{
  "url": "http://www.smartmoney.com/stockscreen/index.cfm?story=20040805intro",
  "file_number": "711",
  "content_hash": "bc0393658ec7164993d5ec6db0e6b9281e1b591fe739d3199b522233b461cd76",
  "total_blocks": 406,
  "retained_blocks": 25,
  "ignored_blocks": 381,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""
    },
    {
      "tag": "div",
      "text": "Tuesday December 26, 2006 7:51 PM ET U.S. Markets are Closed"
    },
    {
      "tag": "div",
      "text": "Search (choose an option below) Quote Charting Earnings Ratings Competition Financials Profile Key Statistics Insiders Site Search News (Enter Symbol) advanced search"
    },
    {
      "tag": "div",
      "text": "Select Select Homepage Stock Screener Market Map 1000 Fund Screener Stock Compare Fund Map 1000 Fund Compare Market Radar Correlation Tracker Power Allocator Portfolio Mixer Streaming Quotes More... Portfolio Tools & Maps Portfolio Tracker Watchlist Calendar Intraday Alerts News Alerts Sector Tracker ETF Center Map of the Market Streaming Quotes Stock Screener Stock Compare Price Check Calculator Map Your Portfolio Market Map 1000 ETF Map Mutual Fund Map Sector Maps Fund Map 1000 Stocks & Options Daily Briefing Common Sense Tradecraft Ahead of the Curve Under the Radar Trendspotting One-Day Wonder Sector Patrol Stock Screen Financial Planners Annual Broker Survey Intraday Alerts News Alerts SmartMoney TV Options Options Education Bonds Funds Fund Map 1000 Fund Screener Fund Compare Fund Screen Fund Insight Fund Finder Fund Map Fund Snapshots Fund FAQs Top 25 Funds The Pro Shop ETFs ETF Tracker ETF Screener ETF Compare ETF Map ETF Focus Tradecraft Ahead of the Curve Sector Patrol Common Sense Personal Finance University Autos Career Journal College Planning Deal of the Day Debt Management Health Care Insurance Life LTC Insurance Real Estate Retirement SmartMoney TV Tax Guide Economy & Bonds Key Indicators Bond Market Update Short Term Investing Living Yield Curve Small Business Business Travel Intro Franchise 500 Startup Journal Incorporation SmartMoney TV Technology Techsmart Magazine CEO Interview Stockscreen Mossberg Report Subscribe Give a gift Customer Service Media Kit Editorial Calendar Custom Publishing"
    },
    {
      "tag": "div",
      "text": "DJIA 12407.63 64.41 Nasdaq 2413.51 12.33 S&P 500 1416.90 6.14 Rus 2000 788.17 7.35 10 Yr Bd 4.60 -0.02 DJTA 4540.76 30.26 Wil 5000 14240.98 63.32 S&P 400 806.51 4.35 Nas 100 1753.55 4.94"
    },
    {
      "tag": "div",
      "text": "Sign up now for FREE SmartMoney.com Newsletters Enter your email address below"
    },
    {
      "tag": "div",
      "text": "Stocks : Stock Screen : A Model of Efficiency"
    },
    {
      "tag": "h2",
      "text": "Stock Screen"
    },
    {
      "tag": "h1",
      "text": "A Model of Efficiency"
    },
    {
      "tag": "div",
      "text": "By Jack Hough Published: August 5, 2004 Click here for more stories by Jack Hough ."
    },
    {
      "tag": "div",
      "text": "In This Story Intro Go to Screen Download Screen Spotlight Stock Usana Health Sciences ( USNA ) Develops and manufactures nutritional, personal-care and weight-management products. Distributes its products through a network marketing system. Market Value $550 million Trailing 12-Month Sales $241 million 2004 P/E 19.9 Est. Long-Term Earnings-Growth Rate 17.5%"
    },
    {
      "tag": "div",
      "text": "Additional Data Earnings Financials Key Ratios Ratings Insiders"
    },
    {
      "tag": "div",
      "text": "The Efficiency Experts Screen Recipe Return on equity at least 20%. Return on invested capital greater than 15%. Five-year annualized sales growth more than 10%. Five-year annualized earnings growth more than 10%. Current operating margin higher than five-year average. Current debt/capitalization ratio no higher than five-year average. At least two analysts contributing to long-term earnings growth estimate. Annual sales greater than $200 million. Average daily trading volume of at least 200,000 shares. StockCompare"
    },
    {
      "tag": "div",
      "text": "See how the stocks on this page stack up."
    },
    {
      "tag": "div",
      "text": "Price Check Calculator"
    },
    {
      "tag": "div",
      "text": "What's this stock really worth? Try our new valuation calculator."
    },
    {
      "tag": "div",
      "text": "Archive Stock Screen Archive Stock-Watching Tools Intraday Stock Alerts Stay on top of price movements Map of the Market An interactive view of 600 stocks Your Portfolio Track up to 500 stocks in 10 portfolios Tear-Off Watchlist The best way to track your stocks Daily Briefing Hot stocks, earnings and economic reports Breaking News Today's top business news Updated Market Overview Today on SmartMoney Sell Some of Your Losers Now and Revisit Them in February Here's Where to Find the Best Shopping Deals After Christmas Ugly Credit Card Trends For Best Results in 2007, Follow These Leaders Advertisement"
    },
    {
      "tag": "div",
      "text": "Email This Story Print This Story Add to del.icio.us Save This Story Read/Post Comments Digg it Add this column to your News Alerts (New!)"
    },
    {
      "tag": "div",
      "text": "Note: This column was originally published on SmartMoney Select, our premium, subscription-based website.\r\n\t\t\tTo access this and other content from SmartMoney Select on a daily basis, click here to start your FREE TRIAL now!"
    },
    {
      "tag": "p",
      "text": "WITH PRODUCT names like 5-Day High-Fiber Cleanse and Soyamax, it may surprise you just how quickly Salt Lake City-based Usana Health Sciences ( USNA ) is expanding. The marketer of nutritional and cosmetic products has seen its number of sales associates climb 35% in the past year as its profits surged 70%. And its stock returns make Avon Products' ( AVP ) three-year cumulative gain of 94% and vitamin seller NBTY's ( NTY ) 40% jump look paltry. Usana's shares during that time have spiked more than 3,000%. It's not history that concerns us today, though. There's reason to believe that Usana's streamlined business model, which relies on a global network of independent sellers to peddle its products, is poised to continue delivering strong profits. The company turned up recently on our Efficiency Experts screen. We gauge companies' efficiency using return on equity, or ROE. The measure is calculated by dividing profits by shareholders' equity, or book value. In other words, ROE tells us how much earnings a company can squeeze out of what it owns. Managers are often paid according to how high they can boost their companies' ROEs. That's generally, but not always, good for shareholders. Here's why. ROE is the product of three other ratios multiplied together: profit margin (profits/sales), asset turns (sales/assets) and leverage (assets/equity). (The two \"sales\" and two \"assets\" cancel out, leaving profits over equity, or ROE.) So to increase ROE, managers need to increase one or more of its three components. If they can fatten margins by, say, cutting costs, or increase asset turns by making new products with existing machinery (a la Honey Nut Cheerios), all the better. But they can also goose ROE simply by employing borrowed funds — which is not always in the best interest of long-term shareholders. So pay careful attention to debt when assessing ROE. For our Efficiency Experts search, we also use return on invested capital, or ROIC. It works like ROE, but adds debt to, rather than subtracts it from, the bottom half of the ratio, which makes overborrowers look duly bad. Run this screen for yourself anytime using our stock screener and the recipe to the right.  Recently, it turned up 12 companies, including Usana Health Sciences. Despite its recent rapid growth, Usama isn't a big company. Its $550 million market cap and $241 million in trailing 12-month sales put it firmly in small-cap territory. About 69% of its 2003 revenue came from nutritional products, including vitamins, fiber supplements and protein powders. Top sellers include Usana Essentials (22% of total sales), a multivitamin, and Proflavinol (9%), a free-radical-busting pill. The company's Sense line of skin-care products contributed 12% of sales, and combination packages of goods from both product lines, as well as sales-training materials, made up the rest. North America accounts for only about two-thirds of Usana's sales.  Australia and New Zealand together make up 15% of revenue, Taiwan contributes 7% and Hong Kong, 4%. Newer markets for the company include Mexico, Japan, South Korea and Singapore. Most sales go through network-marketing associates, but the company has a preferred-customer list of people who can buy products for personal use (but not resell them), which contributes about 15% of sales. Second-quarter results for the company, reported July 20, showed sales increasing 43% year-over-year to $67.2 million and profits ballooning 70% to $7.4 million. Per-share earnings of 36 cents, up from a year-earlier 20 cents, surpassed analysts' expectations by three cents. The company had 104,000 sales associates at quarter's end, up from 77,000 a year ago. Chief Executive Dave Wentz credited the strong results to associate recruitment, and noted that he recently replaced managers in two key growth markets that have thus far been underperforming: Japan and South Korea.  David Block, an analyst with Los Angeles-based stock research firm Seidler Cos., sees potential in Asia. \"With the company yet to crack the code in exploiting the enormous market opportunity in Japan, the world's second-largest direct-sales market, we are cautiously optimistic that Japan's new [general manager] will finally drive the market forward,\" wrote Block in a July 21 research note. He calls the stock \"an excellent long-term investment\" and notes that the most important metric to watch is associate growth, since it's correlated so closely with sales. (Block doesn't own shares of Usana; Seidler Cos. doesn't have an investment-banking relationship with the company.) Just how efficiently is Usana Health Sciences operating right now? It has posted trailing 12-month profits of $26.5 million, on shareholders' equity of $44.4 million as of its second-quarter filing, for a ROE of about 60%. The median ROE for the companies that make up the Standard & Poor's 500 index is 15%. Since expanding its associate network requires little by way of capital investment, the larger Usana is able to grow its sales force, the higher its ROE will likely rise. Consider that direct-seller Avon today has a ROE of about 130%. How pricey are Usana's shares after their recent run-up?  They trade presently at 19.9 times Reuters Research's three-analyst 2004 earnings consensus of $1.44 per share. The average price/earnings multiple for personal and household products sellers is 19.7; Avon's P/Eis 24.5. Usana is projected by analysts to grow earnings by 17.5% annually over the next five years, faster than the group's 8.6% and Avon's 15.0%. That gives the stock a price/earnings-to-growth, or PEG, ratio of 1.14, well below peers' 2.29, Avon's 1.63 and the S&P 500's 1.53, suggesting that this nutrient seller's shares may still have plenty of strong growth ahead. Stock Screen Archive Read/Post Comments"
    },
    {
      "tag": "div",
      "text": "For more answers to your tough investing questions, subscribe to SmartMoney Magazine."
    },
    {
      "tag": "p",
      "text": "To license this content, click here"
    },
    {
      "tag": "p",
      "text": "ADVERTISEMENTS"
    },
    {
      "tag": "div",
      "text": "$7 stock trades, fast executions & exceptional service at Scottrade Two new Vanguard mid-cap ETFs: More precision at half the cost. Smarter tools in Forbes columnist Ken Fisher's new book! Market headed for a fall? Get stock forecast by Forbes columnist! The Motley Fool co-founders David & Tom Gardner´s TOP 2 stock picks for 2006 - FREE Report! Compete against NFL pros in SmartMoney.com's All-Star Bowl for a chance to win $5000! EverBank® offers 6.01% intro APY* on the FreeNet® Checking Account.  Click to learn more. Switch to TD AMERITRADE and trade free for 45 days + get $100. 1000 BONUS POINTS. AMERICAN EXPRESS AND CHOICE PRIVILEGES REWARDS. Fidelity Active Trader Services. Powerful tools. Click here to trade smarter for less today. Free Report: Top 10 Proven Stock Screens Win a business makeover. Enter for your chance at bizbreakthrough.com."
    },
    {
      "tag": "div",
      "text": "Customer Service | Magazine Customer Service | Subscribe to SmartMoney Magazine | Your Profile | Contact Us Corrections | Custom Publishing | License Our Content | Media Kit | Press Room | SmartMoney.com © 2006 SmartMoney. SmartMoney is a joint publishing venture of Dow Jones & Company, Inc. and Hearst SM Partnership.  SmartMoney is a registered trademark.  All Rights Reserved. A Model of Efficiency (Stock Screen). By accessing and using this page, you agree to our terms and conditions and our PRIVACY STATEMENT . All quotes delayed by 20 minutes. Delayed quotes provided by ComStock . Historical prices and fundamental data provided by Hemscott, Inc. Mutual fund data provided by Lipper . Mutual Fund NAVs are as of previous day's close. Earnings estimates provided by Zacks Investment Research . Insider trading data provided by Thomson Financial . Upgrades and downgrades provided by Briefing.com ."
    }
  ]
}