{
  "url": "http://www.stanford.edu/group/spa/admit/sthought.html",
  "file_number": "723",
  "content_hash": "36eb23df3e6638c62c2e96c9f2d04906298d75db8384fc63881db659b2017008",
  "total_blocks": 95,
  "retained_blocks": 4,
  "ignored_blocks": 91,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\" the banner the guide the main page the title Thoughts on Medical School Interviews II"
    },
    {
      "tag": "p",
      "text": "by Scott Parazynski BS '83 Stanford University Here are some thoughts on interviewing from my experience as an interviewee, \nAdvising Associate, Residence Assistant, Freshman Premed Advisor, UAC Premed Advisor, \nand a member of Stanford Medical School's Committee on Admissions. Be aware that each \ninterview and interviewer is different and, as such, these notes should not be taken as the \n\"golden rule\". You should speak to as many advisors, med students & \nfellow applicants as soon as possible to get their insights on interviewing."
    },
    {
      "tag": "blockquote",
      "text": "\"There is within medicine, somewhere beneath the pessimism and discouragement \nresulting from the disarray of the health-care system and its stupendous cost, an \nundercurrent of almost outrageous optimism about what may lie ahead for the treatment \nof human disease if we can only keep learning.\" - Lewis Thomas, The Medusa and the Snail"
    },
    {
      "tag": "p",
      "text": "\"Just what is the medical school interview?\" The medical school interview (MSI) brings the applicant's numbers and essays to life and, \nwith adequate preparation, can really boost an application. Though MCAT scores and GPAs \nare a mediocre index of how well a person might do in med school and decides whether an \napplicant is granted an MSI, they offer nothing to assess personality or suitability \nfor a career in medicine. With decreasing importance of the MCAT at many schools and a \nstrong desire by medical schools to train compassionate physicians, the MSI has a central \nrole in admissions. Being selected for a MSI is a significant achievement in itself. The admissions process \nessentially involves reducing a large applicant pool to a relatively small number of \ncompetitive applicants. The MSI is an imperfect means of selecting the best potential \nMDs from among this group. Basically, the MSI is designed to substantiate your application \nby subjectively evaluating your compatibility with the school and motivations for pursuing \nan MD. Also, time is allowed for a question/answer period about the school itself. \nThis is quite a difficult task in an interview that lasts only 20 minutes! \"Is there any way to prepare for the 3rd degree?\" Time spent in preparation for the MSI is time well-spent. The admissions panel will place \na great deal of importance on your interview report, and confidence going into the MSI \nis essential. You don't need to spend hours preparing answers to \"standard\" MSI \nquestions, but you should review the most commonly asked interview questions. Unfortunately, MSI questions can come in an infinite number of forms. The solution: \n\"study\" the basics. Although there are no standard MSI questions, certain \ngeneral topics invariably come up: your college, work and extracurricular experiences; \nyour motivation for becoming a physician; and your \"uniqueness\". Read and \nre-read your AMCAS Personal Statement and other essays. Be prepared to talk in further \ndetail about anything mentioned in your application. Go back and study your notes and \nany publications you might have from research projects; re-read your best history paper, \nthe article you wrote for The Daily, etc. Think back on your various extracurricular \npursuits. What did they mean to you and how did they influence your motivation to become \na physician? Really think about why you want to go to medical school. What do you hope \nto accomplish and contribute to medicine? How do you know what being an MD is like? \nThink about your strengths and weaknesses, likes and dislikes. If you're a junior \nresearcher, why aren't you pursuing just a Ph.D.? Where is your research going and \nwhat would you do next? Be aware of any new developments in your application which you \nmay want to bring up at the MSI: any recent awards or achievements? You might mention \nother activities unrelated to medicine: current volunteer tutoring, athletic participation, \na musical performance or an interesting trip for spring break is worth discussing and \ncould liven a stalled MSI.  These are just guidelines to \"organize\" your brain;  \nthe best preparation is to know yourself and to have solid reasons for seeking an MD. The admissions panel will certainly want to know why you're applying to their school. \nTherefore, research the school thoroughly before going for your MSI. Read the school's \ncatalog and review the Stanford \"red Books\" (surveys of Stanford graduates \nattending med schools). Use this information wisely during the question/answer period \nof your MSI. Construct insightful questions about the medical school program. Well \nthought-out questions demonstrate that you have researched their program and are \nenthusiastic about the school. Don't ask about their grading system or vacation schedule; \nthis is blatantly obvious in their catalog. \"What are the opportunities for early \nclinical experiences during my freshman year?\" \"Is it possible to obtain teaching \nexperience during the basic sciences curriculum?\" are examples of appropriate questions. In addition, a general knowledge of trends in medicine and the goings-on in the world make \nfor interesting conversation. Topics such as in-vitro fertilization, abortion, euthanasia, \nsocialized medicine, the AIDS epidemic and the high costs of medicine are often brought up \nas an exercise in current awareness and logical thought. When discussing such topics, substantiate \nwhat you believe with what you know. Try not to get defensive. There are no right or wrong \nanswers. Think about how you would try to address the issues. Take notes on your MSI \"performances\": what went well, what went wrong? \nThis strategy will help you improve subsequent MSI performance. You should also plan to \nre-read your entire application to a school the night before your MSI, just to refresh \nyour memory. To come across well at the MSI, you need to express yourself well: be concise \nand articulate. Learning to relax with difficult questions is important in handling the \nstress of an MSI. As a final preparation before your interview, schedule a mock interview at the UAC - \nthis is a great opportunity for immediate feedback! All of this preparation will build \nyour confidence and help you to present yourself succinctly regardless of the \nquestions asked. \"What's going to happen to me?\" Nightmares abound regarding stressful interviews and you've likely heard the rumors. \nFrom my experience and common consensus, pressure-type interviews are far less common than \nthe \"laid-back, Californian\" variety. Granted, the MSI is an anxiety-ridden \nexperience and some form of self-imposed stress reaction is normal. Fortunately, \nthe process gets much easier with experience and, by your 3rd or 4th MSI, you may find \nyourself more relaxed than your interviewer! Remember that most interviewers are \nvolunteers for the job and as such: a) usually enjoy meeting people and interviewing; \nb) were all once in your shoes; and c) don't bite (usually). In the unfortunate event that you run into someone who asks you to open a nailed-shut \noffice window, keep your composure and play along with it. If dealing with the former, \nstick with your answer and substantiate it. If a question seems vague or offensive, \ndon't immediately jump in without thinking. Try to clarify what's being asked and to \npin the interviewer down to a specific question. If this doesn't work, punt: \"Well, that's a very interesting question. I'd have to think about \nthat for a while.\" Interview formats vary from school to school. Prior to your interview trip, talk with \nmedical students, your advisors and friends who have interviewed at the school to get details. \nOn the average, you will receive 2 one-on-one interviews, often one with a faculty member \nand one with a medical student. Other varieties do exist with multiple interviewers or \nmultiple interviewees. Interviews may be \"blind\", where the interviewer has not \nyet read your file, or they may be based on a thorough review. There are advantages and \ndisadvantages to each. In a blind interview you may not have to explain your \nC- in Weed Out Chemistry 101, but you're more likely to have to tell your complete life \nstory to a stranger. In a reviewed MSI, often the interviewer has been selected for you \nbased on common academic interests (a molecular biologist for an undergrad biochemistry \nresearcher, for example). This underscores the need for complete honesty and avoidance \nof exaggeration. The interviewer probably knows more about your specialty than you, and \nhalf truths really stand out. Another point about MSIs is that they often don't take the full scheduled time allotment \n(generally 1 hour). MSIs can be as short as 20 minutes to longer than 2 hours. Note: \nthe length of an interview is not a reliable indicator of how well or how poorly an MSI went: \nit's the content that matters. \"Who are they looking for?\" The MSI is designed to fill the gaps in your personal statement: are you charismatic, \nenthusiastic, friendly and warm? The MSI also serves to assess communication skills: \ndo you have fluid and articulate speech? Medical schools are also looking for people \nwho are oriented to the school's strong programs: a researcher-type might have a tougher \ntime gaining acceptance to a school that primarily trains Family Practitioners and vice versa. Interviewers like to see an applicant who follows what's going on in the world, not \nsomeone buried completely under books. They want students with a well-founded desire to \npractice medicine and students enthusiastic about their school. They will probe your \ninvolvement in extracurricular activities and research, and expect thorough knowledge. \nYou should stress the independent work and creativity that went into your projects. What \nthought process, critical decisions and judgment went into your experimentation? No one \nwants to hear the details of how to pour an agarose gel. Express your thoughts, not what you think the interviewer wants to hear. \nAlso realize that your interviewer will ask you two basic types of questions: those that \nyou're expected to know and those that are geared to test your comprehension and analytical \nabilities. You aren't expected to know everything, so don't be afraid to say, \"Idon't know\". It's often looked upon very favorably when a student has the courage \nto admit this. Don't bluff or give a hand-waving explanation this is easy to spot. Finally, \nyou may be asked how you rank their school: be honest. If it's your number one choice, \nby all means tell them. If not, state enthusiastically that you are strongly considering \nthem (otherwise you'd be wasting your time and money), but that you haven't finished \nvisiting/interviewing at all schools yet. (About controversial issues: these can be a problem for female applicants. \nTopics like pregnancy, raising children, marriage, etc. are taboo, but might be asked. \nKeep your cool and answer honestly. Unfortunately, if you want to get into that school, \nyou'll have to be cautious about protesting. But, if the MSI went badly, you can defend \nyourself in a letter to the Director of Admissions stating what was unfair. This tactic might \ngo in your favor and you could get another MSI.) \"Emily Post's MSI Etiquette\" Honesty, humility, enthusiasm and humor (within reason; play it by ear) are your best \nbets for a successful interview. Remember not to sell yourself short - go into the MSI \nbelieving you're a very special person who could \"do their school proud\". \nIf you don't toot your horn, no one else will. Just do it in moderation. You need to walk \nthe fine line between humility and conceit to get your best attributes across to your interviewer. \nConversely, be aware of your weak points as these may also come up in the discussion. \nIrealize that Stanford students have few weaknesses, but it's important to have identified \na few beforehand. Typical responses like \"Itend to get involved in too many activities, \nbut Inever let my performance be compromised\" are overused. You can do better - just add \na positive note. Relax and, if possible, enjoy your interview. Interviewers are genuinely \ninterested in meeting and making next year's class a strong one, so generalized terror \nprobably isn't warranted. Try to express a confident and positive attitude. If you are shy, it may take longer than the allotted time to get things rolling. \nMonosyllabic responses and lack of enthusiasm are not exciting conversation. This \nperception may carry over to your evaluation. Practice making strong first impressions \nwhen meeting people. Schedule a mock interview at UAC to reinforce this. You need \nto come across as a warm and sensitive person with excellent potential. Aword of caution: try not to monopolize the interview or get too verbose. This leaves \na very negative impression. If an interviewer gets on a tangent and you feel that you \nhaven't quite touched on all the major bases it's OK to tactfully and cautiously guide \nthe interview in a more productive direction. As for physical appearance, applicants \nstick out in their pressed blue blazers and conservative dresses among the faded jeans \nand unshaven faces of the local med students (and even their interviewers on occasion). \nNonetheless, professional and conservative dress is strongly recommended, as it is a token \nof respect and reflects a serious attitude. You might argue that you have a right to \n\"express yourself\" through your clothing, but why risk it? You should dress \nso that the interviewer won't think about your attire but about you. This translates \nto a 3-piece suit or jacket and tie for men, a business-type dress for women. You should think about your body language and how this may affect your interviewer. \nSpecifically, try not to fidget or tap your feet. Nervousness is normal; try to quell \nthis with an occasional deep breath. Don't stare outside or at the clock. Express interest \nin what both of you are saying by leaning slightly forward and keeping eye contact with your \ninterviewer. One last word of advice on MSI etiquette: don't take the medical student interview too \nlightly. Their reports carry just as much clout as a faculty MSI. Therefore, don't be \ncocky or confide something to a student that you would never say to a professor. Remember \nthat student and faculty are working together and you might get burned. \"Fun facts to know & tell about MSI scheduling\" MSI's are usually by invitation only . The Admissions Committee reviews your GPA, MCAT scores, \npersonal statement, secondary application and letters of recommendation, and then somehow \ndecides whom to interview (See Ruby and Nancy on how to go about getting one). The \npercentage of applicants interviewed depends on the particular school - often only a small \nfraction are granted an MSI. Once you've been granted an interview, pat yourself on the \nback and/or congratulate yourself in some fashion. You've made the big cut and are one of a \nfew highly competitive applicants being considered. Often a school will assign you a \ndate and time that may be difficult to accommodate, especially if on the east coast. \nGenerally, the Admissions Staff is flexible and will arrange another date as need be. If you haven't heard from a school but will be \"in the neighborhood\" on the \nopposite coast, it is acceptable to call or write a school well in advance of your trip \nto request an MSI. Give the school at least 3-4 weeks leeway, the dates of your trip and \na polite letter. It's OK to call if you haven't gotten a response in a couple of weeks. It \nisn't OK, however, to walk up to their doorstep and request an interview on the spot. This is a serious MSI faux pas. If you have been rejected from a school but \nthink your application is competitive (be realistic), you may appeal the decision and \nask for a review of your record. After all, you have nothing to lose and at best will \nget an interview. Some schools will offer a regional MSI; there is no known disadvantage with respect to \nadmission by opting for a regional. Some say that having a local MSI may show a greater \ninterest in a school, but committees are cognizant of financial constraints. If accepted \nand/or highly considering a school, check it out first before accepting a spot there. You're probably asking, \"How can Iafford a deluxe MSI vacation?\" Ticketing as \nfar in advance as possible helps lower travel costs. Try to group schools regionally \nto save time and money; if you've arranged a group of 2 or more east coast schools, \nyou can get special fares with unlimited travel for 21 days (try Continental and American). \nThis often takes several phone calls back and forth to the admissions offices to juggle \ninterview dates. 5-Star accommodations can often be arranged with a local medical student \nor in the medical school dormitory for a reasonable price (this is also a great way to meet \nthe \"locals\"); call the admissions office for details. One final thought: the interviewing \"season\" often extends until May. Generally, \nthe earlier you complete your AMCAS and secondary applications, the earlier your file is \nreviewed for interview. Later in the season, the offices become backlogged and you may \nhave to wait in limbo longer. Apply early! \"What do Iget in return?\" You may receive some feedback with respect to your chances for acceptance. Don't read too \ndeeply into your interviewer's comments or the atmosphere of your discussion, however. Remember \nthat the comment, \"Ihope to see you here next year\" is only coming from one member \nof the admissions panel. Conversely, a perceived \"bad\" interview may reflect the \ninterviewer's personality, and s/he may have been expressionlessly but thoroughly impressed \nby you. Moreover, one marginal MSI may be entirely negated by another excellent one. \nMy advice: think positive and cross your fingers. You will definitely have the opportunity to discover lots of information about the school \nand its environs (elicited by your insightful questions as discussed above, remember?). \nTake a tour or, if your MSI is regional, plan on seeing the school well before enrolling. \nTalk to as many students as possible and inquire about the overall quality of lectures \nand clinical education. Do senior medical students think they received a quality education? \nAlso, try to assess the quality of life, the climate, your prospective peers and the \ncultural/recreational activities available.  Think about your family and friend \nsupport network - how would it change? Is this important? How would you, individually, \nfit into the medical school? This will be the time to get info on financial aid, student housing, Nat'l. Board Scores \nand the Nat'l. Residency Matching Program. Visit the financial aid and housing offices, \ntime permitting. Applicants tend to focus on board scores and the percentage of school's \nseniors matching their top choice for residency training. Afew words of caution on each: \nsome lesser schools gear their teaching toward performance on the Nat'l. Boards (rather \nthan the art of medicine). As such, their students score much higher than normal. \nRemember that your patients won't have a 3 x 5 index card on their forehead with labeled \noptions. As for claims like: \"90% of our graduating class matched their top 3 \nchoices\", regard such statements with a certain amount of skepticism as well. \nThe Residency Matching Program works with a self-selected applicant pool: a C+ student \nfrom Granada Medical School won't apply for training in neurosurgery at Massachusetts \nGeneral Hospital. \"What happens next?\" i.e. The Wheel of Fortune Somehow all of the information at the Committee's disposal goes into a black box - the \ncommittee meeting - and emerges as accepted, wait list and rejected candidates. Often \nthe decisions that are made seem arbitrary and nonsensical. Icouldn't even attempt \nto describe or unravel the mysteries of the panel as they vary from school to school and \nyear to year. All Ican say is that a strong interview can really boost even a marginal \napplicant to an accepted spot. Give it your best shot. Asincere follow-up thank you note to an interviewer is fine if you really enjoyed \nthe conversation and if you have a strong interest in their school. Don't write if the \nMSI was only marginal, as this may appear like begging. Sit back and wait for the \nCommittee's decision. Summary: The Golden Rules of Interviewing Prepare Yourself - Know yourself - Know the school; have questions ready - Know what's going on in the world and in medicine Be Yourself - Be honest - Don't be afraid to say: \"Idon't know\" Be Clear and Concise Be Enthusiastic and Confident Don't Monopolize the Conversation Be Prompt and Dress Appropriately Don't Be Pushy About Scheduling Take a Tour Try To Relax Don't Leave Home Without Your American Express Card A Disclaimer The above notes represent the unedited thoughts of one Scott Edward Parazynski and, as such, \nshould not be considered official Undergraduate Advising Center recommendations. The names \nhave been changed to protect the innocent. Verity Powell Ruby Mason © 1999 Stanford Premedical Association Comments? Suggestions? Email the Web Development Team hhmts start Last Modified Fri Oct 29 16:15:29 PDT hhmts end"
    }
  ]
}