{
  "url": "http://www.succulent-plant.com/hoya.html",
  "file_number": "734",
  "content_hash": "ad045eeda62b656712c65e7e470e491a6355c8c71086d833bc43597400745a67",
  "total_blocks": 40,
  "retained_blocks": 14,
  "ignored_blocks": 26,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""
    },
    {
      "tag": "div",
      "text": "What is Hoya? The History of Hoya The Nature of Hoyas Hoya Culture Hoya Pests A Few Favourite Hoya Species Picture Gallery Hoya Links Text by Christine M. Burton"
    },
    {
      "tag": "h2",
      "text": "What is Hoya?"
    },
    {
      "tag": "p",
      "text": "Hoya is a genus of tropical plants in the Asclepiad family. When one thinks\nof hoyas one usually thinks of the old favourite, Hoya carnosa, which is\nbetter known as \"Grandma's Old Fashioned Wax Plant\", and lets it go at that,\nassuming that is all there is to it. When curiosity gets the better of a\nnovice grower, to the point that he or she orders an advertised catalogue,\njust to learn why anyone would have the nerve to advertise a catalogue with\nonly one plant in it, shock often results from learning that Hoya is a\ngenus comprised of around 200 different species, plus numerous cultivars."
    },
    {
      "tag": "h2",
      "text": "The History of Hoya"
    },
    {
      "tag": "p",
      "text": "Hoya was once part of the Apocinaceae family of plants. Robert Brown\ncreated Asclepiadaceae in 1810 to accommodate a group of Apocinaceae plants\nwhose characteristics did not fit well into that family. He named the new\nfamily Asclepiadaceae and included in it all those former Apocinaceae plants\nhaving their pollen contained in gelatinous masses called pollinia\n(singular is pollinium). The only other group of plants with pollinia are\nthe Orchids. Asclepiadaceae includes the common roadside milkweeds\n(Asclepias), the popular succulent Stapeliads, which look more like cacti\nthan Asclepiads and the very interesting Dischidias, whose leaves are often\nshaped like pouches and urns and serve as homes for ants. Hoya contains the\nmost beautiful flowers in the family. Robert Brown was born in Scotland on December 21, 1773. He studied medicine\nin Edinburgh but did not take a medical degree, preferring instead to\nstudy the plants that, at that time, all medical specialists depended upon\nas cures. Despite his lifelong dedication to the study of plants, he is\nbest known today in the scientific community for the discovery of\n\"Brownian Movement,\" which, simplified, is \"the motion that you see in a liquid\ncontaining minute suspended solid particles.\" It is only by chance that hoyas are known today by the name Hoya. There is\nstill some controversy over which name, Hoya R.Br. or Sperlingia Vahl came\nfirst. Both names received their first publication in 1810 at about the\nsame time. Some say that Brown's publication preceded Vahl's by several\ndays and others argue the other way. The sides are so divided that there is\na movement afoot to instigate formal efforts to have the name Hoya\nconserved since it is the most widely known name. If Vahl's manuscript had\nbeen published when it was first submitted there is no doubt that Hoyas\nwould be known as Sperlingias today. Sperlingia lost out due to its\nauthor's having been hanged for treason. His manuscript was not published\nuntil long after his death, it is said, because no publisher was willing to\nhave his name associated with that of a traitor. Robert Brown named Hoya in honour of his friend and fellow botanist, Thomas\nHoy, who was employed as head gardener by the Duke of Northumberland at his estate,\nSion House. There is no record of Thomas Hoy's ever having grown a Hoya but surely \nhe must have, since his employer was an avid collector of rare tropical plants."
    },
    {
      "tag": "h2",
      "text": "The Nature of Hoyas"
    },
    {
      "tag": "p",
      "text": "We usually think of Hoya as succulent and there are, indeed, a lot of\nsucculent hoyas, plus many more that have succulent parts, but the vast\nmajority of them are non-succulent. We also usually think of Hoyas as vines\nbut there are many species with little to no vining tendencies. For\nplant collectors, there are hoyas for every taste and situation. Some are\ntwining vines; some are woody shrubs; some are entirely terrestrial; and\nsome are epiphytes. There are still others that begin life as terrestrials\nthen lose all contact with the ground and continue life as epiphytes. Many\ncling to their supports both by twining and by adventitious roots, but\nothers grow as upright shrubs. There are a few that begin as upright shrubs\nbut after becoming several feet tall, continue their life as twining vines.\nSome hoyas are woody; others are soft and succulent. Some have woody stalks\nand succulent leaves. Others are thin and wiry with papery leaves. Hoya leaves vary in size, texture, colour and venation. In size they range\nfrom a centimetre in length and from two to four millimetres in width ( Hoya\nengleriana, Hosseus) to 25 cm. by 25 cm. ( Hoya latifolia, G. Don). Hoya\ncoriacea, Blume, is said to sometimes have leaves as long as two feet in\nlength. One of the most succulent of the lot, Hoya kerrii, Craib, has\nperfect valentine shaped leaves, with the notches at the apexes of the\nleaves instead of at the bases. This species has two forms, one with\nglabrous leaves and one with suede textured leaves. There are hoyas with\nalmost perfectly round leaves and others with linear leaves ( Hoya linearis, Wall. ex. D. Don and Hoya teretifolia, Griff. ex Hook. f.). Apopular\nspecies, Hoya shepherdii, Short ex Hook. has leaves that look for the world\nlike bunches of string beans hanging from their stalks. Hoya linearis, Wall. ex D. Don is covered with fine downy hair and greatly resembles\nmasses of Spanish Moss ( Tillandsia useneoides ) hanging from trees in its\nnative habitat. Some Hoya leaves are smooth and shiny; some are covered\nwith hairs. Some Hoya leaves appear to be veinless while others have very\nconspicuous veins of a lighter or darker colour than the rest of the leaves.\nSome have leaves that are mottled with speckles of silvery white ( Hoya\ncarnosa, R. Br.). Some Hoya leaves are smooth and shiny and others are\ncovered with hairs. Some hoyas have leaves that are thin and translucent\n( Hoya coriacea, Blume); some are so thick and succulent that they look more\nlike crassulas than hoyas ( Hoya australis subsp. rupicola, oramicola and saniae from Austrailia and Hoya pachyclada from Thailand). Hoya flowers are just as varied as the leaves, despite the fact that all are\nshaped like five pointed stars. They grow in umbels, usually with many\nflowers per umbel. Individual flowers range in size from as small as four\nto five millimetres in diameter ( Hoya bilobata, Schltr.) to well over\nthree inches in diameter ( Hoya imperialis, Lindl. and H. macgillivrayi, F.\nM. Bailey). The number of flowers per umbel varies from one ( H. pauciflora, Wight.) to 55 or even more. Hoya coriacea, Blume has been known to have \nas many as 70, each measuring nearly 2 centimetres in diameter. The single\nflowered Hoya pauciflora, Wight makes up for its paucity by its flower\nsize of nearly an inch and a half in diameter. Just as hoyas vary in size, they also vary in texture, some being glabrous\nand shiny and some being quite hairy. They also vary in colour. They come\nin the purest white, varying shades of pink from almost white to rubber-doll\nor bubble-gum pink, yellowish-pink, yellow, green, purple, brownish-red and\nbrown. There are some that are so dark that they are often referred to as\nblack. Until recently it was thought that a true red hoya was not ever\nlikely to appear but recent discoveries make that seem possible. One of the\ntwo clones of Hoya mindorensis, Schltr., from the Philippines, which are\ncurrently in circulation, comes very close to being a true red. Blue still\ndoes not appear to be represented in the Hoya genus."
    },
    {
      "tag": "h2",
      "text": "Hoya Culture"
    },
    {
      "tag": "p",
      "text": "Hoyas are, for the most part, very easy to grow. They require a well\ndrained soil, warmth and lots of humidity. Many people will tell you that\nthe temperature must never be allowed to fall below 60 degrees F. or go over\n85 degrees F. Ihave seen no harm resulting from night temperatures of 45\ndegrees F. in winter or 120 degrees F. in daytime temperature in summer.\nHere in north central Georgia, several of us have had Hoya shepherdii, Short\nex Hook. survive outdoors all winter, when we forgot to bring it inside.\nAll of us reported that our plants were left in well sheltered areas but,\neven so, we often have winter temperatures below 20 degrees F. Hoya\nshepherdii is native to the lower Himalayas, where freezing does occur so\nthat explains its hardiness. As for temperatures at the other end of the\nthermometer, we must remember that most hoyas are native to the very hottest\nspots on earth. The secret to survival under less than ideal conditions\nappears to be providing lots of humidity - very near, but not quite, 100%.\nWhen it is cool, water should only be applied in amounts to prevent leaves\nfrom shrivelling. One Atlanta grower lost most of his hoyas last winter\nbecause the roots got too dry. My Hoya roots were given even less water than\nhis and mine thrived. We compared notes and concluded that the only\ndifference between our growing conditions was that the humidity in my\ngreenhouse was near the saturation level. Humidity provides summer\nprotection too. Ihave seen Hoya leaves burn nearly to a crisp in summer,\neven with exhaust fans running full time and daily watering - and with a\n50% shade cloth covering the roof. Ido not use exhaust fans in my\ngreenhouse because Ifind that mealie bugs are sucked in with the breeze. Ihave lots of circulating fans inside and maintain humidity near the\nsaturation point. There's rarely a burned leaf. Although many Hoyas will\ngrow well and make lots of beautiful leaves in a centrally heated-air\nconditioned living room, it is very rare that one will bloom in one. If a\nliving room is the only indoor place you have for growing hoyas, if you want\nthem to bloom, find a place outdoors in summer - under a tree or, better\nyet, on a screened porch - anywhere that protects them from noonday sun. Many Hoyas respond to a bit of lime in the potting mix but most of them do \nbetter in a very slightly acid compost. Some, being coastal dwellers can even\ntake a bit of salt spray so if you live near the ocean in a warn climate,\nyou should have no trouble finding a hoya suitable to your conditions. One, Hoya halophila, Schltr., whose name means \"salt lover,\" was originally\ndiscovered growing on the beaches of New Guinea and nearby smaller islands.\nThere are many other coastal hoyas and many that are found growing,\nsuspended above bayou waters from the branches of Mangrove trees. There are\nalso a large number that are native to mountainous areas, some in calcareous\nsoils and some in soils containing granite and shale. Others live\nsymbiotically with ants. In some species, such as Hoya imbricata, Callery\nex Decne., one of the leaves at each node (which are paired in most Hoya\nspecies) aborts and the single peltate leaf that remains, flattens itself\nagainst the trunk of its host tree and clings there, being held by numerous\nnodal roots. Ants build their nests beneath the leaves and contribute to\nthe plant's nourishment. Another species ( Hoya darwinii, Loher) provides a\nhome for ants in a different way. For much of its life, its leaves look\nlike normal leaves, but something will trigger the growth mechanism and\ncause the lateral margins of some of its leaves to stop growing, while the\ncentres continue to grow. The result is leaves that are rolled up into\nball shapes, looking much like green golf balls. It isn't known what causes\nthis but it has been suggested that it is caused by the presence of formic\nacid, a by-product of ants. The sheltered golf-ball leaves serve as homes\nfor ants, whose wastes fertilise the host plant and the unsheltered leaves\ncollect rain water which is utilised by the host plants during dry periods.\nAnother ant lover is the popular miniature, Hoya lacunosa, Blume. \nAlthough usually grown as a pendulous hanging basket plant in cultivation, \nin its habitat it is a tree climber. It is usually found growing out of the\nground from the center of an ant bed. As it climbs up the trunks of nearby\ntrees, the ants build \"dirt-dauber-like\" tunnels along its stalks, in order\nto give their tunnels stability. The ants live inside the tunnels and\nsupply nourishment to the plants. Collectors, in the wild, often find, to\ntheir sorrow, that a plant with not a single ant in sight will suddenly come\nalive with vicious ants, when they cut a stem and try to dislodge a cutting.\nThe species of ants that occupy those tunnels are said to sting like the\ndickens and leave painful, itchy sores with days worth of scratching in\ntheir wake. Not to fear, this lovely and very fragrant wee hoya will grow\nvery nicely without ants so don't fear growing it. The most difficult aspect of growing hoyas is finding correctly labelled\nones. Many people don't care a bit what their hoyas are called - or even,\nif they have names. They grow by God and by guess or pure animal instinct\nand never lose a plant. Others like to learn about their plants' native\nhabitats and try to match climatic and soil conditions to those habitats.\nThat is next to impossible for Hoya growers because dealers call plants by\nwhatever names suit them. It does one little good to know that Hoya\ngriffithii, Hook.f., for example, is a native to northern India, Sikkim and\nNepal, if the plant one buys with that label actually came for an island in\nthe southern part of the Solomons, which is exactly where the one Igot so\nlabelled originated. One grower (no longer in business) once listed over 200\ndifferent species names. Ibought every single one of them and learned, to\nmy sorrow, that the dealer had only 7 different correctly identified species\nand one of those was labeled only half right. All the rest were either\nduplicates of those seven with different labels or cultivars of them, plus a\nnumber of unidentified numbered species."
    },
    {
      "tag": "h2",
      "text": "Hoya Pests"
    },
    {
      "tag": "p",
      "text": "Hoyas are liked by three common garden pests, aphids, mealy bugs, red spider\nmites and scales. These are easily controlled by systemic insecticides,\nunless you are opposed to their use. Many control them with plain old\nrubbing alcohol. Many spray it on the plants right from the bottle. Others\ndilute it with water and add soap or sticker spreaders to it. Some say you\nshould wash the alcohol off after it has done its job, but it isn't\nnecessary. It does no harm as long as the sun doesn't hit the plants while they\nare still wet - it is no different than plain water in that respect. Some\nuse insecticidal soaps. Ihave found the use of alcohol and\ninsecticidal soaps to be worthless, except that alcohol applied to a swab,\nused to wipe the insects off does a pretty good job but this is extremely\nimpractical in a large collection and could become a full time job. Others\nuse preying insects. We in Atlanta learned the hard way a few years ago\nthat preying insects, which are not native to the area can create more\nproblems than they solve. Once they feed on the mealy bugs, they start\nlooking for other food and that food may not be what you'd like them to feed\non. Also when removed from their natural homes they must find other nesting\nplaces to their liking. Ten million non-native Lady Beetles crawling all\nover one's ceilings, floors, furniture and inhabiting one's bread box will\ncure one of importing exotic preying insects very quickly. If one has only\na few plants, swabbing with alcohol is the ideal method of ridding ones\nplants of insect pests. In a greenhouse with several thousand plants,\nchemical control is the only practical solution. If you can afford to hire\nprofessional handlers to apply the chemicals, Istrongly advise it. If you\ndo it yourself, be sure that you follow the directions on the container\nprecisely and wear protective clothing. The best method of pest control is\nstill to avoid them in the first place. Keeping all new plants isolated for\nabout six weeks before introducing them into your pest free collection is\nthe best advise you will ever follow."
    },
    {
      "tag": "div",
      "text": "TOP The Nature of Hoyas Hoya Culture Asclepiad Page What is Hoya? Hoya History Hoya Pests SITE MAP Favourite Hoya Species Hoya Picture Gallery Hoya Links Email: Webmaster"
    },
    {
      "tag": "div",
      "text": "This page is © copyright R.J. Hodgkiss 2004 Last update: 15th October 2004"
    }
  ]
}