{
  "url": "http://www.suite101.com/article.cfm/lutheranism/116637",
  "file_number": "735",
  "content_hash": "e36baffca9117bf3e761e0be360ceda2d81749856d65a90f99159968f96a22b0",
  "total_blocks": 58,
  "retained_blocks": 11,
  "ignored_blocks": 47,
  "blocks": [
    {
      "tag": "div",
      "text": "Suite 101"
    },
    {
      "tag": "p",
      "text": "hiring freelance writers | sign in"
    },
    {
      "tag": "div",
      "text": "Home » Mind & Soul » Lutheranism » Articles » Luther's Tragic Mistake: Commentary on Parts 18-23"
    },
    {
      "tag": "h1",
      "text": "Luther's Tragic Mistake: Commentary on Parts 18-23"
    },
    {
      "tag": "div",
      "text": "John L. Hoh, Jr. Articles in this Topic Discussions in this Topic Our focus this week in Luther's portions of the tract presented is on the Kingdom of David. Luther makes the valid point that the reign of David's house continued in spite of the members of that lineage. It only took a second generation, in fact, to lose a majority of the tribes. After Solomon, the northern ten tribes (known as the Kingdom of Israel) followed another king, electing not to follow the dynasty of David. Luther also points out the many evil kings in the lineage of David. This is important because in Luther's day, as today, the dynasty of David no longer exists as a political entity. Obviously it is a spiritual dynasty. Hence the sign that again points to Jesus as the Christ, the Messiah."
    },
    {
      "tag": "p",
      "text": "Even during the Babylonian Captivity, Luther points out, the Davidic kings had honor in the Babylonian court. God preserved the dynasty! Next, Luther explores the promise to David: \"When your days are fulfilled and you lie down with your fathers, Iwill raise up your seed after you.\" Luther points out that this does not refer to immediate descendants but is in fact a Messianic promise. For it is after David's death that this seed would be raised up. Luther also explores the two houses mentioned: David's eternal house, built by God, and the temple build by Solomon, which would be destroyed by Babylon's Nebuchadnezzar. One reflects Gospel; the other reflects Law. Which do you suppose stands the test of time and which no longer exists? Luther gets into some more name-calling. Specifically, these words are to be considered:"
    },
    {
      "tag": "blockquote",
      "text": "Anyone who would venture to contradict such clear and convincing statements of Scripture regarding the eternal house of David, which are borne out by the histories, showing that there were always kings or princes down to the Messiah, must be either the devil himself or whoever is his follower. For Ican readily believe that the devil, or whoever it may be, would be unwilling to acknowledge a Messiah, but still he would have to acknowledge David's eternal house and throne."
    },
    {
      "tag": "p",
      "text": "It was Luther himself who stated we are at the same time saints and sinners. It was Luther who wrote that \"The Law is a constant inhabitant in a man's heart, the Gospel a seldom guest.\" Luther should recognize that because of our sinful nature we resist the teaching of the Messiah, the Messiah who pays for our sin by dying on a cross. The Jews of Jesus' day sought a Messiah that would lead Israel back to political glory. But here again Christians generalize. Many Jews in Jesus day did await a Messiah who would save them from sin. The New Testament is full of Jewish people accepting that Jesus was the fulfillment of Scriptural prophecy. Go To Page: \r\n\t\t\t\t1 2 Luther's Tragic Mistake: Commentary on Parts 18-23 < Previous Article | Next Article >"
    },
    {
      "tag": "div",
      "text": "Print Article Email Article View All Articles"
    },
    {
      "tag": "p",
      "text": "Digg this Article Add this Article to del.icio.us Join the latest discussions"
    },
    {
      "tag": "div",
      "text": "business & finance education & career film, tv, & pop culture food & drink health history home & garden mind & soul music outdoor & adventure partners & parents reading & writing science & nature social issues sports technology travel & culture visual & performing arts wellness & style world affairs alternative spirituality astrology buddhism/taoism catholicism great thinkers hinduism kabbalah new age paganism/wicca paranormal personal development personal ethics philosophy protestantism psychology » archive that jesus christ was born a jew: part 14: jacob's prophecy 4 henry melchior mühlenberg: the patriarch of american lutheranism why we left lutheranism--introduction why we left lutheranism-- foundation human not divine why we left lutheranism--unscriptural name why we left lutheranism--they walk by a man-made creed why we left lutheranism--upholds denominationalism » more lutheranism articles david joash athaliah temple solomon jesus and the temple the camel fair at pushkar » more lutheranism blogs defending genesis defending christmas december 25 jews & christians bill of rights » more lutheranism discussions atheism 101 bahai 101 bible 101 bible study 102 bible study methods bible study: genesis » more mind & soul courses hiring freelance writers about us site map terms and policies"
    }
  ]
}