{
  "url": "http://www.talkingcities.co.uk/budapest_pages/sights_museums1.htm",
  "file_number": "737",
  "content_hash": "026a0b2329b8bb430d64ceb4a22b46d72dafcc3d0552bf44d7ea529af9a65c41",
  "total_blocks": 117,
  "retained_blocks": 37,
  "ignored_blocks": 80,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""
    },
    {
      "tag": "p",
      "text": "| Contact | Help | Shop | Site Search | Photo Gallery |"
    },
    {
      "tag": "div",
      "text": "Budapest Main Menu Essential Information Getting to Budapest Budapest Hotels Budapest Sightseeing Food and Drink Entertainment Shopping in Budapest Budapest History"
    },
    {
      "tag": "p",
      "text": "You are in: Main Page » Sightseeing » Page 1 » P2 » P3 » P4 » P5 » P6 » P7 » P8 » P9 » Baths » Bridges » Museums\r\nP1 » Museums P2 Next Page »"
    },
    {
      "tag": "h1",
      "text": "Budapest Museums (Page 2)"
    },
    {
      "tag": "h2",
      "text": "Military History Museum"
    },
    {
      "tag": "p",
      "text": "I. Tóth árpád sétány 40, Open:\r\n10am-5pm Tue-Sat, 10am-6pm Sun, Budapest Card accepted ,\r\nWebsite: www.militaria.hu Situated in a former municipal army barracks, the Museum of Military History has a sprawling\r\ncollection of weaponry and war memorabilia housed on two main floors. Open to the public since 1937\r\nand restored after World War II, the museum has permanent collections covering the 1848 revolution\r\nand War of Independence, both World Wars and the 1956 uprising, together with more modern displays\r\nshowing machinery, guns and other military equipment used by the Hungarian army. On the ground\r\nfloor, shells of different calibres and sizes line the museum's corridors, while above, images of\r\nengineers building pontoon bridges, soldiers hauling gun carriages and weary infantry men in the\r\ntrenches stare out at you. On the staircase leading to the first floor, there are two lovely stain glass\r\nwindows depicting Buda in 1493 and Budavár Bevetele in 1849. Turn right and you'll find\r\nexhibits on military history during the Austro-Hungarian Empire, including uniforms worn by the\r\nHungarian Hussar regiment. The are also large display cases featuring models and battle scenes from World\r\nWar II, although the addition of a Huey helicopter (as used in Vietnam) was somewhat puzzling. The\r\ndisplays devoted to the tragic events of the 1956 uprising are the most poignant by far. One nice touch is the WW2 American helmet which sits on a clear glass case on\r\nthe ground floor landing. Aslot has been cut in the top so that visitors can make a donation to\r\nthe museum. The entrance, which is from Tóth árpád sétány\r\n(promenade) has a fine lookout over Buda's western suburbs."
    },
    {
      "tag": "h2",
      "text": "Museum of Applied Arts"
    },
    {
      "tag": "p",
      "text": "IX. Üllői út 33-37, Metro: M3\r\nFerenc körút , Trams 4, 6, Open: 10am-4pm Tue-Sun from Jan 1-13 March, 10am-6pm rest\r\nof the year, Budapest Card accepted , Website: www.imm.hu This beautiful building was designed by Odön Lechner and completed in 1896. It houses a\r\nnumber of interesting exhibitions with a permanent display of arts and crafts and furniture in the\r\nupstairs area."
    },
    {
      "tag": "h2",
      "text": "Museum of Commerce and Catering"
    },
    {
      "tag": "p",
      "text": "I. Fortuna utca 4, Várbusz, Bus 16, Open: 10am-5pm\r\nWed-Fri, 10am-6pm Sat/Sun, Closed: Mon/Tue, Budapest Card\r\naccepted , Website: www.mkvm.hu , Show Map The old 18th century inn at No. 4 Fortuna utca now houses a small but interesting museum dedicated\r\nto the history of confectionery and pastry shops. If you have small children, then this\r\nperhaps is a better place to visit than some of the other more austere museums on Castle Hill."
    },
    {
      "tag": "h2",
      "text": "Museum of Fine Arts"
    },
    {
      "tag": "p",
      "text": "XIV. Hősök\r\ntere, Metro: M1\r\nHősök tere , Bus 4, 20, 30, 105, Trolleybus 75, 79, Open: 10am-5:30pm All year round, Budapest Card accepted , Website: www2.szepmuveszeti.hu/index.htm The museum stands on the northern side of Heroes' Square and houses the National collection of\r\nnon-Hungarian art with items dating back to the Egyptian era. Some count this as one of the most\r\nimpressive galleries in Central Europe as it's home to works by famed artists such as El Greco,\r\nGoya, Rembrant and Rubens. Astrong core of the art collection was collected by the\r\nEsterházy family, once one of the most influential aristocratic families in the country.\r\nThere are often temporary exhibitions on show and it's therefore worth checking to see what's on beforehand.\r\nHowever, the permanent displays alone are well-worth a visit."
    },
    {
      "tag": "h2",
      "text": "Museum of Music History"
    },
    {
      "tag": "p",
      "text": "I. Táncsics Mihály utca 7, Várbusz, Bus 16, Open:\r\n10am-6pm Mar 15-Oct 31, 10am-5pm Nov 1-Mar14, Closed Mondays, Budapest Card accepted , Website: www.zti.hu/museum.htm Set in the magnificent Baroque surroundings of the Erdődy Palace, the Museum of Music History\r\ncharts the history of musical life in Budapest from the 18th to 20th centuries. Asection of the\r\nexhibition is devoted to the life and works of composer Béla Bartók, while early\r\nHungarian musical instruments are also on display."
    },
    {
      "tag": "h2",
      "text": "Postal Museum"
    },
    {
      "tag": "p",
      "text": "VI. Andrássy út 3, Metro: M1\r\nBajcsy-Zsilinksky út , Bus 4, 105, Open: 10am-6pm Apr 1-Oct 31, 10am-4pm Nov 1-Mar 31\r\n(closed Mondays), Budapest Card accepted Set in a decorative first floor apartment formerly belonging to the wealthy Andreas\r\nSaxlehner, the\r\nmuseum details the history of the Hungarian postal service. Included among the exhibits is a mock\r\n19th-century post office and vintage mail vehicle. The building itself is the highlight of a visit\r\nhere."
    },
    {
      "tag": "h2",
      "text": "Ráth György Museum"
    },
    {
      "tag": "p",
      "text": "VI. Városligeti fasor 12, M1 Bajza\r\nutca,\r\nBus 4, 105, Trolleybus 78,79, Open: 10am-4pm Jan 1-Mar 31, 10am-6pm Mar 14-Dec 31, Budapest Card accepted Just a stone's throw away from Heroes' Square, the former home of artist György Ráth is\r\ndevoted to Buddhist and Eastern Art from China and Japan. Among the excellent displays are ornate\r\nsnuff bottles, Samurai armour and intricately detailed lacquered combs. Temporary exhibitions of\r\nart from other Far Eastern countries also take place here during the summer."
    },
    {
      "tag": "h2",
      "text": "Semmelweis Museum of Medical History"
    },
    {
      "tag": "p",
      "text": "I. Apród utca 1-3, Tram 18, Open: 10:30am-5pm Tue-Sun, Budapest Card accepted Housed in the birthplace of Dr Ignác Semmelweis (who discovered the cure for puerperal\r\nfever) the Museum's exhibits document the history of medicine from ancient times to the present\r\nday. Of the many surgical instruments on display, most interesting is the medieval chastity belt.\r\nMakes you wonder what anyone wearing one would do if they had an itch!"
    },
    {
      "tag": "h2",
      "text": "Stamp Museum"
    },
    {
      "tag": "p",
      "text": "VII. Hársfa utca 47, Open: 10am-6pm Tue-Sun, Metro: M1 Vörösmarty\r\nu. With a collection that includes every first edition Hungarian postage stamp, this museum is a real\r\ntreat for collectors. Foreign stamps are not left out either, as displays are organised by\r\ncontinent and country. If nothing else, the museum leaves you with the opinion that Hungarian\r\nstamps are (arguably) the most beautiful in the world."
    },
    {
      "tag": "h2",
      "text": "Statue Park (Szoborpark)"
    },
    {
      "tag": "p",
      "text": "XXII. Balatoni út, Bus 50, Open: 10am-dusk daily, Budapest Card accepted , Website: www.szoborpark.hu Without a hint of irony, the old lady selling tickets to this curious outdoor museum puts on a\r\ntape of stirring Soviet music as you pass through the main entrance. Visitors to Szobor Park seem\r\nto fall into two categories - those intrigued by the idea of a dumping ground for Soviet and\r\nCommunist statues and others making a bizarre sort of pilgrimage to wallow in what remains of the\r\ngood old days of 'goulash communism'. Back then, the statues represented, albeit superficially, a powerful symbol of\r\nSoviet strength and unity. Today, stuck out on the edge of town, they've lost much of their\r\ndignity, instead being brutally exposed as the idealistic follies that ordinary Hungarians always\r\nknew them to be. Worth a look, but not as impressive as most guide books would have you\r\nbelieve."
    },
    {
      "tag": "h2",
      "text": "Telephone Museum"
    },
    {
      "tag": "p",
      "text": "I. Úri utca. 49, Várbusz, Bus 16, Open: 10am-6pm Apr 1-Oct31,\r\n10am-4pm Nov 1-Mar 31, Closed Mondays), Budapest Card\r\naccepted Asmall museum set in a former telephone exchange in Buda's Castle District. Centred around a\r\nfully working antique switchboard, the exhibition charts the history of the telephone using various\r\ninteractive displays. Not as much fun for kids as some tourist guides claim. Instead, you may find\r\nthem slipping back to their Nintendos for a sneaky game of Super Mario Kart."
    },
    {
      "tag": "h2",
      "text": "Transport Museum"
    },
    {
      "tag": "p",
      "text": "XIV. Városligeti körút 11, Tram 1, Trolleybus 70, 72, 74,\r\nOpen: 10am-4pm Tue-Thu from Jan 1-Apr 30, 10am-5pm Tue-Sun May 1-Sep 30, 10am-5pm Sat/Sun Oct 1-Dec\r\n31, Closed Monday, Budapest Card accepted ,\r\nWebsite: www.km.iif.hu/index.html Permanent exhibitions on the history of Hungarian railways (including scale models), shipping and\r\nthe development of the modern car and motorcycle. Accompanied by guided tours, films and lectures\r\nthroughout the year."
    },
    {
      "tag": "h2",
      "text": "Tomb of Gül Baba"
    },
    {
      "tag": "p",
      "text": "II. Mecset utca 14, Bus 91, Open: 10am-6pm May 1-Oct 31 (closed Mondays), Budapest Card accepted , Website: www.btm.hu/Turbe/turbe.htm Burial chapel of the muslim dervish and member of the Bektashi order who died in 1541 following\r\nthe capture of Buda. Built between 1543 and 1548, the octagonal building now features a permanent\r\ndisplay of religious items and Turkish rugs. Awell known shrine for Muslims."
    },
    {
      "tag": "h2",
      "text": "Underground Railway Museum"
    },
    {
      "tag": "p",
      "text": "Metro: M1, M2, M3 Deák tér , Opening\r\nhours to follow, Budapest Card accepted Located inside Deák tér metro station, the museum occupies part of an original\r\nunderground tunnel. The exhibits give good insight into the development of mainland Europe's first\r\nsubway service and include a number vintage carriages which ran on the original line built for the\r\nMillennium celebrations in 1896. There are also architect's plans, various drawings and other\r\nperiod memorabilia that makes the museum an interesting place to stop off."
    },
    {
      "tag": "h2",
      "text": "Vasarely Museum"
    },
    {
      "tag": "p",
      "text": "III. Szentlélek tér 6, Metro: HÉV árpad híd , Bus 6, 86, 106, Tram 1, Open:\r\n10am-6pm Mar 15-Oct 31, 10am-5pm Nov 1-Mar 14, Budapest Card\r\naccepted Housed in a two-storey wing of the old aristocratic home of the Zichy family, Vasarely's vast\r\ncollection of over four hundred works creates one of the most vivid and inspirational galleries in\r\nBudapest. Born in Pécs, Hungary, at the turn-of-20th-century, Victor Vasarely\r\nspent his early working life in advertising before moving with his wife Klára to Paris in\r\n1930. Inspired by the Bauhaus movement of Walter Gropius in 1919, he found fame as an artist after\r\nexhibiting at the Boétie Street Gallery, Paris in 1944. Dubbed as the father of Op Art in the 60s, his familiar style of creating\r\nillusionary 3D geometric shapes on flat canvases has an almost hypnotic effect. Early efforts such\r\nas MITIN (1938) give a clear indication of the style he would later follow, while more recent\r\nworks such as BULL (1973-74) are a prelude to modern day computer imagery. For anyone interested in\r\nmodern art the Vasarely Múzeum is a must."
    },
    {
      "tag": "h2",
      "text": "Zoltán Kodály Memorial Museum"
    },
    {
      "tag": "p",
      "text": "VI. Kodály körönd 1, Metro: M1\r\nKodály körönd , Bus 4, 106, Open: 10am-4pm Wed, 10am-6pm Thu-Sat, 10am-2pm Sun,\r\n(Mon/Tue closed), Budapest Card accepted ,\r\nWebsite: www.iks.hu/museum.htm The former home of the Hungarian composer until his death in 1967, the memorial museum has on\r\ndisplay folk art objects that he owned as well as personal manuscripts and photographs. You are in: Main Page » Sightseeing » Page 1 » P2 » P3 » P4 » P5 » P6 » P7 » P8 » P9 » Baths » Bridges » Museums\r\nP1 » Museums P2 Next Page » | Contact | Help | Shop | Site Search | Photo Gallery | © Talking Webs. All Rights Reserved. | Privacy Statement | Copyright Information | Content on this website may not be used without prior permission from the website's owners."
    }
  ]
}