{
  "url": "http://www.teamuse.com/article_030601.html",
  "file_number": "741",
  "content_hash": "b4ce260ef94bc92644fc113edd7388d80d322bd2da283ca56906deee495113c8",
  "total_blocks": 66,
  "retained_blocks": 3,
  "ignored_blocks": 63,
  "blocks": [
    {
      "tag": "h1",
      "text": "Bootleg Tea"
    },
    {
      "tag": "h3",
      "text": "by James Norwood Pratt"
    },
    {
      "tag": "div",
      "text": "Tea had become England's national drink by 1800 and she was importing an average\n\t\t\t\t\t\tof twenty-four million pounds a year, it is said. It is now time for me to admit\n\t\t\t\t\t\tthat all figures relating to earlier tea consumption in England are merely\n\t\t\t\t\t\tofficial, which is to say, misleading. The English drank vastly more tea than\n\t\t\t\t\t\tany John Company records before 1784 reveal, thanks to a nationwide network of\n\t\t\t\t\t\t\"free traders\" or-from the government's viewpoint-smugglers. About a decade after the Company began importing tea on a regular basis, the\n\t\t\t\t\t\tCrown slapped a duty of five shillings on each pound irrespective of quality.\n\t\t\t\t\t\tThis did not much affect the price of the most expensive teas, but it served to\n\t\t\t\t\t\tknock the cheap right out of the market, or rather, to create a black market for\n\t\t\t\t\t\tit. The cheapest sort one could legally buy then cost seven shillings a\n\t\t\t\t\t\tpound-almost a laborer's whole week's wages-while just across the Channel or\n\t\t\t\t\t\tacross the North Sea in Holland tea of this same quality could be had for two\n\t\t\t\t\t\tshillings. With a 350 percent profit to play with, \"free traders\" were not long\n\t\t\t\t\t\tin multiplying along the whole length of England's coastline. Mr. J.M. Scott, to\n\t\t\t\t\t\twhose grand book The Great Tea Venture these pages are much indebted, has\n\t\t\t\t\t\twritten: \"The trouble and talk which resulted publicized tea as nothing else\n\t\t\t\t\t\tcould have done, and as the illegal industry spread and prospered it carried the\n\t\t\t\t\t\tnew commodity to every door. It was calculated that at the height of this\n\t\t\t\t\t\tillegal campaign two-thirds of the tea drunk in England had been smuggled.\" Many a fine old home near the English coast was built on the proceeds of a\n\t\t\t\t\t\tventurer, one who put up the smuggling capital but kept well in the background,\n\t\t\t\t\t\tleaving the risks to the captain and the lander. The captain purchased his goods\n\t\t\t\t\t\tquite legally abroad and then waited for a dark night to run them across to one\n\t\t\t\t\t\tof several spots the lander might arrange. The lander arranged with the local\n\t\t\t\t\t\tfarmhands for transport, with the local parson, perhaps, for storage in the\n\t\t\t\t\t\tchurch, and for eventual sales. Besides the venturer, very often the only\n\t\t\t\t\t\tprincipal in the whole business who could read and write was the quill driver,\n\t\t\t\t\t\tthe man who kept the accounts. Eternal vigilance is, to be sure, the price of\n\t\t\t\t\t\tlaw breaking if it is to be successful for long, and this is but one of the ways\n\t\t\t\t\t\ttea smuggling was carried on from 1680, the year of the tax, until 1784, the\n\t\t\t\t\t\tyear of its repeal. In 1733, no less than fifty-four thousand pounds of bootleg\n\t\t\t\t\t\ttea were seized; present-day American consumption of illegally imported drugs\n\t\t\t\t\t\tcan give us some idea of how much was not. The smugglers succeeded mainly because they had the sympathy of the whole\n\t\t\t\t\t\tcountryside. On the Isle of Man they often un-loaded as much tea and brandy as a\n\t\t\t\t\t\thundred horses could carry, and stored their contraband in large caves no\n\t\t\t\t\t\trevenue man ever managed to discover because, as a pious old Manxman said,\n\t\t\t\t\t\t\"Who'd ever be so wicked as to tell them?\" The free traders knew every time a\n\t\t\t\t\t\tcoast guard craft went into drydock, or when a riding officer had the gout or\n\t\t\t\t\t\tplanned a raid. The country folks dealt with the smugglers less for the sake of\n\t\t\t\t\t\tgetting luxuries cheap than of getting them at all. But the larger the band, the\n\t\t\t\t\t\tmore contra-band, and the more overawed the revenuers and the populace. The day\n\t\t\t\t\t\tof the small-scale free trader had passed well before the mid-1700s. And as the\n\t\t\t\t\t\tbusiness grew, as rich men found it profit-able to own three or four sloops\n\t\t\t\t\t\tengaged in illegal traffic, it be-came the part of wisdom to know nothing of\n\t\t\t\t\t\twhat went on. Without regard for secrecy, smugglers boldly stole their car-goes back from\n\t\t\t\t\t\tgovernment customs houses more than once. Long cavalcades of horses loaded with\n\t\t\t\t\t\ttea were led quite openly through Kent; it is said six tons a week were run from\n\t\t\t\t\t\tFrance through Sussex. \"The best that can be said of this period,\" ob-serves\n\t\t\t\t\t\tJ.M. Scott, \"is that it was the beginning of yacht racing-revenue cutters\n\t\t\t\t\t\tchasing smugglers who almost invariably won the cup of tea.\" There were, of\n\t\t\t\t\t\tcourse, occasional casualties on both sides. One of the famous \"Wiltshire\n\t\t\t\t\t\tMoonrakers,\" who used the old church in Kingstone as their hiding place, is\n\t\t\t\t\t\tburied in its churchyard under this epitaph: To the memory of Robert Trotman, late of Rowd, in the county of Wilts, who was\n\t\t\t\t\t\tbarbarously murdered on the shore near Poole, the 24th of March, 1765: Alittle tea; one leaf Idid not steal. For guiltless bloodshed Ito God appeal. Put tea in one scale, human blood in t'other, And think what 'tis to slay a harmless brother. Stripped of their glamour, most smuggling gangs must have been rather like the\n\t\t\t\t\t\tone Daphne du Maurier depicted in her novel Jamaica Inn: bloodthirsty and wholly\n\t\t\t\t\t\tout for themselves. Still, in a time when inland communications were\n\t\t\t\t\t\tunimaginably bad, when most roads in England were tracks, dangerous at night and\n\t\t\t\t\t\tunusable part of the year, when most of the populace was illiterate, living and\n\t\t\t\t\t\tdying within ten or twenty miles of their birthplaces, smugglers undertook a\n\t\t\t\t\t\tnationwide sales campaign of an expensive novelty-and succeeded. They were only\n\t\t\t\t\t\tput out of business entirely after Waterloo, when the country finally had spare\n\t\t\t\t\t\ttroops enough to enforce the laws. But the large-scale smuggling of tea had\n\t\t\t\t\t\tended in 1784, when the government finally repealed the tea tax at the behest of\n\t\t\t\t\t\tRichard Twining, chairman of the dealers of tea. For most Britishers, it was the\n\t\t\t\t\t\tfirst intelligent act of government in living memory, coming as it did three\n\t\t\t\t\t\tyears after their American colonists had ended another dispute over tea by\n\t\t\t\t\t\tcompelling the surrender of Lord Cornwallis at Yorktown. SwishCommand noindex Enjoyment Globo: Tilt When Ready What's in a Name? History Trading Tea for Opium Empire Brewed from Tea Leaves Opinions A Nice Cup of Tea 2003: Tea Year in Review Mr. Tea Shipping to Canada Upset stomach at an Indian restaurant Tea in Art Tea Paintings: The Birds Tea Poem: Tender and Fragrant Reviews Babington's Tea Rooms Central Perc European Café Slides Asia Trip Highlights TeaMuse is interested in hearing your stories! Combine your love of tea with your desire for fame. SwishCommand index"
    }
  ]
}