{
  "url": "http://www.thebookplace.com/",
  "file_number": "745",
  "content_hash": "7aafe315b48e79618efe9cdcf774155358ae1eb27eb4da7e229e1f74f46581c9",
  "total_blocks": 255,
  "retained_blocks": 37,
  "ignored_blocks": 218,
  "blocks": [
    {
      "tag": "div",
      "text": "--Choose-- Arts & Antiques Audio Books Biography Business Children Computers Crime Entertainment Erotica Popular Fiction Literary Fiction Poets & Poetry Food & Drink Health & Fitness Home and Garden Humour Mind, Body & Spirit Music Newspapers Non Fiction Science & Nature SF & Fantasy Sport Travel"
    },
    {
      "tag": "p",
      "text": ">>To ASK A BOOKSELLER, click here ."
    },
    {
      "tag": "div",
      "text": "SEARCH BROWSE SUBJECTS MAGAZINE HELP Your Account : Checkout BOOKPLACE : BOOKENDS"
    },
    {
      "tag": "div",
      "text": "Editor's Choice of the Week CHRISTMAS CRIME The Best of \"Charles Buchan's  Football Monthly\" edited by Simon Inglis FOR MANY FIFTY-something football fans, Charles Buchan's Football Monthly was a must-have throughout the year. It was an indispensible guide to what was happening on the pitch and on the terraces at a time when television wasn't exactly common currency. So this fantastic compilation of the best of the magazine should prove a brilliant stocking-filler for every grey-haired (or balding... or both) couch potato footie-fan in the country. Areal crowd pleaser! Read more. OUR PRICE: £14.99 SEE OUR LIST of the best crime books of 2006... and we have them signed by the authors. So fill your stocking with some of these exclusive books: from IAN RANKIN's thrilling new bestseller The Naming of the Dead to PATRICIA CORNWELL's At Risk to MARK BILLINGHAM's gruesome Buried , these books are guaranteed to keep you awake on Christmas Eve! For the full list click HERE ."
    },
    {
      "tag": "p",
      "text": "20% PLUS OFF OUR CHRISTMAS LIST"
    },
    {
      "tag": "div",
      "text": "THE BEST BOOKS for the man in your life this Christmas. And what better than Conn and Hal Iggulden's Dangerous Book for Boys . For the full list of recommended books, click here . GREAT READS FOR that woman are guaranteed with our recommended list, and top of the pile is Philippa Gregory's The Boleyn Inheritance ... but there's many more to go with it.  Just click here for the full list. WE SHAKE THE Christmas tree and pick the best books for the kids this season. Oliver Jeffers The Incredible Book Eating Boy is one that will go down a treat. But there's lots more here ."
    },
    {
      "tag": "p",
      "text": "LIFE GOES ON... and at Christmas, we have time to appreciate it all. For food, check The Duchy Originals Cookbook for organic recipes, but we also look at art, the world and much more in our Lifestyle list. Go here ."
    },
    {
      "tag": "div",
      "text": "CHRISTMAS IS Agreat time for sport - football, rugby and cricket included. Read about Wayne Rooney's rise in My Story So Far but you can also tuck into all of your favourite sports in our top list of sports books here ."
    },
    {
      "tag": "p",
      "text": "FILL THOSE STOCKINGS with our suggested books... a wide range of everything from music to trivia. One of the favourites is sure to be The Best of \"Smash Hits\" , featuring the top bands and thier hits. But there's much more besides here . December Specials New this month: the new books from Catherine Webb, Roddy Doyle. Peter Ackroyd, JG Ballard. Raymond E Feist & Terry Brooks, signed here ."
    },
    {
      "tag": "div",
      "text": "Books in the media TV shows & movies based on here The shortlists - HERE"
    },
    {
      "tag": "p",
      "text": "Reviews of the new books from Andrew O'Hagan, James MacKinnon, Ken Dornstein, David Peace, Sir John Betjeman & Giacomo Papi here December Interviews & features"
    },
    {
      "tag": "div",
      "text": "Interview Matthew Klein IN 2007, LOOK out for Matthew Klein, whose debut novel, Switchback is not only a great story, but is guaranteed to keep you transfixed. What's it all about? Go to our interview with Klein by clicking here . Feature Here's to Heroines WHEN JESSICA RUSTON did a Google search on \"heroines\", she was disappointed at the results, so she set out to write her own book on the subject. And now it's getting praised everywhere. To read how Jessica put the book together, click here . Interview Jennifer Donnelly JENNIFER DONNELLY, ORIGINALLY burst on the scene when her crossover novel, A Gathering Light , was picked for last year's Richard & Judy Summer Read and went on to win the Carnegie Prize. She's back with a great new novel, The Winter Rose . Read our interview here ."
    },
    {
      "tag": "div",
      "text": "This Week's Top 10"
    },
    {
      "tag": "div",
      "text": "1: PostSecret by Frank Warren (Ed)"
    },
    {
      "tag": "div",
      "text": "2: Why Don't Penguins Feet Freeze?"
    },
    {
      "tag": "div",
      "text": "by Mick O'Hare (Ed)"
    },
    {
      "tag": "div",
      "text": "3: Wall and Piece"
    },
    {
      "tag": "div",
      "text": "by Banksy"
    },
    {
      "tag": "div",
      "text": "4: The God Delusion"
    },
    {
      "tag": "div",
      "text": "by Richard Dawkins"
    },
    {
      "tag": "div",
      "text": "5: The Goddess Guide"
    },
    {
      "tag": "div",
      "text": "by Gisele Scanlon"
    },
    {
      "tag": "div",
      "text": "6: Freakonomics"
    },
    {
      "tag": "div",
      "text": "by Steven Levitt & Stephen Dunbar"
    },
    {
      "tag": "div",
      "text": "7: Welcome to Big Biba"
    },
    {
      "tag": "div",
      "text": "by Steven Thomas & Alwyn Turner"
    },
    {
      "tag": "div",
      "text": "8: The Power of Art"
    },
    {
      "tag": "div",
      "text": "by Simon Schama"
    },
    {
      "tag": "div",
      "text": "9: Shalimar the Clown"
    },
    {
      "tag": "div",
      "text": "by Salman Rushdie"
    },
    {
      "tag": "div",
      "text": "10: The Secret Life of Trees"
    },
    {
      "tag": "div",
      "text": "By Colin Tudge"
    },
    {
      "tag": "div",
      "text": "OU Set Texts WE HAVE HUNDREDS of   Open University set texts on offer for this term, at great prices.. FIND THE LIST OF OPEN UNIVERSITY SET TEXTS HERE"
    },
    {
      "tag": "div",
      "text": "December magazine INTERVIEWS See the full list here"
    },
    {
      "tag": "p",
      "text": "FEATURES Awide range here BOOK EXTRACTS Great extracts here"
    },
    {
      "tag": "div",
      "text": "Book awards Man Booker shortlist 2006 British Book Awards 2006 Orange Shortlist 2006 Costa shortlist Samuel Pepys Award Winner for Non-fiction William Hill Sports Book of the Year 2005 Financial Times and Goldman Sachs \r\nBusiness Book of the Year Award Samuel Johnson Prize 2006 The Book Pl@ce Browser Get personalised e-mail updates. Competitions, offers and the latest reviews delivered to your desktop. Partnership Program Earn a COMMISSION on books sold. Build your own bookshop! Add to Favourites! Add us to your favourites list by clicking here . About The Book Pl@ce Help & FAQ's Shipping charges Order Info. Open a business account Contact us"
    },
    {
      "tag": "div",
      "text": "Your Account : Checkout «TOP» BP : BE"
    }
  ]
}