{
  "url": "http://www.travelintelligence.net/wsd/hotels/htls_3833_Les_Suites_TaipeiChingCheng_Taipei_review.html",
  "file_number": "760",
  "content_hash": "5208046831b3518a75efa3012f8c533cda22dd4717b280a9001729e58b30514a",
  "total_blocks": 262,
  "retained_blocks": 27,
  "ignored_blocks": 235,
  "blocks": [
    {
      "tag": "div",
      "text": "sitemap - My Map (beta)"
    },
    {
      "tag": "div",
      "text": "home find hotels - Amalfi Coast - Amsterdam - Barcelona - Cotswolds - London - Madrid - Mallorca - Marrakech - Milan - New York City - Paris - Prague - Rome - Sydney - Venice More popular cities > Popular regions > All destinations > Advanced search > Hotlists > Boutique Hotels Design Hotels Luxury Hotels read articles Writers Contributors Article search Publish us Join us Before you die Photography Travel writing courses special offers about us Resources Client Comments TI Team Booking service Group bookings Booking conditions"
    },
    {
      "tag": "div",
      "text": "hotel reviews & inspiration stay somewhere special with Travel Intelligence"
    },
    {
      "tag": "div",
      "text": "< back book this hotel"
    },
    {
      "tag": "div",
      "text": "Check-in: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 December '06 January '07 February '07 March '07 April '07 May '07 June '07 July '07 August '07 September '07 October '07 November '07 Check-out: 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 December '06 January '07 February '07 March '07 April '07 May '07 June '07 July '07 August '07 September '07 October '07 November '07 Adults: Children: 1 2 3 4 none 1 child 2 children 3 children 4 children advanced search »"
    },
    {
      "tag": "h1",
      "text": "Les Suites Taipei - Ching Cheng"
    },
    {
      "tag": "p",
      "text": "\"Classy clubby petite hideaway hotel in down-town Taipei\" While away a rainy Taipei afternoon in any of the luxurious lounges listening to jazz and perusing the eclectic collection of coffee table books."
    },
    {
      "tag": "div",
      "text": "Send Feedback: [hide]"
    },
    {
      "tag": "div",
      "text": "Your Name: Your E-mail: Comments:"
    },
    {
      "tag": "div",
      "text": "Comfort Character Location 1 - poor 2 - average 3 - good 4 - very good 5 - excellent 1 - poor 2 - average 3 - good 4 - very good 5 - excellent 1 - poor 2 - average 3 - good 4 - very good 5 - excellent To avoid spam robots, please enter the code below: Ican't see that."
    },
    {
      "tag": "div",
      "text": "Hotel Factsheet: [hide] Property Highlights Air Conditioning Business Center Concierge Dry Cleaning Fitness Facility Meeting Rooms Non-Smoking Rooms Room Service Internet point Wifi Room Highlights Separate shower in some rooms Bathrobe Coffee/Tea Maker Minibar Internet access Direct Dial Telephone Alarm Clock Radio In-Room Safe Pay-Per-View Movies Remote Control Color Cable TV Turn-Down Service Wake-up service Security Features 24 Hour Security Restricted Access to Guest Floors Electronic Room Keys Parking Garage\r\n\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t (Cost: Free)"
    },
    {
      "tag": "div",
      "text": "Check in/out times Check-in: 15:00 Check-out: 12:00 Cancellation Policy 48 hours before arrival, in case of no show the hotel reserves the right to charge one night."
    },
    {
      "tag": "div",
      "text": "Area Airport Information Airport Name: Taipei C.K.S. Airport 3-Letter Code: TPE Distance from Airport to Hotel: 32 km Cost shuttle from the airport: USD 50.00 Private Limo Estimated Taxi Charge (one-way): USD 35.00"
    },
    {
      "tag": "div",
      "text": "Rates are per room per night including breakfast and excluding taxes (15% service charge & local tax on room rates)"
    },
    {
      "tag": "div",
      "text": "Hotel Map: [hide] The Travel Intelligence review:"
    },
    {
      "tag": "div",
      "text": "Tucked behind a high chocolate wall, on the corner of the first lane opposite the McDonalds outside Nanjing East MRT... more"
    },
    {
      "tag": "div",
      "text": "The Travel Intelligence review: [close]"
    },
    {
      "tag": "div",
      "text": "Caroline Major Tucked behind a high chocolate wall, on the corner of the first lane opposite the McDonalds outside Nanjing East MRT station, Les Suites is a hideaway in a city frenetic in its pursuit of the manufacture of things.  More, it is Taipeis only small contemporary hotel and its assembled with a relaxed and timeless style.  Bravo! Charcoal and chocolate, silver and aubergine, olive and gold and black and white are all mixed together with mood lighting, textural interest and jazzy style.  Plenty of space for luxury lounging gives the ground floor a clubby feel helped along by an ever present selection of complimentary nibbles and drinks.  Youll want to linger around to enjoy the books, get online, read the papers or maybe tuck your feet under you and curl up with a cup of tea, slippers abandoned on the floor.  The hotel is for guests only and the lack of a traditional lobby is cosy and charming. Upstairs theres five choices of room where even the small entry level offering is inviting (if only for sleeping).  Small touches are the work of an owner whos spent a lot of time in business hotels and wanted more.  The mini-bar is complemented with an always-on urn of boiling water for serving yourself with the kinds of instant noodles you can only get in Asia, or for brewing up a real pot of tea.  Hi tech continues on the bedside panel for room controls.  Alarm, lights, temperature, world time and curtains all function with light touch digital.  Perhaps the most fun though, is the Toto toilet, bringing into favour a choice of three wash cycles and a warm air dry in easy reach on a wall panel. Maybe itll change your routine forever! Wi-fi and broadband are of course standard and fast in super-tech Taiwan. Though not in the toilet - yet. Breakfast is served downstairs in the lounge and cleared away promptly at ten am when its replaced with the tea selection.  There is no restaurant, but who needs it in a bustling district full of fabulous local alternatives?  The gym is small but with well enough chosen equipment to get a good work-out in.  Room-service is available between eleven pm and two am but is nothing special.  Youll get better value with those exotic instant noodles from the mini-bar. Les Suite is a welcome alternative to the multi story behemouths prevalent in this city, and is a great space for lounging around in those out of business hours if you feel like staying in and chilling instead of going out on the town.  Thats an achievement for a business hotel.  It feels as much like home as a hotel can.   Book early as the Japanese, Hong Kongese and the Singaporeans are wise to the secret and the occupancy here, alongside its sister hotel a few blocks away on Da-An Road, run high."
    },
    {
      "tag": "div",
      "text": "Les Suites Taipei - Ching Cheng writes: [expand] Les Suites Taipei - Ching Cheng writes: [close]"
    },
    {
      "tag": "div",
      "text": "Find a refuge from Taipei's hectic pace at Les Suites Taipei. Taipei, the world's most sprawling city, is a complex and dynamic urban landscape well-known for its cutting-edge, high-tech efficiency. Ideally located in Taipei's premier financial and business district, Les Suites Taipei offers a tranquil home-away-from home atmosphere. Exquisite taste and syle make this one of Taipei's finest hotels. The Hotel's 90 rooms, including 16 suites and one VIP suite, achieve a new standard in the heart of Taipei. Guest quarters are remarkably spacious, with contemporary furnishings befitting a hotel in one of the world's most technologically advanced cities. Each room is equipped to meet the needs of the modern business traveler and help manage the demands of international travel."
    },
    {
      "tag": "div",
      "text": "Room types: [expand] Room types: [close]"
    },
    {
      "tag": "div",
      "text": "Please select a date to get available rooms. Slideshow (6 images)"
    },
    {
      "tag": "div",
      "text": "rate guarantee"
    },
    {
      "tag": "h2",
      "text": "Les Suites Taipei - Ching Cheng 12 Ching-Cheng Street, Taipei 105, Taiwan"
    },
    {
      "tag": "p",
      "text": "Address Les Suites Taipei - Ching Cheng 12 Ching-Cheng Street, Taipei 105, Taiwan Telephone Bookings 0845 227 0141 (UK) 011-44-845 227 0141 (US) Rooms 84 Local Star Rating Rates from TWD 9,999 General Enquiry email us here >"
    },
    {
      "tag": "div",
      "text": "About us Contact us Booking conditions Become an affiliate Hotel Log-in Newsletter Sign-up Images"
    },
    {
      "tag": "div",
      "text": "Copyright © 1999-2006 Travel Intelligence. All rights reserved."
    }
  ]
}