{
  "url": "http://www.umsl.edu/services/govdocs/ooh9899/40.htm",
  "file_number": "770",
  "content_hash": "8a3b01d2e575e7729c64b8b7dfc59bdabcaef9888b1db9f13ef4022b631456b3",
  "total_blocks": 56,
  "retained_blocks": 28,
  "ignored_blocks": 28,
  "blocks": [
    {
      "tag": "div",
      "text": "CLICK HERE TO GO TO NEWER 2000-2001 EDITION"
    },
    {
      "tag": "div",
      "text": "98-99 Handbook Contents ... UMSL Govt. Docs ... UMSL Libraries ... UMSL Home ..."
    },
    {
      "tag": "h2",
      "text": "Veterinary Assistants and Nonfarm Animal Caretakers"
    },
    {
      "tag": "p",
      "text": "Nature of the Work"
    },
    {
      "tag": "div",
      "text": "Working Conditions Employment Training, Other Qualifications, and Advancement Job Outlook Earnings Related Occupations Sources of Additional Information"
    },
    {
      "tag": "p",
      "text": "( D.O.T. 410.674-010, -022; 412.674-010, -014;\r\n418.381-010, .674-010, 677-010; and 449.674-010)"
    },
    {
      "tag": "h4",
      "text": "Significant Points"
    },
    {
      "tag": "p",
      "text": "* People who love animals get satisfaction in this occupation, but the work can be\r\n    unpleasant and physically and emotionally demanding. * Most animal caretakers are trained on the job, but advancement depends on experience\r\n    and/or formal training. * Job outlook is generally good; however, competition will be keen for animal caretaker\r\n    jobs in zoos."
    },
    {
      "tag": "h4",
      "text": "Nature of the Work"
    },
    {
      "tag": "p",
      "text": "Many people like animals. But, as pet owners can attest, taking care of them is hard\r\n      work. Animal caretakers, sometimes called animal attendants or animal keepers, feed,\r\n      water, groom, bathe, and exercise animals and clean, disinfect, and repair their cages.\r\n      They also play with the animals, provide companionship, and observe behavioral changes\r\n      that could indicate illness or injury. Kennels, animal shelters, animal hospitals and clinics, stables, laboratories, aquariums,\r\n      and zoological parks all house animals and employ caretakers. Job titles and duties vary\r\n      by employment setting. Kennel staff usually care for small companion animals like dogs and cats while their\r\n      owners are working or traveling out of town. Beginning attendants perform basic tasks,\r\n      such as cleaning cages and dog runs, filling food and water dishes, and exercising\r\n      animals. Experienced attendants may provide basic animal health care, bathe and groom\r\n      animals, and clean their ears. Caretakers who work in kennels also sell pet food and\r\n      supplies, assist in obedience training, help with breeding, or prepare animals for\r\n      shipping. Animal caretakers who specialize in grooming, or maintaining a pet's—usually a dog's\r\n      or cat's—appearance are called groomers. Some groomers work in kennels and others\r\n      operate their own grooming business. Groomers answer telephones, schedule appointments,\r\n      discuss with clients how they want their pets to look, and collect information on the\r\n      pet's disposition and veterinarian. Grooming the pet involves several steps: An initial\r\n      brush-out is followed by a first clipping of hair or fur using electric clippers, combs,\r\n      and grooming shears; the groomer then cuts the nails, cleans the ears, bathes, and\r\n      blow-dries the animal, and ends with a final clipping and styling. Animal caretakers in animal shelters perform a variety of duties and work with a wide\r\n      variety of animals. In addition to attending to the basic needs of the animals, caretakers\r\n      must also keep records of the animals received and discharged and any tests or treatments\r\n      done. Some vaccinate newly admitted animals under the direction of a veterinarian, and\r\n      euthanize (put to death) seriously ill, severely injured, or unwanted animals. Caretakers\r\n      in animal shelters also interact with the public, answering telephone inquiries, screening\r\n      applicants for animal adoption, or educating visitors on neutering and other animal health\r\n      issues. Workers in stables saddle and unsaddle horses, give them rubdowns, and walk them through a\r\n      cool-off after a ride. They also feed, groom, and exercise the horses, clean out stalls\r\n      and replenish bedding, polish saddles, clean and organize the tack (harness, saddle, and\r\n      bridle) room, and store supplies and feed. Experienced staff may help train horses. Animal caretakers in animal hospitals or clinics are called veterinary assistants.\r\n      Veterinarians rely on caretakers to keep a constant eye on the condition of animals under\r\n      their charge. Caretakers watch as animals recover from surgery, check whether dressings\r\n      are still on correctly, observe the animals' overall attitude, and notify a doctor if\r\n      anything seems out of the ordinary. While among the animals, caretakers clean constantly\r\n      to maintain sanitary conditions in the hospital. Laboratory animal caretakers work in research facilities and assist with the care of a\r\n      wide variety of animals, including mice, rats, sheep, pigs, cattle, dogs, cats, monkeys,\r\n      birds, fish, and frogs. They feed and water the animals, clean cages and change bedding,\r\n      and examine the animals for signs of illness, disease, or injury. They may administer\r\n      medications orally or topically according to instructions, prepare samples for laboratory\r\n      examination, sterilize laboratory equipment, and record information regarding genealogy,\r\n      diet, weight, medications, and food intake. They work with scientists, physicians,\r\n      veterinarians, and laboratory technicians. In zoos, caretakers called keepers prepare the diets and clean the enclosures of animals,\r\n      and sometimes assist in raising their wards. They watch for any signs of illness or\r\n      injury, monitor eating patterns or any changes in behavior, and record their observations.\r\n      Keepers also may answer questions and assure that the visiting public behaves responsibly\r\n      toward the exhibited animals. Depending on the zoo, keepers may be assigned to work with a\r\n      broad group of animals such as mammals, birds, or reptiles, or they may work with a\r\n      limited collection of animals such as primates, large cats, or small mammals."
    },
    {
      "tag": "h4",
      "text": "Working Conditions"
    },
    {
      "tag": "p",
      "text": "People who love animals get satisfaction from working with and helping animals.\r\n      However, some of the work may be unpleasant and physically and emotionally demanding.\r\n      Caretakers have to clean animal cages and lift, hold, or restrain animals, risking\r\n      exposure to bites or scratches. Their work often involves kneeling, crawling, repeated\r\n      bending, and lifting heavy supplies like bales of hay or bags of feed. Animal caretakers\r\n      must take precautions when treating animals with germicides or insecticides. The work\r\n      setting can be noisy. Animal caretakers who witness abused animals or assist in the\r\n      euthanizing of unwanted, aged, or hopelessly injured animals may experience emotional\r\n      stress. Caretakers may work outdoors in all kinds of weather. Hours are irregular. Animals have to\r\n      be fed every day, so caretakers must work weekend and holiday shifts. In some animal\r\n      hospitals, research facilities, and animal shelters an attendant is on duty 24 hours a\r\n      day, which means night shifts. Most full-time caretakers work about 40 hours a week; some\r\n      work 50 hours a week or more. Caretakers of show and sports animals travel to\r\n      competitions."
    },
    {
      "tag": "h4",
      "text": "Employment"
    },
    {
      "tag": "p",
      "text": "Animal caretakers held about 163,000 jobs in 1996. About 33,000 of the total worked as\r\n      veterinary assistants in veterinary services. The remainder worked primarily in boarding\r\n      kennels, but also in animal shelters, stables, grooming shops, zoos, and local, State, and\r\n      Federal agencies. In 1996, 2 out of every 10 caretakers was self-employed, and 4 in 10\r\n      worked part time."
    },
    {
      "tag": "h4",
      "text": "Training, Other Qualifications, and Advancement"
    },
    {
      "tag": "p",
      "text": "Most animal caretakers are trained on the job. Employers generally prefer to hire\r\n      people with some experience with animals. Some training programs are available for\r\n      specific types of animal caretakers, but formal training is usually not necessary for\r\n      entry-level positions. Most pet groomers learn their trade by completing an informal apprenticeship, usually\r\n      lasting 6 to 10 weeks, under the guidance of an experienced groomer. Prospective groomers\r\n      may also attend one of the 50 State-licensed grooming schools throughout the country, with\r\n      programs varying in length from 4 to 18 weeks. The National Dog Groomers Association of\r\n      America certifies groomers who pass a written and practical skills examination. Beginning\r\n      groomers often start by taking on one duty, such as bathing and drying the pet. They\r\n      eventually assume responsibility for the entire grooming process, from the initial\r\n      brush-out to the final clipping. Groomers who work in large retail establishments or\r\n      kennels may, with experience, move into supervisory or managerial positions. Experienced\r\n      groomers often choose to open their own shops. Beginning animal caretakers in kennels learn on the job, and usually start by cleaning\r\n      cages and feeding and watering animals. Kennel caretakers may be promoted to kennel\r\n      supervisor, assistant manager, and manager, and those with enough capital and experience\r\n      may open up their own kennels. The American Boarding Kennels Association (ABKA) offers a\r\n      3-stage, home-study program for individuals interested in pet care. The first two study\r\n      programs address basic and advanced principles of animal care, while the third program\r\n      focuses on in-depth animal care and good business procedures. Those who complete the third\r\n      program and pass oral and written examinations administered by the ABKA become Certified\r\n      Kennel Operators (CKO). There are no formal educational requirements for animal caretakers in veterinary\r\n      facilities. They are trained on the job, usually under the guidance of a veterinarian or\r\n      veterinary technician. They start by performing tasks related to basic animal health care,\r\n      such as keeping cages and examination areas sanitary. They also help veterinarians prepare\r\n      for surgery, sterilize surgical equipment, observe recovering animals, and give\r\n      medications and basic medical treatment under the directions of a veterinarian or\r\n      veterinary technician. Highly motivated veterinary assistants may become veterinary\r\n      technicians, with additional training from one of approximately 65 accredited veterinary\r\n      technology programs. Employers of entry-level laboratory animal caretakers generally require a high school\r\n      diploma or General Educational Development (GED) test. Afew colleges and vocational\r\n      schools offer programs in laboratory animal science which provide training for technician\r\n      positions, but such training is not strictly necessary. New animal caretakers working in\r\n      laboratories begin by providing basic care to laboratory animals. With additional training\r\n      and experience, they may advance to more technical positions in laboratory animal care,\r\n      such as research assistant, mid-level technician, or senior-level technologist. The\r\n      American Association for Laboratory Animal Science (AALAS) offers certification for three\r\n      levels of technician competence. Those who wish to become certified as Assistant\r\n      Laboratory Animal Technicians (ALAT) must satisfy education and experience requirements\r\n      before taking an examination administered by AALAS. Some zoological parks may require their caretakers to have a bachelor's degree in biology,\r\n      animal science, or a related field. Most require experience with animals, preferably as a\r\n      volunteer or paid keeper in a zoo. Zoo keepers may advance to senior keeper, assistant\r\n      head keeper, head keeper, and assistant curator, but few openings occur, especially for\r\n      the higher-level positions. Animal caretakers in animal shelters are not required to have any specialized training,\r\n      but training programs and workshops are increasingly available through the Humane Society\r\n      of the United States and the National Animal Control Association. Workshop topics include\r\n      cruelty investigations, appropriate methods of euthanasia for shelter animals, and\r\n      techniques for preventing problems with wildlife. With experience and additional training,\r\n      caretakers in animal shelters may become an adoption coordinator, animal control officer,\r\n      emergency rescue driver, assistant shelter manager, or shelter director."
    },
    {
      "tag": "h4",
      "text": "Job Outlook"
    },
    {
      "tag": "p",
      "text": "Employment opportunities for animal caretakers generally are expected to be good. The\r\n      outlook for caretakers in zoos, however, is not favorable; jobseekers will face keen\r\n      competition because of expected slow growth in zoo capacity, low turnover, and the fact\r\n      that the occupation attracts many candidates. Employment is expected to grow faster than the average for\r\n      all occupations through the year 2006. The growth of the pet population, which drives\r\n      employment of animal caretakers in kennels, grooming shops, animal shelters, and\r\n      veterinary clinics and hospitals, is expected to slow. Nevertheless, pets remain popular\r\n      and pet owners—including a large number of baby boomers whose disposable income is\r\n      expected to increase as they age—may increasingly take advantage of grooming\r\n      services, daily and overnight boarding services, and veterinary services, spurring\r\n      employment growth for animal caretakers and veterinary assistants. Demand for animal\r\n      caretakers in animal shelters is expected to remain steady. Communities are increasingly\r\n      recognizing the connection between animal abuse and abuse toward humans, and should\r\n      continue to commit funds to animal shelters, many of which are working hand-in-hand with\r\n      social service agencies and law enforcement teams. Despite growth in demand for animal caretakers, the overwhelming majority of jobs will\r\n      result from the need to replace workers leaving the field. Many animal caretaker jobs that\r\n      require little or no training have work schedules which tend to be flexible; therefore, it\r\n      is ideal for people seeking their first job and for students and others looking for\r\n      temporary or part-time work. Because turnover is quite high, largely due to the hard\r\n      physical labor, the overall availability of jobs should be very good. Much of the work of\r\n      animal caretakers is seasonal, particularly during vacation periods."
    },
    {
      "tag": "h4",
      "text": "Earnings"
    },
    {
      "tag": "p",
      "text": "Animal caretakers who worked full time earned a median weekly salary of $290 in 1996.\r\n      The middle 50 percent earned between $220 and $380. The bottom 10 percent earned less than\r\n      $170; the top 10 percent earned more than $500 a week. According to a salary survey by the\r\n      National Animal Control Association, nonsupervisory animal caretakers working in animal\r\n      care and control agencies earned a yearly average of about $17,100 in 1996."
    },
    {
      "tag": "h4",
      "text": "Related Occupations"
    },
    {
      "tag": "p",
      "text": "Others who work extensively with animals include animal breeders, animal trainers,\r\n      livestock farm workers, ranchers, veterinarians , veterinary\r\n      technicians and technologists, and wildlife biologists and zoologists."
    },
    {
      "tag": "h4",
      "text": "Sources of Additional Information"
    },
    {
      "tag": "p",
      "text": "For more information on jobs in animal caretaking and control, and the animal shelter\r\n      and control personnel training program, write to: The Humane Society of the United States, 2100 L St. NW, Washington, DC 20037-1598. National Animal Control Association, P.O. Box 480851, Kansas City, MO 64148-0851. To obtain a listing of State-licensed grooming schools, send a stamped, self-addressed\r\n      envelope to: National Dog Groomers Association of America, Box 101, Clark, PA 16113. For information on training and certification of kennel staff and owners, contact: American Boarding Kennels Association, 4575 Galley Rd., Suite 400A, Colorado Springs, CO\r\n      80915. Homepage: http://www.abka.com For information on laboratory animal technicians and certification, contact: American Association for Laboratory Animal Science, 70 Timber Creek Dr., Cordova, TN\r\n      38018-4233. FAX (901) 753-0046 E-mail address: info@aalas.org"
    },
    {
      "tag": "h4",
      "text": "Occupational\r\nOutlook Handbook Home Page BLS Home\r\nPage"
    },
    {
      "tag": "p",
      "text": "Kristina Shelley Bureau of Labor Statistics Shelley_T@bls.gov Last modified: January 15, 1998 URL: http://stats/bls.gov/oco/ocos168.htm Cite: Occupational Outlook Handbook , 1998-99, UM-St. Louis Libraries Edition, derived and modified by Raleigh Muns April 14, 1998, from http://stats.bls.gov/ocohome.htm"
    },
    {
      "tag": "p",
      "text": "98-99 Handbook Contents ... UMSL Govt. Docs ... UMSL Libraries ... UMSL Home ..."
    },
    {
      "tag": "p",
      "text": "Contact Maintainers"
    }
  ]
}