{
  "url": "http://www.un.int/usa/03clp0214.htm",
  "file_number": "771",
  "content_hash": "f07061bf936c1c3a02fe818f93627786cc3ebffbc6646698eaa9038f755819cb",
  "total_blocks": 93,
  "retained_blocks": 5,
  "ignored_blocks": 88,
  "blocks": [
    {
      "tag": "div",
      "text": "[if !mso]>\r\n<style>\r\nv\\:*         { behavior: url(#default#VML) }\r\no\\:*         { behavior: url(#default#VML) }\r\n.shape       { behavior: url(#default#VML) }\r\n</style>\r\n<![endif] [if gte mso 9]>\r\n<xml><o:shapedefaults v:ext=\"edit\" spidmax=\"1027\"/>\r\n</xml><![endif]"
    },
    {
      "tag": "h1",
      "text": "February 14, \r\n                2003"
    },
    {
      "tag": "p",
      "text": "U.S. DEPARTMENT OF STATE Office of the Spokesman [if gte vml 1]><v:line id=\"_x0000_s1025\"\r\n style='position:absolute;left:0;text-align:left;top:0;z-index:1' from=\"0,7.2pt\"\r\n to=\"460.8pt,7.2pt\" o:allowincell=\"f\">\r\n <v:stroke startarrowwidth=\"narrow\" startarrowlength=\"short\" endarrowwidth=\"narrow\"\r\n  endarrowlength=\"short\"/>\r\n</v:line><![endif] if !vml endif For \r\n                    Immediate \r\n                    Release                                                                                 \r\n                      February 14, 2003 As Delivered 2003/160 Remarks Secretary of State Colin L. Powell To the United Nations Security Council February 14, 2003 New York, New York (12:20 p.m. EST) SECRETARY POWELL: Thank you \r\n                    very much, Mr. President.  Mr. President, Mr. Secretary \r\n                    General, Distinguished Members of the Council, it's a great \r\n                    pleasure to be here with you again to consider this very \r\n                    important matter.  And I'm very pleased to be here as the \r\n                    Secretary of State of a relatively new country on the face \r\n                    of the earth, but Ithink Ican take some credit sitting \r\n                    here as being a representative of the oldest democracy that \r\n                    is assembled here around this table. I'm proud of that.  Ademocracy that \r\n                    believes in peace, a nation that has tried in the course of \r\n                    its history to show how people can live in peace with one \r\n                    another, but a democracy that has not been afraid to meet \r\n                    its responsibilities on the world stage when it has been \r\n                    challenged; more importantly, when others in the world have \r\n                    been challenged or when the international order has been \r\n                    challenged or when the international institutions of which \r\n                    we are a part have been challenged."
    },
    {
      "tag": "div",
      "text": "That's why we have joined \r\n                        and been active members of institutions such as the \r\n                        United Nations and a number of other institutions that \r\n                        have come together for the purpose of peace and for the \r\n                        purpose of mutual security and for the purpose of \r\n                        letting other nations which pursue a path of \r\n                        destruction, which pursue paths of developing weapons of \r\n                        mass destruction which threaten their neighbors, to let \r\n                        them know that we will stand tall, we will stand \r\n                        together, to meet these kinds of challenges."
    },
    {
      "tag": "p",
      "text": "Iwant to express my appreciation to Dr. Blix and Dr. ElBaradei for their presentation this \r\n                    morning.  They took up a difficult challenge when they went \r\n                    back into Iraq last fall in pursuit of disarmament, as \r\n                    required by Resolution 1441 .  And Ilistened very \r\n                    attentively to all they said this morning and Iam pleased \r\n                    that there have been improvements with respect to process.  \r\n                    I'm pleased that there have been improvements with respect \r\n                    to not having five minders with each inspector, down to \r\n                    something less than five minders with each inspector.  But Ithink they still are being minded, they are still being \r\n                    watched, they are still being bugged.  They still do not \r\n                    have the freedom of access around Iraq that they need to do \r\n                    their job well. Iam pleased that a few people have \r\n                    come forward for interviews, but not all the people who \r\n                    should be coming forward for interviews, and with the \r\n                    freedom to interview them in a manner that their safety can \r\n                    be protected and the safety of their families can be \r\n                    protected, as required by UN Resolution 1441. Iam glad that access has been \r\n                    relatively good.  But that is all process; it is not \r\n                    substance.  Iam pleased to hear that decrees have now been \r\n                    issued that should have been issued years and years ago.  \r\n                    But does anybody really think a decree from Saddam Hussein, \r\n                    directed to whom, is going to fundamentally change the \r\n                    situation?  And it comes out on a morning when we are moving \r\n                    forward down the path laid out by Resolution 1441. These are all process issues.  These \r\n                    are all tricks that are being played on us.  And to say that \r\n                    new commissions are being formed that will go find materials \r\n                    that they claim are not there in the first place, can \r\n                    anybody honestly believe that either one of these two new \r\n                    commissions will actively seek out information that they \r\n                    have been actively trying to deny to the world community, to \r\n                    the inspectors, for the last eleven plus years? Icommend the inspectors.  Ithank them \r\n                    for what they are doing.  But at the same time, Ihave to \r\n                    keep coming back to the point that the inspectors have \r\n                    repeatedly made, and they've made it again here this \r\n                    morning.  They've been making it for the last eleven plus \r\n                    years:  What we need is not more inspections, what we need \r\n                    is not more immediate access; what we need is immediate, \r\n                    active, unconditional, full cooperation on the part of \r\n                    Iraq. What we need is for Iraq to disarm.  \r\n                    Resolution 1441 was not about inspections.  Let me say that \r\n                    again.  Resolution 1441 was not about inspections.  \r\n                    Resolution 1441 was about the disarmament of Iraq.  We \r\n                    worked on that resolution for seven weeks, from the time of \r\n                    President Bush's powerful speech here at the United Nations \r\n                    General Assembly on the 12th of September until the \r\n                    resolution was passed on the 8th of November. We had intense discussions.  All of you \r\n                    are familiar with it.  You participated in these discussions \r\n                    and it was about disarmament.  And the resolution began with \r\n                    the clear statement that Iraq was in material breach of its \r\n                    obligations for the past eleven years and remains to that \r\n                    day, the day the resolution was passed, in material breach. And the resolution said Iraq must now \r\n                    come into compliance.  It must disarm.  The resolution went \r\n                    on to say that we want to see a declaration from Iraq within \r\n                    30 days of all of its activities.  Put it all on the table.  \r\n                    Let's see what you have been doing.  Give us a declaration \r\n                    that we can believe in that is full, complete and accurate.  \r\n                    That's what we said to Iraq on the 8th of November.  And \r\n                    some 29 days later we got 12,000 pages.  Nobody in this \r\n                    Council can say that that was a full, complete or accurate \r\n                    declaration. And now it is several months after that \r\n                    declaration was submitted, and Ihave heard nothing to \r\n                    suggest that they have filled in the gaps that were in that \r\n                    declaration or they have added new evidence that should give \r\n                    us any comfort that we have a full, complete and accurate \r\n                    declaration. You will recall, we put that \r\n                    declaration requirement into the resolution as an early test \r\n                    of Iraq's seriousness.  Are they serious?  Are they going to \r\n                    disarm?  Are they going to comply?  Are they going to \r\n                    cooperate?  And the answer with that declaration was, \"No.  \r\n                    We're going to see what we can get away with.  We can see \r\n                    how much we can slip under your nose,\" and everybody will \r\n                    clap and say, \"Isn't that wonderful?  They provided a \r\n                    declaration that was of not any particular use.\" We then had some level of acceptance of \r\n                    the fact inspectors would be going back in.  Recall that \r\n                    Iraq tried to use this gambit right after the President's \r\n                    speech in September to try to keep Resolution 1441 from ever \r\n                    coming down the pipe. Suddenly, on the following Monday after \r\n                    the President's speech, \"Oh, we'll let inspectors back in.\"  \r\n                    Why?  Because when the President spoke and when Iraq saw \r\n                    that that the international community was now coming \r\n                    together with seriousness and with determination, it knew it \r\n                    better do something.  It didn't do it out of the goodness of \r\n                    its heart or it suddenly discovered that it's been in \r\n                    violation for all those years.  They did it because of \r\n                    pressure.  They did it because this Council stood firm.  \r\n                    They did it because the international community said, \r\n                    Enough.  We will not tolerate Iraq continuing to have \r\n                    weapons of mass destruction to be used against its own \r\n                    people, to be used against its neighbors.\" Or worse, if we find a post-9/11 nexus \r\n                    between Iraq and terrorist organizations that are looking \r\n                    for just such weapons -- and Iwould submit and will provide \r\n                    more evidence that such connections are now emerging and we \r\n                    can establish that they exist -- we cannot wait for one of \r\n                    these terrible weapons to show up in one of our cities and \r\n                    wonder where it came from after it's been detonated by al-Qaida \r\n                    or somebody else.  This is the time to go after this source \r\n                    of this kind of weaponry.  And that's what 1441 was all \r\n                    about. And to this day, we have not seen the \r\n                    level of cooperation that was expected, anticipated, hoped \r\n                    for -- Ihoped for.  No one worked harder than the United \r\n                    States, and Isubmit to you no one worked harder, if Imight \r\n                    humbly say, Idid to try to put forward a resolution that \r\n                    would show the determination of the international community \r\n                    to the leadership in Iraq so that they would now meet their \r\n                    obligations and come clean and comply.  And they did not. Notwithstanding all of the discussion \r\n                    we've heard so far this morning about giving inspections \r\n                    more time, let's have more airplanes flying over, let's have \r\n                    more inspectors added to the inspection process, Dr. Blix \r\n                    noted earlier this week that it's not more inspectors that \r\n                    are needed; what's needed is what both Dr. Blix and Dr. \r\n                    ElBaradei have said what's been needed since 1991:  \r\n                    immediate, active, unconditional compliance and cooperation. I'm pleased that Iraq is now discussing \r\n                    this matter with South Africa, but it isn't brain surgery.  \r\n                    South Africa knows how to do it.  Anybody knows how to do \r\n                    it. If we were getting the kind of \r\n                    cooperation that we expected when 1441 was passed and we \r\n                    hoped for when 1441 was passed, these documents would be \r\n                    flooding out of homes, flooding out of factories.  There \r\n                    would be no question about access.  There would be no \r\n                    question about interviews.  If Iraq was serious in this \r\n                    matter, interviewees would be standing up outside of UNMOVIC and IAEA offices in Baghdad and elsewhere, waiting to be \r\n                    interviewed, because they are determined to prove to the \r\n                    world, to give the world all the evidence needed that these \r\n                    weapons of mass destruction are gone. But the questions, notwithstanding all \r\n                    of the lovely rhetoric, the questions remain, and some of my \r\n                    colleagues have talked about it.  We haven't accounted for \r\n                    the anthrax.  We haven't accounted for the botulinum, the VX, \r\n                    bulk biological agents, growth media, 30,000 chemical and \r\n                    biological munitions.  These are not trivial matters one can \r\n                    just ignore and walk away from and say, well, maybe the \r\n                    inspectors will find them, maybe they won't.  We have not \r\n                    had a complete, accurate declaration. We have seen the reconstitution of \r\n                    casting chambers for missiles.  Why?  Because they are still \r\n                    trying to develop these weapons. We have not seen the kind of \r\n                    cooperation that was anticipated, expected and demanded of \r\n                    this body.  And we must continue to demand it.  We must \r\n                    continue to put pressure on Iraq, put force upon Iraq, to \r\n                    make sure that the threat of force is not removed, because \r\n                    1441 was all about compliance, not inspections.  The \r\n                    inspections were put in as a way, of course, to assist Iraq \r\n                    in coming forward and complying, in order to verify, in \r\n                    order to monitor, as the Chief Inspector noted.  But we've \r\n                    still got an incomplete answer from Iraq.  We are facing a \r\n                    difficult situation. More inspectors?  Sorry, not the \r\n                    answer.  What we need is immediate cooperation. Time?  How much time does it take to \r\n                    say, \"Iunderstand the will of the international community \r\n                    and Iand my regime are laying it all out for you\"?  And not \r\n                    playing guess, not forming commissions, not issuing decrees, \r\n                    not getting laws that should have been passed years ago, \r\n                    suddenly passed on the day when we are meeting. These are not responsible actions on \r\n                    the part of Iraq.  These are continued efforts to deceive, \r\n                    to deny, to divert, to throw us off the trail, to throw us \r\n                    off the path. The resolution anticipated this kind of \r\n                    response from Iraq, and that's why in all of our discussions \r\n                    about that resolution we said they're in material breach; if \r\n                    they come into new material breach with a false declaration \r\n                    or not a willingness to cooperate and comply, as OP 4 says, \r\n                    then the matter has to be referred to the Council for \r\n                    serious consequences. Isubmit to you that notwithstanding \r\n                    the improvements in process that we have noted, and Iwelcome and Ithank the inspectors for their hard work, \r\n                    these improvements in process do not move us away from the \r\n                    central problem that we continue to have; and more \r\n                    inspections and a longer inspection period will not move us \r\n                    away from the central issue, the central problem we are \r\n                    facing; and that central problem is that Iraq has failed to \r\n                    comply with 1441.  The threat of force must remain. Force should always be a last resort.  \r\n                    Ihave preached this for most of my professional life, as a \r\n                    soldier and as a diplomat, but it must be a resort.  We \r\n                    cannot allow this process to be endlessly strung out as Iraq \r\n                    is trying to do right now-- string it out long enough and \r\n                    the world will start looking in other directions, the \r\n                    Security Council will move on, we'll get away with it again. My friends, they cannot be allowed to \r\n                    get away with it again.  We now are in a situation where \r\n                    Iraq's continued noncompliance and failure to cooperate, it \r\n                    seems to me, in the clearest terms, requires this Council to \r\n                    begin to think through the consequences of walking away from \r\n                    this problem with a reality that we have to face this \r\n                    problem; and that, in the very near future, we will have to \r\n                    consider whether or not we've reached that point where this \r\n                    Council, as distasteful as it may be, as reluctant as we may \r\n                    be, as many as -- there are so many of you who would rather \r\n                    not have to face this issue, but it's an issue that must be \r\n                    faced.  And that is whether or not it is time to consider \r\n                    serious consequences of the kind intended by 1441. The reason we must not look away from \r\n                    it is because these are terrible weapons.  We are talking \r\n                    about weapons that will kill not a few people, not a hundred \r\n                    people, not a thousand people, but that could kill tens of \r\n                    thousands of people if these weapons got into the wrong \r\n                    hands. And the security of the region, the \r\n                    hopes for the people of Iraq, themselves, and our security \r\n                    rest upon us meeting our responsibilities.  And, if it comes \r\n                    to it, invoking the serious consequences called for 1441 -- \r\n                    in 1441.  1441 is about disarmament and compliance and not \r\n                    merely a process of inspections that goes on forever without \r\n                    ever resolving the basic problem. Thank you. # # # ###"
    }
  ]
}