{
  "url": "http://www.un.org/ga/president/58/speeches/031020-2.htm",
  "file_number": "773",
  "content_hash": "35bd740813e3d49324631d88382e8bf99fe828c5a805426eace41a239e895b92",
  "total_blocks": 55,
  "retained_blocks": 6,
  "ignored_blocks": 49,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""
    },
    {
      "tag": "p",
      "text": "UNITED \r\n                        NATIONS GENERAL \r\n                        ASSEMBLY INTRODUCTORY \r\n                        STATEMENT BY THE PRESIDENT OF THE FIFTY EIGHT SESSION OF THE UNITED NATIONS GENERAL ASSEMBLY PANEL DISCUSSION ON \"INTERNATIONAL COOPERATION IN TAX MATTERS\" 20 OCTOBER 2003"
    },
    {
      "tag": "div",
      "text": "Printer-Friendly \r\n                              Format"
    },
    {
      "tag": "p",
      "text": "Excellencies, \r\n                      ladies and gentlemen, It \r\n                      is my pleasure to Chair this Panel Discussion on International \r\n                      Cooperation in Tax Matters. International cooperation in \r\n                      tax matters has commanded the attention of the international \r\n                      community for decades now, but requires further focus in \r\n                      the context of financing for development. This Panel discussion \r\n                      is therefore both important and timely, coming as it does \r\n                      on the eve of the High-level dialogue on Financing for Development. \r\n                      Itherefore wish to commend the Financing for Development \r\n                      Office for its cooperation in organising the Panel. The \r\n                      United Nations decision to take up the matter of tax cooperation \r\n                      - for which its predecessor organisation, the League of \r\n                      Nations had a fully constituted Fiscal Committee - coincided \r\n                      with the Organisation for Economic Co-operation and Development's \r\n                      (OECD) publication in 1967 of its draft model tax convention \r\n                      for treaties between developed countries. Through its Ad \r\n                      Hoc Group of Experts on International Co-operation in Tax \r\n                      Matters, and its predecessor Ad-hoc Group of Experts on \r\n                      Tax Treaties between Developed and Developing Countries, \r\n                      the United Nations has continued its active participation \r\n                      in international tax matters. The \r\n                      thrust of the United Nations work in tax co-operation has \r\n                      been in the area of policy advice and capacity building \r\n                      for the negotiation of bilateral tax treaties. It has, in \r\n                      that regard, provided a framework within which member states, \r\n                      both developed and developing, might approach bilateral \r\n                      and other initiatives in this area. Iwish to make specific \r\n                      reference to development and updating of the Manual for \r\n                      the Negotiation of Bilateral Tax Treaties between developed \r\n                      and developing countries, published in 1979, and Model Double \r\n                      Taxation Convention between Developed and Developing Countries, \r\n                      published in 1980, and to the several Interregional Training \r\n                      Workshop on International Taxation which have been convened \r\n                      under the auspices of the United Nations. At \r\n                      the International Conference on Financing for Development, \r\n                      held in Monterrey Mexico, in March 2002, Heads of State \r\n                      and Government underscored that mobilisation of domestic \r\n                      resources is a crucial step, if we are to fulfil internationally \r\n                      agreed development goals, eliminate poverty, improve social \r\n                      conditions and raise the living standards of all our peoples. \r\n                      Taxation is one of the major instruments of domestic resource \r\n                      mobilisation, and its regulation is of interest to all states. We must \r\n                      now seriously consider what is required to progress rationally \r\n                      and systematically in respect of international co-operation \r\n                      in tax matters. It seems logical that a matter affecting \r\n                      countries at large, developed and developing, does not lend \r\n                      itself to solutions devised in limited membership, special \r\n                      interest bodies. If a set of universal standards, principles \r\n                      and norms are to be developed in respect of tax cooperation, \r\n                      which take into account the role of tax matters in mobilising \r\n                      resources for sustainable development, then such principles \r\n                      and standards must be set in a truly universal organisation. \r\n                      There must be an institutional framework through which developed \r\n                      and developing countries can participate actively, and equally, \r\n                      in determining outcomes in this important area. The \r\n                      topics selected for consideration by this Panel Discussion \r\n                      takes into account the broad range of issues impacting on \r\n                      cooperation in tax matters - Globalisation, investment, \r\n                      trade and tax competition; The tax treatment of cross border \r\n                      interest income, capital flight, money laundering and tax \r\n                      evasion; and improved intergovernmental institutional framework \r\n                      for international cooperation in tax matters, focussed on \r\n                      enhancing resource mobilisation for development. Our \r\n                      distinguished panellist can be expected to provide invaluable \r\n                      insight into these issues. May Isay, Panellist, that Ilook forward, with interest, to hearing your perspectives \r\n                      on issues including capital flight, improvement in the institutional \r\n                      framework for international tax cooperation, including the \r\n                      establishment of mechanism within the United Nations, and \r\n                      enhancing resource mobilisation, including the creation \r\n                      of an environment conducive to financial resource mobilisation. Iwould \r\n                      urge our other participants to engage the Panellist in a \r\n                      frank and open exchange of views. Iask you to bear in mind, \r\n                      in that regard, that the presentations, comments and observations \r\n                      are intended to provide crucial and substantive inputs into \r\n                      the deliberations that will take place during the High-level \r\n                      Dialogue. Importantly, we expect the outcome of this Panel \r\n                      Discussion to inform the conclusions and recommendations \r\n                      of the High-level Dialogue. Ido hope that at the end of \r\n                      our deliberations, we would have a clearer understanding \r\n                      of our options, institutional and others that might be exercised \r\n                      to ensure genuine cooperation in tax matters. Ithank \r\n                      you."
    },
    {
      "tag": "div",
      "text": "Printer-Friendly \r\n                            Format"
    },
    {
      "tag": "p",
      "text": "Office \r\n                of the President of the General Assembly United Nations, New York, NY, 10017 tel: (212) 963 2486, fax (212) 963 3301"
    }
  ]
}