{
  "url": "http://www.visalaw.com/news/sfc5262003.htm",
  "file_number": "790",
  "content_hash": "56b86b8e32a711585d331fc4946c2ec1d214ac3f457a0a492190e02beceff68e",
  "total_blocks": 334,
  "retained_blocks": 13,
  "ignored_blocks": 321,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" saved from url=(0089)http://www.sfgate.com/cgi-bin/article.cgi?file=/chronicle/archive/2003/05/25/BU268156.DTL begin ZEDO end ZEDO BEGIN LEFT RAIL AREA Search in: Articles - 30 \r\n                    days - \r\n                    Archive - Photos ----- Classifieds Jobs Rentals Real Estate Vehicles ----- Dining Movies Events Art Music PerfArts ----- Lodging SFGate \r\n                  Home Today's \r\n                  Chronicle Sports Entertainment News & \r\n                  Features Business Opinion Politics Technology Crime Science Weird News Polls Photo Gallery Columnists Lottery Obituaries Personal Shopper Classifieds Jobs Personals Real Estate Rentals Vehicles WebAds Regional Traffic Weather Live Views Maps Bay Area Traveler Wine Country Reno & Tahoe Ski & Snow Outdoors Entertainment Food & Dining Wine Movies Music & Nightlife Events Performance Art Books Comics TV & Radio Search Listings Living Health Home & Garden Gay & Lesbian Horoscope Resources Search & Archives Feedback/Contacts Corrections Newsletters Promotions Site Index Chronicle Services Missed Delivery Vacation Hold Subscribe Contact Advertising Advertise Online Place Print Ad Media \r\n            Kit END LEFT RAIL END LEFT RAIL AREA THE GUTTER END GUTTER BEGIN MAIN SPREAD begin article nested table here divider /divider Visa's use provokes opposition by techies L-1 \r\n                  regarded as threat to workers Carrie Kirby, Chronicle \r\n                  Staff Writer Sunday, May \r\n                  25, 2003 PAPER LOGO if expr=\"('' eq 'pm')\" <A HREF=\"#sections\"><IMG SRC=\"/templates/brands/chronicle/images/chroniclepm.gif\" WIDTH=150 HEIGHT=36 BORDER=0></A> else endif"
    },
    {
      "tag": "p",
      "text": "chart \r\n                  attached An obscure work visa known as the L-1 has become the center \r\n                  of a bitter controversy in the technology industry. Much like the H-1B before it -- an equally obscure visa \r\n                  that rose to prominence when American workers complained they \r\n                  were being displaced by its recipients -- the L-1 is catching \r\n                  the ire of tech workers and the eye of government regulators \r\n                  who disagree on whether the visa is being used legally. In the middle of the spat are Indian firms that undertake \r\n                  tech projects for U.S. companies, including many in the Bay \r\n                  Area, on a contract basis. The L-1 visa was originally intended for multinational \r\n                  companies that need to transfer key employees to U.S. \r\n                  divisions. But in recent years, outsourcing firms such as \r\n                  Wipro Technologies, Infosys Technologies and Tata Consultancy \r\n                  Services have stepped up their use of the L-1 visa to bring \r\n                  programmers and other professionals from India to work at the \r\n                  offices of U.S. clients. In the Bay Area, the firms' clients include \r\n                  Hewlett-Packard, Cisco Systems, Visa International, \r\n                  ChevronTexaco and Sun Microsystems. Some U.S. tech workers, frustrated by growing unemployment, \r\n                  say the L-1, like the H-1B before it, creates unfair \r\n                  competition and eliminates jobs of American workers. In fact, \r\n                  the workers like the L-1 even less than the H-1B because L-1 \r\n                  lacks the abuse-prevention clauses and annual limit that H-1B \r\n                  has. Abill introduced by a Florida congressman last week seeks \r\n                  to ban the visa's use in outsourcing. But the outsourcing companies, multimillion-dollar concerns \r\n                  with thousands of employees in the United States and abroad, \r\n                  say their use of the visa is legal and appropriate. The companies make no secret of their visa use. Wipro and \r\n                  Infosys, both listed on U.S. stock exchanges, disclose the \r\n                  number of L-1 and H-1B visas they get in financial filings. U.S. worker groups, including the AFL-CIO's Department for \r\n                  Professional Employees and the Seattle technology union \r\n                  WashTech, say outsourcers are using L-1 to get around what \r\n                  they call the minimal worker protections attached to H- 1B \r\n                  visas. \"We think it's the secret stealth visa,\" said Marcus \r\n                  Courtney, president of WashTech. L-1s \"seem to be sprouting up all over the Bay Area, and \r\n                  they're totally off the radar screen,\" said Peter Bennett, a \r\n                  former computer programmer who works as a mortgage broker in \r\n                  Danville. Because he runs a Web site protesting the H-1B visa \r\n                  program ( http://www.nomoreh1b.com/ ), \r\n                  Bennett gets 50 to 500 e-mails a day from tech professionals \r\n                  who are out of work or fear losing their jobs. An increasing \r\n                  number of them complain that L-1 workers have shown up in \r\n                  their offices. Restrictions that apply to H-1B, but not L-1, include an \r\n                  annual limit on the number of visas issued and a requirement \r\n                  that the visa applicant have a bachelor's degree or higher. \r\n                  H-1B visa applicants have to pay a $1,000 fee toward training \r\n                  American workers; L-1 applicants don't. Visa law also requires workers with H-1Bs to be paid the \r\n                  prevailing wage in the region where they work, although the \r\n                  Department of Labor does not routinely check up on this. The L-1 visa carries no salary requirements, theoretically \r\n                  allowing a foreign worker to continue drawing the salary he \r\n                  was paid at home while working side-by-side with or replacing \r\n                  Americans earning two or three times as much."
    },
    {
      "tag": "h3",
      "text": "PROGRAMMERS EARN LESS"
    },
    {
      "tag": "p",
      "text": "Outsourcing firms say they pay their L-1 workers wages \r\n                  comparable to what American workers earn. But Tata \r\n                  acknowledges that when it took over a project at Siemens \r\n                  Information and Communication Networks in Lake Mary, Fla., it \r\n                  paid some programmers only $36,000 a year -- below the average \r\n                  local range of $37, 794 to $69,638 for a basic programmer \r\n                  (determined by Department of Labor surveys) and far below the \r\n                  $98,000 that one U.S. programmer there said she was paid. Tata spokesman Tom Conway said taxes, Social Security and \r\n                  other withholding bring the salaries up to the average range. After Tata took over the project, Siemens let a dozen \r\n                  employees go, said spokeswoman Paula Davis. Some of those employees were outraged that they could be \r\n                  replaced by foreigners. It especially stung that they were \r\n                  asked to train Tata's workers before they left, a procedure \r\n                  that Tata calls knowledge transfer. \"This is what they call outsourcing. Icall it insourcing. \r\n                  Import foreign workers, mandate your American workers to train \r\n                  them, then lay off your Americans,\" said Michael Emmons, who \r\n                  left Siemens last fall just before his job there was to end. \r\n                  Emmons had worked as a contract computer programmer for the \r\n                  company for six years, first in San Jose, then in Florida. Davis said Emmons and other workers were not directly \r\n                  replaced by foreign workers. \"We actually outsourced a \r\n                  function. It wasn't replacing this employee with that \r\n                  employee,\" she said. What happened in Florida follows the general pattern of how \r\n                  Indian outsourcing firms use L-1 visas: The Indian firms take \r\n                  over a project, such as software maintenance, at low rates for \r\n                  an American client and send in a team of visa holders to learn \r\n                  the company's procedures. As much of the work as possible is \r\n                  then transferred to the company's headquarters in India, where \r\n                  wages are much lower. But some visa holders continue working \r\n                  at the client's office."
    },
    {
      "tag": "h3",
      "text": "INTERPRETATIONS VARY"
    },
    {
      "tag": "p",
      "text": "Whether this is a legal use of the L-1 visa is a matter of \r\n                  interpretation. An official at the Department of Homeland \r\n                  Security, now responsible for immigration, said this kind of \r\n                  use is fraudulent because the L-1 is designated to let workers \r\n                  move from one office to another within a company -- not from a \r\n                  company to a client. \"If an L-1 comes into the United States to work, they're \r\n                  coming to work for their specific company that petitioned for \r\n                  them, not for another company that they're being contracted \r\n                  out to. That would be a fraudulent use of an L-1 visa, \" said \r\n                  Christopher Bentley, spokesman for the Bureau of Citizenship \r\n                  and Immigration Services, a division of the Department of \r\n                  Homeland Security that replaced Immigration and Naturalization \r\n                  Services. The bureau is assessing the L-1 and other visa \r\n                  programs for fraud, he said. The companies say they would never risk using the visas if \r\n                  officials had not assured them it is legal. Wipro immigration \r\n                  attorney Terry Helbush said she is puzzled by Homeland \r\n                  Security's statement. \"The L-1 visas are all approved by the \r\n                  consulate or by the INS. In our submissions, we're very clear \r\n                  that . . . some of the employees are on site at the client.\" Tata also said it complies with visa law. Infosys declined \r\n                  to comment because it is in a quiet period before a financial \r\n                  transaction. The way the outsourcers see it, they are complying with the \r\n                  law because their employees are ultimately working for them, \r\n                  whether sitting in a cubicle in Silicon Valley or sitting in \r\n                  one in Bangalore. Tata and Wipro both strive to differentiate themselves from \r\n                  what they call body shoppers, firms that provide nothing more \r\n                  than inexpensive workers for clients. Wipro Chief Operating Officer Lakshman Badiga said it is \r\n                  precisely because the company has moved from just bringing in \r\n                  workers to running complex global projects that it has \r\n                  increased its use of L-1 visas. The State Department says the outsourcers are within the \r\n                  law. \"The fact that someone is on the site of (a client) does \r\n                  not make them ineligible for an L-1 as long as . . . the \r\n                  company they actually work for is truly functioning as their \r\n                  employer in terms of how they're paid and who has the right to \r\n                  fire them,\" said Stuart Patt, spokesman for the State \r\n                  Department's Consular Affairs Bureau."
    },
    {
      "tag": "h3",
      "text": "ATTORNEYS CAN'T AGREE"
    },
    {
      "tag": "p",
      "text": "Not even immigration attorneys who specialize in procuring \r\n                  work visas can agree. Memphis immigration lawyer Gregory Siskind said, \"It's \r\n                  largely inappropriate for companies to be using the L-1 to \r\n                  bring in workers that are being contracted out to other \r\n                  companies. Iwould be very surprised if it continues for very \r\n                  much longer without a crackdown.\" If using L-1s for outsourcing is legal now, it won't be \r\n                  under legislation introduced last week by Rep. John Mica, \r\n                  R-Fla. Calling L-1 \"a back door to cheap labor,\" Mica said his \r\n                  bill would ban L-1 visa holders from being transferred to \r\n                  client companies. It's not clear whether the legislation would actually ban \r\n                  Wipro, Tata and others from using the visas just as they have \r\n                  been because the companies say the workers are their employees \r\n                  even when they are doing work for clients. L-1 visas have been used in relative obscurity since 1970. \r\n                  But during the past two years, an increasing number of the \r\n                  visas are going to workers from a single country: India. \r\n                  Thirty-three percent of the 32,416 L-1 visas issued so far in \r\n                  2003 went to Indians, up from 20 percent in 2001. At Wipro and Infosys, L-1 visa use rose considerably during \r\n                  the same time. Wipro, for example, had 624 H-1B employees in \r\n                  2000 but only 289 L-1 workers. Since then, its L-1 count has \r\n                  soared to 1,157, while the number of H-1B employees has \r\n                  increased to 705. The limit on that other contentious tech visa, the H-1B, is \r\n                  scheduled to go from 195,000 to 65,000 in the fall unless \r\n                  Congress intervenes. Worker groups are gearing up to fight \r\n                  industry lobbyists to make sure the limit is lowered. Some say the L-1 visa could make the H-1B limit irrelevant. \"If the H-1B becomes more difficult to get, (companies) \r\n                  will just adapt and go to L-1s,\" said Ron Hira, a volunteer on \r\n                  workforce policy issues at the Institute of Electrical and \r\n                  Electronics Engineers-USA. Hira is also a Columbia University \r\n                  researcher on science and technology policy. E-mail Carrie Kirby at ckirby@sfchronicle.com ."
    },
    {
      "tag": "div",
      "text": "RIGHT HAND GUTTER drop in column Printer-friendly \r\n                  version Email \r\n                  this article to a friend"
    },
    {
      "tag": "p",
      "text": "START OF QUOTEBOX Get Quote: Detailed News Charts SEC Filings Company Profile Historical \r\n                                Quotes Symbol \r\n                                Lookup END OF QUOTEBOX Main \r\n                                Business & Finance Page : Stock \r\n                                quotes, portfolio, funds and more... SFGate \r\n                                Technology : It's a high-tech world - - \r\n                                we just plug you into \r\n                                it..."
    },
    {
      "tag": "div",
      "text": "MORTGAGE UNDERWRITERS BANK OF AMERICA SALES 2,000 ... Signing Bonus! \r\n                                $5,500/wk. TEACHER MATH w/pre Alg., Alg., \r\n                                Geom., Alg. I MANAGEMENT REGIONAL VP SALES/NAT'L \r\n                                ACCTS infoUSA COLLECTIONS EXPERIENCED \r\n                                COLLECTORS R M A SALES CAREER OPPORTUNITY Local \r\n                                sales posit GRANT WRITER w/min. 7 yrs exp. \r\n                                at the Inst ACCOUNTING CONTROLLER Xperex Corp., \r\n                                SSF-based C MEDICAL BILLER Full-time, \r\n                                benefits, for busy SALES High-end SF Jewelry \r\n                                Company Jeanine Payer, \r\n                                Inc HUMAN \r\n                                RESOURCES Salary Range \r\n                                $28.91-$35.16/hour Town of Colma, \r\n                                Calif PROPERTY MANAGER Estab. Property \r\n                                Mgmt Co in S REST Highly experienced SOUS \r\n                                CHEFS & LINE SOCIAL \r\n                                WORK MULTIPLE CAREER \r\n                                OPPORTUNITIES LARKIN ST. \r\n                                YOUTH TEACHER Science/Math 5th-8th gr \r\n                                & Kindergart TEACHER Daycare for \r\n                                infant/toddler. M, W, Th LEGAL SECTY FT 2yrs+ lit exp. \r\n                                Family law e BIOTECH CAREER EXPO PDL COURT Excellent Benefits \r\n                                Part-Time(32hr/wk) Napa Superior \r\n                                Court HOTEL The Stanford Park Hotel, a \r\n                                luxurious NURSING CLINICAL NURSING \r\n                                DIRECTOR Sutter Medical NURSING RN/LVN DEPT OF \r\n                                CORRECTIONS EDUCATION EXECUTIVE DIRECTOR MBA \r\n                                PROGRAM UC BERKELEY DRIVER Class A. 3 yrs min exp. \r\n                                Good DMV. Go HOTEL/RESTAURANT Join Our 5-Star \r\n                                Team! Mandarin Oriental About \r\n                                Top Jobs View All Top Jobs end article nested table here Standard Article Footer Page I - 1 begin buy the paper insert Get 50% off home delivery of the Chronicle for \r\n                  12 weeks! end buy the paper insert 2003 San \r\n            Francisco Chronicle | Feedback BEGIN CHRONICLE SECTIONS PULLDOWN newspaper_nav2 list_sections Chronicle Sections Magazine Living Sports Bay \r\n                    Area Travel Real \r\n                    Estate Insight Business Book \r\n                    Reviews Commentary News Sunday \r\n                    Datebook Movies /list_sections /newspaper_nav2 END CHRONICLE SECTIONS PULLDOWN BEGIN HORIZONTAL NAV ITEMS (BOTTOM) END HORIZONTAL NAV ITEMS (BOTTOM) ad here ad ends here"
    },
    {
      "tag": "pre",
      "text": "Indian workers\r\n   Year      L-1 visas to all nationalities      To Indians      Proportion of \r\nIndians\r\n   2001      59,384                                  11,908            20%\r\n   2002      57,721                                  17,812            31\r\n   2003      32,416                                  10,447            33\r\n   First 6 months\r\n   Source: State Department\r\n   Top nationalities for visa holders FY 2002:\r\n   India  17,812\r\n   Britain 6,711\r\n   Japan  6,122\r\n   Germany 2,916\r\n   Mexico 2,020\r\n   France 1,995\r\n   Total  57,721\r\n   Source: State Department\r\n   L-1 visa use by Indian outsourcers is increasing:\r\n   Wipro         Infosys\r\n   2000   289           218\r\n   2001   510           292\r\n   2002   1,004         445\r\n   2003   1,157       1,760"
    },
    {
      "tag": "div",
      "text": "------END MAIN SPREAD------ /chronicle/archive/2003/05/25/BU268156.DTL"
    }
  ]
}