{
  "url": "http://www.wabaptists.org/voto/voto2004-02-23.htm",
  "file_number": "793",
  "content_hash": "2fd38a90e65a0aca5cdf9db3d4a70b077920bd6b6702c5a822ccdbfb34962088",
  "total_blocks": 43,
  "retained_blocks": 4,
  "ignored_blocks": 39,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\""
    },
    {
      "tag": "p",
      "text": "VOICE OF \r\n    THE TURTLE Online - February 23-29, 2004"
    },
    {
      "tag": "div",
      "text": "Articles, editorial comment and \r\n    stories here do not necessarily reflect the opinion of the AWAB Council or \r\n    members. If you would like to share news, comments, thoughts and concerns \r\n    through VOTO, you are encouraged to do so. Select the link at the bottom of \r\n    this page to email an article. The History of Marriage Within the Church as it Pertains to Gay Marriage By Wally Bryen"
    },
    {
      "tag": "p",
      "text": "The subject of the recognition and blessing of the \r\n    marriages by those in homosexual relationships has been a hotly debated \r\n    topic in recent years. In a time of record deficit spending, the president \r\n    has stated that the government will spend 1.5 billion dollars on the \r\n    defense of marriage to ensure that only heterosexual men and women will be \r\n    allowed to marry. The recent Massachusetts Supreme Court ruling that it is \r\n    unconstitutional to prevent homosexuals from participating in the rights and \r\n    responsibilities of marriage has caused a firestorm of protests by both \r\n    civil and church leaders. It is often said that beginning with Adam and Eve \r\n    God has ordained the institution of marriage as a holy rite. The marriage of \r\n    gays is thus seen as an attack on the sanctity of the institution of \r\n    marriage. Gay marriage has been described as a sacrilege undercutting the \r\n    very definition of marriage that has existed from the dawn of recorded \r\n    history. Looking closer at the Biblical and historical record shows us that ideas of \r\n    marriage have changed considerably over the millennia. Practices once deemed \r\n    perfectly acceptable are now considered to be abhorrent. The New Testament \r\n    can be seen at times to radically change the understanding of marriage \r\n    resulting in a much more empowered position for women in marriage, even as \r\n    at other times it seems to firmly place women under the subjection of men. \r\n    Can it be that marriage is not the monolithic entity it is so often \r\n    purported to be in the rhetoric opposing gay marriage? Perhaps there are \r\n    ways of faithfully looking at both scripture and the values held by the \r\n    church that leave open the possibility of the church affirming and blessing \r\n    gay marriages. Even though the Bible has been used as a source of the idea that marriage is \r\n    a sacred rite ordained by God from the beginning of history, there is \r\n    surprisingly little discussion in the Hebrew or New Testament scriptures \r\n    about what a marriage actually is. Asearch for the words marriage, \r\n    marry or wife in the Bible yield numerous verses. Yet virtually none of \r\n    these discusses exactly what a marriage is. One is hard pressed to find \r\n    verses containing anything resembling the Lord says a marriage happens \r\n    when or marriage is Gods way of or the reason the Lord wants us to be \r\n    married is. There are cases where the emphasis is on making sure the \r\n    Israelites do not marry foreigners such as in Nehemiah 13:27 Shall we then \r\n    listen to you and do all this great evil and act treacherously against our \r\n    God by marrying foreign women?(All scripture references are New Revised \r\n    Standard Version unless otherwise noted.). There are also instances where a \r\n    marriage is seen as a way of forming alliances as in 2 Chronicles 18:1 Now \r\n    Jehoshaphat had great riches and honor; and he made a marriage alliance with \r\n    Ahab. Leviticus 18:18 instructs men that you shall not take a woman as a \r\n    rival to her sister, uncovering her nakedness while her sister is still \r\n    alive. Interestingly, the explicit reference to the prohibition on marrying \r\n    two sisters seems to imply that it would be acceptable to have more than one \r\n    wife as long as they were not related, a practice certainly frowned upon in \r\n    modern times. The majority of cases in scripture seem to simply assume that \r\n    marriage is a preexisting cultural entity and that the reader would \r\n    understand what a marriage is without further explanation. But just what was \r\n    this cultural entity in ancient times? In the vast majority of cases where it is discussed in the Hebrew scriptures \r\n    marriage is presented as a rather one-sided transaction. Daughters are \r\n    usually seen as objects given in marriage by their fathers. Genesis 34:21 \r\n    states let us take their daughters in marriage, and let us give them our \r\n    daughters. In I Kings 11:19 there is even an account of Pharaoh giving the \r\n    sister of his wife as a bride to Hadad. Often the husband is not even the \r\n    party negotiating for the bride, but the father of the husband, as in 2 \r\n    Kings 14:9 give your daughter to my son for a wife. Seldom if ever is the \r\n    wife portrayed as having any decision-making power in the choice of a \r\n    husband, or even any input on the subject. Yamauch supports this view by \r\n    noting that in ancient Mesopotamia marriages were arranged by parentsthe \r\n    consent of the bride was not necessary(Yamauch 1978, 241). There are few if \r\n    any references in the Bible to the minimum age of brides, but an indication \r\n    of likely minimum ages can be seen gleaned in noting that in ancient Egypt \r\n    girls were married between the ages of twelve and fourteen (Yamauch 1978, \r\n    242). Arranged marriages are certainly still prevalent in many cultures \r\n    across the globe. However, in the West particularly in the United States, \r\n    the idea of a woman as the property of her father and being forced to marry \r\n    against her will and become the property of her husband is now usually seen \r\n    as overly oppressive to the freedom of women. Furthermore, an attempt by a \r\n    grown man to marry what modern society calls a girl of twelve years old \r\n    would be seen now as a heinious act of pedophilia. There is usually very little mention of love in the romantic sense as a \r\n    basis for marriage in the Hebrew scriptures. When there is any mention of \r\n    love it is usually a matter of what the potential husband wants, with no \r\n    concern mentioned about the womans wishes. Such is the case in the Genesis \r\n    29 account of Jacob who loved Rachel, yet there is no mention of a \r\n    reciprocal love on the part of Rachel for Jacob. Later in the story, when \r\n    Rachel and her sister Leah are both married to Jacob, the sisters squabbles \r\n    are not over the love of Jacob, but over who will bear him sons and thus \r\n    inherit the wealth of Jacob. The inheritance of this wealth would thus \r\n    enable the son to care for the mother. Additionally, this account of \r\n    multiple wives is neither frowned upon within the story, nor is it the only \r\n    such case in the Bible. There is even an instance where God appears to bless \r\n    the union of a man with his maidservants, as in the story of Abimelech in \r\n    Genesis 20. In this story, after Abimelech returns Sarah to Abraham God \r\n    blesses him by healing his wife and maidservants so that they bear children. \r\n    While it doesnt explicitly state the maidservants bore him children, it \r\n    strongly implies such. Sarah herself gives her own servant Hagar to Abraham \r\n    as a wife to bear him children. Sarah is even described as Abrahams half \r\n    sister. While many modern societies might frown on these practices, they are \r\n    presented within these canonical scriptural stories with a matter-of-fact \r\n    nonchalance as if that is just the way things were done at the time. Men were seemingly seen as the source of life itself in marriage \r\n    relationships, as can be seen in Adams declaration in Genesis 4:1 that Ihave produced a man with the help of the Lord. There is no mention of we \r\n    made a man implying a partnership with Eve, or indeed even the knowledge of \r\n    the basic biological facts of procreation as we know them today. The event \r\n    is portrayed as a creative act between God and Adam, with Eve merely \r\n    providing a place for the child to grow. This focus on procreation had a \r\n    great deal to do with the inheritance of wealth. Wives were expected to bear \r\n    children for their husbands in large part so that the man would have an heir \r\n    to inherit his wealth. While the right of a widow to inherit the property \r\n    of her deceased husband was generally recognized in the cultures of the \r\n    Ancient Near East (Davies 1981, 138), such was not the case in ancient \r\n    Hebrew society. If a Hebrew wife had no male children then the nearest \r\n    kinsmen of the husband would have succeeded to the estate(Davies 1981, \r\n    138-9). This precarious situation of childless widows is likely a source of \r\n    the Bibles emphasis on concern for widows and orphans. One possible \r\n    exception that allowed a woman with no sons to participate in her husbands \r\n    estate was known as the Levirate marriage in which the brothers of the \r\n    deceased had the responsibility of providing the widow with male \r\n    heirs(Davies 1981, 139). The assumption seems to be that the male heirs \r\n    that inherited the husbands estate would then be able to care for their \r\n    mother. Such an arrangement would be almost unthinkable today. The New Testament sometimes seems to reemphasize the Hebrew scriptures \r\n    subordinate status of the wife. In 1 Corinthians 11:3 Paul states that \r\n    Christ is the head of every man, and the husband is the head of his wife. \r\n    Throughout the New Testament Christ is referred to as out Lord and ruler. In \r\n    this context of Christ as our ruler, it would be easy to view these verses \r\n    in I Corinthians as laying out the natural order of humanity: Christ is the \r\n    ruler of men, and husbands are the rulers of wives. Indeed, church \r\n    leadership has often used these scriptures to defend just such a position. \r\n    Yet this passage is sandwiched between discussions of church liturgical and \r\n    eating practices with emphasis on the prevention of becoming a stumbling \r\n    block to new believers. It seems quite a bit out of place to throw in a few \r\n    verses about the rightful place of women in the middle of these chapters. \r\n    Further, Paul is undoubtedly speaking to the prevailing cultural practices \r\n    when he says shortly thereafter in 11:14 does not nature itself teach you \r\n    that if a man wears long hair, it is degrading to him? The readers in \r\n    Corinth would see it as self-evident that a woman should have long hair, and \r\n    a man should have short hair. Yet many cultures do not hold that men should \r\n    have short hair. God even gave Samson a covenant of strength through his \r\n    long hair. It is entirely possible and probable that Pauls assessment of \r\n    the husband as head of the wife reflected not an edit of the way things must \r\n    be, but a reflection of how things were at the time. We are then left with \r\n    the prospect of determining how we apply the overriding principles to our \r\n    culture today. Paul emphasizes the more egalitarian nature of life in Christ when he states \r\n    in Galatians 3:38 that there is no longer Jew or Greek, there is no longer \r\n    slave or free, there is no longer male and female; for you are one in \r\n    Christ. In Ephesians 5:31 Paul instructs each husband to love his wife as \r\n    himself. The modern Western notion of marriage as originating between two \r\n    people who love each other so much that they want to spend their lives \r\n    together can make a reading of Ephesians 5:33 seem to be merely a friendly \r\n    reminder to not fall out of love. This message of love toward wives came at \r\n    a time when wives were seen by the larger society as virtual chattel \r\n    property for the benefit of the husband. This notion of treating a wife with \r\n    a spirit of love instead of ownership can be seen as a very empowering \r\n    egalitarian message of the value and dignity of wives. The verses immediately prior to Ephesians 5:31 can also be seen to be a \r\n    reinterpretation of the passage so often quoted in order to show the divine \r\n    order of marriage as solely between man and woman. Genesis 2:24 reads \r\n    Therefore a man leaves his father and mother and clings to his wife, and \r\n    they become one flesh. He restates it not as a reflection of the natural \r\n    biological order of humanity as created in two genders. Here in Ephesians \r\n    5:29-32 his emphasis is on the unity in Christ: for no one ever hates his \r\n    own body, but he nourishes and tenderly cares for it, just as Christ does \r\n    for the church, because we are members of his body. For this reason a man \r\n    will leave his father and mother and be joined to his wife, and the two will \r\n    become one flesh. This New Testament notion recasts marriage away from a \r\n    transaction of property and domination towards a relationship of mutual \r\n    respect and partnership. Even though the nature of marriage changes somewhat in the New Testament, it \r\n    is still not recorded in the scriptures as something that happens under the \r\n    authority of the church. Even in the Byzantine era marriage could be seen to \r\n    happen through a blessing, or crowning, or a contract (Viscuso 1991, 310). \r\n    This notion of blessing here refers to betrothal (Viscuso 1991, 310). This \r\n    betrothal was not fully a marriage, but the promise that such marriage would \r\n    take place. The betrothal differed from a mere verbal agreement, which would \r\n    have been considered an engagement, in the fact that a betrothal was \r\n    brought about or celebrated through a sacred blessingwhose central \r\n    feature was a prayerthat the betrothal might be confirmed and made \r\n    indissoluble (Viscuso 1991, 312). Eventually the church began to see \r\n    marriage as a sacrament imparting grace. During the Reformation Protestant marriage theory began to take shape: the \r\n    legitimacy and significance of civil authority over the institution was \r\n    recognized; the sacramental status which the Roman Catholic Church accorded \r\n    the institution was removed (Yates 1985, 41). Yates further notes that \r\n    Martin Luther considered marriage an order of creation whose origin \r\n    transcended both church and state (Yates, 1985 41). This thought by Luther \r\n    began the belief still held by most Protestants that marriage is an \r\n    institution ordained by God. During the Reformation, the character of \r\n    marriage began to be viewed as a covenant rather than a contract. This \r\n    covenant relationship thus mirrors the relationship between God and Israel \r\n    to become partners in a relationship marked by trust, fidelity, steadfast \r\n    love, justice, and obedience to the will of God (Yates 1985, 42). Arecent editorial in Christianity Today noted that in modern times the \r\n    increasing privatization of marriage has become almost absolute: neither the \r\n    community nor the paterfamilias (does such exist anymore?) has any say in \r\n    the formation or dissolution of a marriage. What was a community affair for \r\n    over 400 years has devolved into just one more exercise of personal choice \r\n    (Editorial 2000, 40). This same article decries attempts to promote gay \r\n    marriages as a threat by judicial activism and gay-rights activists working \r\n    together to empty marriage of its traditional meaning (Editorial 2000, 40). \r\n    However, these representative arguments against gay marriages fail to \r\n    explain in any substance how allowing gay marriages would in any way change \r\n    the nature or understanding of heterosexual marriages. They fail to explain \r\n    how allowing same-sex couples to become partners in a relationship marked \r\n    by trust, fidelity, steadfast love, justice, and obedience to the will of \r\n    God (Yates 1985, 42) would prevent heterosexuals from access to those same \r\n    rights and responsibilities. Nor does it suggest how gay marriage would \r\n    remove such connotations from the institution of marriage as understood by \r\n    the church. Others have argued that marriage and the family are valuable social \r\n    institutions, especially important for children, but that they need to be \r\n    newly understood in nonpatriarchal and egalitarian waysmarital love \r\n    reflects God's own triune relationality. Marriage is an opportunity to \r\n    experience the reality of the divine. Marriage is an opportunity to \r\n    experience the reality of the divine (Wall 2000, 1120). Afresh \r\n    interpretation of the theology of marriage should thus strive to liberate \r\n    children from the widespread and often unacknowledged suffering caused by \r\n    modernitys culture of divorce (Wall 2000, 1121). The traditional emphasis on procreation within marriage and the belief that \r\n    the sacrament of marital love finds its further expression in parents love \r\n    for the fruits of their sexuality (Wall 2000, 1120) might seem to exclude \r\n    homosexuals from the marriage rites, since homosexual acts can never produce \r\n    offspring. Yet the vast majority of current churches make no outcry of \r\n    damnation against childless couples, even if couples remain childless by \r\n    choice. The church sees married couples that participate in the possibility \r\n    of procreation by adoption or artificial insemination as equally valid \r\n    parents to those who have their own biological children. Childless couples \r\n    are still seen to embody this procreative possibility of their marriage by \r\n    being involved in the support of other peoples children, or even in the \r\n    support of the communities that foster the development of future \r\n    generations. The church has failed to adequately explain how childless \r\n    homosexual couples should not be allowed to marry on the basis of \r\n    infertility, when the same rules do not apply to heterosexuals. Nor do they \r\n    explain how homosexuals who become parents via adoption or other means would \r\n    be incapable of participating in the procreative nature of marriage. It should be noted that even the most steadfast opponents to gay marriage on \r\n    the grounds that marriage is a holy sacrament allow that there is a civil \r\n    component of marriage that is separate from the constraints of church \r\n    doctrine. Many clergy refuse to marry couples unless both parties are \r\n    committed Christians. The Catholic Church refuses to recognize a second \r\n    marriage of someone who has divorced his or her first spouse. Some churches \r\n    refuse to include marriage vows calling for the wife to obey her husband, \r\n    yet other churches consider this vow a fundamental component of the \r\n    ceremony. Yet none of these churches fight to make these restrictions and \r\n    requirements part of the common law of the land. Allowing the state to \r\n    sanction gay marriages would still leave individual churches the freedom to \r\n    refuse to perform gay marriages on the basis of their own beliefs. Many of the proponents of gay marriage in the current political sphere argue \r\n    from the basis of civil rights. They argue that homosexuals should have the \r\n    same right to marriage that heterosexuals do. This may be the case, but \r\n    perhaps this argument is incomplete, and does not fully counter the \r\n    arguments against gay marriage as an attack on the sanctity of marriage. \r\n    Perhaps the church needs to be a prophetic voice that calls for a deeper \r\n    commitment by all people, heterosexual or otherwise, to the spiritual \r\n    aspects of marriage. The church can and should support and nurture marriages \r\n    based on Christian principals of love, trust, honesty, commitment and faith \r\n    in God. The church should be the institution leading society to a more just \r\n    understanding that the promotion of Christ-centered marriages does not have \r\n    to exclude homosexuals from the equation. Indeed, the very existence of \r\n    committed Christian, monogamous, married homosexual couples within the \r\n    community can nurture the next generation of homosexual youth. Married gay \r\n    couples within the church can affirm to young people that it is possible to \r\n    be who and what God made them to be, and still be in deep communion with God \r\n    and with community. It can also provide the next generation with a model for \r\n    moral, Godly homosexual behavior. References Davies, Eryl W. 1981. Inheritance Rights and the Hebrew \r\n    Levirite Marriage. Vetus Testamentum. 31 no 2 (April): 138-144. Viscuso, P 1991. The Formation of Marriage in Late Byzantium. St. Vladimirs \r\n    Theological Quarterly 35 no 4: 309-345. Yamauch, Edwin M. 1978. Cultural Aspects of Marriage in the Ancient World. \r\n    Bibliotheca sacra. 135 (July-Sep): 241-252. Yates, Wilson 1985. The Protestant View of Marriage. Journal of Ecumenical \r\n    Studies. 22 no 1 (Winter): 41-54. Editorial 2000. Just Married? Christianity Today. 44 no 5 (April): 40-1. Wall, John 2000. Review of Marriage After Modernity: Christian Marriage in \r\n    Postmodern Times by Adrian Thatcher. In The Christian Century 117 no 30 \r\n    (November): 1120-1. 2004 By Wally Bryen, Used with Permission Top of Page Last Weeks Issue AWAB News Page AWAB Home Page Email Article or Comment Past Weeks Issues"
    }
  ]
}