{
  "url": "http://www.washingtonpost.com/wp-dyn/articles/A20471-2004Nov3.html",
  "file_number": "797",
  "content_hash": "f39f81609eb41f866b27ffb3a2e6371110014037b66207e457b8abc60b2952a0",
  "total_blocks": 474,
  "retained_blocks": 26,
  "ignored_blocks": 448,
  "blocks": [
    {
      "tag": "div",
      "text": "Hello Change Preferences | Sign Out Sign In | Register Now Print Edition | Subscribe"
    },
    {
      "tag": "div",
      "text": "Politics Business Education Real Estate Nation Technology KidsPost Obituaries World Entertainment Religion Corrections Metro Health Post Magazine Archives Politics Blog Congress Polls Elections House/Senate Votes Federal Page Key Races White House In Depth Columns & Blogs Feedback Cartoons & Videos Outlook Editorials Message Boards Redskins D.C. United Columns/Blogs NBA Nationals Capitals College Football NHL Wizards High Schools Local Colleges NFL Style Movies Travel Fashion & Beauty Horoscopes City Guide Television Books Home & Garden Comics Entertainment News Food & Dining Museums Theater & Dance Crosswords Ad: Click here for Travel Specials & Deals Tues., Jan. 2, All Times ET K Street, 1 NFL Insider, 11 Today's Schedule Life at Work, 11 Post Politics, 11 Weekly Schedule Media Backtalk, 12 Opinion, 1 Transcripts Multimedia: Being A Black Man Day in Photos Photos:   Eye On Entertainment News Video Videos: A Living HIV Quilt Documentary Video Search D.C.-area events and locations. Find movies, restaurants, bars and clubs. Merchandise Pets Death Notices Personals Rentals Legal Notices Find a Job Post a Job News & Advice Employer Login Buy a Car Experts & Advice Dealer Specials Sell a Car Coupons Buy a Home Sell a Home Property Values Find a Rental Rent Your Place Rentals Section"
    },
    {
      "tag": "div",
      "text": "SEARCH: washingtonpost.com Web | Search Archives washingtonpost.com > Politics > Special Reports > Gay Marriage Print This Article E-Mail This Article"
    },
    {
      "tag": "h2",
      "text": "RSS News Feeds"
    },
    {
      "tag": "div",
      "text": "Top News Gay Marriage What is RSS? | All RSS Feeds"
    },
    {
      "tag": "h6",
      "text": "Ballot Issues"
    },
    {
      "tag": "h1",
      "text": "Same-Sex Marriage Measures Succeed"
    },
    {
      "tag": "h2",
      "text": "Bans in Several States Supported  By Wide Margins"
    },
    {
      "tag": "div",
      "text": "By T.R. Reid"
    },
    {
      "tag": "p",
      "text": "Washington Post Staff Writer Wednesday, November 3, 2004; Page A25 Red state or blue, north or south, voters around the country found at least one thing they could agree on yesterday as proposals banning same-sex marriage were  winning in all 11 states where the issue appeared on the ballot. Tallies from Arkansas, Georgia, Kentucky, Michigan, Mississippi, Montana, Ohio, Oklahoma, North Dakota and Utah  showed constitutional amendments restricting marriage to a man and woman would pass by substantial margins.  Asimilar  measure in Oregon enjoyed a solid lead with nearly three-quarters of the votes counted."
    },
    {
      "tag": "div",
      "text": "Same sex couple Taylor West, left, and  Ann Hubard react to early results on Measure 36, Tuesday, Nov. 2, 2004, in Portland, Ore. (Bruce Ely - AP)"
    },
    {
      "tag": "div",
      "text": "___ Gay Marriage Debate ___ ___ Mass. Weddings ___ Video Feature On May 17, 2004, America's first state-sanctioned, same-sex marriages took place in Cambridge, Massachusetts. ___ Latest News ___ • More Stories"
    },
    {
      "tag": "div",
      "text": "Photos: Bush Wins President Bush claims victory after John F. Kerry concedes the 2004 presidential election. • Bush's Speech: Video | Transcript • Kerry's Speech: Video | Transcript • Video: 2004 Election Rewind ___ Election Results ___"
    },
    {
      "tag": "p",
      "text": "Exit Polls by State: Select a State National Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware DC Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Mass. Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hamp. New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming ------------------------- Results by Zip Code: Results by State: Select a State Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware DC Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Mass. Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hamp. New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming ------------------------- • 50 State Election Roundup • Comparison of 2004 and 2000 • Amendments Defining Marriage"
    },
    {
      "tag": "div",
      "text": "___ Electee Profiles ___"
    },
    {
      "tag": "p",
      "text": "• The New House • Freshman Senators • New Governors"
    },
    {
      "tag": "div",
      "text": "U.S. President Updated 2:09 AM ET Precincts:0% Candidate Votes % Bush * (R) 60,693,281 51% Kerry (D) 57,355,978 48% Other 1,107,393 1% Full Results Source : AP"
    },
    {
      "tag": "div",
      "text": "_____ Message Boards _____ • Post Your Comments"
    },
    {
      "tag": "h2",
      "text": "Free E-mail Newsletters"
    },
    {
      "tag": "div",
      "text": "Daily Politics News & Analysis See a Sample | Sign Up Now Federal Insider See a Sample | Sign Up Now Breaking News Alerts See a Sample | Sign Up Now"
    },
    {
      "tag": "p",
      "text": "Gary Bauer, director of the conservative group American Values, said the results on same-sex marriage proposals \"tell us that the American people know exactly where they stand on this question, and it doesn't matter whether it's a Bush state or a Kerry state.\" But social conservatives were on the losing end of the vote in California, where voters agreed to create a $3 billion fund to finance research on embryonic stem cells, circumventing federal limits imposed by President Bush. Voters in three other states were headed toward approving new funds dedicated to health care programs, in each case by imposing hefty tax increases on tobacco. Montanans agreed to raise the tax on a pack of cigarettes by $1; an increase of 64 cents per pack was leading in Colorado, and Oklahoma voters approved a 55-cent tax hike. In a result that could spark anti-immigration proposals in other states, Arizona voters appeared to be backing a measure that would require public officials to turn in illegal immigrants who seek public services, including police or fire calls. Supporters of the proposal said they want to see the idea carried to other states. In Colorado, voters rejected a plan that would have divided the state's nine electoral votes in proportion to the popular vote in presidential elections. Supporters had called the move a step toward eliminating the electoral college nationally; opponents argued that dividing the state's vote would prompt presidential candidates to ignore Colorado altogether. Colorado Republicans, expecting Bush to carry the state, led the opposition to the proposal. Montana voters approved the use of marijuana there for medical reasons, even though Bush had dispatched his drug czar to campaign against the measure. But a measure to further loosen marijuana controls in Oregon was losing, and Alaskans appeared to defeat a proposal that would have decriminalized marijuana possession. Floridians approved a cap on damage awards in medical malpractice lawsuits. Asimilar proposal was leading in Nevada, but the vote on malpractice damage caps was extremely close in Oregon and Wyoming. Florida voters also approved a measure that will allow the legislature to require parental notice before an abortion can be performed on girls  younger than 18. Courts previously voided parental-notice laws, but the ballot measure passed  yesterday changes the state constitution and would allow the legislature to approve the law. Floridians approved a  measure to raise the minimum wage  to $6.15, a dollar above the federal minimum wage. Nevadans were also voting on a minimum-wage increase. Oklahomans agreed to create a state lottery, leaving nine states that do not use this form of gambling to raise revenue. But gambling proposals struck out elsewhere. Californians appeared to reject proposals to allow more slot machines and casinos, Michigan voters tightened requirements to open casinos there, and Nebraskans resoundingly rejected an initiative that would have permitted Las Vegas-style casinos on the plains. Aproposal before California voters to ease the three-strikes law that mandates a lengthy prison term for a third felony conviction was closely contested with about half the voted counted. The election offered more than 160 ballot issues to voters in 34 states yesterday. That was a decline from the 2002 election, when ballots in 40 states listed 202 initiatives and referenda. The decrease reflected, in part, efforts by several state legislatures to make it more difficult for voters to qualify initiative proposals for the ballot."
    },
    {
      "tag": "div",
      "text": "Print This Article E-Mail This Article RSS Feed Permission to Republish © 2004 The Washington Post Company"
    },
    {
      "tag": "h2",
      "text": "Featured Advertiser Links"
    },
    {
      "tag": "p",
      "text": "Refinance Rates As Low As 2.9% - FREE QUOTES! $200,000 Loan for only $896⁄mo. Bad Credit OK. $200,000 Loan for only $667⁄mo. Bad Credit OK. $40,000 Home Equity Loan for only $287⁄mo fixed. Redskins Tickets , Wizards Tickets , BCS Championship Malpractice Lawyer , Birth Defect Lawsuit , Trasylol Promotional Pens , T-shirts , Custom Hats Cool Gadgets, Great Deals, Visit CircuitCity.com 7 Funds at Vanguard to BUY; 10 to SELL--Free! Travel downtown to downtown only on Acela."
    },
    {
      "tag": "div",
      "text": "SEARCH: washingtonpost.com Web NEWS | OPINIONS | SPORTS | ARTS & LIVING Discussions | Photos & Video | City Guide CLASSIFIEDS | JOBS | CARS | REAL ESTATE"
    },
    {
      "tag": "p",
      "text": "washingtonpost.com: Help | Contact Us | About Us | Advertisers | Site Index | Site Map | Make Us Your Homepage | mywashingtonpost.com | Work for Us | Mobile | RSS The Washington Post: Subscribe | Subscriber Services | Advertisers | Electronic Edition | Online Photo Store | The Washington Post Store | About The Post | National Weekly The Washington Post Company: Information and Other Post Co. Websites © Copyright 1996- The Washington Post Company | User Agreement and Privacy Policy | Rights and Permissions"
    }
  ]
}