{
  "url": "http://www.angryharry.com/esMenearnquarterofamillionpoundsmore.htm",
  "file_number": "227",
  "content_hash": "f2ddd94146538e419fb5a860eff779059c4d062d25fc66e799be0aad05236740",
  "total_blocks": 70,
  "retained_blocks": 3,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "p",
      "text": "Angry Harry Blog Page3 Your Emails Male\nStudent's Guide To Feminism Western men die some five years earlier than\nwomen. They suffer more from nearly every medical disease and ailment that there is.\nAnd yet, far more money is spent by governments on women's health than on men's\nhealth. Men are also nowadays educationally disadvantaged significantly compared to\nwomen; with the curriculum, the teaching methods and the resources being\ndesigned to cater far more for women and girls than for men and boys. Men make up 80% of the homeless. There are more of them in\nsocial service care-homes as boys . They are many times more likely to be wrongfully arrested, wrongfully imprisoned, mugged, assaulted or murdered. They are 5 times more likely to lose their\nchildren when families break down, 4 times more likely to lose their homes, 4 times more likely to commit suicide,\n20 times more likely to be killed or injured at work, 20 times more likely to be\nimprisoned, and, probably, more than 100 times more likely to be demeaned, denigrated and ridiculed by the\nmainstream media. Men also pay much more in taxes than women but receive far\nless in benefits from the government. In other words, when compared to women, men are\nsignificantly disadvantaged when it comes to their health, their homes, their\nchildren, their education, their families, the tax burden, the law, the benefit\nsystem, and even when it comes to their\nown personal\nsafety. They are nowadays also being heavily discriminated against in the work\nplace. How is it possible, therefore, that women are being 'oppressed' more than men? In what areas? Where? What a Piece of Sh*t is Man The Trojan Horses Of Feminism Fools\nAnd Feminists Equality Between Men and Women Is Not Achievable Women -\nWeak and Pathetic? Were Women Oppressed in the West? Fathers Groups Miss The Big Picture Some BBC Propaganda Tricks Only Women Are Offered An Alternative To Domestic Violence The\nNSPCC Needs To Be Stopped A Permanent Gender War? Rape Baloney"
    },
    {
      "tag": "p",
      "text": "Men\n        earn quarter of a million pounds more than women during the course of\n        their lifetimes! The article Women Do Not\n        Deserve Equal Pay explains\n        some of the reasons why it is that, statistically speaking, women earn\n        less than men. And it explains why there is nothing sinister about this,\n        for the figures simply demonstrate the consequences of women's biology\n        and the choices that they make. Here we look at the ridiculous,\n        distorted propaganda propounded by the EOC, squeezed out from the very\n        same figures. The EOC is currently trumpeting the\n        fact that men, on average, earn quarter of a million pounds more than\n        women during the course of their lifetimes, and that, therefore, this\n        reveals some terrible injustice being done to women. So, let's look at what this figure\n        really means. Firstly, it means that men pay about\n        90,000 more in taxes than do women. In other words, the average man\n        puts 90,000 more into the pot than does an average women. Your average\n        man is therefore supporting women to the tune of 90,000. Just one\n        average man! Bearing in mind also, that when it\n        comes to benefits, such as health, pensions and income support, a\n        whopping 70% of the budget is actually spent on women's needs, it is\n        absolutely clear that the support, in the UK, given by men to women, is\n        phenomenal, and it shows just how much the men in the UK truly hand over\n        to women via the government coffers. Further, men also hand\n        money over directly to women when they stay at home to look after the\n        kids. And why shouldn't they stay at home to look after the kids if\n        that's what the pair of them want? Why should feminists try to make\n        women go out and earn the same as their partners? So, what do the feminazis at the EOC\n        do with these figures? Well, as usual, they twist their real meanings\n        and turn them into man-hating propaganda. Thus, they are currently\n        squawking loudly about this quarter of a million pounds with a deliberately\n        distorted spin designed to make women feel aggrieved, disadvantaged and\n        hateful towards men. But let me show you something. Imagine that the figures were the\n        other way round. Imagine that women earned quarter of a million pounds\n        more than men during the course of their lifetimes. What would the\n        feminazis at the EOC be saying then? It doesn't take much imagination,\n        does it? Here are the headlines. \"Women are having to do all the\n        work. Women pay more taxes than men. The tax laws are discriminatory\n        because they take more from women.\" And do you know what would happen next? There\n        would be a major government initiative to stop benefits for men, and\n        demand that they take up any work that was on offer. The government would\n        set different tax rates for men and women in order to make sure that men\n        could not benefit from 'sex-discriminatory'\n        tax laws. But the EOC figures show that UK men\n        put hell of a lot more into the pot, and they take hell of a lot less\n        out of it. And it is still the case that while men die seven years\n        earlier than women, they are still expected to work for five more years\n        before receiving their pensions. This is going to change in the future,\n        thanks to Brussels and the European Commission. But do notice that,\n        working for five years longer and receiving seven years less of pension,\n        adds up to a massive twelve years of financial injustice. Atruly\n        blatant, ongoing act of sex discrimination. An enormous act of\n        discrimination. And what has the EOC done about this? Nothing. Nothing at\n        all. People really must take on board the\n        fact that the EOC is a feminist organisation dominated by all the\n        selfish, self-centred slogans of feminism. It is probably the most\n        sex-discriminatory body in the land, despite its cosy name, and it\n        should have been abolished a long time ago. An Equal Opportunities Commission\n        whose sole aim seems to be to diminish and demean constantly one half of\n        the population by distorting the facts, the figures and their\n        implications, cannot be allowed to continue to exist. The EOC costs a fortune, but all it\n        does is stir up anger and resentment within women against the very men\n        who support them - and massively so. Do the feminists at the EOC really\n        want women to have\n        to work for the same number of hours as men, doing the same types of\n        jobs, for the same number of years, for the same pay, putting the same\n        proportion of money into the pot, and getting the same amount out? And if so, who is going to look after\n        the kids? The stupidity of Feminism, and\n        hence of the EOC, is that in its blind, hysterical vindictiveness toward\n        men, it actually hurts all real women as well, particularly the majority\n        of women, who do not want to devote most of their lives and their\n        energies to whatever it is that they might have to do to earn a decent\n        wage. Afew million UK women want to be mothers\n        who stay at home, or just do jobs part time. What is wrong with that? And while so many women continue to\n        CHOOSE to do this, men are BOUND, statistically speaking, to be earning\n        more than women."
    },
    {
      "tag": "p",
      "text": "When women were 'oppressed' ... click a picture"
    }
  ]
}