{
  "url": "http://www.animationschoolreview.com/sketches/2004/09/king-camera-used-toon-boom-animation-software-for-ad-spot.html",
  "file_number": "228",
  "content_hash": "aae492b9e27c485eb0dc85604584cd6ed9aff7ccd09f857960570100746204fa",
  "total_blocks": 42,
  "retained_blocks": 18,
  "ignored_blocks": 24,
  "blocks": [
    {
      "tag": "div",
      "text": "home animation schools computer animation schools graphic design schools multimedia schools video game design schools"
    },
    {
      "tag": "h3",
      "text": "Search for Animation Schools by Location:"
    },
    {
      "tag": "div",
      "text": "ONLINE Animation Schools Arizona Animation Schools California Animation Schools Florida Animation Schools Georgia Animation Schools Illinois Animation Schools Texas Animation Schools All Animation Schools"
    },
    {
      "tag": "h3",
      "text": "Search for Graphic Design Schools by Location:"
    },
    {
      "tag": "div",
      "text": "ONLINE Graphic Design Schools Arizona Graphic Design Schools California Graphic Design Schools Illinois Graphic Design Schools Massachusetts Graphic Design Schools New York Graphic Design Schools Texas Graphic Design Schools All Graphic Design Schools Graphic Design Schools By Location"
    },
    {
      "tag": "h3",
      "text": "Featured School: Visit These Other Sites:"
    },
    {
      "tag": "div",
      "text": "Career School Guide Chef School Review College Degree Review Culinary Arts School Review Graphic Design School Review hq education Learning & Life"
    },
    {
      "tag": "h1",
      "text": "King Camera used Toon Boom Animation Software for Ad Spot"
    },
    {
      "tag": "p",
      "text": "(Montreal, September 9, 2004) - King Camera has just completed, \"A Life\", a stunning 60-second animated commercial, currently airing on United Airlines flights.  It was directed by prominent, Oscar Winning Director of \"Father and Daughter\", Michael Dudok de Wit in HD and Toon Boom's USAnimation software was used to create the animation effects. \"A Life\" is part of a series of animated commercials for United Airlines produced by Acme Filmworks for the agency Fallon/Worldwide of Minneapolis; including \"Light Bulb\" by Joanna Quinn and \"Interview\" by Wendy Tilby and Amanda Forbis. \"The men from King Camera were experienced, professional, perfectionists and they understood the animator's mind. Iwanted to rely on their skills totally and Icould. Wonderful. And on top of that we got on really well.\" Stated Michael Dudok de Wit, Director. With the objective of recapturing the Oscar, BAFTA, Grand Prix & Prix du Public award-winning style of \"Father and Daughter\", Michael Dudok de Wit decided to approach King Camera. System Administrator, Chris King, and creative Senior Digital Artist & Compositor, Tim Barter brought the production together. Michael initially created colour models in Photoshop while King Camera created special purpose built modules to emulate the various Photoshop blending modes used in the models. As with Michael's previous work, textures were required, not only for the backgrounds but also for all the characters, with some scenes requiring the application of over 70 textures at a time. USAnimation's(r) new Opus upgrade, coupled with Michael's inimitable line quality with it's subtle greyscale variations, achieved the desired effects. King Camera's full HD capability, teamed with Toon Boom's USAnimations'(r) Opus resolution independent software, enabled the output of two versions simultaneously; in High Definition (HD) at 24 Frames per second and NTSC formats at 30 Frames per second. Tim Barter confirms: \"In all we had an extensive use of over 1200 textures across the 60 second commercial. So with the additional need to perfectly retain Michael's outstanding line quality and output to both Hi Def and NTSC within an extremely tight deadline, USAnimation(r) once again proved itself to be an ideal tool.\"  Additionally, King Camera's Chris King made use of Houdini from Side Effects to create snowfall for the commercial and composite NTSC field rendered output from\nUSAnimation's(r) Opus. The production was highly complex and work intensive, challenged by a deadline that was moved forward by two weeks and resulted in Michael creating artwork through to the very last days of production. With this in mind, King Camera's Senior Digital Artist and Compositor, Tim Barter, decided to structure the compositing of the production so that most of the important textures and colour models could arrive later without impacting on the deadline.  To this effect, highly complex compositing modules were created that enabled any characters or textures to be plugged into them. Michael's storyboard was then extrapolated to create proxy characters that would later be scanned in as the real thing. In the process, approximately 1200 proxy textures were created and plugged in, to be replaced as and when the correct textures arrived.  This meant that the entire job could be 'composited' long before the actual artwork arrived, with only minor changes to follow. \"The King Camera work ethic is that with proper organisation, communication and pre-visualisation, no production should be stressful or over-run beyond the normal hours in the day!  Wishful thinking perhaps, but for the above reasons, working with Michael was an absolute pleasure. Despite Michael's overwhelming workload, he was incredibly organised, which made it possible for me to work from his storyboards, ensuring that neither of us became dependent on the other for material. Michael also had such pre conceived ideas of what he wanted to achieve, that Iwas able to confidently work in unison with him with the knowledge that our work wouldn't all become redundant as changes were made further down the line. Consequently, despite a curtailed delivery period, a massive workload for Michael and the need to work towards both High Definition and NTSC outputs, the production was wonderfully stress free.\" Tim Barter from King Camera stated. CREDITS: King Camera: Chris King, System Administrator at King Camera; Tim Barter, Senior Digital Artist & Compositor at King Camera, Acme Filmworks: Michael Dudok de Wit, Director for Acme Filmworks, Ron Diamond, Executive Producer for Acme Filmworks, Holly Stone, Producer for Acmefilmworks\nClient: United Airlines.\nFallon/Worldwide of Minneapolis Advertising Agency:\nSenior Producer: Kate Talbott\nProducer: Sofia Akinyele-Trokey and Holly Stone\nExecutive Creative Director:  David Lubars\nGroup Creative Director/Copywriter: Stuart D'Rozario\nCreative Director:  Bruce Bildsten\nArt Director:  Bob Barrie About King Camera....... Based in Soho, London, King Camera is a facility for TV production, commercials and animation. Retooled in the mid nineties, as a digital Ink and Paint bureau for broadcast video and motion picture film, King Camera has gone from strength to strength, working on a plethora of high profile, award-winning productions. Whether it is scanning, digital colouring, compositing or rendering, King Camera has brought its formidable talents to a vast array of productions. King Camera also provides rostrum camera facilities for TV, production alongside title design and graphics. King Camera prides itself on being a high quality, fast, competitively priced facility for getting your productions to the edit on time and on budget. View King Camera's website at www.kingcamera.co.uk About Toon Boom Animation Inc....... Building on a decade of great successes, Toon Boom has entered a new era. Designated as Toon Boom Animation Inc., the company carries several leading animation products, including USAnimation OPUS and Toon Boom Studio. Toon Boom also offers consulting and training services dedicated to increasing animation production efficiency and quality. Concerto, a new solution designed to meet digital and paperless animation production needs, is implemented in prestigious animation studios worldwide. With these great offerings, Toon Boom Animation is well poised, as the world-leading supplier of animation solutions, to continue delivering quality, efficiency and reliability to the animation community - for all animation styles and formats. Toon Boom's client base ranges from major studios creating Hollywood-blockbuster animated films to individual animators creating their first masterpieces. Market-leading studios using Toon Boom's products include Nelvana, Klasky Csupo, Warner Bros., DreamWorks, Paramount Pictures, Universal, Mercury Filmworks, Wild Brain, King Camera, Cromosoma and Lanterna Magica, to name a few. For additional information, visit Toon Boom on the Web at www.toonboom.com . Concerto(tm), OPUS(tm) and USAnimation(r) are trademarks of Toon Boom Animation Inc. Other company and product names may be trademarks of their respective owners. For more information, contact:\nToon Boom Animation Inc.\nKarina Bessoudo\n(514) 278-8666, extension 248\nkarina@toonboom.com Posted on September 11, 2004 at  3:01 PM Previous: Toon Boom Studio for Teaching Next: Paul McCartney DVD Uses Toon Boom Animation Software Back to Archives Have an animation news item or link to suggest?"
    },
    {
      "tag": "h3",
      "text": "The Art Institute Online"
    },
    {
      "tag": "p",
      "text": "Get your animation training online and take classes that fit around your schedule. Learn more about The Art Institute Online's animation and design programs."
    },
    {
      "tag": "h3",
      "text": "Recent Articles:"
    },
    {
      "tag": "div",
      "text": "Hot Jobs in Computer Animation Flash Animation: From Cell Phones to Romance Female Animation Pioneer held Numerous Animation Jobs 2D Animation Versus 3D Animation: A Tutorial Higher Standards of 3D Animation in Video Game Design Animation News Archive"
    },
    {
      "tag": "h3",
      "text": "Feeds:"
    },
    {
      "tag": "div",
      "text": "RSS 1.0 RSS 2.0 Atom Google Yahoo!"
    },
    {
      "tag": "h3",
      "text": "Animation Resources:"
    },
    {
      "tag": "div",
      "text": "Animation Education Links Animation Software: The Basics Animation Styles: An Overview Careers In Animation Choosing an Animation School Computer Animation Training Video Game Animation Skills"
    },
    {
      "tag": "p",
      "text": "Home | Privacy Policy | Site Map | Copyright © 2006, Animation School Review PO Box 460654, San Francisco, CA 94146"
    }
  ]
}