{
  "url": "http://www.annecollins.com/",
  "file_number": "229",
  "content_hash": "4550b46d5f793b8cc0ad6a175fcb49743168df74d0b8ed099d3cb9ba01409bc0",
  "total_blocks": 159,
  "retained_blocks": 18,
  "ignored_blocks": 141,
  "blocks": [
    {
      "tag": "h1",
      "text": "Anne Collins \r\n        Weight Loss Program 2006 One of the EASIEST \r\n        Weight Loss Programs on the Internet Free Diet and Weight Control Information - Healthy Weight Loss Diets With \r\n        Forum Support to Help You Reduce Fat, Exercise & Learn Good Eating \r\n        Habits Read \r\n        What Women and Men Say About This Amazing Weight Loss Program - SEE \r\n        PHOTOS"
    },
    {
      "tag": "div",
      "text": "AT-A-GLANCE Weight \r\n            Loss Program Diet Plans - Low GI Diet - Balanced Diet - 14-Day Booster Diet - Low Carb Diet - Cholesterol Diet - Vegetarian Quick Diet - Meals-in-10-Minutes Diet Meals and Menus Motivation Tips 365-Day Support Weight Loss Forum FAQS Amazing Price Join Online Now UK \r\n            Dieters Click Here Program For REAL People Weight Loss Help Healthy Eating Advice GI Diet Information Diets For Women's Health Diet Advice For Conditions Weight Management Guide Doctors & Obese Patients"
    },
    {
      "tag": "p",
      "text": "Hi, I'm Anne Collins For 24 years I've been helping people to lose weight and change their lives. Now let me help YOU! No Gimmicks - No False Promises Read \r\n        About My Program See Before/After Photos Anne \r\n              Collins Program Now sells in every state in America and Canada, and in 20 countries worldwide MEMBERS \r\n              LOGIN Ifound Anne Collins through my \r\n              doctor! We had a long discussion one day about my weight and how \r\n              many diets Ihad tried etc. He told me to go on-line and find Anne\"s \r\n              site. He was doing research at the time on on-line diets (e-diets \r\n              etc) and said that Anne's was the only one that was always nutritionally \r\n              sound and would make sure the weight would come off and stay off! \r\n              The best advice Iwas ever given!! CW (Post on Anne Collins Forum) BEST Help and \r\n              Support Anne Collins Program has a reputation \r\n              for providing the BEST support of any online weight management program Best Support Forum Best \r\n              Diet For You"
    },
    {
      "tag": "h1",
      "text": "Free Information About Reducing Weight This website covers all diet and fat loss questions, including: how to reduce weight , how to burn body fat, how fast to lose weight, how to solve a weight loss plateau how to reduce fat on thighs, what is overweight and obesity, how to lower cholesterol, how to raise metabolism, how to cut calories, how to control weight during/after pregnancy or during menopause are diet pills safe, what's involved in gastric bypass or other types of bariatric weight loss surgery, diet nutrition and hundreds more. Also included are reviews of diets like Atkins Diet, South Beach and all popular fad diets. See also facts on fat loss supplements, patches, recipes for rapid weight loss, clinics & obesity support groups. For example, see: Healthy Weight Loss Tips Calories in Food Calorie Needs for Women Protein Needs in Diet Ideal Weight for Women"
    },
    {
      "tag": "p",
      "text": "To see how my program can help and \r\n              support you to lose weight, see: Weight \r\n              Loss Program Advice About Weight Healthy Weight Reduce a Fat Belly Causes of Weight Gain How Do We Gain Body Fat? Mid-Life Weight Gain? Weight & Depression Hypothyroidism & Weight Ideal Weight Healthy Cholesterol Levels Does Dieting Work? Best Way to Lose Weight Count Calories or Carbs? How Fast to Lose Weight? Best Weight Loss Goals Easy Ways to Lose Weight Why Does Weight Loss Stop? Lose Your Final 10 Pounds Lose Weight After Pregnancy Weight When Breastfeeding Water & Weight Loss Weight Loss Success Stories Celebrity Diets Best Exercise to Burn Calories Lose Fat by Exercise Health Benefits of Exercise Diet Plan For Men Weight Loss Tips For Teens Advice For Teens Teen Eating Disorders Help For Overweight Kids Dangers of Bariatric \r\n        Surgery Dangers of Gastric \r\n        Bypass Does Bariatric Surgery \r\n        Work? Risks of Liposuction Advice \r\n        About Diet Food Digestion Guide Stone Age Diet Health Problems of Carbs Health Problems of Fats Modern Diet Guide to Healthy Diet Principles of Healthy Eating Diet For Optimum Weight Calorie Counting Good Carbs to Eat Good Protein to Eat Good Fats to Eat Advice About Sugar Guide to Dietary Fiber Best Vitamins Best Minerals Food Portion Size Low-Calorie Snacks Fast Food For Weight Control Fast Food Recipes How to Cook Fast Food Water Needs"
    },
    {
      "tag": "div",
      "text": "Anne ...my doctor called me personally at work to tell me that Iwon't \r\n            have to take cholesterol meds. My LDL was 164. It is now 104! Ireally \r\n            feel like my body is ready to let go of the fat and maybe it won't \r\n            be so hard from now on. Thanks Anne for not letting me give up! Connie (Alabama)"
    },
    {
      "tag": "p",
      "text": "Obesity, Health, Weight WEIGHT AND HEALTH OBESITY INFORMATION OBESITY CHART OBESITY DIET OBESITY MANAGEMENT BODY MASS INDEX CALCULATOR WEIGHT CHART ESTIMATE HEALTHY WEIGHT IDEAL WEIGHT for MEN WAIST CIRCUMFERENCE WAIST-HIP RATIO HOW TO REDUCE CELLULITE BODY FAT PERCENT BODY FAT and HEALTH BODY FAT CALCULATORS WEIGHT LOSS PLATEAU HYPOTHYROIDISM FOOD CRAVINGS RAISE METABOLISM EXERCISE for WEIGHT LOSS EXERCISE EQUIPMENT DIET FITNESS HIGH CHOLESTEROL GUIDE CHOLESTEROL and DIET LOW CHOLESTEROL DIET DIET FOR HIGH CHOLESTEROL DIABETIC DIET INFORMATION DIABETIC DIET QUESTIONS Diet Information DIETING ADVICE WEIGHT LOSS ADVICE REVIEWS OF DIETS DIETS - 3 QUESTIONS HOW TO LOSE WEIGHT WEIGHT LOSS QUESTIONS FAD DIETS HOW TO LOSE WEIGHT FAST HEALTHY DIET FAST WEIGHT LOSS WEIGHT WATCHERS DIET LOW FAT DIET LOW CARB DIETS SOUTH BEACH DIET PLAN SOUTH BEACH RECIPES ZONE DIET DR ATKINS DIET WEIGHT LOSS VEGETARIANS WEIGHT CONTROL ARTICLES SLIMMING DIET DIET ADVICE - STAR SIGNS WEIGHT - PREGNANCY WEIGHT - MENOPAUSE DIET NEWS CABBAGE SOUP DIET CIDER VINEGAR DIET WEIGHT LOSS FOOD PYRAMID WEIGHT LOSS PILLS DIET PILLS EATING DISORDERS BARIATRIC SURGERY GASTRIC BYPASS HEALTHY DIETS ONLINE DIETS Calories, Nutrition DIET NUTRITION DIET and HEALTH EXERCISE & CALORIES BURNED CALORIE NEEDS FOR MEN DIETARY FAT CALORIES and WEIGHT CONTROL BURN CALORIES, LOSE WEIGHT CALORIE SAVINGS DIET FOODS CARBS and DIET DIETARY FIBER PROTEIN IN DIET SODIUM IN DIET BALANCED DIET VEGETARIAN DIET NUTRITION Healthy Eating & Conditions LACTOSE INTOLERANCE GUIDE TO IRRITABLE BOWEL GUIDE TO CANDIDA DIET CELIAC GLUTEN-FREE DIET DIVERTICULITIS AND DIET FIBROMYALGIA DIET GUIDE PMS DIET ADVICE GUIDE TO PCOS WEIGHT DURING PREGNANCY PREGNANCY DIET NUTRITION GUIDE TO MENOPAUSE DIET"
    },
    {
      "tag": "div",
      "text": "Itake 1.25 \r\n            mg Synthyroid daily (for hypothyroidism). Iam here to tell you that \r\n            with Anne's diet information and the support you will receive on this \r\n            forum, weight loss is not only possible, but easily obtainable. Iam happy to report a 31 pound loss in 3 mths. MC (Post on Anne Collins Forum)"
    },
    {
      "tag": "p",
      "text": "7 Reasons to Join 1. There Are No Gimmicks Anne Collins Program has NO Gimmicks! It's a highly successful weight loss program that has already helped thousands of women, men and teenagers to lose weight, including many with serious, \r\n        long term weight problems. See: Weight \r\n        Loss PHOTOS of Members 2. Recommended by Doctors Anne Collins Weight Reduction Program is used by doctors and nursing staff to reduce patient overweight. Here \r\n        is typical recommendation: \" Anne Collins Weight Loss Program is one of the best value programs on the Internet. It offers a wide range \r\n        of healthy food, uses simple, healthy recipes and wonderful support to \r\n        keep you motivated. Unlike some diets this program encourages then supports \r\n        real lifestyle changes that are sustainable. This is not a yo-yo diet. \r\n        It's a way of life. Ihave personally lost weight on the program, and \r\n        as a doctor, Ihave no hesitation in recommending it to anyone who wants \r\n        to improve their weight and health.\" Dr. Tina Ambury FRCGP, GP. Read \r\n        What Doctors Say 3. Very Easy Diet Plans Anne Collins Program has 9 Easy Diets Each is designed for healthy weight reduction, AND to help you learn GREAT \r\n        eating habits, so the weight STAYS OFF. There are no \"special\" \r\n        weight loss foods or supplements. Each diet is a complete eating-plan \r\n        with TONS of choices and lots of food-substitutions for picky eaters. \r\n        See: Diet Programs 4. World Class Support This Program Offers Fantastic Support! When you join the weight loss program, you automatically receive FREE \r\n        membership to Anne's Weight Loss Support \r\n        Forum . Talk to her, keep a weekly weight loss journal, ask other \r\n        members for advice, find a diet-buddy, or simply browse the discussion. \r\n        Or, email Anne for extra support 365-days a year. What Members Say About \r\n        the Forum \"Ihave literally dieted 38 of \r\n          my 48 years and Ihave learned more in the six weeks since Ijoined \r\n          this group than ever before. Oh, Iknew all there was to know about \r\n          calories, fat grams, carbs, etc. Icould write my own book. What Ihave \r\n          learned....actually, what Iam learning is about self-image, positive \r\n          attitude, etc. Iknew all the physical stuff but here Iam learning \r\n          about the mental part of weight loss. Iam finding out that is an essential \r\n          part of any weight loss program.\" GR \"Boy, Ilove this forum. You can't get this kind of treatment anywhere \r\n          else, and believe me Ihave tried WW, Curves, Jenny Craig, everything. \r\n          Nothing beats Anne. Iwant to eventually get to 150 lbs. Iwill be happpy \r\n          if Ijust break the terrible 200 lb mark. Ihaven't seen that in almost \r\n          18 years when Ihad my last child.\" DD \"I've been reading the weight loss forum most of the day, and Imust say, it's a very special and powerful place and Ifeel so welcomed \r\n          and supported already.\" J (NZ) 5. TONS of Motivation!! Anne Collins Program Has REAL Motivation The program includes a huge range of motivation tips to boost weight loss \r\n        and prevent weight gain when LIFE intervenes! With over 23 years experience \r\n        of helping people to lose weight, Anne Collins tips are guaranteed to \r\n        help you achieve your goals. See: Motivation Information 6. Great Exercise Advice Anne Collins Program gives \r\n        you all the facts about how to exercise to lose weight What exercise \r\n        is best? When to exercise? How hard to exercise? How long to exercise \r\n        for? How to develop abs? How to get the best cardio-aerobic or weight-training \r\n        benefits? What is a good fitness program? Exactly how do we burn body \r\n        fat? And lots more. See: Dieting and Fitness \r\n        Information"
    },
    {
      "tag": "h1",
      "text": "7. Unbeatable Price"
    },
    {
      "tag": "p",
      "text": "12 Months Membership to Anne Collins Weight \r\n        Reduction Program includes the following:"
    },
    {
      "tag": "div",
      "text": "9 Complete Diet Plans Membership to Anne's Forum 365-Day Support 600+ Pages of Weight Loss Information \"Brilliant\" Motivation Advice"
    },
    {
      "tag": "p",
      "text": "All This \r\n        For Just US$19.97 for a Full Year !! For details: See Our Unbeatable \r\n        Price Question: Which other weight reduction \r\n        program gives you all this PLUS personal access to one of the Internet's \r\n        top weight management experts for only $1.66 per month ? Click: Weight \r\n        Loss Program At-a-Glance"
    },
    {
      "tag": "div",
      "text": "Anne Iam really impressed with your healthy and comprehensive approach \r\n            to helping people manage their weight! EC Henley Adjunct Professor, University of Georgia Anne Iused shame to motivate myself to reduce weight. That's why Icheck \r\n            out your weight loss motivation tips at least once a day. They are \r\n            not \"shame-based\"! They are great touchstones to make me \r\n            think that Ireally can lose this weight and feel good about myself \r\n            through the whole dieting process... Lynn (Texas) Hi Anne, Just wanted to say - from the bottom of my heart - your diet is awesome... \r\n            Great value, unbelievable support... no other internet diet program \r\n            I've tried comes close... you are so unbelievably REAL! Pat Doctors \r\n            With Obese Patients Click Here Ihave lost \r\n            60 pounds as of today. I`m on thyroid medicine, Iwas on prednisone \r\n            which made me gain weight, but on this diet [cholesterol lowering \r\n            diet] Istarted losing even though Iwas on both medications. I`m \r\n            on the GI diet now. Ilove the food on it. MH (Post on Anne Collins Forum) Hi Anne what REALLY impresses me is your customer service. It is simply amazing \r\n            compared to anything else I've experienced... Ann R (Wisconsin) Anne Joining your weight loss program was the best $20 we ever spent, Ihave lost 50 pounds and my wife has lost 100 pounds! My wife has even \r\n            been asked a couple of times if she has had gastric bypass. We are \r\n            quick to tell them, just order your program, follow it, and exercise. \r\n            Ihave attached before/after pics of my wife. MP (Alabama) Hi Anne Ijust wanted to thank you for your wonderful web site. Irecently \r\n            completed a 10 week diet sponsored by my work place. With the help \r\n            of your low carb diet Iwas able to lose 24 pounds over the 10 week \r\n            period.... Once again, thanks, Ihave never felt so wonderful and \r\n            Ithink your customer service is awesome. Shelley B (NY)"
    },
    {
      "tag": "p",
      "text": "For TONS More Comments see: What Members Say"
    },
    {
      "tag": "div",
      "text": "Hi Anne When Ijoined your weight loss plan nine months ago, Iwas confused \r\n            and bitter about lots of different things in my life - especially \r\n            my weight. Iwon't list all these things - the list would be too long!! \r\n            - but Ican say that with your help Ican now see some light at the \r\n            end of the tunnel. Your motivation advice especially has been a huge \r\n            help. Anyway, Iam now 60 pounds lighter... you don't know what a \r\n            difference you have made to me. Bless You! LO (Illinois)"
    },
    {
      "tag": "p",
      "text": "Very \r\n            Overweight? Relax. I Can Help! I'm So Overweight! GLYCEMIC \r\n              INDEX How Body Uses Food Energy Guide to Carbohydrates How Carbs Are Digested Carbs and Blood Sugar How Carb Affects Insulin Excess Insulin Health \r\n              Risks Low Carbohydrate Eating \r\n              Plans Guide to Glycemic Index More Details About GI How GI is Measured What Determines GI Value Guide to Glycemic Load GI Values of Meals How to Reduce GI of Meals Low GI Foods How Much Carb Do We Need Low Carb or Low GI Diet Health Benefits of GI \r\n              Diets Anne Ihad a cholesterol screening yesterday at Fred Meyer pharmacy. Blood \r\n            is from a finger poke vs. a blood draw but the technician said accuracy \r\n            is within a few points. Since starting the cholesterol lowering diet \r\n            11 weeks ago: total cholesterol, down 39 points to 197; triglicerides, \r\n            down 28; HDL (good cholesterol), about the same; LDL (bad cholesterol), \r\n            down 29 points with a total cholesterol/HDL ratio of 3.8 instead of \r\n            4.14. I'm delighted with my progress... Melissa (Washington) Anne Iwould like to thank you for your motivational tips and diet solutions! \r\n            Iam a 28yr old male hispanic, 5ft 4in. In two months, my weight and \r\n            body stats have changed from 139 pounds, 20 percent body fat, 34 inch \r\n            waist - to 125 pounds, 13 percent body fat, and 31 inch waist. My \r\n            activity level has remained constant: lightly active (1-2 hours at \r\n            the gym a week weightlifting, light running)... JG (Florida) Anne Well, this is my fourth week on the low glycemic diet and Ilost 4 \r\n            pounds this week. That's a total of 12 pounds and Iactually feel \r\n            better. Iwent to the doctor last week and she reduced my insulin \r\n            dosages, which is terrific. .. MV (New York) Anne Just a quick update for you. As of today, July 22, Iam down 90 pounds \r\n            to 180. Ihave not been this lean since Iwas 18 years old. Iwill \r\n            be 51 in 9 days! LB (Florida) Anne Iam about 5 foot 9, and was weighing 182 pounds. My doctor had just \r\n            told me that the constant pain in my low back was arthritis and that \r\n            losing weight would be important to minimizing the effects of the \r\n            disease over time. Last Friday... he was stunned to look at my chart \r\n            and see that Inow weigh 150 pounds! He applauded my effort. Thank \r\n            you for your diet. Sheila (Illinois) Anne, ... my \r\n            doctor told me yesterday that he didn`t think Ineeded my zestril \r\n            [high blood pressure med] He has lowered my thyroid med to about half \r\n            of what it was. And I`ve been off prednisone now since Aug. ALL THANKS \r\n            TO YOU. Thanks so much Anne for all you`ve done.. NJ (Post on Anne Collins Forum)"
    },
    {
      "tag": "h1",
      "text": "Add \r\n        URL - Links - Site \r\n        Map - Join Anne Collins \r\n        Weight Loss Affiliate Program - Terms - Copyright - Contact © 2000-2006 Anne Collins. All rights reserved."
    }
  ]
}