{
  "url": "http://www.bbc.co.uk/radio2/soldonsong/songlibrary/yourviews/one.shtml",
  "file_number": "266",
  "content_hash": "8f28ea7c4d77b03c0233dd66c4c801a0b257ebbe92ea907b929673f8eb2aa4bf",
  "total_blocks": 190,
  "retained_blocks": 14,
  "ignored_blocks": 176,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""
    },
    {
      "tag": "div",
      "text": "Home TV Radio Talk Where I Live A-Z Index"
    },
    {
      "tag": "div",
      "text": "Accessibility help Text only BBC Homepage BBC Music Janice Long Full Schedule 0000 - 0400"
    },
    {
      "tag": "div",
      "text": "Radio 2 Sold on Song What's On Search For A Songwriter Songs A-Z Artists A-Z Songwriting Guides Genres Glossary Newsletter Contact Us Like this page? Send it to a friend!"
    },
    {
      "tag": "div",
      "text": "YOUR VIEWS SONG HOME IN-DEPTH COVER VERSIONS"
    },
    {
      "tag": "div",
      "text": "One U2"
    },
    {
      "tag": "div",
      "text": "Is One U2's finest moment? Or has Bono bettered this? Send us your comments Your Name and Town/City: Your Message: Disclaimer: The BBC will put up as many of your comments as possible but we cannot guarantee that all e-mails will be published. The BBC reserves the right to edit comments that are published."
    },
    {
      "tag": "div",
      "text": "One by U2 is the most stunning and beautiful tunes. It has melancholy lyrics that are powerfully hopefull, mournfull, deeply personal, and touching. The music emotes and soars and lifts your heart up while breaking it."
    },
    {
      "tag": "div",
      "text": "Bill"
    },
    {
      "tag": "p",
      "text": "Jed - East Sussex This is one of the greatest and most moving songs ever written. No matter how often you hear it, it never fails to affect you with its lyrics and deep emotion. Amasterpiece. James hessle One song, one album, one band. What a song, what a band, what an album. Iam hope the repetion of my comment  does not bore you. Ithought it was a intresting way to put the point. Kuldip Sokhi, Enfield, Middlesex \"One\" has to be U2's best song. Ihave been a U2 fan since 1991. Achtung Baby was my first U2 album. Ihave been hooked ever since. Every time you listen to this song, it sends shivers down your spine. Andrew Scully, Edinburgh Ilove this one very much.  It belongs up there with R.E.M's \"Everybody Hurts\" as being a beautiful yet tearjerking classic.  And Johnny Cash's version was superb too. kgallagher manchester one is a briiliant song and inspiring if you love u2 you will love this song NJH Lobo/ London What a beautiful song! So brilliant, calming and excellent. kelly wythenshawe i think that one was an excellent song and still is its like a story of bono trying to say sorry for something a truly excellent track Sean in Dublin Is there a vendetta against Johnny Cash? His version was better than either of these! Great lyric but Bono drowns it out with an overblown performance. Natalie - Rochester This song is just amazing no words can do this one or U2 justice ! Elijah May, Krakow Don't forget Johnny Cash's rendition of \"One\"....worth a listen. Scott, Leicester Haunting yet heartwarming, wound-opening yet healing, somber yet blissful. ian, skipton classic song' great lyrics great driving tune jimbo north wales Bono is the all-time legend. With Or Without You is the no.1 track of all time. alan dickson  fae fife best u2 song man smell the flowers while u still can. Chris Cole/ Haywards Heath Not a die hard U2 fan but this is lyrically one of the best. Jonny Cash cover is spellbinding, heartbreaking almost especially 'did i ask to much, more than a lot, you gave me nothing now it's all Igot.' Kevin Mowatt Johnny Cash did a version of this song that is on the American 3 album, Iemplore you to listen to this version. Its as good as the original. Martin - Lichfield Johnny Cash did the best cover version of this song. Without doubt. His cover makes you understand what it is really about. Vicky, Leigh \"One\" is a great U2 anthem with all the trademark inspirational lyrics and layers of sound you've come to expect from  this band. U2 don't just tell a story, they create a soundscape which in this case is poignant but ultimately uplifting - a celebration of unity in diversity. Eliana Santiago, Chile Iam actually listening this show from down here in Chile and is awesome how this song bring tears to your eyes the very moment it starts, WOW! Andrew R.Laing. Glagow Mr Jonny Cash covered this epic song with his magical acoustic twist, long live the ONE Daniel Haverly Liverpool Whilst Ilove U2, you have forgotten Johnny Cash's version which brought a raw bitter edge to the song. Fabulous"
    },
    {
      "tag": "div",
      "text": "Newsletter sign-up Sign up for updates on new songs, documentaries and live events Like this song? Try these... Live Forever With or Without You"
    },
    {
      "tag": "div",
      "text": "RADIO 2 LATEST Rock The Hall on Radio 2 Find out how to get tickets for a New Year's Eve special."
    },
    {
      "tag": "div",
      "text": "What's on Radio 2 Documentaries Find out more about current and forthcoming documentaries on Radio 2."
    },
    {
      "tag": "div",
      "text": "About the BBC | Help | Terms of Use | Privacy & Cookies Policy"
    }
  ]
}