{
  "url": "http://www.beenleigss.qld.edu.au/webquest/actualquest/actualquest.htm",
  "file_number": "272",
  "content_hash": "001560ee083ca491cdf469ea616f154d953dee200e690a72ddf68e310f3a9f2d",
  "total_blocks": 63,
  "retained_blocks": 24,
  "ignored_blocks": 39,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "h4",
      "text": "WEBQUEST"
    },
    {
      "tag": "div",
      "text": "Note: \r\nLinks updated January 2002.  Author takes no responsibility for redundant\r\nlinks.  Please notify author when links become redundant. Note: \r\nThe SUBJECT SAMPLER and KNOWLEDGE\r\nHUNT should be completed before the WebQuest.  See also Being\r\nAustralian ."
    },
    {
      "tag": "p",
      "text": "Introduction Question Background Individual\r\nTasks Group\r\nSynthesis Real\r\nWorld Feedback Conclusion Evaluation"
    },
    {
      "tag": "h4",
      "text": "Introduction"
    },
    {
      "tag": "blockquote",
      "text": "Who\r\nare Australians? Where have they come from? In which ways do we perceive\r\nour 'Australianess'? Would we all answer these questions in the same way?\r\nFood\r\nfor thought? Chew your way through this WebQuest to satisfy your hunger."
    },
    {
      "tag": "p",
      "text": "The\r\nQuestion"
    },
    {
      "tag": "blockquote",
      "text": "The\r\nmain question you will be asked to find an answer for is:"
    },
    {
      "tag": "blockquote",
      "text": "What\r\ndoes it mean to be Australian?"
    },
    {
      "tag": "h4",
      "text": "Background\r\nInformation"
    },
    {
      "tag": "p",
      "text": "Have\r\nyou already completed the Subject\r\nSampler and the Knowledge Hunt? If not, you should do both of these now to get some background on Oz and\r\nits people. You could also check out some of these links: Virtual\r\nAustralia History\r\nof Immigration to Australia - from Convicts to the Gold Rush 50\r\nYears of Postwar Migration"
    },
    {
      "tag": "h4",
      "text": "Individual\r\nTasks"
    },
    {
      "tag": "blockquote",
      "text": "Now\r\nthat you have some overall background knowledge, it's time to return to\r\nthe main question for this WebQuest. Aquestions this big and important\r\nis better answered when a few people are working on it at one time. Things\r\nwork even better when a group of you decide to look at the question from\r\ndifferent perspectives. This way team members can become experts on different\r\naspects of the question and then come together to poll their learning.\r\nThis is where team work pays off. So are you ready to divide and conquer\r\nthis question?"
    },
    {
      "tag": "p",
      "text": "Form\r\ngroups of six.  Each group member must research and answer the question\r\nfrom a different perspective: Vietnamese ; Aboriginal ; Greek ; Italian ; British/Irish ; New\r\nZealand .   Each group member will consider what it must be\r\nlike to be a representative of our diverse population. Group\r\nmembers must then re-form to answer the essential question:  WHAT\r\nDOES IT MEAN TO BE AUSTRALIAN? Each\r\ngroup will present their thesis in the form of an oral presentation. \r\nAll six members must speak to the question for a period of no less than\r\n3 minutes per speaker.  The team's oral presentation should be structured\r\nwith an introduction, middle and conclusion ( want\r\nhelp? ) (which includes an answer to the question). VIETNAMESE Use\r\nthe links below to find out more about the Vietnamese in Australia. \r\nThink about how a Vietnamese-Australian may experience his/her 'Australianess'\r\ndifferent to you.  Specifically, look for answers to the following\r\nquestions: What is the dominant religious\r\nbelief of the Vietnamese?  In what ways might religious belief affect\r\nthe way the Vietnamese live their life? Vietnamese\r\nReligions and Beliefs What differences exist in\r\nAmerican (similar to Australian) family structure and Vietnamese family\r\nstructure?  What sorts of problems may this present for the Vietnamese\r\nin Australia? The\r\nSo-called Freedom of the Western Culture... Read this personal story. \r\nWhy did this 18 year old leave Vietnam?  Was his life endangered during\r\nhis journey?  In what ways might this experience affect a Vietnamese\r\nrefugee trying to settle in Australia? Personal\r\nStory A Vietnamese, recently arrived\r\nin Australia, many face many challenges.  Belief systems vary and\r\nlanguage barriers exist.  Imagine you are a Vietnamese person with\r\na health problem and you have to visit an Australian doctor.  How\r\ncan 'language differences' and 'belief systems' affect your visit? Vietnamese\r\nCultural/Practical Experience Read Mr\r\nPhi Lu's story .  Why did he leave Vietnam?  What hardships\r\ndid he face on his journey?  How long did it take to finally arrive\r\nin Australia?  Think of 3 descriptive words to sum up how Mr Lu felt\r\nwhen he first sighted Australian soil. Scroll down to the heading\r\n'Settlers Born in Viet Nam and Hong Kong' to find out when\r\nthe Vietnamese arrived .  Read further to find out why there was\r\na sudden influx of immigrants. Read Section 7 'Conclusion'. \r\nIn what ways do second generation Vietnamese (born in Australia) differ\r\nfrom their parents (refugees)?  What role does multiculturalism play\r\nin maintaining Vietnamese culture? Indochinese\r\nRefugee Families in Australia:  A Multicultural Perspective What is the connection between\r\norganisations, such as this, and 'multiculturalism'? Vietnamese\r\nYouth Media What are some of the needs\r\nand challenges faced by Indochinese families? Needs\r\nand Challenges Rumbaut claims that 'In the\r\ncase of the Vietnamese, differing life experiences of the children growing\r\nup in the U.S. and their immigrant parents can turn the generational gap\r\ninto a chasm'  What are some of the conditions which create this 'chasm'? The\r\nBiculturation of the Vietnamese Student Why do Indochinese refugees\r\ncluster in certain areas of Australia? Indochinese\r\nRefugees in Australia What are some of the contrasts\r\nbetween these two sites about Cabramatta?  Why might the information\r\npresented by so different? Four\r\nCorners: Cabramatta Fairfield\r\nCity:  Cabramatta"
    },
    {
      "tag": "h5",
      "text": "BRITISH/IRISH"
    },
    {
      "tag": "p",
      "text": "Use\r\nthe links below to learn more about the British/Irish/Scots in Australia. \r\nSpecifically, look for answers to the following questions: Why\r\ndid the Scot, Thomas Stevenson, come to Australia?  Why did he stay? \r\nDid he forget his homeland? Scots\r\nAround the World 'British-Australianism\r\nis only transplanted British patriotism', according to this author. \r\nDo you agree or disagree? Development\r\nof Australian National Identity and Culture In what\r\nways do Scots in Australia maintain their Scottish culture? The\r\nScottish Australian Heritage Council Glen\r\nInnes and the Australian Celtic Festival What\r\nwas meant by 'the convict taint'? Immigration\r\nHistory Australians\r\nwere apparently not proud of their British ancestry in the 1950s, do you\r\nthink we are now? Immigration\r\nHistory GREEKS"
    },
    {
      "tag": "blockquote",
      "text": "Use\r\nthe links below to learn more about Greeks in Australia.  Specifically,\r\nlook for answers to the following questions: How\r\nmany Greek-Australians were living in Australia in 1991? 1991\r\nGreek-Australian Census Click\r\non 'Melbourne'.  Why is Melbourne referred to as 'the third largest\r\nGreek city worldwide'? The\r\nGreeks in Australia Which\r\nstate registered the highest growth (according to the 1991 Census) of Greek\r\nborn Australians?  Where do the majority of Greek born Australians\r\nlive? Geographic\r\nDistribution Between\r\nwhich two years did the majority of Greeks migrate to Australia? \r\nIn what ways do Greeks maintain their culture? History\r\nof Greek Migration Why\r\ndo many Greek migrants join community organizations? Welfare\r\nand Community Organizations Do you\r\nrecognise any of the Greek sportspeople living in Australia? Greek\r\nAustralians in Sport What\r\nis the purpose of the Antipodes Festival? Festivals,\r\nMusic and the Arts 'Second\r\ngeneration' means that at least one  parent was not born in Australia\r\nand the 'second generation' (children) were born in Australia.  What\r\npercentage of second generation Greeks speak Greek in their home? \r\nWhy do you think so many second generation Greeks speaks Greek in their\r\nhomes? Australian\r\nSocial Trends Are\r\nsecond generation Greeks likely to marry other Greeks?  What is the\r\nlong-term affect of this trend? Australian\r\nSocial Trends Are\r\nsecond generation Greeks maintaining their adherence to the Greek Orthodox\r\ntradition or to Greek traditions generally? Australian\r\nSocial Trends Personal\r\nOpinion of Greek Australians Look\r\ninto this site extensively, bearing in mind that it is 'tongue-in-cheek' Wog\r\nLife"
    },
    {
      "tag": "p",
      "text": "ITALIANS"
    },
    {
      "tag": "blockquote",
      "text": "Use\r\nthe links below to learn more about Italians living in Australia. \r\nSpecifically, look for answers to the following questions: What\r\ndo you understand by ' chain\r\nmigration '?  How would 'chain migration' have affected Italians\r\nliving in Australia today? Give\r\nthree reasons why Italians were welcomed into the Australian population\r\nin the post-war era. White\r\nAlien Immigration Report, 1944 When\r\nItalians first arrived, they caused a national scandal!  Why was this? Frommers What great food would Australians be missing out on if the Italians were\r\nsent home? Italians\r\nhave influenced and contributed to the 'Australian way of life'. \r\nIn what ways has the host country to Italian immigrants (in this case,\r\nAustralia) benefitted? Italians\r\nfor Beginners Read ' Identity\r\nand Community:  What is it to be Australian?' , by Professor Mary\r\nKolantzis.  After reading her paper, briefly summarize how she would\r\nanswer the question 'What Does it Mean to be Australian?\" Read\r\nChapter Eight from Gli\r\nItaliani in Australia .  What are some problems faced by children\r\nof immigrants from rural Italy? In what\r\nways do Italians share their culture with the residents of Ingham? Australian\r\nItalian Festival This\r\nis a site about two successful Aussies of Italian heritage?  How does\r\ntheir heritage influence their lives? Aussie\r\nTalents Steeped in Rugged Ancient Land Read\r\nabout the Italian\r\nHeritage in New South Wales .  What do you know about your heritage? \r\nIs an understanding or our personal 'heritage' important? What\r\nare some of the conflicts faced by this second generation Australian-Italian? Life\r\nas a Second Generation Wog Although\r\nthis article is humorous, it gives a good insight into how 'wogs' see themselves. The\r\nWog Garden Look\r\ninto this site extensively, bearing in mind that it is 'tongue-in-cheek' Wog\r\nLife"
    },
    {
      "tag": "p",
      "text": "ABORIGINES"
    },
    {
      "tag": "blockquote",
      "text": "Use\r\nthe links below to learn more about aborigines in Australia.  \r\nSpecifically, look for answers to the following questions: Read\r\nthis page, focussing on the fundamental differences and misunderstandings\r\nbetween Aborigines and white settlers.  How many of these differences\r\nstill exist? Aborigines: \r\nThe First Australians Look\r\nat the comparisons which are made in this article between aboriginal people\r\nand the rest of the Australian population.   What are your personal\r\nsuggestions for how these statistics can be overturned? Hutchenson\r\nEncyclopaedia According\r\nto the author of this site, Ian Coller, aborigines have suffered a loss\r\nof 'a common humanity'.  Read the whole page.  How do you think\r\nthat affects the way aboriginal people experience their 'Australianess'? Colonialism\r\nand Australian Aborigines White\r\nAustralian medical workers can misinterpret the cultural ways of aboriginal\r\nAustralians.  See how you would fare by answering these multiple choice\r\nquestions.  What does this training manual tell us about cultural\r\ndifferences? Culture\r\nTraining Manual for Medical Workers in Aboriginal Communities In this\r\ninterview with an Australian war veteran, look for incidents of racism\r\nduring his life. Victorians\r\nat War:  Oral History Project Read\r\nwhat 'Kathy' and 'Amos' have to say. The\r\nHealth of Young Aborigines:  Preface How\r\ncan aboriginal health be improved, according to this author? Aboriginal\r\nHealth What\r\nis meant by 'The Dreaming'?  How does this religion differ from christianity? Dreaming How\r\nare schools 'failing Aborigines'? Indigenous\r\nAttrition"
    },
    {
      "tag": "p",
      "text": "NEW\r\nZEALANDERS Use\r\nthe links below to learn more about New Zealanders in Australia.  \r\nSpecifically, look for answers to the following questions: Click\r\non the picture of the man to learn about the haka . \r\nHave you ever seen the All Blacks perform the haka?  Why do you think\r\nthey do this before their matches? Australia\r\nhas a special bond with New Zealand through the ANZAC\r\ntradition . Do New\r\nZealanders share our taste in cuisine (food)? NZ\r\nRecipes Approximately\r\nhow many New Zealanders emigrate to Australia each year? (a previous year's\r\nintake is a good guide) New\r\nZealanders in Australia Do New\r\nZealand  immigrants to Australia have a high participation rate in\r\nAustralia's work force? (near bottom of page) New\r\nZealanders in Australia Are\r\nAustralians' accents the same as New Zealanders' accents? Accent\r\non New Zealand and Australia According\r\nto this commentator, what are some differences between Kiwis and Aussies? The\r\nGlobal Etiquette Guide:  Australia New\r\nZealand has a diverse population, similar to Australia's.  True or\r\nFalse? About NZ\r\nPeople Clearly,\r\nthe All Blacks are a significant part of New Zealand culture.  The\r\nquestion is:  Do you think it is justified for New Zealanders who\r\nlive in Australia to still support the All Blacks?  Why/Why not? All\r\nBlack Supporters' Club, Australia Group\r\nSynthesis Congratulations! \r\nEach person  on your team has become an expert on one group of Australians. Before\r\nyou meet with your group, Check\r\nout this site to help you review and organise your data. Guess\r\nwhat, gathering useful information isn't the same as truly understanding\r\na topic. What experts in the field of learning suggest is that you now\r\nuse that information in a new and challenging way. Then you'll really know\r\nabout this topic. So\r\nwith you team members all gathered together, carefully read and try answering\r\nthe main question for this WebQuest. See where you all agree and where\r\ndifferences arise. Use information,\r\npictures, movies, facts, opinions, etc you explored to convince your teammates\r\nthat your viewpoint is important and should be part of your team's answer\r\nto the question. Your WebQuest team should arrive at  an answer that\r\neveryone on the team can live with. Check\r\nout this site for help with structuring your oral presentation. Before\r\nyour group presents its findings, ask yourselves these questions : Have\r\nwe worked co-operatively as a group? Are\r\nwe prepared to give our answer? (practise!) Is our\r\npresentation structured? Do we\r\nneed to prepare any resources? Are\r\nour speaking roles evenly distributed? Is the\r\ncorrect question being addressed? What\r\nhave we learnt? Your\r\ngroup can now present its thesis in the form of an oral presentation. \r\nAll six members must speak to the question for a period of no less than\r\n3 minutes per speaker.  The team's oral presentation should be structured\r\nwith an introduction, middle and conclusion (which includes an answer to\r\nthe question). Real\r\nWorld Feedback Research\r\ncontacts you can make for each of the six ethnic groups and write a letter\r\nto each of them asking  for an answer to the question:  What\r\nDoes it Mean to be Australian?  Compare/contrast your conclusions\r\nwith the replies. Conclusion"
    },
    {
      "tag": "blockquote",
      "text": "At\r\nthe beginning of this activity, you were asked about the truth. Did you\r\ndiscover it? Was there only one? Did everyone on your team think so? How\r\ndid you answer the main question for this WebQuest?"
    },
    {
      "tag": "p",
      "text": "You\r\ndeserve a lot of praise for all the work you've done. And so does your\r\nbrain. You've sure put that gray stuff to the test. You gained background\r\ninformation, developed expertise in one particular area and got into some\r\npretty expert analysis. At times, you must have felt confused with ideas\r\nspinning every which way. That's normal when you're building new mental\r\nconnections. It's funny, with each link between what you already knew and\r\nthe new learning going on, you broke another different kind of link, remember\r\nthe intellectual slavery we spoke about earlier? You're free! How will\r\nyou use these ideas and strategies as you continue to grow and learn? It's\r\nall up to you. Good luck. Evaluation You\r\nwill be evaluated on the following: organisation\r\nof content clarity\r\nof voice audibility posture preparedness\r\n(confident approach) use\r\nof  visual resources expressive\r\nvoice use\r\nof gestures fluency eye\r\ncontact with audience audience\r\ninvolvement/reaction created\r\nby Cheryl Kerr, Beenleigh\r\nState School , Queensland, Australia email: C.Kerr@uq.net.au"
    }
  ]
}