{
  "url": "http://www.bis.org/publ/cpss68.htm",
  "file_number": "284",
  "content_hash": "21d50e7a0a70da0f0c11da0f5804a149f24b9240fe66c2013e15e085d2053987",
  "total_blocks": 448,
  "retained_blocks": 21,
  "ignored_blocks": 427,
  "blocks": [
    {
      "tag": "div",
      "text": "Print-friendly | E-mail alert | FAQ | Contact Advanced search | Go"
    },
    {
      "tag": "div",
      "text": "xml version=\"1.0\" encoding=\"UTF-8\"?"
    },
    {
      "tag": "div",
      "text": "About BIS Central bank hub Monetary & financial stability Banking services Publications & research Statistics Press & speeches"
    },
    {
      "tag": "div",
      "text": "Overview | Organisation | Activities | History | Legal information | Representative offices | Recruitment | Contact Overview | Central bank websites | Central bankers speeches | Research hub | International Journal of Central Banking Overview | Basel II | Basel Committee on Banking Supervision | Committee on the Global Financial System | Committee on Payment and Settlement Systems | Financial Stability Institute | Other BIS-hosted organisations Bank for central banks | Products and services | Balance sheet Research at BIS | Annual Report | Quarterly Review | BIS Papers | Working Papers | Committee publications | Conference proceedings | Other publications About BIS statistics | Banking | Securities | Derivatives | Effective exchange rates | Foreign exchange | External debt | Payment systems Overview | Press releases | BIS management speeches | Central bankers speeches | BIS photo gallery | Embargo area | News archive"
    },
    {
      "tag": "div",
      "text": "xml version=\"1.0\" encoding=\"UTF-8\"?"
    },
    {
      "tag": "div",
      "text": "Committee on Payment and Settlement Systems"
    },
    {
      "tag": "div",
      "text": "Background information Fact sheet Payment system information Payment statistics Glossary of Terms Index of Spanish translations Contact CPSS"
    },
    {
      "tag": "div",
      "text": "Publications by year Select Latest 2005-2006 2003-2004 2001-2002 1999-2000 1997-1998 1995-1996 1993-1994 1991-1992 1989-1990 Publications by category"
    },
    {
      "tag": "div",
      "text": "Core principles / standards Foreign exchange settlement Large-value payment systems Payment Systems in general Principles, recommendations and oversight Red Book: CPSS countries Red Book: various countries Retail payments and electronic money Securities and derivatives settlement"
    },
    {
      "tag": "div",
      "text": "BIS home Monetary & financial stability Committee on Payment and Settlement Systems"
    },
    {
      "tag": "h3",
      "text": "Central bank oversight of payment and settlement systems"
    },
    {
      "tag": "h4",
      "text": "CPSS Publications No. 68 May 2005"
    },
    {
      "tag": "p",
      "text": "Foreword Central banks have always had a close interest in the safety and efficiency of \npayment and settlement systems. One of the principal functions of central banks \nis to be the guardian of public confidence in money, and this confidence \ndepends crucially on the ability of economic agents to transmit money and \nfinancial instruments smoothly and securely through payment and settlement \nsystems. The systems must therefore be strong and reliable, available even when \nthe markets around them are in crisis and never themselves the source of such \ncrisis. Central banks have traditionally influenced payment and settlement systems \nprimarily by being banks which provide a variety of payment and settlement \nservices to other banks. As such, central banks provide a safe settlement asset \nand in most cases they operate systems which allow for the transfer of that \nsettlement asset. It is only relatively recently that oversight has become a \nfunction that is more formal and systematic - namely a function whereby the \nobjectives of safety and efficiency are promoted by monitoring existing and \nplanned systems, assessing them against these objectives and, where necessary, \ninducing change. However, although recent, this development in the nature of \noversight has been rapid and the function has now come to be generally \nrecognised as a core responsibility of central banks. Given this importance, and the experience that has been gained over the years, \nthe Committee on Payment and Settlement Systems felt it would be useful to set \nout publicly what has been learned about effective oversight. Most of this \nreport is descriptive and analytical, explaining why and how central banks \noversee payment and settlement systems. It looks at the need for oversight, the \nsource of central banks' responsibilities for oversight, the scope of oversight \nand the activities that oversight involves. In addition it looks at cooperative \noversight, where more than one central bank or other authority has \nresponsibilities for a system. However, as well as this description and \nanalysis, the report also includes 10 principles for effective oversight, each \nwith explanatory text. Five of the principles are generally applicable to \noversight arrangements while the other five are specifically for cooperative \noversight arrangements. All the principles are consistent with, and indeed \nlargely drawn from, the previous work on payment and settlement systems \npublished by the Committee and earlier groups reporting to the G10 Governors. The Committee set up a Working Group on Oversight of Payment and Settlement \nSystems to help it produce this report. The CPSS is very grateful to the \nmembers of the working group, its chairman, Martin Andersson of Sveriges \nRiksbank, and the CPSS secretariat at the BIS for their excellent work in \npreparing this report. Tommaso Padoa-Schioppa, Chairman Committee on Payment and Settlement Systems"
    },
    {
      "tag": "div",
      "text": "xml version=\"1.0\" encoding=\"UTF-8\"?"
    },
    {
      "tag": "div",
      "text": "Full text"
    },
    {
      "tag": "div",
      "text": "PDF61pages, 329kb"
    },
    {
      "tag": "div",
      "text": "Other languages"
    },
    {
      "tag": "div",
      "text": "Executive summary (Spanish)"
    },
    {
      "tag": "div",
      "text": "Press release"
    },
    {
      "tag": "div",
      "text": "9 May 2005"
    },
    {
      "tag": "div",
      "text": "Terms and conditions of use | Copyright and permissions | Disclaimers | Privacy policy"
    }
  ]
}