{
  "url": "http://www.boxesandbubbles.co.uk/moving-tips.php",
  "file_number": "291",
  "content_hash": "9f1feef23e29c6e2cc2685a69d91bd7ca0bfafb85f9a240ef680a554051b9b7d",
  "total_blocks": 111,
  "retained_blocks": 18,
  "ignored_blocks": 93,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" Home About \n            Us Products Delivery Contact \n            Us Testaments Discounts Box \n            Clever Moving \n            Tips T&C's View \n            Cart Resellers earn extra cash Removal box quality Site \n            Map"
    },
    {
      "tag": "p",
      "text": "product quick links: - Cardboard Boxes - Cardboard Wardrobes - Cardboard Box Packs - Bubble Wrap - Mattress Covers - Tissue Paper - Parcel Tape - Tape Guns"
    },
    {
      "tag": "h3",
      "text": "Festive Period Deliveries Please   note: Normal \"next day\" delivery service will continue up until Thursday 21st   December. Any orders placed before 4pm on Thursday 21st December will be   delivered on Friday 22nd December. Any orders placed after 4pm on Thursday 21st   December will be delivered on Thursday 4th January 2007.\n        Online   orders can still be placed at any time during the holiday period and will be   delivered on Thursday 4th January. Best   Wishes for Christmas & The New Year."
    },
    {
      "tag": "h1",
      "text": "Moving Home"
    },
    {
      "tag": "h2",
      "text": "By Boxes and Bubbles Ltd"
    },
    {
      "tag": "p",
      "text": "Here a just a few tips on how to maximise the efficiency of using your \n        packaging products for moving home."
    },
    {
      "tag": "div",
      "text": "Try not to leave packing your removal boxes until the day of your home move. Ideally you want to have everything \n          boxed up and ready to go as soon as your estate agent has called you \n          to release your new keys. Packing your cardboard \n          boxes with items that you don’t use on a daily basis can be \n          done as soon as you know that contracts have been exchanged. Get hold of good quality packaging products for moving home, in particular \n          strong, cardboard boxes . Make sure you \n          have a good selection of packing boxes in different sizes for the job \n          in hand. You’ll need medium sized cardboard \n          boxes for small, heavy items such as books (if you fill a large \n          box with heavy items it becomes too heavy to lift). Large \n          removal boxes can be filled with lighter, bulky items. Bed linen \n          and duvets are best packed in Tea Chest storage \n          boxes . The best scenario for very large items such as television \n          sets will be to use their original cardboard \n          box . If you don’t have this, use plenty of bubble \n          wrap and make sure you tie up the cable to avoid tripping over it \n          on the way to the van. Remember to tape the remote control to the inside \n          of the packing box. Don’t just throw your clothes in bin bags. Make life easier \n          for yourself (and the removal people) by simply transferring your clothes \n          to a Cardboard Wardrobe . This will keep \n          your clothes clean and crease free during transit. In addition, the \n          space at the bottom of the cardboard wardrobe is handy for storing shoes \n          and handbags. Protect you mattresses with mattress \n          covers . These thick, heavy duty plastic covers will prevent your \n          mattresses getting scuffed or marked. Because of their size, mattresses \n          are easily damaged. Packaging products such as mattress covers can also \n          be used for covering sofas and chairs particularly if the weather is \n          wet on your removal day. When you get to the other end, they can be \n          either left on the mattress to prevent moisture damage or used as large \n          rubbish bags. Wrap china, crockery and glass in acid \n          free tissue paper . This will help prevent the dulling of your china \n          and once sealed safely in a cardboard box, will protect it during your home removal . What about your best crystal or the bottles of wine in your rack? \n          You’ll need to keep these separated during transit to prevent \n          them banging together and breaking. Special bottle boxes designed specifically with this in mind are available \n          and come with dividers that separate each item. Adding tissue paper or bubble wrap to this \n          equation will give you extra peace of mind during your removal. Make sure you have plenty of tape and \n          a tape gun – absolutely essential for sealing cardboard boxes \n          quickly and securely."
    },
    {
      "tag": "h2",
      "text": "Utilities"
    },
    {
      "tag": "p",
      "text": "Make sure that you have informed each of these utilities companies that \n        you are moving home and if possible, see if you can get the account simply \n        changed over rather than having them cut off. This will save your buyers \n        having to pay re-connection charges once they move in. Gas Cable/Satellite TV Water Broadband Connection Electricity Telephone"
    },
    {
      "tag": "h2",
      "text": "Services"
    },
    {
      "tag": "p",
      "text": "There may be many different companies that service your home and these \n        will also need some action unless for instance you still want all of your \n        post turning up at your old address. Post (Redirection) Cleaner (Cancelled) Milk (Cancelled) Newspapers (Cancelled) Window Cleaner (Cancelled) Other [               ]"
    },
    {
      "tag": "h2",
      "text": "Before you leave (your old home)"
    },
    {
      "tag": "p",
      "text": "Moving house can be just as exciting as it is arduous \n        and leaving a place clean and tidy with information about the services/area \n        will help your buyers settle in a little easier. Below are some tips on \n        how you can make their lives a little easier."
    },
    {
      "tag": "div",
      "text": "Leave your house as you would hope to find it. We're not talking a \n          full spring clean here but wiping ring marks from work surfaces, vacuuming \n          up the dust from behind long-standing items after you've move them and \n          giving the toilet a once-over goes such a long way to making people \n          feel more comfortable with their new environment (remember they will \n          have had a tough day of packing, lifting and travelling behind them \n          already). Remember to empty your bins and write down the times and days of refuse \n          recycling collections so that your buyers know when to leave theirs \n          out. Leave out all the keys that relate to your property. The front door \n          key goes without saying (as the agent will probably hold these) but \n          keys for things such as sheds, greenhouses, outbuildings and more importantly, \n          windows will need to be tagged so that your buyer knows which is which. Make sure that all of your utilities - Gas, Water, Electricity, are \n          switched off (not cut off) and leave operating instructions for things \n          such as the central heating, gas fires and boilers and locations for \n          things such as Stop Cocks for Gas and Water and Mains Switches for Electricity. Also point out locations of utility meters and take meter readings, \n          leaving copies for your new buyers so that there can be no dispute for \n          any utility settlement. Do a quick check against your fixtures and fittings list (which your \n          solicitor will have forwarded to you) to make sure you have left all \n          that you said you would leave. You may wish to leave a forwarding address if you have chosen not \n          to have your mail forwarded directly by the Post Office."
    },
    {
      "tag": "h2",
      "text": "When you arrive (at your new home)"
    },
    {
      "tag": "p",
      "text": "No doubt you will be fairly weary yourself once you arrive at your new \n        home. No one says that you have to do everything the same day, after all \n        you will probably be spending a fair amount of time getting the place \n        just the way you want it. So, these pointers may help you move comfortably \n        into your new home."
    },
    {
      "tag": "div",
      "text": "Always, always put the beds up first because the last thing you'll \n          want to be doing on the day of moving is put up your bed at midnight \n          when you are already tired. Switch on all of your utilities (if your sellers are using these tips, \n          they should all be off) and pay special attention to the hot water/boiler Familiarise yourself with the keys to your property and ALWAYS KEEP \n          ONE ON YOU to avoid getting locked out (believe us, this does happen). \n          Better still, arrange for a lock smith to change all of the locks at \n          your property to give yourself added security. Keep pets inside if possible. Cats especially need to get used to \n          their surroundings before they feel comfortable enough to venture outside. Find your utility meters and take readings. Send these off to the \n          relevant company IMMEDIATELY so that you can start your new account \n          and verify the readings that your sellers have potentially already given \n          them."
    },
    {
      "tag": "p",
      "text": "We can't guarantee a smooth ride every step of the way but \n        follow these tips and they will go a long way to helping you avoid a lot \n        of the hassle that moving can create. Happy moving Boxes and Bubbles Ltd. Home | About \n        Us | Products | Delivery | Contact Us | Customer Testaments Discounts | Box Clever | Moving Tips | T&C's | View \n        Cart | Resellers | Removal \n        Box Quality | Sitemap"
    }
  ]
}