{
  "url": "http://www.brudirect.com/DailyInfo/News/Archive/Jan05/060105/nite02.htm",
  "file_number": "299",
  "content_hash": "b78896e0b11d4e1b0f353a3935e4575660848b5cf006e16e1df38c92ebf5d249",
  "total_blocks": 95,
  "retained_blocks": 5,
  "ignored_blocks": 90,
  "blocks": [
    {
      "tag": "p",
      "text": "BruneiDirect.Com"
    },
    {
      "tag": "div",
      "text": "."
    },
    {
      "tag": "p",
      "text": "His Majesty Gives Lots To Landless \n          And Keys To Homeless Bandar Seri \n          Begawan His Majesty Sultan Haji Hassanal Bolkiah, the Sultan \n          of Brunei, yesterday presented free land lots and house keys to 299 \n          recipients. The land lots recipients are the \n          successful applicants under the Kampong Lambak Kanan and Kampong Rimba \n          National Housing Scheme. The recipients of the house keys are \n          for the Kampong Rimba National Housing Scheme. Recipients were also those who gained \n          semi detached houses under the Kampong Rimba Landless Scheme for the \n          Indigenous People and houses developed by the developers under the \n          Kampong Rimba Landless Scheme for the Indigenous People at Kampong \n          Tungku (Katok 'A') and Kampong Madang in the Brunei Muara District. Upon arrival at the Dato Othman \n          Primary School, His Majesty the Sultan of Brunei was greeted by the \n          Minister of Development, Pehin Dato Doctor Awang Haji Ahmad, the \n          Deputy Minister of Home Affairs, Pehin Dato Awang Haji Adnan and the \n          Brunei Muara District Officer, Dato Awang Haji Adnan. The function began with a recitation \n          of the surah Al-Fatihah led by Syari'e Subordinate court judge of the \n          Brunei Muara district, Pengiran Haji Mohammad Tasim bin Pengiran Haji \n          Hassan. The Brunei Muara District Officer, in \n          his welcoming address, called upon the recipients of the land lots and \n          house keys to be grateful and to give their undivided loyalty to His \n          Majesty as well as to continue support the monarch's wise leadership. His Majesty then presented land lots \n          under the Kampong Lambak Kanan National Housing Scheme to 57 people, \n          and to another 231 people who received Land lots and house keys under \n          the Kampong Rimba, Gadong National Housing Scheme. Three people received keys to the \n          semi-detached houses under the Kampong Rimba Landless Scheme for \n          Indigenous people and eight people received their house keys for \n          developers' houses under the Kampong Rimba Landless Scheme for \n          Indigenous people at Kampong Tungku (Katok 'A') and Kampong Madang. According to statistics of the \n          Housing Development Department 7,448 and land lots nationwide under \n          the national housing scheme had been handed over to the applicants. \n          The department also stated that there are more than 41,000 people \n          nationwide have applied for the housing scheme since 1980 until last \n          and from that total, 29, 382 applicants were from the Brunei Muara \n          District. After presenting the land lots and \n          house keys, His Majesty later to visited several government and \n          private institutions as well as homrs of some of the recipients. His Majesty first visited the Dato \n          Othman Primary School. Being Located at the area of the Landless \n          scheme for Indigenous people, more than 600 hundred pupils from the \n          housing area and several other kampongs nearby are currently studying \n          at the school. His Majesty planted a mango tree at \n          the school ground to mark the event. His Majesty's presence yesterday made \n          teachers and pupils feel proud. Then His Majesty visited the Skim \n          Tanah Kurnia Rakyat jati Lambak Kiri Mosque. Started to be used in \n          2003 with a construction cost nearly two million dollars. The mosque could accommodate around \n          1,200 worshippers from the housing area and nearby kampongs. The \n          mosque is headed by a graduate officer (seorang pegawai berijazah) and \n          two imams. The mosque is also active in numerous religious and welfare \n          activities in upholding His Majesty's Titah to glorify mosque. From the mosque, His Majesty proceed \n          to the residence of the Kampong Ketua of the Kampong Lambak Kiri \n          Landless Indigenous Citizens Housing Scheme, Awang Haji Hamdani bin \n          Omar. He was appointed as a kampong ketua in May 1995 for more than \n          six thousand population of the housing scheme, nearby housing areas (kawasan \n          perumahan sekitarnya), Jalan Pasir Berakas and Kampong Lambak Kiri \n          with nearly 700 houses. His Majesty's stop over to the \n          residence of the kampong ketuas in His Majesty's series of visit to \n          mukim and kampong are a great opportunities for kampong residents as \n          they get to interact personally with His Majesty and at the same time \n          to express their needs and attention from His Majesty's goverment. From there, His majesty continue to \n          get a closer look at the companies operated at the Lambak Kanan \n          Industrial Area. First visited by His Majesty was the Kim Lee Hong \n          Motors Sendirian Berhad. The company is a showroom of imported car and \n          a workshop started their business in july 1997. It covers the area of \n          0.4306 acres. There are 12 employees including 7 locals working at the \n          company. The total sales for 2003 was close to \n          B$715,000. His Majesty's also consented to visit \n          the Asia Printers, a locally owned printing company which has been in \n          business for over 30 years at the forefront of the print graphics \n          industry. For numerous years the company had operated in Beribi before \n          moving to the Industrial estate in 2003 to accommodate a growing \n          business. His Majesty also visited S & L \n          Trading Sendirian Berhad, a company that provides repair service and \n          selling of imported tyres. There are 15 staffs employed here with six \n          locals. Operating in November 1999, the company obtained the total \n          sales of more than one million dollars for the year 2003. His Majesty's next stop was at the CE \n          Industrial Sendirian Berhad, a' company that run the production of \n          electrical switch boards depending on the demands of the clients \n          including a majority of the government projects. The company which is \n          just operated last year has a total employees of 16 people, six of \n          whom are locals. The residence of Ketua Kampong Lambak \n          Kiri, Awang Haji Bujang bin Ahim was also visited by His Majesty. He \n          was appointed as Ketua Kampong in July last year. Kampong Lambak Kiri comprises Kampong \n          Lambak Kiri 'A' and Kampong Terunjing. The kampongs have the \n          population of 4 thousand 2 hundred and 44 residents with 4 hundred \n          houses. The agricultural department also came \n          under His Majesty's scrutiny. Here, His Majesty was greeted by the \n          Minister of Communication who is also the Acting Minister of Industry \n          and Primary Resources, Pehin Dato Awang Haji Zakaria. The three-block complex includes the \n          veterinary health and Quarantine Unit (unit kesihatan ternakan dan \n          kurantina) that has the mission to maximise the business of livestock \n          and to encourage commercial livestock industrial growth to be \n          competetive and proactive. The unit also provide veterinary \n          clinic for pet treatment and 90 percents of them are cats. The clinic \n          treat an average of a hundred to one hundred 50 animals daily. The Agrochemical Technology Unit \n          responsible in identifying level of chemicals in plants. The unit is \n          responsible in monitoring and analysing agricultural chemical toxic \n          waste in vegetables and fruits imported and produced in this country \n          are safe for consumption. Plant Quarantine Unit has the role to \n          ensure that all plants produce imported to this country are free from \n          exotic diseases and agricultural pests that might effected the Plant \n          Industrial Development in this country. The unit functioned as issuing \n          documents related to import and export such as Import Permit and \n          Phytosanitary Certificate and also taking samples of vegetables and \n          fruits as test of excess toxic waste. His Majesty's next stop was to the \n          Phase Five of the Kampong Rimba Housing Scheme Project Site (tapak \n          projek fasa lima, rancangan perumahan negara kampong rimba, \n          gadong).The project provides 1 thousand and 48 land lots where 80 \n          percents are for housing. One land lot covers an area of 0.167 acres. \n          Since 1986 a total of 4 thousands , 5 hundreds and 11 houses and lands \n          under the national housing scheme in the Brunei Muara District had \n          been occupied. House key recipients of Kampong Rimba \n          National Housing Scheme also get the opportunity to mingle with His \n          Majesty. The Scheme is aimed at creating a cohesive and harmonious \n          society in line with the objective of balanced national development. This is consistent with the housing's \n          policy and objective of creating a high standard of living for the \n          people in a well-planned and harmonious environment, besides giving \n          the opportunities for them to own land and houses. His Majesty also visited houses \n          constructed by developers under the Landless Scheme for the Indigenous \n          People in Kampong Rimba, Kampong Tungku (Katok A) and Kampong Madang. \n          Besides government and national housing schemes, private sector also \n          plays an active role in the provision of housing in the country. Besides houses constructed by \n          developers, houses built under the, Brunei Shell Petroleum housing \n          loan scheme for its personnel and the special housing scheme by the \n          Sultan Haji Hassanal Bolkiah Foundation to assist fire victims, new \n          converts and the less fortunate members of the society, help to \n          increase the provision of housing as a whole. His Majesty later visited the \n          DataStream Technology Sendirian Berhad, DST in Tungku. Here,His \n          Majesty was greeted by a Permanent Secretary at the Prime Minister's \n          Office who is also the Chairman of Brunei Investment Agency, Pehin \n          Dato Awang Haji Yahya and the Acting Managing Director of Brunei \n          Investment Agency who is also the Chairman of DST Dr. Hj Mohd Amin bin \n          Abdullah. Formed in April 1995, DST Group is \n          fully committed to the process of nation building and the improvement \n          of life in Brunei Darussalam in its role as a network operator, \n          service and entertainment provider. It has since spinned off \n          achievement milestones in other areas, adding support and value to the \n          group's core operations. DST is a provider of world-class \n          mobile communications services both for business and for the local and \n          foreign communities of Brunei Darussalam. Since its inception, it has \n          grown from an AMPS type analogue telephone service provider to \n          introducing GSM services, putting it on par with the world's top \n          network operators and service providers. This was swiftly followed by \n          the provision of international roaming facilities to more than 30 \n          countries in four continents. The visit ended with a luncheon at \n          the Empire Hotel and Country Club in Jerudong. The National Housing \n          Development Programme and other housing schemes visited, today \n          testifies to the firm commitment of His Majesty's government to \n          provide properly planned and comfortable housing for his, citizens, \n          since this is key to promoting the welfare of the people of the \n          sultanate. It is such a unique experience for \n          residents of the country to have the Monarch consented to present keys \n          and land titles personally to his people from all various kampongs and \n          districts of the Sultanate. -- Courtesy of Radio Television Brunei Related Story - 300 Landless Locals Receive Royal Presents Click\n          Here To Have Your Say On This Story Brudirect.com News"
    },
    {
      "tag": "div",
      "text": "Back to News Page Write to Us ONESTAT SCRIPTCODE START // Modification of this code is not allowed and will permanently disable your account!\n// Account ID : 202572\n// Website URL: \n// Copyright (C) 2002-2004 OneStat.com All Rights Reserved Counter ONESTAT SCRIPTCODE END"
    },
    {
      "tag": "p",
      "text": "Copyright \n      1999-2004 Brudirect.com All rights reserved. Revised: webbot bot=\"TimeStamp\" S-FORMAT=\"%B %d, %Y\" S-TYPE=\"EDITED\" startspan January 06, 2005 webbot bot=\"TimeStamp\" i-checksum=\"31464\" endspan ."
    }
  ]
}