{
  "url": "http://www.bsr.org/CSRResources/Environment/EnvResources.cfm",
  "file_number": "300",
  "content_hash": "715047f6a37e9fa530e7f2c0ae389b4e0b64d9286fc6b310f3be5544e54ff6f3",
  "total_blocks": 141,
  "retained_blocks": 37,
  "ignored_blocks": 104,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-/W3C/DTD HTML 4.0 Transitional/EN\""
    },
    {
      "tag": "div",
      "text": "Home | Join BSR | About BSR | Search | Member Login BSR Advisory Services CSR Resources BSR Conferences BSR Store"
    },
    {
      "tag": "div",
      "text": "Home » CSR Resources »\n\t\t  \n\t\t\t  Environment"
    },
    {
      "tag": "h4",
      "text": "CSR News"
    },
    {
      "tag": "div",
      "text": "The contents in the following three links are available to BSR Members only and require login. NEW! BSR Weekly BSR Weekly Archives News Monitor News Monitor Archives Search News Summaries"
    },
    {
      "tag": "h4",
      "text": "CSR Networking"
    },
    {
      "tag": "div",
      "text": "Calendar CSR Jobs Posting Guidelines and Payment Information"
    },
    {
      "tag": "h4",
      "text": "Free BSR Publications"
    },
    {
      "tag": "div",
      "text": "Leading Perspectives"
    },
    {
      "tag": "h4",
      "text": "BSR China"
    },
    {
      "tag": "div",
      "text": "BSR China"
    },
    {
      "tag": "h4",
      "text": "CSR Resources"
    },
    {
      "tag": "div",
      "text": "Issue Briefs Featured CSR Resources Community Investment Resources Environment Resources Human Rights Resources Workplace Resources"
    },
    {
      "tag": "h4",
      "text": "Unique CSR Resources"
    },
    {
      "tag": "div",
      "text": "Labor Law Clean Cargo Working Group: Sustainable Transportation Food & Agriculture Working Group"
    },
    {
      "tag": "h4",
      "text": "External CSR News"
    },
    {
      "tag": "div",
      "text": "CSR News Releases Environment Resources"
    },
    {
      "tag": "p",
      "text": "This page contains freely available resources and BSR publications related to the Environment issue area. Unless otherwise noted, all publications are in PDF format."
    },
    {
      "tag": "h3",
      "text": "Clean Cargo Working Group"
    },
    {
      "tag": "p",
      "text": "The Clean Cargo Working Group works since 2001 to promote sustainable product transport. Its work encompasses environmental and social aspects of international transport by all modes. The Clean Cargo Working Group is a collaboration of leading international manufacturers and retailers, and their freight carriers. Please see the working groups' section for more information."
    },
    {
      "tag": "h3",
      "text": "Strengthening Implementation of Corporate Social Responsibility in Global Supply Chains"
    },
    {
      "tag": "p",
      "text": "Amidst the ongoing debate on how best to achieve good social and environmental practices in global supply chains, the World Bank Group commissioned a study on barriers to the achievement of better social and environmental performance in suppliers, and also on the options that hold the greatest promise for overcoming those barriers and enabling future improvement. Specifically, in the words of the Bank Group, the\r\noverall objective of the study is to \"... contribute to a broader goal of removing unnecessary barriers to CSR compliance at the supplier level in global supply chains, enabling more suppliers to implement CSR standards more easily.\" The specific objectives of this study are to: Identify the key barriers to improved implementation of codes of conduct at the level of suppliers. Identify and prioritize viable options for addressing these barriers. Download your copy of the report (PDF 575KB) ."
    },
    {
      "tag": "h3",
      "text": "Sustainability Toolkit and Scorecard"
    },
    {
      "tag": "p",
      "text": "How can your company improve its products and services while still meeting sustainability goals? Anew Sustainability Toolkit and Scorecard from Norm Thompson Outfitters can help your company to understand the implications of their product choices  on the triple bottom line and drive corporate sustainability goals throughout the organization. The toolkit can play a role in staff training, performance evaluation, product development and merchandizing. It also provides a method for assessing the overall sustainability of product lines while offering flexibility to buyers and product designers. The Sustainability ToolKit and Scorecard are copyright 2002 Norm Thompson Outfitters, Inc., and Michael S. Brown & Associates. Download your free copy of Norm Thompson's Sustainability Toolkit (PDF 2.9MB) ."
    },
    {
      "tag": "h3",
      "text": "Benchmark ReportRetail Recycling Project"
    },
    {
      "tag": "p",
      "text": "This benchmark report documents current practices by retailers and leading examples of shopping center recycling, including key factors that contribute to their leadership status. It also identifies conditions that can impede recycling at retail facilities. The information is based on a benchmarking survey and interviews with eight major retail companies representing more than 10,000 store locations in the U.S., and on interviews with property managers, waste haulers, and recycling experts. It provides leadership examples, as well as economic benefits that accrue to retail centers that implement recycling programs. Download the PDF Report (369KB)"
    },
    {
      "tag": "h3",
      "text": "Restricted Substances List"
    },
    {
      "tag": "p",
      "text": "RSL List Updated September 2004! Restricted Substances List and Implementation Tools provides information on substances that are limited by legislation in finished apparel products. These resources include the List (File size: 245KB), with limits, legislation, and test methods, as well as Implementation Tools (File size: 395KB) for adopting these limits throughout a company's supply chain. These resources will be most useful to apparel companies selling products globally, including in Europe and Asia."
    },
    {
      "tag": "h3",
      "text": "Water Quality Guidelines for Textile and Apparel Wastewater"
    },
    {
      "tag": "p",
      "text": "Water Quality Guidelines and Pollutant Fact Sheet and Water Quality Working Group Overview provide information on substances that are commonly found in textile and apparel wastewater. These resources include the Guidelines and Fact Sheets (PDF File 921KB), with wastewater effluent guidelines, test methods, and specific information about each pollutant, as well as the Overview (File size 1.1MB) which describes how the Guidelines were created. These resources will be most useful to apparel companies selling products globally, including in Europe and Asia. Please contact BSR for information on implementing the Guidelines in your supply chain. Other tools, including an Implementation Handbook are available by contacting environment@bsr.org ."
    },
    {
      "tag": "h3",
      "text": "Suppliers Perspective on Greening the Supply Chain"
    },
    {
      "tag": "p",
      "text": "Over the past several years, a number of organizations have investigated the increasing number of companies seeking to influence their suppliers' environmental practices, but typically have not looked at suppliers' perspectives on this trend. To address this imbalance and gain suppliers' insights into effective strategies for supply chain environmental management, BSR talked with representatives from 25 suppliers in four sectors -- automotive, electronics, forest products, and business services. This report, released in 2001 [PDF Document, File size: 135KB], summarizes their insights on: current trends in supply chain environmental management how these trends are impacting their business recommendations to suppliers on effective strategies for addressing environmental issues with suppliers whether and how these suppliers are addressing environmental issues with their suppliers future trends and directions"
    },
    {
      "tag": "h4",
      "text": "Search"
    },
    {
      "tag": "div",
      "text": "Entire Site Advisory Services CSR Resources BSR Conferences BSR Store About BSR"
    },
    {
      "tag": "h4",
      "text": "Join BSR BSR Services"
    },
    {
      "tag": "div",
      "text": "Legal | Contact Us | Email this Page Home | Join BSR | About BSR | Search | Member Login BSR Advisory Services | CSR Resources | BSR Conferences | BSR Store"
    },
    {
      "tag": "p",
      "text": "© 2001–2006 Business for Social Responsibility"
    }
  ]
}