{"file_number": "101", "non_ground_truth": []}
{"file_number": "102", "non_ground_truth": []}
{"file_number": "103", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? BlogThis!"}, {"tag": "div", "text": "Mark | 5:00 PM | Comment Thursday, November 10, 2005"}, {"tag": "div", "text": "Mark | 12:03 PM | Comment Monday, August 29, 2005"}, {"tag": "div", "text": "Mark | 11:00 AM | Comment Tuesday, August 16, 2005"}, {"tag": "div", "text": "Mark | 10:30 AM | Comment Friday, August 12, 2005"}, {"tag": "div", "text": "Mark | 11:00 AM | Comment Wednesday, August 03, 2005"}, {"tag": "div", "text": "Mark | 1:00 PM | Comment Tuesday, August 02, 2005"}, {"tag": "div", "text": "Mark | 6:00 AM | Comment Monday, August 01, 2005"}, {"tag": "div", "text": "Mark | 8:45 AM | Comment Thursday, July 07, 2005"}, {"tag": "div", "text": "Mark | 11:00 AM | Comment Thursday, March 31, 2005"}, {"tag": "div", "text": "Mark | 2:15 PM | Comment"}, {"tag": "div", "text": "the option open in new window the biography 25 things i was born in 1977 and lived in mill hill until the tender age of 17, whereupon Iwent up to oxford for my degree. two years of varying success later, i left (degreeless) and wandered the tide of mediocre jobs while living in, variously, new marston, brixton, finsbury park, camden town, notting hill and greenwich village. i'm six foot tall, thin, i wear glasses, i work in an office, i drink in nyc and i live in hope. a new atlantis adrift 1 • 2 • 3 • 4 • 5 ninth street 1 • 2 • 3 • 4 • 5 cinema londonmark audi olympics guest week 1 • 2 • 3 • 4 • 5 alphabet soup a • b • c • d • e • f • g • h • i • j • k • l • m • n • o • p • q • r • s • t • u • v • w • x • y • z the science of … troubled diva guest week knowing corresponding breaking playing timing wanting worrying giving second-guessing mistaking science by others failing fifteen-to-one 15 • 14 • 13 • 12 • 11 • 10 • 9 • 8 • 7 • 6 • 5 • 4 • 3 • 2 • 1 with added londonkate see: kate | mark hear: kate | mark smell: kate | mark taste: kate | mark touch: kate | mark the art of … first series waiting meeting drinking choosing guessing smoking preparing lazing laughing losing second series speaking anticipating buying snacking wandering embracing envying rising sleeping asking art by others answering loaded questions washing dishes charming: 1 • 2 • 3 making a fucking decision giving getting away with it letting go novelty cakes the case of the missing … episode 1 episode 2 episode 3 episode 4 episode 5 episode 6 episode 7 episode 8 episode 9 episode 10 deleted scenes die another day: 1 • 2 • 3 • 4 • 5 matrix trilogy: 1 • 2 • 3 • 4 • 5 pirates of the caribbean: 1 • 2 • 3 • 4 • 5 indiana jones trilogy: 1 • 2 • 3 • 4 • 5 league of extraordinary gentlemen: 1 • 2 • 3 • 4 • 5 spider-man 2: 1 • 2 • 3 • 4 • 5 the links blogs a girl with a .com acerbia american undershirt anglepoised aprosexic audi olympics autoblography bent back tulips blast! blue witch bryan adams blog burnt toast chasing daisy chew get meh? chucklehut d4d diamond geezer easy tiger freshly sharpened pencil frizzy logic fussy geese aplenty girls don't cry green fairy hip to you hydragenic i live on your visits icandy invisible stranger jannism juicy kudzu la de da little.red.boat mad musings of me mo morgan my boyfriend is a twat naked blog neveratoss not you, the other one parenthetical ellipses redux petit hiboux pixeldiva prolific sashinka scaryduck shivery silent words speak loudest smitten something speaking as a parent swish cottage tales from the mad side the kate the manly smell of a pipe this fish needs a bicycle troubled diva uborka wendy city wherever you are world of chig not blogs | general amazon (uk) batman on film bbc b3ta cat and girl danger here do something pretty empire online film philosophy football365 google guardian internet anagram server make a mr man monbiot.com need to know newcastle united (official) newcastle united (unofficial) newcastle united (icnewcastle) olis catalogue opta index oracle of bacon penny arcade popbitch premier league scary-go-round shark tank telegraph times urban dictionary xrefer not blogs | london bbc ldn camden market camden new journal camden town online camden tube redevelopment evening standard londinium london underground underground history xfm not blogs | music the beloved black box recorder the divine comedy muse pet shop boys placebo st etienne suede the contact mwmc01 at yahoo dot co dot uk the book the cd the dvd the past the credit blogger: weblog blogtree downes: referrals haloscan: web comments the rights This work is licensed under a Creative Commons License . the power"}]}
{"file_number": "104", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Tuesday, December 26, 2006 - 07:02 PM EST  — Apple Stock Quote: 81.51 (-0.69, -0.84%)"}, {"tag": "div", "text": "full • squeeze 5-Day Most Commented:"}, {"tag": "p", "text": "The Economist makes us laugh: In look & feel and ease of use, Vista out-Macs Apple's Mac OS X (113) The Wall Street Journal: Apple's 'Get a Mac' knife cuts deep (107) Merry Christmas and Happy Holidays from MacDailyNews! (102) RUMOR: Apple 'iPhone' photo leaked? (51) RUMOR: Second leaked Apple 'iPhone' image shows chameleonic trackpad (50)"}, {"tag": "div", "text": "Opinion Archive:"}, {"tag": "p", "text": "October 2006 Microsoft Windows’ innate charm September 2006 Opinion: Engadget’s Microsoft Zune lovefest culminates in Zune giveaway You want back into the Mac market?  Apologize to Mac users first Digital media downloads: what do we really own and do subscriptions make sense? August 2006 Is Steve Jobs sick? Current Headlines: MacNN:"}, {"tag": "div", "text": "Sub-$1,350 refurbished MacBook Pro Forums: MWSF '07, dead pixels Apple takes no. 2 in BW 'Tech Hot Growth 50' Briefly: review, Shuffle clasp patent UI Browser 2.0 goes Universal You Control: Fonts gains Universal Binary Apps: CSSEdit 2.0.2; xTime Planning Beta 3 Amazon.com sees record holiday sales Apple retail beats Tiffany & Co. Apple wins hybrid mouse, auto resize patents MacMinute: Happy Holidays from MacMinute! iPod shuffle Reset Utility 1.0.1 for Mac released 'Ten Mac Games Holiday Bundle' announced Tweakersoft releases WebcamTweaker with new effects New soccer manager simulation game released RadTech announces improved ScreenSavrz for Notebooks ezGear enhances ezEars SX50 SMS Mac 2.1 adds 'Handle Reports' preference pane Everyone Wins with TeachMac Giveaway and Contest PageSpinner 5.0 Public Preview 1 released ThinkSecret: Secret Notes: Apple plants Mac OS X 10.4.9 seed Gallery: New Leopard build reveals OS far from finished, but earning its stripes (or spots) Fresh iPhone details emerge as release grows closer Secret Notes: Apple lets new Leopard seed roar Adobe Photoshop CS3 public beta due soon AppleInsider: Jobs seeks outside counsel as Apple restatement looms Blip: Apple Taiwan opens first retail outfit New Clovertown chip an option for Apple's 8-core Mac Pro VMware, Parallels release new virtualization betas for Mac Mac OS X 10.4.9 to offer Bluetooth, synching improvements iTunes Top 10: 1. Radio Disney Exclusive: Push It to the Limit + Exclusive Interview + Sampler - Corbin Bleu 2. Hip Hop Is Dead (Explicit Version) - Nas 3. Wintersong - Sarah McLachlan 4. Now That's What I Call Christmas! 3 - Various Artists 5. Daughtry (Bonus Track) - Daughtry 6. Let It Snow! - EP - Michael Bublé 7. A Charlie Brown Christmas (Remastered) - Vince Guaraldi Trio 8. James Taylor At Christmas - James Taylor 9. How to Save a Life - The Fray 10. FutureSex / LoveSounds - Justin Timberlake Mac OS X Downloads: Apple Support: How to reset iPod Mac Pro: How to locate the Serial Number iCal 1.5.4: What's an \"unsafe\" alarm? Boot Camp Beta: Apple keyboards and keyboard mapping in Windows XP Intel-based iMac: What to do if your computer won't turn on DVD Studio Pro: Format to DLT drive does not complete on Mac Pro Adding and Deleting Songs and playlists from your iPod Mac OS X: Printing to an HP printer with binary PostScript iMovie HD 6: Red tint on imported photos Final Cut Pro: Troubleshooting Basics"}, {"tag": "p", "text": "16-percent of computer users are unaffected by viruses, malware because they use Apple Macs Wednesday, June 15, 2005 - 07:05 PM EST In a press release on Friday, June 3, 2005, Wizzard Software explained why they believe the Macintosh market is important as they prepare to release AT&T Natural Voices for Apple's Mac OS X: According to a statement released earlier this year, Apple Computer reported their 2005 first quarterly revenue and net income as the highest in the history of their company, with 74% revenue growth. Apple shipped 1,046,000 Macintosh units during this quarter, representing a 26% increase in CPU units over the year-ago quarter. According to US News and World Report, Macintosh owners buy 30% more software than their Windows counterparts. Further, Macintosh software comprises over 18% of all software sold, according to the Software and Information Industry Association. In addition, the Software Publishers Association (SPA) estimates that 16 percent of computer users are on Macs. Also, on Thursday, June 2, 2005, Winn Schwartau, one of the country's leading experts on information security, infrastructure protection and electronic privacy, summed up his first month's experiences in his conversion from Windows to Mac: In the WinTel world, could you do this? Or maybe you should ask, 'Do Ireally want all of that paranoia to go away? Do Ireally want to spend more time enjoying whatever the hell Ido on my 'puter, or maybe Ishould continue wasting hours every week on security crap that shouldn't be a problem in the first place? Hey. It's just a question. Matthew G. Solovey, writing for The Hershey Chronicle on Thursday, June 2, 2005, explained: As Windows users continue to run their adware, spyware, and virus removal programs, Macintosh enthusiasts have enjoyed - literally - zero viruses. Adware and spyware are nonexistant as Mac users surf the Web without issue. OS X's UNIX shell is a secure system that keeps your computer safe, and Apple has built in a firewall for added security.  In addition, it's stable. OS Xusers report months without rebooting their computers. MacDailyNews Take: Put the ingredients together, stir gently and bake for 10 minutes.  What you get is surprisingly delicious: more people use Macs than most people realize and those Mac users efficiently surf the Web with impunity on stable systems that aren't bogged down by unnecessary virus and malware scanners. [UPDATED: 6/15/05, 8:05pm EDT] Related MacDailyNews articles: AT&T Natural Voices coming soon for Apple Mac OS X - June 02, 2005 Survey shows Apple Macs owned by nearly 10 percent of US small and medium-sized businesses - February 17, 2005 More people use Apple Macs than you think; 8-12 percent of homes use Macs - March 31, 2004 10 percent of computer users use a Mac; 3 percent is Mac's approximate quarterly market share - February 10, 2004 Syracuse Post-Standard: 3 percent is a false stat; Mac holds '10 to 12 percent of the market for PCs - August 27, 2003 Microsoft: The safest way to run Windows is on your Mac - October 08, 2004 Columnist tries the 'security through obscurity' myth to defend Windows vs. Macs on virus front - October 1, 2003 New York Times: Mac OS X 'much more secure than Windows XP' - September 18, 2003 Fortune columnist: 'get a Mac' to thwart viruses; right answer for the wrong reasons - September 02, 2003 Shattering the Mac OS X 'security through obscurity' myth - August 28, 2003 Is Mac OS Xreally inherently more secure than Windows? - August 26, 2003 Hershey Chronicle: Now's the time for Windows users to consider Apple's 'zero virus' Mac - June 02, 2005 Security expert sums up first month with Mac: 'much safer, more secure, more productive than Wintel' - June 02, 2005 Intel CEO Otellini: If you want security now, buy a Macintosh instead of a Wintel PC - May 25, 2005 Intel CEO Otellini: If you want security now, buy a Macintosh instead of a Wintel PC - May 25, 2005 Microsoft Windows Sober.Pworm shows 'epidemic' spread; Macintosh unaffected - May 03, 2005 Apple touts Mac OS Xsecurity advantages over Windows - April 13, 2005 New 'highly critical' Office flaw embarrasses Microsoft - April 13, 2005 97,467 Microsoft Windows viruses vs. zero for Apple Mac's OS X - April 05, 2005 Apple's Mac OS Xis virus-free - March 18, 2005 68,736 Microsoft Windows viruses vs. zero for Apple Mac's OS X - March 12, 2005 Microsoft tries to turn its own security flaw into commercial gain - February 25, 2005 Cybersecurity advisor Clarke questions why anybody would buy from Microsoft - February 18, 2005 Unlike Windows users, Mac OS Xusers surf the Internet without a care in the world - December 28, 2004 Windows spyware mess is out of control, get a Mac and surf with impunity - December 21, 2004 Detroit Free Press: Windows malware problem getting worse, it's time to get a Mac instead - December 16, 2004 Sick of spyware, adware headaches? Get a Mac and surf the Internet freely - December 13, 2004 Mossberg: Windows PCs plagued with problems, Apple's Mac is 'rock solid, elegant and affordable' - December 09, 2004 Security expert: Don't use Microsoft Windows, Office, Outlook, Internet Explorer - December 09, 2004 Sick of spyware, adware infecting your PC? Don't fret, just get a Mac - November 01, 2004 Spyware plagues Windows users while Mac users surf Net with impunity - November 01, 2004 Microsoft: The safest way to run Windows is on your Mac - October 08, 2004 Windows users' security woes spark interest in Apple's secure Mac OS X - October 06, 2004 Windows desktop monopoly threatened by secure, safe Apple Mac OS X - October 04, 2004 Even Bill Gates can't avoid Windows malware; Mac users surf the Web freely - October 03, 2004 Cyber-security adviser uses Apple Macintosh to avoid Windows' security woes - September 27, 2004 Information Security Investigator says switch from Windows to Mac OS Xfor security - September 24, 2004 Mossberg: Apple iMac G5 'powerful, affordable, virus-free with better, more modern OS than Windows XP' - September 23, 2004 USA Today: people are switching from Windows to Mac because of security issues - September 21, 2004 Windows besieged by hackers; number of Windows viruses soars by more than 400% - September 20, 2004 USA Today columinst angry about Windows viruses, adware, spyware - September 15, 2004 University of Chicago recommends all students patch Windows at least once a day - September 14, 2004 Windows XP worm speaks to users as it deletes their files; Macintosh unaffected - September 13, 2004 Security is top priority in Apple's Mac OS X - September 12, 2004 Millions of Windows PC's hijacked by hackers, turned into zombies; Macintosh unaffected - September 08, 2004 Mossberg: Dump your Windows machine and get an Apple Macintosh to free yourself of spyware - August 25, 2004 Tired of patching patches to patch Windows patches? Writer suggests getting a Mac - August 03, 2004 Windows 'Scob' virus designed to steal financial data, passwords; Macintosh unaffected - June 26, 2004 Gartner: Worms jack up the total cost of Microsoft Windows - May 07, 2004 Spyware, adware plague Windows users online; Mac OS Xusers surf freely - April 19, 2004 SmartMoney: Long-suffering Windows users can only dare to dream of Mac's ease-of-use - February 12, 2004 Mac OS Xhas no viruses; what's wrong with Windows? - February 11, 2004 Gates: Windows 'by far the most secure' system; tries to use 'Mac OS Xsecure through obscurity' myth - January 27, 2004 Wall Street Journal's Mossberg on making the switch from Windows to Mac - September 18, 2003 Chicago Sun-Times columnist: Windows 'many holes in its security' but 'none of my Macs have ever been affected - August 26, 2003 Sick of worms and viruses? 'Move to Mac OS X' suggests Chicago Tribune columnist - August 25, 2003 Virus and worm problems not just due to market share; Windows inherently insecure vs. Mac OS X - August 24, 2003 Email this article to a friend"}, {"tag": "h3", "text": "Always -- Free ground shipping with orders over $50 at the Apple Store. Reader Feedback:"}, {"tag": "h3", "text": "Always -- Free ground shipping with orders over $50 at the Apple Store."}, {"tag": "h3", "text": "Add your feedback:"}, {"tag": "p", "text": "Name: Email: (optional)"}, {"tag": "h3", "text": "Emoticons | Allowed HTML Tags"}, {"tag": "p", "text": "Remember my personal information Notify me of follow-up comments? Please enter the \"MDN Magic Word\" you see in the image below:"}, {"tag": "h3", "text": "Current MacDailyNews Stories:"}, {"tag": "p", "text": "Apple Computer #2 on BusinessWeek ‘Tech Hot Growth 50’ list Tuesday, December 26, 2006 - 06:45 PM EST Discovery Channel to broadcast the ‘Inside Story of Apple iPod’ Tuesday, December 26, 2006 - 03:39 PM EST PC Magazine: Top 5 questions asked by Windows PC to Mac switchers Tuesday, December 26, 2006 - 02:44 PM EST Apple opens first large retail store in Taiwan Tuesday, December 26, 2006 - 02:20 PM EST Apple ‘iPhone’ could disrupt mobile service distribution channel Tuesday, December 26, 2006 - 10:32 AM EST The Register’s Ray: Apple ‘iPhone’ will fail Tuesday, December 26, 2006 - 10:01 AM EST Wired News covers Steve Jobs’ best year ever Tuesday, December 26, 2006 - 09:21 AM EST Microsoft Windows Vista proves ‘pushover for Internet hackers’ Tuesday, December 26, 2006 - 08:57 AM EST The Wall Street Journal: Apple’s ‘Get a Mac’ knife cuts deep Sunday, December 24, 2006 - 01:59 PM EST Merry Christmas and Happy Holidays from MacDailyNews! Saturday, December 23, 2006 - 12:00 AM EST Apple releases iPod shuffle Reset Utility 1.0.1 Friday, December 22, 2006 - 03:13 PM EST The Economist makes us laugh: In look & feel and ease of use, Vista out-Macs Apple’s Mac OS X Friday, December 22, 2006 - 02:59 PM EST Planned home PC purchases surge, Apple Mac looks primed to benefit Friday, December 22, 2006 - 02:38 PM EST Windows PC user tries Apple Mac for two weeks, finds ‘once you go Mac, you don’t want to go back’ Friday, December 22, 2006 - 01:59 PM EST Winterwolves releases Universal Soccer Manager 2 for Apple’s Mac OS X Friday, December 22, 2006 - 11:45 AM EST"}, {"tag": "h6", "text": "news opinion store contact links Advertising Info . Copyright ©2002-2006\n              MacDailyNews. All rights reserved. Privacy\n              Policy"}]}
{"file_number": "105", "non_ground_truth": [{"tag": "p", "text": "INR Bleeding Vitamin K FFP Normal  5.9 None Not indicated Not indicated 6.0  9.9 None Oral: 0.5  2.5 mg SC: 0.5  1.0 mg Not indicated > 10 None SC: 3 mg total, in divided doses of 1 mg Not indicated > 20 Yes SC: 10 mg 10  20 cc/kg"}, {"tag": "p", "text": "Type 1 Type 2 Frequency 10-20% 1-3% Timing 1-4 days 5-10 days Nadir of\n  platelet count 100,000 30-55,000 Antibody\n  mediated No Yes Thromboembolic\n  sequelae None 30-80% Hemorrhagic\n  sequelae None Rarely Management Observe Discontinue heparin\n  and start alternate anticoagulant."}, {"tag": "p", "text": "Stage Skin Liver (total bilirubin) GI 1+ maculopapular rash on < 25 % of BSA 2-3 mg/dl diarrhea 500  1000 cc/day 2+ maculopapular rash on 25-50 % of BSA 3-6 mg/dl diarrhea 1000  1500 cc/day 3+ generalized erythroderma 6-15 mg/dl diarrhea > 1500 cc/day 4+ generalized erythroderma and desquamation > 15 mg/dl severe abdominal pain  ileus"}, {"tag": "p", "text": "See Toxicology"}]}
{"file_number": "106", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Office of Medical Public Affairs, Washington University School of Medicine at Washington University Medical Center, Campus Box 8508, 4444 Forest Park Ave., St. Louis MO 63108-2259, (314) 286-0100 FAX: (314) 286-0199"}, {"tag": "div", "text": "Medical School Home | Public Affairs Home | Public Affairs Archived Releases | Search Public Affairs Affiliated with Barnes-Jewish and St. Louis Children's Hospital Members of BJC Health Systems. SM"}]}
{"file_number": "107", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""}, {"tag": "div", "text": "Sun Mon Tue Wed Thu Fri Sat"}, {"tag": "div", "text": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31"}, {"tag": "h2", "text": "About Books I'm Trying To Find Time To Read"}, {"tag": "p", "text": "J.R. Moehringer: The Tender Bar: A Memoir Queen Noor: Leap of Faith : Memoirs of an Unexpected Life"}, {"tag": "h2", "text": "Mental Health Blogs"}, {"tag": "div", "text": "misszoot.com :: Zoot's TV Addict Blog :: Laid-Off Dad MetroDad Married to Medicine Fluid Pudding The Pieces of my Life a little pregnant Wet Feet Suburban Bliss re:becca"}, {"tag": "h2", "text": "Blogs That Make Me Look Smart At Work"}, {"tag": "div", "text": "Sanders Says Rattle The Cage Learned on Women I'm a firestarter with energy and enthusiasm to get the buzz going about whatever product or service Irepresent. Tom Peters Brand Autopsy Powered by TypePad"}, {"tag": "h2", "text": "Recent Posts"}, {"tag": "h2", "text": "Feeling Flickr-y"}, {"tag": "div", "text": "www. flick r .com This is a Flickr badge showing public photos from MelissaP . Make your own badge here ."}, {"tag": "h2", "text": "Categories"}, {"tag": "div", "text": "How TIVO Changed My Life MS doesn't stand for morning sickness On Being a Doctor's Wife Puddin' Talk Stinkerbell The Puddin' This and That Set Up Your Blog for Free Customize & create your blog today. Publish your opinions and photos. www.TypePad.com Get Movable Type Today The professional's blogging tool. Full featured weblog tool. www.MovableType.org Free LiveJournal Account Asimple-to-use personal journal that allows you to interact with other users. www.LiveJournal.com"}, {"tag": "h2", "text": "Archives"}, {"tag": "div", "text": "October 2006 September 2006 December 2005 September 2005 July 2005 May 2005 April 2005 March 2005 February 2005 January 2005 Add me to your TypePad People list Subscribe to this blog's feed"}]}
{"file_number": "108", "non_ground_truth": [{"tag": "h4", "text": "A."}]}
{"file_number": "109", "non_ground_truth": [{"tag": "div", "text": "Home Stories Pictures Thesaurus Shop Chuck Ups Links"}, {"tag": "h1", "text": "Welcome to the web's premier vomit humour site!"}, {"tag": "h2", "text": "You drink, you get drunk, you throw up, you pass out, you wake with a hangover and a hell of a mess to clean up... but a great story to tell - if you can remember it!! pure comedy!"}, {"tag": "p", "text": "Check out this month's new stories: Don't forget our range of cool tshirts and other great merchandise Blowing Chunks Explosion The Long Way Home The Black Death Taped Desk Not in the Fish Bowl!"}, {"tag": "div", "text": "Gifts Galore at www.poyt.com"}, {"tag": "p", "text": "Click Here to read Herbert Weiner's Essay on the Vomiteers of America"}, {"tag": "h2", "text": "Got a story to tell?"}, {"tag": "p", "text": "Click here to mail it in to us  at The Vomitorium  and who knows, you might get to puke on the web!"}, {"tag": "h2", "text": "Blowing  Chunks"}, {"tag": "p", "text": "Unlike most contributors, Iam an older woman (54) and a former high school teacher.  But, Ihave a great revenge-puke story. Ayear ago Ihad a major back surgery and was confined to my hospital bed.  Iwas given very strong pain medication through an IV, and it gave me a crushing headache and nausea.  Iwas on a liquid-only diet, and had just eaten my green jello and milk lunch.  Ihad a real \"Nurse Rachet\" type who repeatedly ignored my complaints of nausea.  Irang the bell repeatedly and told her that Ineeded a basin quickly as Iwas sure Iwas going to vomit.  Not only was Ihooked to the IV, Icouldn't even get out of bed yet because of the brace on my back, so Iwas totally at her mercy. She'd stick her head in the door, and snottily say, \"In a minute dear, I'm BUSY right now.  Like other people's complaints were more important than my own.  Well, she finally deigned to bring my basin, and even though Iswear Ididn't plan it, Iprojectiled all over the front of her as soon as she got close to my bed. It was a wonderful technicolor green with jello chunks mixed in with sour milk curds.  Isplatted her mostly on the chest but also got her face and hair. The look on her face was priceless.  She was so mad and disgusted that Iknow she would have slapped me if she could have gotten away with it.  Iguess she got her own revenge though, because she left and didn't send anyone in to clean up for a long time.  Ididn't see her again for the rest of that shift. Iwonder if she'll be too busy next time to ignore complaints for nausea from a patient. * * * * * * * Back to the top * * * * * * *"}, {"tag": "h2", "text": "Explosion"}, {"tag": "p", "text": "I'm 17, and a week ago, Iwas just working on a science project with my friend at home. She starts puts her hand over her mouth then runs to the toilet and Ihear her go, “BLEEEEEEEEEGH!!!!!!” There was a trail of puke that looked like spilled coffee. Then she comes out and goes right back in. When she comes out Igo in and there Igo, stepping in puke. When Istep forward again, there Igo AGAIN, stepping in puke. Isee that the bathroom floor is covered in her puke!!! That made ME puke! My friend passed out puking. Then she wets her pants unconscious. My mom screamed to wake her up. Then she puked blood. My mom and Igagged as we cleaned it up and it took forever because Ikept puking. * * * * * * * Back to the top * * * * * * *"}, {"tag": "h2", "text": "The Long Way Home"}, {"tag": "p", "text": "When Iwas about nine, ( Iam now 42) my mother, sister and Iwere making the two-hour drive to my grandmother’s house for the weekend.  About halfway there, my Mom’s VW bug sputtered and died.  Iwas coming down with something and had already had to stop and hurl once. We stood by the side of the road trying to figure out what to do. (No cell phones back then!)  Afew minutes later, a sweet little old lady in a very old, but mint condition sedan pulled up and offered us a ride to the bus station in Boston.  What a good Samaritan! Afew minutes later, the dreaded churning of my stomach began.  “Ihave to throw up again” Iwhispered to my Mom from the back seat.  “Open up your suitcase and do it in there!” she replied.  “Iam not asking this sweet lady to pull over!”  Iquietly unzipped my suitcase and spewed the contents of my stomach all over my clothing.   The lady didn’t seem to notice, or was too polite to say anything.  Itruly believe this woman was a saint because the stench was overwhelming! We made it to the bus station without further incident, but it was not over yet.  Aboard the bus, the diesel fumes were not helping my condition.  The nausea rode once again.  Another sweet old lady (they’re everywhere) must have noticed the green hue of my face and offered me a butterscotch to “settle my stomach”.  The mere thought of the butterscotch in my mouth was too much and, once again, Iput my suitcase/barfbag to use. An hour later, Iwas finally lying on my grandmother’s couch, wastebasket at the ready, while Nana, the sweetest old lady of them all, took my suitcase without hesitation and laundered my clothes. This story is dedicated to sweet old ladies everywhere! * * * * * * * Back to the top * * * * * * *"}, {"tag": "h2", "text": "The Black Death"}, {"tag": "p", "text": "Iwanted to tell ya this story i have. My mates and Istill laugh about this to this day. We were all drinking at my mate Luke's house (parents were away, yanno, makin the most of it). The mian crew was myself, with my girlfriends Jess and Tam, and my male mates, Luke, Clayton, Jarad, and Russell, and about 6 or 10 other stragglers. Let me just say that Russell is a little man. and doesn't drink very much. And what do best mates do when they find a weakness of each other... Exploit it like mad. The boys fed Russell so many drinks that the poor boy couldn't even think of standing without feeling sick, let alone actually do it. All in all, Iremember us having 1 bottle Bundy OP, 1.5 bottles of vodka, 1 bottle of tequila, 2 cartons of beer, 1 bottle of Real McCoy Burbon, 1 bottle of Jack Daniels, 1 bottle of Cougar, and 1.5 botles of Jim Beam , and say a case of girlie drinks (that the girls would have brought between them), 1 bottle of Southern Comfort, and im sure there would have been a large array of things that were floating around in the mean time. Anyhow, he was doing really well considering the drinking torture the boys had put him through. Ilove Black Sambuca, so Ithought I'd crack my bottle. The boys looked at each other, and just grinned, pouring a normal drinking glass full for Russell, and dared him to scull it. Being male and extremely drunk... he did. After an hour or two, Russ wasnt coping with the vertigo thing very well, and was starting to feel rather seedy, so Igave him 2 panadol, a litre of cold water and guided him into Luke's sisters room (as she wasnt home for the weekend, and we figured he'd be safe there as it was close to the toilet in case it was needed) About 5 am, we hear this scrabbling from bedroom to bathroom, and the most wicked sounding heave in the world. We all looked at eachother and went to check on Russ. The poor boy had been sick all in the bedroom.... only problem is, this bedroom is Luke's sisters, and its completely white, and after drinking Black Sambuca, your vomit turns this lovely deep violet purple colour. He managed to spew on the white wall, on the white carpet, in Luke's sisters clothes drawers, on the matress, all over himself, all over the pillow and somehow even managed to get some on the roof. Iwas the only one who's guts wasnt churning enough to clean it up, but Itell ya, it look at long time to get the colour and smell out, and Iwasnt feeling so pretty afterwards. But you've gotta do what you've gotta do, when you've had a party that the parents dont know about, and you know would lose the plot if they ever found out, but at least nothing was broken. Mind you, Icouldnt help but laugh... and the others were trying very hard to stifle their giggles... everyone that was, except for Russ who was just hoping he wasn't going to die. To this day, Russ can't stomach the smell of Black Sambuca, but at least we can laugh about it. * * * * * * * Back to the top * * * * * * *"}, {"tag": "h2", "text": "Taped Desk"}, {"tag": "p", "text": "This happened when Iwas in 4th grade. Iwasn't feeling well, so Iwent to the nurse's office. Unfortunately, she wasn't there! Then, Iwent to the secretary, and before Icould say anything, Ithrew up all over her desk!!! Iapologized, and she accidentally said,\"Oh,sh*t!\" She said that the last time someone spewed near her, she started spewing too. The janitor put 'police line' tape all around the desk! Luckily,no classmates knew about it. * * * * * * * Back to the top * * * * * * *"}, {"tag": "h2", "text": "Not in the Fish Bowl!"}, {"tag": "div", "text": "okay.. so i was at my friends house and my friend decided to bring out some bacardi. i had never drank before so i took this as a golden opportunity, by drinking my drink as well as both of my friends while they went to get more molson. well the last thing i remember is doing a somersault and in the morning i woke up drenched in sick and for some reason cranberry juice. apparently i got hungry but couldnt get it in my mouth while i was getting sick. anyways, i got up to see that my friends fish bowl was gone... confused i asked what happened and what happened was, i had decided i needed to get sick, so i grabbed the first thing near me. killed the goddamn fish. oops i guess :)"}, {"tag": "p", "text": "* * * * * * * Back to the top * * * * * * *"}, {"tag": "div", "text": "Vomit Shop News Guest Book Contact Us More Stories Chuck Ups Vomit Pictures Vomit Thesaurus Links"}, {"tag": "p", "text": "You are puker number"}, {"tag": "div", "text": "Home | Stories | Pictures | Thesaurus | Vomit Shop | Contact Us | Links"}]}
{"file_number": "110", "non_ground_truth": [{"tag": "p", "text": "-to\nLinks to Miscellaneous Horse/Wilderness sites Back\nTo Top of Page"}, {"tag": "blockquote", "text": "Get a GoStats hit counter"}]}
{"file_number": "111", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""}, {"tag": "div", "text": "The Library \nof Congress"}, {"tag": "div", "text": "home top of page The Library of Congress | American\n   Memory Contact\n   us Last updated 09/26/2002"}]}
{"file_number": "112", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis! \"Honesty is my only excuse...\""}, {"tag": "div", "text": "Links Open in New Window July 2004 August 2004 September 2004 October 2004 November 2004 December 2004 January 2005 February 2005 March 2005 April 2005 May 2005 June 2005 July 2005 August 2005 September 2005 October 2005 November 2005 December 2005 January 2006 February 2006 March 2006 April 2006 May 2006 June 2006 July 2006 August 2006 September 2006 October 2006 November 2006 December 2006 The Drudge Report Free Republic World Net Daily News Busters September 11, 2001 Sean Hannity Ann Coulter Laura Ingraham Protest Warrior Iraq the Model GOP Grassroots PA Young Nationalist Right Wing News National Summary Pajamas Media Conservative Pages Powerline News Zombie: A Real Look at the Anti-War Left PAT DOLLARD: Young Americans Jules Crittenden Keystone Soldiers Castle Argghhh! BLACKFIVE Mudville Gazette CBFTW's WAR MILblogging.com Army Girl Desultory Butterfly My Army Life Doc in the Box American Soldier From My Position...On the Way! Miserable Donuts A Female Soldier This is Your War II Anti-Idiotarian Rottweiler The Jawa Report The Middle Ground Basil's Blog Ace of Spades HQ Small Dead Animals AFSis' Side of the Puddle The G-Man The Cassandra Page She Who Will Be Obeyed Junk Yard Blog Villainous Company TrekMedic251 News & Views from Philly Righty in a Lefty State Third World County Homocon Guardian Watchblog ArmyWifeToddlerMom Andi's World Six Meat Buffet Papa Doc Wizbang Three Sources Lost in Lima Heartless Libertarian Stalking Cat The Attic Downstairs A Sage Moment Right in Philly Ron Goodwyne Slag Blog Common Folk-Common Sense Cancer World Another Man's Meat UrbanGrounds Rab Honest Partisan Lone Liberal in The Dirty South Pax Romano J. Marquis Courtney's Gifted School D-NC Bourgeois Deviant PROTEIN WISDOM Straight White Guy IMAO The Flying Space Monkey Blame Bush! Blank Forever Anonymous Rowhouse Tammi's World Jethro's Chirotechnics Homeschooling Mamma Sleeping Ugly Freakchylde's Playground A Unique Southern Belle My Favorite Pastor BlueWolfess Violent Day Dreams Kalipornia Sux My Opinions Are Free Bloggedy Blog Philly Future Blinq Attytood Philadelphia Will Do \"Now there's a sassy blonde! Why don't Ihave her linked?\""}, {"tag": "div", "text": "Ollie North's Freedom Alliance Adopt A Platoon Women For Women International Toys For Iraq Operation Shoe Fly All SANDBOX photos sent to ALa via email or taken from I'm of the Select Few in Technorati Cosmos How about you? Big & Mean TX PunkRock Mommy VA Desultory Butterfly MD Mr. Nimbus VT Pax Romano NJ She Who Will Be Obeyed KS CW4BillT NJ Army Girl AZ Russ from Winterset IA Dan Rubin PA Courtney MA Dale Cruse MA CBFTW CA kali MD RBP TN"}]}
{"file_number": "113", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""}, {"tag": "h2", "text": "The Further Adventures of Jeremy Smith, aka \"Mr. Beaks\", aka Melvin Moody About Archives"}, {"tag": "div", "text": "December 2006 November 2006 October 2006 September 2006 June 2006 May 2006 April 2006 March 2006 January 2006 December 2005 Subscribe to this blog's feed"}, {"tag": "h2", "text": "Books"}, {"tag": "p", "text": "Marcel Proust: Swann's Way: In Search of Lost Time, Volume 1 (Penguin Classics Deluxe Edition) Robert Penn Warren: All the King's Men Bob Woodward: State of Denial: Bush at War, Part III Richard Hofstadter: Anti-Intellectualism in American Life (Vintage)"}, {"tag": "p", "text": "Clipse: Hell Hath No Fury My Morning Jacket: Okonokos Ratatat: Classics TV on the Radio: Return to Cookie Mountain « December 2004 | Main | February 2005 »"}]}
{"file_number": "114", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""}, {"tag": "div", "text": "Web News Jobs"}, {"tag": "div", "text": "Quick Searches!"}, {"tag": "div", "text": "addresses area codes books cameras directions electronics email search europe maps int'l jobs jobs kitchen lawn and patio maps meta-search web movies movie times music news phone numbers software stocks tools and hardware toys traffic tv listings video games"}, {"tag": "div", "text": "comparison shop | family | fashion | gov't | games | genealogy | history | kids/teens | movies | repairs | traffic | weather | featured \n      sites | site map |"}, {"tag": "div", "text": "Clothes Books Cameras Computers DVD Electronics Housewares Music Software Tools"}, {"tag": "div", "text": "Shopping and Product Search All products Books Apparel Jewelry Popular music Watches Classical music DVD's VHS Videos In Theaters Toys Baby Computer Hardware Computer & Video Games Electronics Photo Software Tools & Hardware Garden / Outdoor Living Kitchen Cell Phones & Service for"}, {"tag": "div", "text": "Angel/EMI Boxed Sets Decca Deutsche Grammophon ECM Store DVD-Audio Sheet Music"}, {"tag": "div", "text": "Shop for Classical \nMusic Ballet Opera Symphony Sacred Early Music Renaissance (c.1450-1600) Baroque (c.1600-1750) Classical (c.1770-1830) Romantic (c.1820-1910) Modern Period"}, {"tag": "div", "text": "Search \n              Beat > Arts > Music > Styles > Classical \n              Music > Featured \n              Composer > Philip Glass"}, {"tag": "div", "text": "Shopping and Product Search Books Apparel Jewelry Classical music Popular Music Watches DVD's VHS Videos In Theaters Toys Baby Computer Hardware Computer & Video Games Electronics Photo Software Tools & Hardware Garden / Outdoor Living Kitchen Cell Phones & Service for Advanced \n        Search"}, {"tag": "div", "text": "Browse Philip Glass"}, {"tag": "div", "text": "World \n                    > Deutsch > Kultur > Musik > Genres > Klassische Musik > Komponisten \n                    > G > Glass, Philip"}, {"tag": "div", "text": "Usenet alt.music.philip-glass - news: - Deja - Remarq"}, {"tag": "div", "text": "Help build the largest human-edited directory on the web. Submit \n                          a Site - Open \n                          Directory Project - Become \n                          an Editor"}, {"tag": "p", "text": "Search \n                      for \" Glass, Philip \" on Web News Jobs"}, {"tag": "div", "text": "Sponsored \n              Links"}, {"tag": "p", "text": "JCWhitney.com -  carries  auto, truck, van \n                      and suv parts and accessories. Easy and secure online ordering \n                      and fast delivery nationwide."}, {"tag": "div", "text": "Featured \n              Topics"}, {"tag": "p", "text": "UK \n                            Music Resources Music \n                            Education Music \n                            Resources Classical \n                            Music Guide Classical \n                            Composer History Timelines"}, {"tag": "div", "text": "Early \n                              Music Baroque \n                              Music Classical \n                              Period Romantic \n                              Era Modern \n                              Period"}, {"tag": "p", "text": "Classical \n                            Music Record Companies Symphony \n                            Orchestras on the Web Classical \n                            Radio Stations"}, {"tag": "div", "text": "<a href=\"http://media.fastclick.net/w/click.here?sid=1371&m=3&pageid=1\"><img width=120\nheight=600 src=\"http://media.fastclick.net/w/get.media?sid=1371&m=3&d=s&v=1.0c&pageid=1\" border=0></a>"}, {"tag": "div", "text": "Shopping and Product Search Books Apparel Jewelry Classical music Popular Music Watches DVD's VHS Videos In Theaters Toys Baby Computer Hardware Computer & Video Games Electronics Photo Software Tools & Hardware Garden / Outdoor Living Kitchen Cell Phones & Service for"}, {"tag": "div", "text": "Search \n            the world for your music!"}, {"tag": "div", "text": "Site \n      Sponsors"}, {"tag": "div", "text": "Autos: Autobytel.com Books: Amazon Careers: HotJobs.com Car \n                  Parts: JCWhitney.com Catalog: Lands' \n                  End Clothes: Gap.com Computers: ShopIBM Jobs: FlipDog Travel: TravelNow"}, {"tag": "div", "text": "<a href=\"http://leader.linkexchange.com/66/X237788/clickle\" target=\"_top\"><img width=468 height=60 border=0 ismap alt=\"\" src=\"http://leader.linkexchange.com/66/X237788/showle?\"></a>"}, {"tag": "div", "text": "Site \n              Index: # A B C D E F G H I J K L M N O P Q R S T U V W X Y Z"}, {"tag": "div", "text": "Enter your \" City, State \", US Zip Code or ICAO :"}, {"tag": "div", "text": "Clothes Books Cameras Computers DVD Electronics Housewares Music Software Tools"}, {"tag": "div", "text": "Shopping and Product Search All products Books Apparel Jewelry Popular music Watches Classical music DVD's VHS Videos In Theaters Toys Baby Computer Hardware Computer & Video Games Electronics Photo Software Tools & Hardware Garden / Outdoor Living Kitchen Cell Phones & Service for"}, {"tag": "div", "text": "Angel/EMI Boxed Sets Decca Deutsche Grammophon ECM Store DVD-Audio Sheet Music"}, {"tag": "div", "text": "Shop for Classical \nMusic Ballet Opera Symphony Sacred Early Music Renaissance (c.1450-1600) Baroque (c.1600-1750) Classical (c.1770-1830) Romantic (c.1820-1910) Modern Period Arts/Entertainment | Autos | Books | Business | Colleges | Computers/Internet | Health | Home/Garden | Jobs News/Media | Recreation | Reference | Regional | Science | Shopping | Society/Culture | Sports | Travel | World Advertise | Feedback | Contact \n      us Our Story | Privacy \n\n    Policy | Terms and Conditions Copyright © 1997-2005 SearchBeat, All Rights Reserved"}]}
{"file_number": "115", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "div", "text": "You are here: About > Business & Finance > Mutual Funds Mutual Funds Business & Finance Mutual Funds Essentials Before You Buy Mutual Funds Mutual Fund FAQs Top 10 Funds of 2006 Mutual Funds 101 Email Course Risk Tolerance Quiz Topics Mutual Funds 101 401k Bond Funds ETFs Fund Families Fund Fees Hedge Funds History Index Funds Investment Fraud Mutual Fund Tools No Load Types of Funds Investing Humor & Games Psychology Buyer's Guide Before You Buy Top Picks Top Investment Calculators John Bogle Books Financial Software Product Reviews Tools Find a Job Get a Quote Mortgage Loans Online Degrees Yellow Pages Forums Most Popular Articles Latest Articles Help Newsletters & RSS Email to a friend Digg this story"}, {"tag": "p", "text": "Maximize 401k Matching Different Kinds of Mutual Funds Power of Compounding Interest"}, {"tag": "h5", "text": "Elsewhere on the Web"}, {"tag": "p", "text": "The Millionaire Next Door The Millionaire Code The One Minute Millionaire"}, {"tag": "p", "text": "401k Contribution Limits 2006 401k Contribution Limits 2007 401k Contribution Limits Stock Market Holidays NYSE Holidays"}, {"tag": "h5", "text": "Related Sites"}, {"tag": "p", "text": "Stocks Retirement Planning Economics Investing for Beginners Tax Planning: U.S."}, {"tag": "p", "text": "Maximize 401k Matching Different Kinds of Mutual Funds Power of Compounding Interest"}, {"tag": "h5", "text": "Elsewhere on the Web"}, {"tag": "p", "text": "The Millionaire Next Door The Millionaire Code The One Minute Millionaire"}, {"tag": "h5", "text": "Related Articles"}, {"tag": "p", "text": "What it Takes To Become a Millionaire | Become a Millio... Do You Want to be a Millionaire? Save Money on Your Home Expenses Save Money on Your Home Expenses Traditional vs. Roth IRA"}, {"tag": "h5", "text": "Hot Gadget Videos"}, {"tag": "p", "text": "Shopping for a Digital Camera Choosing an MP3 Player Portable Video Players Choosing a Cell Phone Choosing a DVR"}, {"tag": "h5", "text": "What's Hot"}, {"tag": "p", "text": "Fund Style Definition of Turnover Ratio Load Defined Financial Tight-wad Test Where to Buy Mutual Funds"}, {"tag": "div", "text": "All Topics | Email Article | | Advertising Info | News & Events | Work at About | SiteMap | Reprints | Help Our Story | Be a Guide User Agreement | Ethics Policy | Patent Info. | Privacy Policy ©2006 About, Inc., Apart of The New York Times Company . All rights reserved."}]}
{"file_number": "116", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""}, {"tag": "div", "text": "Masters and Workers - Labour relations in ancient Egypt: The master - a self-image of benevolence, The voice of the workers, The treatment of the corvée workers, Corporal punishment, Abuse and harassment <a href=\"../../ifwindow.htm\" target=\"_blank\">Search (new window)</a> Printout For best results save the whole page (pictures included) onto your hard disk, open the page with Word 97 or higher, edit if necessary and print."}, {"tag": "div", "text": "Wages and prices Index of Topics Main Index and Search Page Offsite links (Opening a new window) These are just suggestions for further reading. Ido not assume any responsibility for the availability or content of these websites. [4] Voices from Ancient Egypt Feedback: Please report broken links, mistakes - factual or otherwise, etc. to me .   Thanks."}, {"tag": "div", "text": "© August 2000 Minor updates: November 2006 November, August, May 2005 November, January 2004 December 2002"}]}
{"file_number": "117", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\""}, {"tag": "div", "text": "Stanford\n        Report, January 31, 2001"}]}
{"file_number": "118", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\""}, {"tag": "div", "text": "CATEGORIES TV RADIO COMMUNICATE WHERE I LIVE INDEX SEARCH"}, {"tag": "div", "text": "You are in: Scotland"}, {"tag": "div", "text": "News Front Page World UK England N Ireland Scotland Wales Politics Business Entertainment Science/Nature Technology Health Education ------------- Talking Point ------------- Country Profiles In Depth ------------- Programmes ------------- SERVICES Daily E-mail News Ticker Mobile/PDAs ------------- Text Only Feedback Help EDITIONS Change to World"}, {"tag": "div", "text": "WATCH/LISTEN ON THIS STORY The BBC's Nigel Robson \"Thick smoke and sparks swirled over the city centre\" Tom Monro, Lothian and Borders Fire Brigade \"It's been a very difficult, complex fire\""}, {"tag": "div", "text": "See also: 07 Dec 02 | Scotland Union backs fire strike 08 Dec 02 | Scotland Fire ravages city's historic centre 17 Oct 02 | Scotland Tourist plan for 'haunted' lane 17 Apr 01 | Scotland Castle ghost hunt's 'curious' findings Internet links: Edinburgh Old Town City of Edinburgh Council The BBC is not responsible for the content of external internet sites Top Scotland stories now: Officer faces harbour death hearing Minister grilled on fish catches For Altnaharra read Sahara University seeks to broaden appeal Dancers urged to make the leap Teenagers admit festival violence Court hears 'secret society' claims Programme an auction winner Links to more Scotland stories are at the foot of the page. E-mail this story to a friend Links to more Scotland stories In This Section Officer faces harbour death hearing Minister grilled on fish catches For Altnaharra read Sahara University seeks to broaden appeal Dancers urged to make the leap Teenagers admit festival violence Court hears 'secret society' claims Programme an auction winner Lawyer admits stealing 500,000 Most common surnames revealed Fifth of gay people are parents Man dies after NZ jetty dive Skye gets brand identity Child protection challenge Concern over scrutiny time Call for tougher phone mast rules Elderly sisters in road tragedy BBC Scotland - News On Air BBC Scotland - Politics On Air ^^ Back to top"}, {"tag": "div", "text": "News Front Page | World | UK | England | N Ireland | Scotland | Wales | Politics | Business | Entertainment | Science/Nature | Technology | Health | Education | Talking Point | Country Profiles | In Depth | Programmes"}, {"tag": "div", "text": "---------------------------------------------------------------------------------- To BBC Sport>> | To BBC Weather>> | To BBC World Service>> ---------------------------------------------------------------------------------- © MMIII | News Sources | Privacy"}]}
{"file_number": "119", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\" bbc.co.uk"}, {"tag": "p", "text": "Accessibility Links"}, {"tag": "div", "text": "Skip to content Skip to bbc.co.uk navigation Skip to search Access keys help"}, {"tag": "h2", "text": "bbc.co.uk Navigation"}, {"tag": "div", "text": "Search Home TV Radio Talk Where I Live A-Z Index UK version International version | About the versions Low graphics | Accessibility help"}, {"tag": "div", "text": "BBC News in video and audio News services Your news when you want it"}, {"tag": "div", "text": "News Front Page World UK England Northern Ireland Scotland Wales Business Politics Health Education Science/Nature Technology Entertainment ----------------- Have Your Say Magazine In Pictures Country Profiles Special Reports Programmes RELATED BBC SITES SPORT WEATHER CBBC NEWSROUND ON THIS DAY EDITORS' BLOG"}, {"tag": "div", "text": "Last Updated: Monday, 2 May, 2005, 10:09 GMT 11:09 UK"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "ASIAN GIANTS' TROUBLED TIES KEY STORIES Japan-China talks on shared past First China visit for Japan's Abe Abe works on neighbourly ties Row stirs Japanese concern Japan's past and future BACKGROUND Uneasy neighbours History and analysis of China and Japan's difficult relationship Japan's controversial shrine The Rape of Nanjing IN PICTURES Beijing voices Views from Japan HAVE YOUR SAY China Japan meeting: Your views TOP HAVE YOUR SAY STORIES James Brown: Your memories Is the fox hunting ban working? What are your wishes for 2007?"}, {"tag": "h4", "text": "PRODUCTS AND SERVICES"}, {"tag": "div", "text": "E-mail news Mobiles Alerts News feeds Interactive TV Podcasts News Front Page | World | UK | England | Northern Ireland | Scotland | Wales | Politics Business | Entertainment | Science/Nature | Technology | Health | Education Have Your Say | Magazine | In Pictures | Week at a Glance | Country Profiles | In Depth | Programmes BBC Copyright Notice Back to top ^^ Help Privacy and cookies policy News sources About the BBC Contact us"}]}
{"file_number": "120", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\" bbc.co.uk"}, {"tag": "p", "text": "Accessibility Links"}, {"tag": "div", "text": "Skip to content Skip to bbc.co.uk navigation Skip to search Access keys help"}, {"tag": "h2", "text": "bbc.co.uk Navigation"}, {"tag": "div", "text": "Search Home TV Radio Talk Where I Live A-Z Index UK version International version | About the versions Low graphics | Accessibility help"}, {"tag": "div", "text": "BBC News in video and audio News services Your news when you want it"}, {"tag": "div", "text": "News Front Page World UK England Northern Ireland Scotland Wales Business Politics Health Education Science/Nature Technology Entertainment ----------------- Have Your Say Magazine In Pictures Country Profiles Special Reports Programmes RELATED BBC SITES SPORT WEATHER CBBC NEWSROUND ON THIS DAY EDITORS' BLOG"}, {"tag": "div", "text": "Last Updated: Thursday, 30 June, 2005, 13:27 GMT 14:27 UK"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "RELATED INTERNET LINKS: Centre for Social Justice The BBC is not responsible for the content of external internet sites TOP POLITICS STORIES Iran calls in UK envoy over Blair Prescott 'unwell' over Christmas Tories release 'key Britons' list"}, {"tag": "h4", "text": "PRODUCTS AND SERVICES"}, {"tag": "div", "text": "E-mail news Mobiles Alerts News feeds Interactive TV Podcasts News Front Page | World | UK | England | Northern Ireland | Scotland | Wales | Politics Business | Entertainment | Science/Nature | Technology | Health | Education Have Your Say | Magazine | In Pictures | Week at a Glance | Country Profiles | In Depth | Programmes BBC Copyright Notice Back to top ^^ Help Privacy and cookies policy News sources About the BBC Contact us"}]}
{"file_number": "121", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\" bbc.co.uk"}, {"tag": "p", "text": "Accessibility Links"}, {"tag": "div", "text": "Skip to content Skip to bbc.co.uk navigation Skip to search Access keys help"}, {"tag": "h2", "text": "bbc.co.uk Navigation"}, {"tag": "div", "text": "Search Home TV Radio Talk Where I Live A-Z Index UK version International version | About the versions Low graphics | Accessibility help"}, {"tag": "div", "text": "BBC News in video and audio News services Your news when you want it"}, {"tag": "div", "text": "News Front Page World Africa Americas Asia-Pacific Europe Middle East South Asia UK England Northern Ireland Scotland Wales Business Politics Health Education Science/Nature Technology Entertainment ----------------- Have Your Say Magazine In Pictures Country Profiles Special Reports Programmes RELATED BBC SITES SPORT WEATHER CBBC NEWSROUND ON THIS DAY EDITORS' BLOG LANGUAGES Arabic Persian Turkish More"}, {"tag": "div", "text": "Last Updated: Saturday, 14 May 2005, 14:17 GMT 15:17 UK"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "IRAN NUCLEAR CRISIS KEY STORIES Council given new draft over Iran Paris talks can't reach Iran deal 'No proof' of Iran nuclear arms Russia queries EU draft on Iran ANALYSIS AND BACKGROUND Nuclear stand-offs 2007 will see further confrontation with Iran and North Korea Q&Anuclear row Quick guide: Iran nuclear crisis Is Iran just boasting? The gulf with the US Iran's key nuclear sites Iran: Energy overview Q&A: Nuclear disarmament CLICKABLE GUIDES From atom to bomb Who runs Iran HAVE YOUR SAY Iran's influence in the Middle East IN DEPTH Inside Iran - special report RELATED INTERNET LINKS: Non-Proliferation Treaty International Atomic Energy Agency The BBC is not responsible for the content of external internet sites TOP MIDDLE EAST STORIES Death sentence for Saddam upheld Dozens killed by Baghdad blasts Gaza rocket injures two Israelis"}, {"tag": "h4", "text": "PRODUCTS AND SERVICES"}, {"tag": "div", "text": "E-mail news Mobiles Alerts News feeds Interactive TV Podcasts News Front Page | World | UK | England | Northern Ireland | Scotland | Wales | Politics Business | Entertainment | Science/Nature | Technology | Health | Education Have Your Say | Magazine | In Pictures | Week at a Glance | Country Profiles | In Depth | Programmes BBC Copyright Notice Back to top ^^ Help Privacy and cookies policy News sources About the BBC Contact us"}]}
{"file_number": "122", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\" Home News Sport Radio TV Weather Languages UK version International version | About the versions Low graphics | Accessibility help"}, {"tag": "div", "text": "BBC News in video and audio News services Your news when you want it"}, {"tag": "div", "text": "News Front Page Africa Americas Asia-Pacific Europe Middle East South Asia UK Business Market Data Economy Companies Health Science/Nature Technology Entertainment ----------------- Have Your Say In Pictures Country Profiles Special Reports Programmes RELATED BBC SITES SPORT WEATHER ON THIS DAY EDITORS' BLOG"}, {"tag": "div", "text": "Last Updated: Monday, 6 September, 2004, 14:41 GMT 15:41 UK"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "E-mail this to a friend Printable version"}, {"tag": "div", "text": "LIBYA COMES IN FROM THE COLD KEY STORIES Libya HIV medics retrial resumes Libyan aviation ready for take-off Libya welcomes new US relations Libya fears for its stolen heritage BACKGROUND AND ANALYSIS Gaddafi's Libya How the veteran leader's rule has shaped a nation Ahistory of Libya's US ties Washington's Libyan fairy tale Colonel gets his reward Country profile: Libya RELATED INTERNET LINKS: Colonel Gaddafi's official website The BBC is not responsible for the content of external internet sites TOP BUSINESS STORIES Georgia in gas deal with Turkey Court halves Exxon spill damages US consumer spending posts rise"}, {"tag": "h4", "text": "PRODUCTS AND SERVICES"}, {"tag": "div", "text": "E-mail news Mobiles Alerts News feeds Podcasts News Front Page | Africa | Americas | Asia-Pacific | Europe | Middle East | South Asia UK | Business | Entertainment | Science/Nature | Technology | Health Have Your Say | In Pictures | Week at a Glance | Country Profiles | In Depth | Programmes BBC Copyright Notice Back to top ^^ Help Privacy and cookies policy News sources About the BBC Contact us"}]}
{"file_number": "123", "non_ground_truth": [{"tag": "div", "text": "Log in | Sign up Why join? Remember me | Forgot password? Welcome ( log out ) View profile Search: News All CNET The Web Advanced search Today on CNET Reviews News Downloads Tips & Tricks CNET TV Compare Prices Today on News | Business Tech | Cutting Edge | Access | Threats | Media 2.0 | Markets | Digital Life | Blogs | Extra | My News | RSS"}, {"tag": "h4", "text": "Now on News.com:"}, {"tag": "div", "text": "Year in review: Social networking catches fire How Ihelped Spider-Man save Santa Claus Crave: Digital pets for the dateless Extra: Most memorable ads of 2006 Video: Goofiest tech moves of '06"}, {"tag": "div", "text": "CONTINUED Page 1 | 2 TalkBack E-mail Print del.icio.us Digg this"}, {"tag": "h3", "text": "Read more on this story's topics and companies"}, {"tag": "div", "text": "Add to My News | Create an alert Open source Add to My News | Create an alert Linux Add to My News | Create an alert Unix Add to My News | Create an alert Operating systems Add to My News | Create an alert Software Add to My News | Create an alert Sun Microsystems Inc Add to My News | Create an alert Red Hat Inc Add to My News | Create an alert Novell Inc Add to My News | Create an alert Intel Corp Add to My News | Create an alert Intl Business Machines Corp Add to My News | Create an alert Hewlett-packard"}, {"tag": "h3", "text": "TalkBack"}, {"tag": "p", "text": "No discussion exists, click here to start it ."}, {"tag": "div", "text": "<SCRIPT LANGUAGE=\"JavaScript\" SRC=\"http://ad.uk.doubleclick.net/adj/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\"></SCRIPT>\n <NOSCRIPT>\n  <A HREF=\"http://adlog.com.com/adlog/c/r=8830&s=650633&t=2006.12.27.00.04.06&o=1001:7344:&h=cn&p=2&b=5&l=en_US&site=3&pt=2100&nd=7344&pid=&cid=5475182&pp=100&e=3&rqid=01c18-ad-e445744A9813BC47B9/http://ad.uk.doubleclick.net/jump/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\"><IMG SRC=\"http://ad.uk.doubleclick.net/ad/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\" BORDER=\"0\" WIDTH=\"300\" height=\"250\"></A>\n </NOSCRIPT> Related stories"}, {"tag": "h4", "text": "Related news"}, {"tag": "div", "text": "Sun plans patent protection for open-source Solaris November 18, 2004 'Open Source Solaris' to debut this year September 13, 2004 Netscape now--for free January 22, 1998 Get this story's \"Big Picture\" >"}, {"tag": "h4", "text": "Related videos"}, {"tag": "div", "text": "Amid the many, start-ups to look out for November 8, 2006 Adobe CEO Bruce Chizen speaks on Apollo November 8, 2006 CEO Jeff Bezos says Web services will be a 'meaningful business' November 8, 2006 Watch more videos >"}, {"tag": "h5", "text": "From News.com Extra"}, {"tag": "div", "text": "Test drive Solaris 10 for free from OSNews Can Solaris 10 Make Sun Shine Again? from BusinessWeek Solaris attempts sunshine for tenth time from the INQUIRER Sun stares down Red Hat with Solaris 10 from The Register Get more news around the Web with News.com Extra >"}, {"tag": "h5", "text": "Related white papers"}, {"tag": "div", "text": "Top Ten Considerations for Choosing a Server Virtualization Technology SWsoft An Introduction to OS Virtualization and Virtuozzo SWsoft Virtualizing High Network I/O Environments SWsoft HP Integrity Essentials: Management Solutions for HP Integrity Servers Hewlett-Packard HP-UX 11i - Approaching a Virtualized IT World With Confidence Hewlett-Packard More results for open source >"}, {"tag": "h3", "text": "Resource center from News.com sponsors"}, {"tag": "h4", "text": "Aligning CIO & CEO visions"}, {"tag": "h5", "text": "What CIOs need to know"}, {"tag": "p", "text": "It's a simple truth. The closer you and your CEO see things, the greater your chance for success. Our exclusive report can help you get there—and help your business grow. Get the report featuring the views of 765 CEOs on innovation. learn more"}, {"tag": "div", "text": "What CEOs think: Innovation Insights for CIOs Learn How CIOs can deliver strategic success for their enterprises The New CIO:  Beyond Technology Learn how CIOs become heroes Podcast:  Chris Gorog of Napster Learn about the impact of technology in strategy execution The future of the Enterprise Read more about tomorrow's organization CIO Vision Series:Innovating within a retail industry disrupted by the Web Video: CIO of Virgin Entertainment Group, Robert Fort CIO Vision Series: Innovating around social search Video: Yahoo CIO Lars Rabbe"}, {"tag": "h3", "text": "Top picks from News.com readers"}, {"tag": "div", "text": "Sun considers GPL for Solaris More Info"}, {"tag": "h3", "text": "Markets"}, {"tag": "p", "text": "Market news, charts, SEC filings, and more"}, {"tag": "h4", "text": "Related quotes"}, {"tag": "div", "text": "Sun Microsystems Inc 5.51 0.05 (0.92%) Red Hat Inc 16.22 0.00 (0.00%) Novell Inc 6.25 0.11 (1.79%) Intel Corp 20.15 0.07 (0.35%) International Business Machines 95.66 0.41 (0.43%) HEWLETT PACKARD CO 40.93 0.30 (0.74%) DJIA 12,407.63 64.41 (0.52%) S&P 500 1,416.90 6.14 (0.44%) NASDAQ 2,413.51 12.33 (0.51%) CNET TECH 1,590.52 7.81 (0.49%)"}, {"tag": "div", "text": "Symbol Lookup <SCRIPT TYPE=\"text/javascript\" LANGUAGE=\"JavaScript\" SRC=\"http://ad.uk.doubleclick.net/adj/us.houseads.zdnet.co.uk/techrepublic;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\"></SCRIPT>\n <NOSCRIPT>\n  <A HREF=\"http://adlog.com.com/adlog/c/r=8830&s=653851&t=2006.12.27.00.04.06&o=1001:7344:&h=cn&p=2&b=5&l=en_US&site=3&pt=2100&nd=7344&pid=&cid=5475182&pp=200&e=3&rqid=01c18-ad-e745744B041470C84D/http://ad.uk.doubleclick.net/jump/us.houseads.zdnet.co.uk/b2b;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\"><IMG SRC=\"http://ad.uk.doubleclick.net/ad/us.houseads.zdnet.co.uk/b2b;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.06?\" BORDER=\"0\" WIDTH=\"300\" height=\"250\"></A>\n </NOSCRIPT> Site map | Help center | Corrections | Newsletters | Send tips | News.com mobile | Content licensing | RSS feeds | Search: News All CNET The Web Popular topics: Camcorders | Desktops | DVD Players | Internet Explorer 7 | iPod Nano | iPod Shuffle | Nikon D80 | Notebooks | Projectors | Speed Test | Web Hosting Today on CNET | Reviews | News | Compare prices | Tips & Tricks | Downloads | CNET TV Popular on CNET Networks: PS3 | Wii | Xbox 360 | Pussycat Dolls | Free Music Videos | TV Listings | Prison Break | Game Cheats About CNET Networks | Jobs | Advertise | Partnerships | Site map Copyright ©2006 CNET Networks, Inc. All rights reserved. Privacy policy | Terms of use"}]}
{"file_number": "124", "non_ground_truth": [{"tag": "div", "text": "Log in | Sign up Why join? Remember me | Forgot password? Welcome ( log out ) View profile Search: News All CNET The Web Advanced search Today on CNET Reviews News Downloads Tips & Tricks CNET TV Compare Prices Today on News | Business Tech | Cutting Edge | Access | Threats | Media 2.0 | Markets | Digital Life | Blogs | Extra | My News | RSS"}, {"tag": "h3", "text": "News.com Poll"}, {"tag": "div", "text": "Do you agree with the Supreme Court decision in the Grokster case?"}, {"tag": "div", "text": "special coverage File-swap fallout Read all of News.com's stories on the Supreme Court's landmark decision and how it affects companies such as Grokster."}, {"tag": "div", "text": "TalkBack E-mail Print del.icio.us Digg this"}, {"tag": "h3", "text": "Read more on this story's topics and companies"}, {"tag": "div", "text": "Add to My News | Create an alert Digital rights management (DRM) Add to My News | Create an alert Copyright Add to My News | Create an alert Peer to peer Add to My News | Create an alert Lawsuits 106 comments Post a comment"}, {"tag": "h3", "text": "TalkBack"}, {"tag": "h4", "text": "This is not about copyright infringement"}, {"tag": "p", "text": "Cat Wild Jun 28, 2005, 5:13 PM PDT"}, {"tag": "p", "text": "Cat Wild Jun 28, 2005, 4:49 PM PDT"}, {"tag": "h4", "text": "Effects on BitTorrent?"}, {"tag": "p", "text": "Michael Basil Jun 28, 2005, 11:41 AM PDT"}, {"tag": "h4", "text": "Boycott the RIAA and others of their ilk"}, {"tag": "p", "text": "J Tzu Jun 28, 2005, 9:48 AM PDT"}, {"tag": "h4", "text": "Gun makers still not held responsible"}, {"tag": "p", "text": "bobby_brady Jun 28, 2005, 8:45 AM PDT"}, {"tag": "h4", "text": "What does this ruling do to Tivo like devices?"}, {"tag": "p", "text": "bobby_brady Jun 28, 2005, 8:42 AM PDT"}, {"tag": "h4", "text": "Only a fool... Or, someone who lives in a vacuum..."}, {"tag": "p", "text": "Raife Jun 28, 2005, 3:59 AM PDT"}, {"tag": "h4", "text": "Mmmhmmm..."}, {"tag": "p", "text": "paintedover26k Jun 28, 2005, 1:44 AM PDT"}, {"tag": "h4", "text": "Does the same go for weapons manufacturers?"}, {"tag": "p", "text": "Ian Barnett Jun 28, 2005, 1:09 AM PDT"}, {"tag": "h4", "text": "TIme to SUE, Ye Haw."}, {"tag": "p", "text": "System Tyrant Jun 27, 2005, 8:24 PM PDT"}, {"tag": "h4", "text": "Perhaps..."}, {"tag": "p", "text": "techoguy Jun 27, 2005, 7:38 PM PDT"}, {"tag": "h4", "text": "Protect ISP's, shoot P2P networks?"}, {"tag": "p", "text": "Alexander Moore Jun 27, 2005, 4:08 PM PDT"}, {"tag": "h4", "text": "Look at the law, not your emotions..."}, {"tag": "p", "text": "rdean Jun 27, 2005, 3:32 PM PDT"}, {"tag": "h4", "text": "Glad to someone think' s right"}, {"tag": "p", "text": "Earl Jun 27, 2005, 3:14 PM PDT"}, {"tag": "h4", "text": "this ruling is good"}, {"tag": "p", "text": "Sam Papelbon Jun 27, 2005, 3:09 PM PDT"}, {"tag": "h4", "text": "Good"}, {"tag": "p", "text": "Earl Jun 27, 2005, 2:54 PM PDT"}, {"tag": "p", "text": "Lloyd Marion Jun 27, 2005, 2:44 PM PDT"}, {"tag": "h4", "text": "One of the best statements made."}, {"tag": "p", "text": "Earl Jun 27, 2005, 2:08 PM PDT"}, {"tag": "h4", "text": "One of the best statements made."}, {"tag": "p", "text": "Earl Jun 27, 2005, 2:07 PM PDT"}, {"tag": "h4", "text": "Very Good Statment"}, {"tag": "p", "text": "Earl Jun 27, 2005, 1:52 PM PDT"}, {"tag": "h4", "text": "That's just it!"}, {"tag": "p", "text": "Earl Jun 27, 2005, 1:29 PM PDT"}, {"tag": "h4", "text": "So should we hold music industry liable..."}, {"tag": "p", "text": "Adi None Jun 27, 2005, 1:21 PM PDT"}, {"tag": "h4", "text": "won't this affect the manufacturers of CD and DVD burning components?"}, {"tag": "p", "text": "Andy Melchior Jun 27, 2005, 12:44 PM PDT"}, {"tag": "h4", "text": "Typically shortsighted"}, {"tag": "p", "text": "Bill Dautrive Jun 27, 2005, 12:16 PM PDT"}, {"tag": "h4", "text": "Meaningless"}, {"tag": "p", "text": "Willie Winkie Jun 27, 2005, 11:59 AM PDT"}, {"tag": "div", "text": "Read more comments > <SCRIPT LANGUAGE=\"JavaScript\" SRC=\"http://ad.uk.doubleclick.net/adj/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.12?\"></SCRIPT>\n <NOSCRIPT>\n  <A HREF=\"http://adlog.com.com/adlog/c/r=8830&s=650633&t=2006.12.27.00.04.12&o=1023:1030:&h=cn&p=2&b=5&l=en_US&site=3&pt=2100&nd=1030&pid=&cid=5764135&pp=100&e=3&rqid=00c18-ad-e445744A98151D74B1/http://ad.uk.doubleclick.net/jump/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.12?\"><IMG SRC=\"http://ad.uk.doubleclick.net/ad/us.houseads.zdnet.co.uk/news;sz=300x250;ptile=1;dcopt=ist;ord=2006.12.27.00.04.12?\" BORDER=\"0\" WIDTH=\"300\" height=\"250\"></A>\n </NOSCRIPT> Related stories"}, {"tag": "h4", "text": "Related news"}, {"tag": "div", "text": "Supreme Court may redefine file swapping March 29, 2005 FAQ: Betamax--tech's favorite ruling March 28, 2005 P2P companies ask high court for help March 1, 2005 Judges rule file-sharing software legal August 19, 2004 Get this story's \"Big Picture\" >"}, {"tag": "h4", "text": "Related videos"}, {"tag": "div", "text": "\"Anytime change is required, some people will resist it\" October 23, 2006 Trials and tribulations of being a female CEO in a man's world October 20, 2006 From secretary to CEO and beyond, it's been a long ride October 20, 2006 Watch more videos >"}, {"tag": "h5", "text": "From News.com Extra"}, {"tag": "div", "text": "Waiting for Grokster from Technology Review As Grokster Decision Nears, Hollywood Talks Tough from InternetNews.com File-Sharing Is the Latest Battleground in the Clash of Technology and Copyright from The New York Times Get more news around the Web with News.com Extra >"}, {"tag": "h5", "text": "Related white papers"}, {"tag": "div", "text": "How To Use the Six Laws of Persuasion during a Negotiation Global Knowledge Network Settling Conflict Without Drawing Blood - Use Mediation EzineArticles.com Enhancing Corporate Governance for Banking Organisations Bank for International Settlements New HSR Rules Regarding the Treatment of Unincorporated Entities White & Case The SEC's Bid to Re-Engineer Corporate Culture White & Case More results for copyright >"}, {"tag": "h3", "text": "Resource center from News.com sponsors"}, {"tag": "h4", "text": "Aligning CIO & CEO visions"}, {"tag": "h5", "text": "What CIOs need to know"}, {"tag": "p", "text": "It's a simple truth. The closer you and your CEO see things, the greater your chance for success. Our exclusive report can help you get there—and help your business grow. Get the report featuring the views of 765 CEOs on innovation. learn more"}, {"tag": "div", "text": "What CEOs think: Innovation Insights for CIOs Learn How CIOs can deliver strategic success for their enterprises The New CIO:  Beyond Technology Learn how CIOs become heroes Podcast:  Chris Gorog of Napster Learn about the impact of technology in strategy execution The future of the Enterprise Read more about tomorrow's organization CIO Vision Series:Innovating within a retail industry disrupted by the Web Video: CIO of Virgin Entertainment Group, Robert Fort CIO Vision Series: Innovating around social search Video: Yahoo CIO Lars Rabbe"}, {"tag": "h3", "text": "Top picks from News.com readers"}, {"tag": "p", "text": "Readers who read Supreme Court rules against file swapping also read..."}, {"tag": "p", "text": "Market news, charts, SEC filings, and more"}, {"tag": "h4", "text": "Related quotes"}, {"tag": "div", "text": "DJIA 12,407.63 64.41 (0.52%) S&P 500 1,416.90 6.14 (0.44%) NASDAQ 2,413.51 12.33 (0.51%) CNET TECH 1,590.52 7.81 (0.49%)"}, {"tag": "div", "text": "Symbol Lookup <a href=\"http://adlog.com.com/adlog/e/r=8034&s=690000&t=2006.12.27.00.04.12&o=1023:1030:&h=cn&p=2&b=5&l=en_US&site=3&pt=2100&nd=1030&pid=&cid=5764135&pp=200&e=3&rqid=00c18-ad-e445744A98151D74B7&event=58/http://altfarm.mediaplex.com/ad/ck/42897?mpt=2006.12.27.00.04.12\"><img src=\"http://altfarm.mediaplex.com/ad/!bn/42897?mpt=2006.12.27.00.04.12\" alt=\"Click this Mojo Ad\" border=\"0\"></a> Site map | Help center | Corrections | Newsletters | Send tips | News.com mobile | Content licensing | RSS feeds | Search: News All CNET The Web Popular topics: Camcorders | Desktops | DVD Players | Internet Explorer 7 | iPod Nano | iPod Shuffle | Nikon D80 | Notebooks | Projectors | Speed Test | Web Hosting Today on CNET | Reviews | News | Compare prices | Tips & Tricks | Downloads | CNET TV Popular on CNET Networks: PS3 | Wii | Xbox 360 | Pussycat Dolls | Free Music Videos | TV Listings | Prison Break | Game Cheats About CNET Networks | Jobs | Advertise | Partnerships | Site map Copyright ©2006 CNET Networks, Inc. All rights reserved. Privacy policy | Terms of use"}]}
{"file_number": "125", "non_ground_truth": [{"tag": "div", "text": "Does your firm have a requirement for content -- for the Web, e-mail or printed customer publications? VISIT our corporate services web site.. ElectricNews.Net delivers thousands of customised e-mail alerts every\n\nday -- the perfect opportunity to reach Ireland's top decision-makers\n\nin business and IT.\n\nFor details on how you can sponsor ENN ALERTS, e-mail us at: ralph@electricnews.net"}, {"tag": "div", "text": "SEARCH THE ENN NEWS ARCHIVE *When searching, all docs with words you enter will appear *Put a \"-\" in front of words which must not appear. *For phrases enclose in \"double quotes\""}, {"tag": "div", "text": "Did you know that you can add our breaking news headlines to your Web site, for FREE? CLICK HERE Enter your email address below to receive the digest in your inbox each week: Add Remove Send as HTML 2002 Best Inventions Web Site"}, {"tag": "p", "text": "This site is actually a sub-site of TIME magazine. It's truly a\n\ngeek's playground, with 100 of the best inventions from 2002 \n\nlisted in six different categories. Ijust can't decide between \n\nthe Phone Tooth, the Mini Sub, and the Wheelman -- a sort of \n\nclown-sized motorbike you steer like a skateboard. Then again, \n\nthe Dog Translator might come in handy too..."}, {"tag": "div", "text": "To suggest Web sites for Pick of the Web mail us at Reviews Click here to view Archived Issues"}, {"tag": "p", "text": "Products Access Voice Internet Content hosting eBusiness/eGov"}, {"tag": "div", "text": "ElectricNews.Net Ltd, 4 Lower Hatch St., Dublin 2, Ireland tel: +353 1 676 9995"}, {"tag": "div", "text": "Email the ENN Weekly Digest to a friend"}, {"tag": "div", "text": "Fluke Networks, addressing network issues With modern network designs becoming more sophisticated Fluke Networks aims to bring network professionals up to speed on appropriate network analysis tools and how to use them. More... Conor O'Connor, CEO of Enterprise Equity In the last two years, small tech firms have complained about the lack of venture capital in Ireland compared to the heady days of 2000. But when he spoke face to face with Matthew Clark, Conor O'Connor -- the man with the memorable name -- said the cash is there for the taking, if a company has the right plans. More..."}, {"tag": "p", "text": "9 OCTOBER Distributed Network Analysis Workshop \n\nCity West Hotel, Saggart, Co Dublin 10 OCTOBER The Impact of Changing Global Markets on Supply Chain Activities \n\nSerCom Solutions, Raheen Business Park, Limerick 14 OCTOBER Mobile Computing -- Understanding the Risks with Wireless and \n\nHome Working \n\nBelfast Hilton Hotel, Belfast 16 OCTOBER eSecurity 2003 -- \"Room for Improvement\"\n\nBerkeley Court Hotel, Ballsbridge, Dublin 4 16 - 17 OCTOBER Broadband and wLANs for Connected Communities\n\nCaherciveen, Co. Kerry For more information on the above events go to the ENN Events Directory . To get your event featured in the Digest and on ENN, contact Sylvia"}, {"tag": "div", "text": "NEED HELP WITH PUBLIC RELATIONS? ElectricNews.Net features Ireland's *only* full on-line directory of public relations.\n\nUse it to find: * IT SPECIALIST * GENERAL PR FIRM If your PR firm isn't listed, it should be! For details on how to join WHO'S WHO IN PR call Sylvia at +353(0)1 676 9995 or send an e-mail"}, {"tag": "div", "text": "Published by ElectricNews Ltd Copyright  2003 ElectricNews.Net Ltd. All rights reserved. Legal Notice Your use of this web site is subject to our terms and conditions, and by using this service you are agreeing, and you are signifying your agreement, to be bound by these terms and conditions . Reference to ENN in these terms and conditions of use refers to ElectricNews.Net Limited. TELL A FRIEND"}, {"tag": "div", "text": "Created with Newsweaver"}]}
{"file_number": "126", "non_ground_truth": [{"tag": "h5", "text": "Home | Personnel | Commodities | Newsletters | Downloads | Links | Feedback | ASU Campuses |"}]}
{"file_number": "127", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis!"}, {"tag": "p", "text": "Those who eat their fill speak to the hungry of the wonderful times to come"}, {"tag": "h6", "text": "email me Links"}, {"tag": "div", "text": "No Corridor Notes WSLCReports NW Portal Wikipedia DFA-Bellingham Cursor News Patrol D-Kos TPmemo Atrios Orcinus Juan Cole Narconews Narcosphere SalonChingon TalkLeft PacificViews Pol.Animal Counterpunch Wonkette RiverBend Dahr Jamail OpTruth Direland D.Sirota PressThink Mediacitizen Digby PRWatch SmartMeme BAGnews DemCtr-Bolivia Blog4America JubileePlus PublicIntegrity TNI ProtectBloggers ThirdWorldNetwork TWNSO KarmaBanque Havens TFrank ISS Indyvoter CAP Ruy Texeira Colorlines Monthly Review Red Pepper LeMondeDiplo Moving Ideas OrganizeNow CDI AudioActivism ACarvin NSArchives"}, {"tag": "h6", "text": "Labor&Economics"}, {"tag": "div", "text": "Submerging Markets DeLong NNewman D&S ILCA Solidarity Labor Notes LBObserver PCUN JWJ MunicipalServiceProj PSIRU Unite to Win WorkingLife CEPR EPI RoubiniGlobal BrettonWoodsProj UnionsFirmsMarkets AsianLabour LaborWatch LaborProf RawBlogExport ReformAFLCIO WorkPlaceFairness AFGE YourWorthMore TDU ConfinedSpace CapitalSpectator GlobalizeThis!"}, {"tag": "div", "text": "IndyRadio MediaMattersRadio LBORadio RadioProject DemocracyNow AirAmericaRadio KBOO-Portland CoopRadio KSER"}, {"tag": "div", "text": "Idealist UnionJobs ECitizenjobs OrionJobs EcoTrustJobs SustainableJobs OrganizerJobBank"}]}
{"file_number": "128", "non_ground_truth": [{"tag": "p", "text": "© 1996-1999 The Materials Research Society"}]}
{"file_number": "129", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? BlogThis!"}, {"tag": "div", "text": "This work is licensed under a Creative Commons License . The Cast of Characters Today I'm feeling: a bit of culture, a bit of music Boyfriends vs boy friends \"we don’t think clients are God\" child support my heart's desire advocacy skills Intolerable tollerance lessons birthday parties, girly nights and refugee benefits Women in Docs getting where you're going"}, {"tag": "h2", "text": "Brisbane bands/ musicians Ilike: Acre AfroDizziAct The Boat People Charles Foster Kane Dave McCormack Doch george Guy Webster The Informants Lancaster Shifter Speedstar Taxi Tylea Women in Docs Zephyr Timbre [if no website, try brispop.com (link below) for info] Other bands/ musicians Ilike: Augie March Ben Folds / Ben Folds Five Damien Rice The Frames Jeff Buckley Matthew Sweet Mercury Rev Sarah McLachlan Suede + many more Links to music sites Ilike: BrisPop - lists local artists, venues and gigs Rockinghorse - music store in Brisbane Skinnys - music store in Brisbane Rics - one of my favourite venues The Zoo - one of my favourite venues Blogs Iread Non blo.gs blogs:"}, {"tag": "div", "text": "Any Resemblance Diary of an Average Australian Kangaroo Court Stay of Execution ‹‹ # Women \n    of Oz ? ›› Who Links Here"}, {"tag": "p", "text": "Post a Comment << Home"}]}
{"file_number": "130", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "p", "text": "Skip to main content"}, {"tag": "div", "text": "Go to: Guardian Unlimited home UK news World news Comment is free blog Newsblog Sport blog arts & entertainment blog Podcasts ---------------------- Archive search Arts and entertainment Books Business EducationGuardian.co.uk Environment Film Football Jobs Life and health MediaGuardian.co.uk Money Music The Observer Politics Science Shopping SocietyGuardian.co.uk Sport Talk Technology Travel Been there ---------------------- Audio Email services Special reports The Guardian The northerner The wrap ---------------------- Advertising guide Crossword Events / offers Feedback Garden centre GNM press office Graduate GuardianFilms Headline service Help / contacts Information Living our values Newsroom Notes & Queries Reader Offers Soulmates dating Style guide Syndication services Travel offers TV listings Weather Web guides Working for us ---------------------- Guardian Abroad Guardian Monthly Guardian Weekly Money Observer Public Learn Guardian back issues Observer back issues Guardian Professional <a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Observer&amp;section=110863&amp;country=(none)&amp;rand=5104361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Observer&amp;section=110863&amp;country=(none)&amp;rand=5104361\"\n\t\t\t\t\t\twidth=\"468\"\n\t\t\t\t\t\theight=\"60\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a> Read today's paper · Jobs"}, {"tag": "div", "text": "Search: Guardian Unlimited Web Home UK news World news Politics Business & Media Comment & Leaders Focus 7 Days Sport Review Travel Cash Observer Woman The Observer Magazine Food Music"}, {"tag": "div", "text": "Tools Text-only version Send it to a friend Save story The Observer Front page Story index The Guardian Front page Story index"}, {"tag": "div", "text": "Search executive jobs Search all jobs Observer Comment Extra"}, {"tag": "div", "text": "Special reports Iraq crisis: Observer special Special report: Iraq Special report: the anti-war movement Observer Worldview Exclusive: UN dirty tricks 02.03.2003: Revealed: US dirty tricks to win vote on Iraq war 02.03.2003: Bugging plan: read the US memo Talk: US dirty tricks In Iraq 02.03.2003: Iraq destroys missiles in last-ditch bid to avoid war 02.03.2003: Kurds in fear of Turkish motives The UN divided 02.03.2003: Focus: America the arm-twister 02.03.2003: Profile: Jacques the juggler 02.03.2003: The diplomatic gridlock 02.03.2003: Nick Taylor: Guinea's moment of fame 02.03.2003: Weekly briefing High drama at Westminster 02.03.2003: Focus: Blair's high wire act 02.03.2003: Win or bust for Blair Special report: Parliamentary debate in full Guardian Unlimited Politics After the vote 02.03.2003: Andrew Rawnsley: Journey into the unknown 02.03.2003: Michael Portillo: Labour won't forgive 02.03.2003: Roy Hattersley: The days of obedience are over 02.03.2003: Mary Warnock: Any war demands morality Iraq crisis: Observer Comment 02.03.2003: Leader: Blair must win the argument 02.03.2003: Nick Cohen: The only way to peace 02.03.2003: Peter Preston: Balance will be the first casualty 02.03.2003: Terry Jones: Tony Blair and the hawks 02.03.2003: Rosemary Hollis: Adiplomatic solution? 02.03.2003: Business focus: Attacking the state 02.03.2003: Bulent Yusuf: Global press week Email your views to debate@observer.co.uk The Business of War 02.03.2003: The first privatised war 02.03.2003: Firms with friends in high places 02.03.2003: OK, who forgot the toilet rolls? 02.02.2003: Vincent Cable: The economic consequences of war Terror threat 02.03.2003: Top 9/11 suspect seized in Pakistan 02.03.2003: Saudi envoy in UK linked to 9/11 War on Terrorism: Observer special Iraq after Saddam 23.02.2003: Val Percival: Lessons from Kosovo 16.02.2003: Iraqi opposition slams plan for military governor 16.02.2003: Kanan Makiya: Our hopes betrayed Talk: Iraq's democrats betrayed? 09.02.2003: Focus: The Iraq Bush will build 09.02.2003: Robert L Barry: The next Yugoslavia? Observer highlights: the broadest debate 19.01.2003: Leader: Why force may be needed Talk: Where do you stand on Iraq? 16.02.2003: Andrew Rawnsley: It's do or die, Prime Minister 16.02.2003: Tony Blair: The price of my conviction 09.02.2003: Mary Riddell: With Bible and bombs 16.02.2003: Nick Cohen: The Left isn't listening 23.02.2003: William Shawcross: Why Saddam will never disarm 16.02.2003: Dan Plesch: Disarm Saddam without war 23.02.2003: Focus: Twilight of a tyrant 16.02.2003: Focus: Worlds apart on war 16.02.2003: Henry Porter: One rule for Israel,  another for Saddam 26.01.2003: Charles Kennedy: We're being bulldozed into war 16.02.2003: Leader: We must not rule out war 09.02.2003: Leader: The dossier that shamed Britain 26.01.2003: Letters: What you say about our stand on Iraq 16.02.2003: Mary Riddell: The great unheard finally speak out 09.02.2003: Jason Burke: Powell doesn't know who he is up against 02.02.2003: David Aaronovitch: Why the Left is wrong on Saddam 16.02.2003: Anthony Sampson: Why Britain's war? 09.02.2003: Jason Burke: The missing link? 19.01.2003: Debate: What prominent Britons think 02.02.2003: Gil Loescher: The refugee crisis 26.01.2003: Mary Riddell: Don't disdain the doves 26.01.2003: Terry Jones: My neighbour trouble 05.01.2003: Nick Cohen: Saddam won't run 14.07.2002: John Pilger: The great charade 29.12.2002: Ken Nichols: Back to Iraq as a human shield 15.09.2002: Jason Burke: Return to Kurdistan 01.09.2002: Dilip Hiro: US blind eye to poison gas 11.08.2002: Nick Cohen: Who will save Iraq? 04.08.2002: Richard Harries: Not a just war 25.08.2002: Christopher Hitchens: With friends like these 22.09.2002: Terry Jones: The audacious courage of Mr Blair 22.09.2002: Rosemary Hollis: Hawks won't stop with Baghdad 11.08.2002: Mark Leonard: Could the left back war? 17.03.2002: John Lloyd: Anti-Americanism betrays the left 17.02.2002: Terry Jones: George's friendly bombs 02.12.2001: David Rose: The doves are wrong - again Special reports Iraq: Observer special Observer Worldview Afghanistan Terrorism crisis Islam and the West More global commentary More from Peter Beaumont More from Jason Burke More from Ed Vulliamy More from Mark Leonard More from Dan Plesch Worldview highlights: debating American power Useful links UNSCOM UN resolutions on Iraq British Foreign Office: Relations with Iraq US State Department Iraq Update Arab.net - Iraq resources Campaign against Sanctions on Iraq Centre for non-proliferation studies"}, {"tag": "div", "text": "Observer sections _______________________ Business Cash Comment Focus International Leaders Letters Life Politics Review Screen Sport Travel UK news Music Monthly style guide server contacts 7 days world ethical awards Sport Monthly Food Monthly 2001 election Press freedom campaign"}, {"tag": "div", "text": "Privacy policy | Terms & conditions | Advertising guide | A-Zindex | About this site Guardian Unlimited © Guardian News and Media Limited 2006"}]}
{"file_number": "131", "non_ground_truth": [{"tag": "dt", "text": "Conclusion"}, {"tag": "dt", "text": "Next to Telecon Meeting Back to Introduction Return to Essays Page Return to Roger Boisjoly Page"}]}
{"file_number": "132", "non_ground_truth": [{"tag": "div", "text": "Library E. Phillips Oppenheim The Kingdom of the Blind Online Dictionary | Spelling Center"}, {"tag": "div", "text": "prev next"}, {"tag": "div", "text": "prev next"}, {"tag": "p", "text": "Copyright © 2004 Farlex, Inc."}]}
{"file_number": "133", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis!"}, {"tag": "h3", "text": "\"Reciprocals\""}, {"tag": "div", "text": "Blogroll Me!"}, {"tag": "p", "text": "As you may or may not already be aware, members of the Watcher's Council hold a vote every week on what they consider to be the most link-worthy pieces of writing around... per the Watcher's instructions , Iam submitting one of my own posts for consideration in the upcoming nominations process. Here is the most recent winning council post , here is the most recent winning non-council post , here is the list of results for the latest vote , and here is the initial posting of all the nominees that were voted on."}]}
{"file_number": "134", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""}, {"tag": "div", "text": "Contact Us Downloads News — December 21, 2006 Search Community Participation > Discussion Archives"}, {"tag": "p", "text": "About Documents FAQs"}, {"tag": "div", "text": "News & Events"}, {"tag": "p", "text": "Calendar Newsletter"}, {"tag": "div", "text": "Community Participation"}, {"tag": "div", "text": "OVAL Language"}, {"tag": "p", "text": "About Definition Tutorial Releases OVAL Interpreter"}, {"tag": "div", "text": "OVAL Repository"}, {"tag": "p", "text": "About Latest Updates Advanced Search Statistics Downloads"}, {"tag": "div", "text": "OVAL Compatibility"}, {"tag": "p", "text": "About Program Requirements Compatible Products Make a Declaration"}, {"tag": "div", "text": "RSS Feeds"}, {"tag": "div", "text": "Back to top"}, {"tag": "div", "text": "Back to top"}, {"tag": "div", "text": "Back to top"}, {"tag": "div", "text": "May 5, 2006 Teleconference August 31, 2006 Teleconference"}, {"tag": "div", "text": "Back to top"}, {"tag": "p", "text": "Page Last Updated: December 14, 2006"}, {"tag": "div", "text": "Section Contents"}, {"tag": "div", "text": "Community Participation Major Contributors Submit a Definition OVAL Board Discussion Lists Sign-Up Discussion Archives OVAL Sponsor Sr. Advisory Council Other Items of Interest Community FAQs Privacy Policy"}, {"tag": "div", "text": "Community\n      Forum List 2005 | 2004 | 2003 | 2002 Developer\n      List 2005 | 2004 Working Groups 2005 | 2004 Board\n      List 2005 | 2004 | 2003 | 2002 Board\n      Meetings 2005 | 2004 | 2003"}, {"tag": "p", "text": "OVAL is sponsored by the US-CERT at the U.S. Department of Homeland Security. See our sponsor page . This Web site is hosted by The MITRE Corporation . Copyright \n\t\t2006, The MITRE Corporation. OVAL and the OVAL logo are trademarks of The MITRE Corporation. NOTICE: This software (or technical data) was produced for the U. S. Government under contract 0706H300-OV, and is subject to the Rights in Data-General Clause 52.227-14 (JUNE 1987) Contact oval@mitre.org for more information."}, {"tag": "div", "text": "Privacy \n\t\tpolicy Terms of use Contact us"}]}
{"file_number": "135", "non_ground_truth": [{"tag": "div", "text": ". . . home comic cast about abridged gallery links Overcaffeinated buttons My Amazon wishlist Hosted by Rednaranja"}, {"tag": "h1", "text": "Rants and Articles."}, {"tag": "h1", "text": "News from the 'net"}, {"tag": "div", "text": "<p class=\"rantSpace\"><a href=\"/news/news.html\">View the news</a></p>"}, {"tag": "h1", "text": "Shout. Let it all out."}, {"tag": "div", "text": "<p><a href=\"/shoutbox/expanded.php\">View the shoutbox</a></p> ⇒ XHTML | CSS | 508 . ."}]}
{"file_number": "136", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""}, {"tag": "p", "text": "Front page Archive XML Feed"}, {"tag": "div", "text": "Visit: Nathan Hale Foreign Policy Society Truman National Security Project \"Love your site\" -- Dan Savage \"Agreat read\" -- Fareed Zakaria \"Ienjoy OxBlog very much\" -- Michael Barone OxBlog:  Trying to live up to the hype since April 23, 2002!"}, {"tag": "p", "text": "The off-the-cuff political commentary of David Adesnik, Patrick Belton and Patrick Porter, all of whom are, or were, graduate students at Oxford. David Adesnik, a research analyst in Washington DC, received his doctorate in international relations from Oxford.  Patrick Belton, a debonair son of Eire with a passion for single malts, is a doctoral candidate in international relations at Oxford.  Patrick Porter, a recently-married Australian, is about to receive his doctorate in history from Oxford. Email David Email Patrick B. Email Patrick P. Afew of our favorite links NYT WaPo OpinionJournal TNR Weekly Standard NRO Slate Commentary BBC RealClear Politics A&L Daily Google Amazon Other Blogs We Like George Washington : InstaPundit James Wilson : Brett Marston Volokh Conspiracy Abigail Adams : Diotima Alexis de Tocqueville : American Scene Crescat Sententia Crooked Timber Galley Slaves KausFiles James Lileks R. Garcia Tagorda Eve Tushnet Theodore Roosevelt : Amygdala Belgravia Dispatch Phil Carter Joyful Christian Joe Gandelman Red and Blue Adrianne Truett Winds of Change PejmanPundit Yuppies of Zion Calvin Coolidge : ScrappleFace Winston Churchill : Sasha Castel England's Sword Innocents Abroad Andrew Sullivan Franklin Roosevelt : Antidotal Kevin Drum Josh Marshall Matt Yglesias David Ben Gurion : GedankenPundit Kesher Talk Friedrich Hayek : Jane Galt Virginia Postrel Natalie Solent VodkaPundit Matt Welch Ronald Reagan : Power Line Daniel Patrick Moynihan : Daniel Drezner How Appealing Josh Cherniss Steve Sachs"}, {"tag": "p", "text": "# Posted 2:04 AM by David Adesnik"}]}
{"file_number": "137", "non_ground_truth": []}
{"file_number": "138", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""}]}
{"file_number": "139", "non_ground_truth": [{"tag": "div", "text": "Berkeley Parents Network"}, {"tag": "div", "text": "Home Members Post a Msg Reviews Advice Subscribe Help/FAQ What's New Search"}, {"tag": "p", "text": "Berkeley Parents Network > Advice > Babies > \nLaundering Baby Clothes"}, {"tag": "div", "text": "Home | Reviews | Advice | Members | Post a Message Join BPN | Help | What's New | Search"}, {"tag": "p", "text": "Please send questions and comments to Berkeley Parents Network . Last updated: May 15, 2006 © 1996-2006 Berkeley Parents Network"}, {"tag": "div", "text": "The opinions and statements expressed on this website \nare those of parents who subscribe to the Berkeley Parents Network . Please see our Disclaimer for details."}]}
{"file_number": "140", "non_ground_truth": [{"tag": "div", "text": "Home Members Post a Msg Reviews Advice Subscribe Help/FAQ What's New Search"}, {"tag": "p", "text": "Berkeley Parents Network > Advice > Sleep > \nThe Crib"}, {"tag": "p", "text": "Please send questions and comments to Berkeley Parents Network . Last updated: Dec 28, 2004 © 1996-2006 Berkeley Parents Network"}, {"tag": "div", "text": "The opinions and statements expressed on this website \nare those of parents who subscribe to the Berkeley Parents Network . Please see our Disclaimer for details."}]}
{"file_number": "141", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" About the author Return to Table of Contents"}, {"tag": "div", "text": "Go back to Chapter 1"}, {"tag": "div", "text": "your comments are welcome. < Joe@JoeCobb.com >"}, {"tag": "div", "text": "About the author Return to Table of Contents"}]}
{"file_number": "142", "non_ground_truth": [{"tag": "div", "text": "about Plus support Plus subscribe to Plus terms of use search plus with google home latest issue explore the archive careers library news © 1997-2004, Millennium Mathematics Project, University\n\t\tof Cambridge. Permission is granted to\n\t\tprint and copy this page on paper for non-commercial\n\t\tuse.  For other uses, including electronic\n\t\tredistribution, please contact us. Issue 14 March 2001 Contents Features Maths aMazes Maths and magic The mathematics of diseases Adam Smith and the invisible hand Radioactive decay and exponential laws Career interview Career Interview: Actuary Regulars Plus puzzle Pluschat Mystery mix Reviews 'The Math Chat Book' 'In Code' Two books for mathemagicians 'The Language of Mathematics' News from March 2001 All the latest news Subscribe to our\nfree newsletter The Plus new writers award Get your own copy of all the Plus posters! March 2001 Features"}, {"tag": "h4", "text": "Download PDF version | Printer friendly version Return to article"}, {"tag": "div", "text": "contact copyright info sponsors privacy info"}, {"tag": "p", "text": "Plus is part of the family of activities in the Millennium\nMathematics Project, which also includes the NRICH and MOTIVATE sites."}]}
{"file_number": "143", "non_ground_truth": [{"tag": "div", "text": "doctype PUBLIC \"-//w3c//dtd html 4.0 transitional//en\""}]}
{"file_number": "144", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Home Fast Facts Pictures Products Treatments Q&Aboard FAQ General Info Control Search Books Site Map Help Support Site"}, {"tag": "div", "text": "Special thanks to 1151 Clinch Road Home | Site Map | Feedback © 1999 - 2006 by Jim Dunphy"}]}
{"file_number": "145", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "p", "text": "Policy Guide Reports Speeches Legislative Initiatives"}]}
{"file_number": "146", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\""}, {"tag": "p", "text": "Issue 279 of SOCIALIST REVIEW\nPublished November 2003\nCopyright © Socialist Review"}, {"tag": "div", "text": "Return to Contents page: \nReturn to Socialist Review Index Home page"}]}
{"file_number": "147", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "p", "text": "VIEW a list of other USGS General Interest\nPublications U.S. Department of the Interior , U.S. Geological Survey This page is <http://pubs.usgs.gov/gip/continents/> Maintained by Eastern Publications Group Web Team Last updated 2.15.00 (krw)"}]}
{"file_number": "148", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" Fresh Intelligence Archives Web Only Archive The Wire Archives After Dark Archives Advertise Links RSS/Atom feeds Contact To the magazine To our e-newsletter Give a gift Subscription services"}, {"tag": "div", "text": "4:02PM A Lie By Any Other Name 3:07PM Astrology Roundup 1:51PM Arrest Irresistible? 12:46PM The Pitfalls of Secondhand Tech Gear 12:27PM Politics as Usual: Myanmar! Tookie! Kanye! 11:43AM Daily Dirt: Alba Damned!"}, {"tag": "h3", "text": "Protest Too Much"}, {"tag": "p", "text": "Who on Earth would sign a petition demanding more Matthew Perry? These people, that’s who."}, {"tag": "div", "text": "<SCRIPT language='JavaScript1.1' SRC=\"http://ad.doubleclick.net/adj/N339.RadarOnline.com/B1674580.3;abr=!ie;sz=160x600;ord=09061888?\"> </SCRIPT> <NOSCRIPT> <a target='_blank' HREF=\"http://radaronline.com/phpAdsNew/adclick.php?bannerid=38&amp;zoneid=3&amp;source=&amp;dest=http%3A%2F%2Fad.doubleclick.net%2Fjump%2FN339.RadarOnline.com%2FB1674580.3%3Babr%3D%21ie4%3Babr%3D%21ie5%3Bsz%3D160x600%3Bord%3D09061888%3F&amp;ismap=\"> <IMG SRC=\"http://ad.doubleclick.net/ad/N339.RadarOnline.com/B1674580.3;abr=!ie4;abr=!ie5;sz=160x600;ord=09061888?\" BORDER=0 WIDTH=160 HEIGHT=600 ALT=\"\"></A> </NOSCRIPT>"}, {"tag": "div", "text": "VONAGE: Sign up for Vonage broadband phone service and get your 1st month free!"}, {"tag": "div", "text": "<SCRIPT language='JavaScript1.1' SRC=\"http://ad.doubleclick.net/adj/N339.RadarOnline.com/B1674580.2;abr=!ie;sz=468x60;ord=53589820?\"> </SCRIPT> <NOSCRIPT> <a target='_blank' HREF=\"http://radaronline.com/phpAdsNew/adclick.php?bannerid=41&amp;zoneid=1&amp;source=&amp;dest=http%3A%2F%2Fad.doubleclick.net%2Fjump%2FN339.RadarOnline.com%2FB1674580.2%3Babr%3D%21ie4%3Babr%3D%21ie5%3Bsz%3D468x60%3Bord%3D53589820%3F&amp;ismap=\"> <IMG SRC=\"http://ad.doubleclick.net/ad/N339.RadarOnline.com/B1674580.2;abr=!ie4;abr=!ie5;sz=468x60;ord=53589820?\" BORDER=0 WIDTH=468 HEIGHT=60 ALT=\"\"></A> </NOSCRIPT> Subscribe Contact Terms and Conditions Advertise"}]}
{"file_number": "149", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Bob Stepno's Other Journalism Weblog Explorations of personal and community journalism online..."}, {"tag": "div", "text": "Weblog front page About Stepno.com Home UT Home Red Liner blog @Harvard.edu AEJMC Newspaper Division Bob's Emerson College cobwebs Bob's UNC Chapel Hill cobwebs Backgrounder: About_Weblogs Web Tools Overview Weblog writing tips Online news writing Weblog picture tips Political reporting links Journalism ethics links What are RSS and that orange 'XML' thing? RSS news aggregators (for PC World) 5 more aggregators"}, {"tag": "div", "text": "© Copyright \n                  2005\n                  Bob Stepno. Last update: \n                  2/1/05; 9:59:57 AM. January 2005 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Dec Feb"}]}
{"file_number": "150", "non_ground_truth": [{"tag": "div", "text": "thanks"}, {"tag": "h3", "text": "Web Services, people, software providers, writers and resources who have made this weblog more useful. Along overdue category... plus resources to never track of...\n\n\n\nFirst things first: this is not for \"public consumption\" this feed is raw, unedited bits of news gathered from the Web, direct quotes from savy bloggers. This is not meant as a weblog... noooo.... this is my personal treasure chest of knowledge... That said, I'm NOT WRITING it.  got it? It's not for review or anything else...\n\n\n\nI'm  hoarding it to a space on the web where Ican go back and find it. Why, you say? : stupid computer, stupid browser, stupid bookmarks can't track this stuff like a Radioland feed can ... and having it on the web is so useful."}, {"tag": "div", "text": "Find ANY word Find ALL words Find EXACT phrase Help Previous /Next"}, {"tag": "div", "text": "Updated: 1/4/2005; 3:04:30 PM. links open windows Explore Dog News: Home Dog Stories Canine Medical News index of all Dog News posts DC Dog News index of DC Dog News posts My Radio Answers Recommended books Help Pets on Wheels! Search Our Site: Picosearch Dog News Adopt a dog Subscribe email RSS/XML: RSS Validator Enter your email address below to subscribe to Dog News: weird, inspiring dog tales! powered by Bloglet Dog Magazine Price Search Other Dog News: Dog News dog.com Horse and Hound UK AKC Weekly wins Dog News Online Bird Dog News OzDog News Guide Dog News Dog World News Cow Dog News Dog News UK &  World DogZ AU & NZ Other Dog Newsletters ASPCA DVM News Maddie's newsletter Dog news in the media Dilbert's Dogbert Funny dog e-zine iVillage Pet Gazette Animal News: Animal News Animal Radio Network Animal Concerns Community Animal Attack Files Dog Blogs: Slat Rat The Books of Dog Ernie Rothman Chasing Daisy Dog Resources: Our Dog Stories Recommended Books Flickr dog photos my dog photos Dog News links feed Merck's veterinary manual Dog Links (spurl) dog events calendar Therapy dogs: Dog Play Pet Pages Veterinary Medicine Open Directory Petfinder's Forums dog faqs ASPCA Animal Poison Control Center Doglinks NZ temperment test dog listserv discussions dogs in cars Google dogs discuss dogs.about.com recently updated blo.gs : dogs Lii.org's animal sites Canine Legal Updates Canine Web Sites Dog Friendly Pet Abuse Chazhound Pet humor DogGroups Citizen dog cartoon dog jokes K-9 Patrol and Beyond Secure Your Server: Smoothwall Corporate Smoothwall Spyware Info Shell City Syndicate: News is Free DayPop Syndic8 Fyuze Bloglines NewsMonster Recommended: Jason Love Humor Librarian's Guide DayPop Top News DayPop 40 derShock Wave Popdex Libdex Library Resources New Media Musings Scripting News weblog diffusion index greeblie blog Beyond ... black stump Blah Stuff Law Guru Doc Searls Exploding Cigar Mind over matters Arts & Letters Obscure Room Scobleizer Simple Links Daily Rotation Info Feed Online News search New Scientist news fresh news org Paolo, English Crayon News Sites Liked TopSearch engines Radioland: fresh weblogs Radio Meta Docs User discussion Radio Dev Top RSS feeds Search Radioland Scott Radio Al's resources Radioland docs Jeff's Radio Weblog The FuzzyBlog Subscriptions blogroll Stagger nation Fagan Finder Blog Resources: Fagan Finder Feedster Kinja Bloglines Flickr Blog Compendium Ping-o-Matic Feedburner Globe of Blogs Blog Catalog Rss Weblogs Blog Matcher Linkwatcher Blogarama Blogwise Blog Search Engine Bloghop Kmax Blog Links search grid Linked local feeds BlogDex BlogStreet links Technorati top 100 BlogStreet blogshares Feedroom rootblog eatonweb gooFresh Google Watch Search google hacks Resource Shelf We're a Cool Site of the Day About.com's Pick of the Web DC area weather"}, {"tag": "p", "text": "This is blogchalk: United States, DC, DC, English, playing with our dog, reading blog feeds."}, {"tag": "div", "text": "Permalink:"}, {"tag": "div", "text": "January 2005 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Dec Feb"}, {"tag": "div", "text": "Previous /Next Translate Deutsch Español Français Italiano Portuguese"}, {"tag": "div", "text": "Yahoo Dog News 3:04PM EST Boca council to name new dog park (Boca Raton News) . The Boca Raton City Council this month will face a real tail-wagger of a challenge: naming the cityâs first ever dog park. The Boca Parks and Recreation Board voted last week to recommend three possible names to the council: Boca Raton Dog Park, Canine Park, and Canine Campus. Indian familyâs dog saves boy (Columbia Daily Tribune) . Pet dragged 7-year-old to safety during waves. CHINNAKALAPET, India (AP) - \"Run away!\" her husband screamed from a rooftop after he spotted the colossal waves. Nonprofit worker gives woman a canine friend (Traverse City Record-Eagle) . TRAVERSE CITY- Kathy Shields was inconsolable when her pet dog, Honey, had to be put to sleep earlier this year. That's when Marilyn Meteer started looking for a dog to give Shields for Christmas. Tell your pet to shape up (The Courier Journal) . You've heard of the dachshund wiener dog and the teacup Chihuahua. Well, Tater, a 9-year-old miniature pinscher, \"Looks like a little football,\" says his owner, Monnie Graves. \"You know â fat in the middle. Ikeep saying he's going to pop one of these days.\" News (Austin Daily Herald) . Call or email the Newsroom at (507) 434-2230. A Mower County Sheriff's Office canine is the best police dog in the nation for the third consecutive year. It's a dog-eat-everything world at Dr. Gillian Arsenault's house when they get a new miniature pinscher puppy (Medical Post Online) . In a moment of madness, our family acquired another miniature pinscher. You see, our first miniature pinscher, our beloved Finnegan, had shed his collar and tag and gone wandering. State's 1st pet blood bank will save lives of best friends (Arizona Daily Star) . Murphy, an Australian shepherd mix, was diagnosed with cancer in November and suffered from internal bleeding. His only chance at survival: a blood transfusion and surgery. But Murphy's veterinarian Keeping pets safe this winter is a matter of COMMON SENSE (South Coast Today) . Brrrrrr -- it's cold outside! Winter's fearsome weather creates many concerns for responsible pet owners. According to Dr. Kimberly Wadsworth, an associate at Anchor Animal Hospital in Dartmouth, providing appropriate care for household pets during winter is simply a matter of \"using common sense.\" Pet came to rescue when mom couldn't save son (Omaha World-Herald) . CHINNAKALAPET, India (AP) - \"Run away!\" Sangeeta's husband screamed from a rooftop after he spotted the colossal waves. It was a simple command that smothered Sangeeta in a nightmarish dilemma: She had three sons, but just two arms. Four-legged pet hailed a tsunami hero (Canoe) . CHINNAKALAPET, India -- \"Run away!\" her husband screamed from a rooftop after he spotted the colossal waves. It was a simple command that smothered Sangeeta in a nightmarish dilemma: She had three sons, but just two arms. Pit bulls have area neighborhood nervous (Gainesville Sun) . Dog trainer Michelle Dunlap, owner of Gainesville Canine Academy, scratches the belly of Phoenix, a pit bull she has been working with for 1 1/2 years. 9/11 rescue dog becomes guinea pig for human ills (Billings Gazette) . MIAMI - Three years ago, Mizu the rescue dog helped search for bodies in the smoldering remains of the World Trade Center. There at ground zero, Mizu, who works for Miami-Dade (Fla.) Fire Rescue, spent two weeks sniffing the rubble for signs of survivors - or their remains. Shop, eat, browse and be charmed in Clinton, Hunterdon County (Courier Post) . Molly's going incognito as she strides down Main Street in the town of Clinton. It's not exactly deliberate: If you stop to engage the 4-year-old Tibetan terrier, she'll gladly shake back the pepper-and-salt mane that shields her face from view and give you a heartbreaker of a canine smile. Buried treasure for dogs who dig (Pioneer Press) . This week, answers to your questions are from renowned dog trainers who attended the 11th annual conference of the Association of Pet Dog Trainers in Denver. Iwas honored to deliver the keynote address to the more than 1,000 attendees at the largest gathering of its kind in the world. HAVE DOG TREATS, WILL TRAVEL (San Jose Mercury News) . When she was laid off earlier this year, Cecilia Saleme turned to therapy -- dog therapy, that is. She launched her own business in which she counsels dogs in behavioral changes. Hey, dogs have issues, too. Blessing of the pets (Selma Times-Journal) . All things bright and beautiful, all creatures great and small, all things wise and wonderful, the Lord God made them all. Each little flower that opens, each little bird that sings, he made their glowing colors, he made their tiny wings. Main News (West Bloomfield Eccentric) . Time spent at an Oakland County Park can be a fun experience, even for one of the workers. Dogged duo praised for saving feline friend (Manchester Online) . CANINE duo Gizmo and Poppy have been named the region's bravest dogs, after rescuing their feline friend Cobweb from a fox. Rather than fighting like cat and dog, the brother and sister pair of Jack Russell/shih tzu crosses get on famously with Cobweb the cat at their Rossendale home. January (Northern News Services Yellowknife Canada) . Festivities to mark the first night of 2004 were branded a fizzle as Yellowknifers complained of a lack of fireworks. Four years had passed since City Hall had been part of New Year's festivities. Residents saw it was time for a change. 01/01/05 (Venice Gondolier) . It's clear from the moment you walk through Jerry Rustler's front door, you have entered the domain of a pet lover. Walls are filled with photos of his present and past dogs. Life-size ceramic Dalmations and tigers eye you as you walk from one room to the next."}, {"tag": "div", "text": "Recent Dog News"}, {"tag": "div", "text": "canine diaper  ... 1/4/05 tsunami sixth s... 1/2/05 dog saves child... 1/2/05 One at a Time S... 12/28/04 Deramaxx FDA do... 12/28/04 vicious dog att... 12/28/04 Tsunami disaste... 12/28/04 clone pet cat G... 12/25/04 incredible dog ... 12/25/04 dog adopt shelt... 12/25/04 iuplogbeta 12/25/04 dead pets Beiji... 12/16/04 pet dog rington... 12/16/04 pet dog Holiday... 12/15/04 African wild do... 12/14/04 coyotes eat dog... 12/14/04 man bites dog 12/14/04 dog bullet proo... 12/14/04 ebay dog magazi... 12/14/04 top searches 20... 12/14/04 posh pet furnit... 12/14/04 Pets Mobility p... 12/13/04 pet dog law jud... 12/9/04 pet gifts Chris... 12/8/04 book is your do... 12/7/04 dog food nutrit... 12/6/04"}, {"tag": "div", "text": "Google Dog News 12/25/2004 27-Nov-04 Gnews2RSS closed down . Gnews2RSS has closed down due to bandwidth constraints. If you're using Gnews2rss you presumably find it useful. Please email Google asking them to produce RSS directly out of Google News Search. Feel free to host it yourself"}, {"tag": "div", "text": "Dog Books Our Dog Stories geeky favorites Dog News blogroll Reading list Statistics: Today's top sites RSS Hotlist Alexa on radio.weblogs.com Popdex Today's visits Comments Syndic8 stats google links DayPop stats Technorati Google related Blogstreet Position Allt' web links Ecosystem MSN links Organica Googlert Search Sites"}, {"tag": "div", "text": "the Web Dog News blogs we read"}, {"tag": "div", "text": "GeoURL Feedster Previous /Next All original content on Dog News: weird, inspiring dog tales © Copyright 2002-2005 by Dog News, All Rights Reserved. © Copyright 2005 Design Dog News. © Copyright 2005 All Images by Dog News and respective companies; all rights reserved. Dogs don't lie: Reliance on the information this site contains is at your own risk. COPYRIGHTS ©2004 Dog News - Other contributors retain their own copyright. Material on this Dog News site may not be published or broadcast without express permission, except as authorized by the Creative Commons Attribution Sharealike License: in a nutshell, For Profit companies or websites do NOT have any authorization or permission to republish any of this site or its newsfeed. All rights reserved. Dog News is not affiliated with linked stories on other websites and is  not responsible for their content. All links for news stories expire eventually... and we're too busy picking up dog poop to bother fixing them... One reason a dog is such a lovable creature is his tail wags instead of his tongue. -- Unknown"}, {"tag": "p", "text": "Previous /Next"}]}
{"file_number": "151", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis!"}, {"tag": "h1", "text": "What a blog!"}, {"tag": "h2", "text": "About Me"}, {"tag": "p", "text": "View my complete profile"}, {"tag": "h2", "text": "Previous Posts"}, {"tag": "h2", "text": "Archives"}, {"tag": "div", "text": "June 2004 July 2004 August 2004 September 2004 October 2004 November 2004 August 2005 September 2005 October 2005 November 2005 August 2006 October 2006"}, {"tag": "h2", "text": "Thursday, September 22, 2005"}]}
{"file_number": "152", "non_ground_truth": [{"tag": "div", "text": "I Was Being Unmade « this life | Main | clay deserts and water windows »"}, {"tag": "div", "text": "Posted by: kelly at February 16, 2005 11:17 PM Post a comment Name: Email Address: URL: Remember personal info? Yes No Comments:"}]}
{"file_number": "153", "non_ground_truth": [{"tag": "h4", "text": "Contents"}, {"tag": "div", "text": "Editorial Information Editorial If you need help Announcements Free Access to Gartner Group Reports within CERN Special 35th Anniversary 30 Years of Computing at CERN - Part 1 GISMO Project: Historical Details Physics Computing US Award for CERN Computing European Union Gives 9.8 million Euros for GRID Development (January News) Move from HPSS to Castor  : Will the hsm\nCommand be Transparent? Desktop Computing NICE (Windows) 2000 Migration News Usage Generalisation of a Problem Report Management\nSystem for Problem Tracking in IT Division Internet Services and Network Computer Security at CERN: Risks are Increasing LocalTalk Networking End Scientific Applications and Software Engineering 2001 CERNLIB Release Future of CERNLIB Software Development Tool Service Desktop Publishing XML Applications at CERN The latest LATEX The Learning Zone Computing at CERN, Once Upon a Time... Questions and Answers from the Computing Helpdesk User Documentation User Support Book Catalogue"}, {"tag": "div", "text": "Previous: Special 35th Anniversary Next: GISMO Project: Historical Details"}, {"tag": "div", "text": "(See printing version)"}, {"tag": "div", "text": "For matters related to this article please contact the author. Cnl.Editor@cern.ch CERN-CNL-2001-002 Vol. XXXVI, issue no 2 Last Updated on Fri Aug 03 12:02:33 CEST 2001. Copyright © CERN 2001 -- European Organization for Nuclear Research"}]}
{"file_number": "154", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis!"}, {"tag": "h4", "text": "Who's Respectful?"}, {"tag": "div", "text": "I'm a psychologist working in HIV research and treatment in the inner city. Don't talk to me about \"compassionate conservatism.\" syndicate me e-mail me indulge me"}, {"tag": "h4", "text": "Blogs of Note"}, {"tag": "div", "text": "Making Light Tapped Daily Kos Alas, A Blog Slacktivist Body and Soul Talking Points Memo Kevin Drum Crooked Timber Pandagon Bitch, Ph.D. Idealistic Pragmatist Kathryn Cramer Fafblog Yet Another Web Log Matthew Yglesias Sisyphus Shrugged Gallimaufry Language Log Eschaton Philocrites Schneier on Security Firedoglake Unclaimed Territory Michael Berube Orcinus The Gimp Parade Hullabaloo CJR Daily Echidne of the Snakes World O' Crap Suburban Guerrilla"}, {"tag": "h4", "text": "Life Stories"}, {"tag": "div", "text": "Whatever Real Live Preacher WWdN: In Exile Finslippy Beanie Baby One Good Thing Abortion Clinic Days Geoffrey Chaucer Hath a Blog Chalice Chick"}, {"tag": "h4", "text": "Pigeonhole Archives"}, {"tag": "div", "text": "October 2003 December 2003 January 2004 February 2004 March 2004 April 2004 May 2004 June 2004 July 2004 August 2004 September 2004 October 2004 November 2004 December 2004 March 2005 April 2005 May 2005 June 2005 September 2005 June 2006 July 2006"}, {"tag": "h4", "text": "Site Meter"}, {"tag": "div", "text": "IE users: page cut off here? Hit F11 twice."}]}
{"file_number": "155", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Emergency Response Pollutants in the Environment Serving Communities Natural Resource Restoration"}, {"tag": "div", "text": "Information for:"}, {"tag": "div", "text": "Emergency Responders Students and Teachers Interested Public Research Institutions Other Agencies Current News Special Note"}, {"tag": "div", "text": "Catalogs of:"}, {"tag": "div", "text": "Publications Software & Data Sets Web Portals Links Downloads Image Galleries Abandoned Vessels Drift Card Studies About OR&R Contact Us Advanced Search Site Index Privacy Policy Home | Emergency Response | Responding to Oil Spills"}, {"tag": "div", "text": "First published on May 2, 2005, and last revised on October 20, 2005. Site Comments | E-mail Emergency Response Division (ERD) | Disclaimer Home | NOAA's Ocean Service | National Oceanic and Atmospheric Administration | US Department of Commerce | FirstGov"}]}
{"file_number": "156", "non_ground_truth": [{"tag": "div", "text": "Log in | Sign up Why join? Remember me | Forgot password? Welcome ( log out ) View profile Search: Reviews All CNET The Web Today on CNET Reviews News Downloads Tips & Tricks CNET TV Compare Prices Cell phones | Desktops | Digital cameras | Laptops | MP3 players | TVs | All Categories What's on CNET Find the perfect gift Who doesn't want an MP3 player, a big TV, or a shiny new laptop? CNET's editors have picked the best tech you can get this year--more than 200 gift ideas for every budget and desire. Read more <SCRIPT language='JavaScript1.1' SRC=\"http://ad.doubleclick.net/adj/N3271.CNET/B2075466.165;abr=!ie;sz=125x125;click0=http://adlog.com.com/adlog/e/r=7546&s=700776&t=2006.12.27.00.06.59&o=9020:9696:&h=cn&p=2&b=25&l=en_US&site=7&pt=4512&nd=9696&pid=&cid=30977189&pp=200&e=3&rqid=01c18-ad-e745744B04147159C8&event=58/;ord=2006.12.27.00.06.59?\">\n</SCRIPT>\n<NOSCRIPT>\n<Ahref=\"http://adlog.com.com/adlog/e/r=7546&s=700776&t=2006.12.27.00.06.59&o=9020:9696:&h=cn&p=2&b=25&l=en_US&site=7&pt=4512&nd=9696&pid=&cid=30977189&pp=200&e=3&rqid=01c18-ad-e745744B04147159C8&event=58/http://ad.doubleclick.net/jump/N3271.CNET/B2075466.165;abr=!ie4;abr=!ie5;sz=125x125;ord=2006.12.27.00.06.59?\">\n<IMG SRC=\"http://ad.doubleclick.net/ad/N3271.CNET/B2075466.165;abr=!ie4;abr=!ie5;sz=125x125;ord=2006.12.27.00.06.59?\" BORDER=0 WIDTH=125 HEIGHT=125 ALT=\"Click Here\"></A>\n</NOSCRIPT> More shopping help: Holiday Helpdesk Personal shopper podcasts Ultimate luxuries Holiday Countdown Holiday treat calendar"}, {"tag": "div", "text": "<SCRIPT language='JavaScript1.1' SRC=\"http://ad.doubleclick.net/adj/N2998.cnetnetworks/B1909321.5;abr=!ie;sz=728x90;click0=http://adlog.com.com/adlog/e/r=7349&s=704555&t=2006.12.27.00.06.59&o=9020:9696:&h=cn&p=2&b=25&l=en_US&site=7&pt=4512&nd=9696&pid=&cid=30977189&pp=&e=3&rqid=00c18-ad-e745744B041468BAF6&event=58/;ord=2006.12.27.00.06.59?\">\n</SCRIPT>\n<NOSCRIPT>\n<Ahref=\"http://adlog.com.com/adlog/e/r=7349&s=704555&t=2006.12.27.00.06.59&o=9020:9696:&h=cn&p=2&b=25&l=en_US&site=7&pt=4512&nd=9696&pid=&cid=30977189&pp=&e=3&rqid=00c18-ad-e745744B041468BAF6&event=58/http://ad.doubleclick.net/jump/N2998.cnetnetworks/B1909321.5;abr=!ie4;abr=!ie5;sz=728x90;ord=2006.12.27.00.06.59?\">\n<IMG SRC=\"http://ad.doubleclick.net/ad/N2998.cnetnetworks/B1909321.5;abr=!ie4;abr=!ie5;sz=728x90;ord=2006.12.27.00.06.59?\" BORDER=0 WIDTH=728 HEIGHT=90 ALT=\"Click Here\"></A>\n</NOSCRIPT>"}, {"tag": "div", "text": "Email this to: Enter the email address of the recipient."}, {"tag": "p", "text": "Add your own personal message: Enter your email address: Note: Your email address is used only to let the recipient know who sent the email and in case of transmission error. Neither your address nor the recipient's address will be used for any other purpose. Dell Home PCs Dell • Home • Systems"}, {"tag": "div", "text": "Help Center | Corrections | What's New | All Product Reviews | Search: Reviews All CNET The Web Popular topics: Adobe | Antivirus | AVG | Games | Drivers | Java | Photoshop | Spyware | Windows Media Player | WinRAR Today on CNET | Reviews | News | Compare prices | Tips & Tricks | Downloads | CNET TV Popular on CNET Networks: PS3 | Wii | Xbox 360 | Pussycat Dolls | Free Music Videos | TV Listings | Prison Break | Game Cheats About CNET Networks | Jobs | Advertise | Partnerships | Site map Copyright ©2006 CNET Networks, Inc. All rights reserved. Privacy policy | Terms of use"}]}
{"file_number": "157", "non_ground_truth": [{"tag": "div", "text": "Happy Holidays from Our Family to Yours"}, {"tag": "div", "text": "1-800-935-2620 MON-FRI 8AM - 10PM ET | SAT-SUN 9AM - 6PM ET"}, {"tag": "div", "text": "Sign up for Newsletter E-mail:"}, {"tag": "div", "text": "Globus Tours Trafalgar Tours Value World Viking River Cruises Uniworld River Cruises Tauck World Discovery Peter Deilmann Amadeus Waterways American West Brendan River Cruises Delta Queen Imperial River Cruises Intrav Travel"}, {"tag": "div", "text": "Search Advanced Search"}, {"tag": "div", "text": "River Cruise Tools"}, {"tag": "div", "text": "Advanced Search Search by Operator Search by Destination Search by River Current Specials Best Deals River Cruise FAQs Site Map Customer Service"}, {"tag": "div", "text": "Copyright  1994 - 2006 AffordableTours.com. All rights reserved. About Us - Terms and Conditions - Privacy Policy - Contact us 1-800-935-2620 OR 1-281-269-2600 Home - Tours - Cruises"}]}
{"file_number": "158", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "div", "text": "You are here: About > Business & Finance > Small Business: Canada > Marketing > Sales and Selling Small Business: Canada Business & Finance Small Business: Canada Essentials Are You Ready to Start a Business? Quiz Steps to Starting a Business Business Plan Outline Best Business Opportunities 2007 Starting a Business FAQ's Topics Starting a Small Business Business Plans Online Courses & Reference Business Management Business Support Closing Your Business Import and Export Insurance & Legal Issues Home Business Marketing Online Business Small Business Financing Business Learning Center Running Your Office Tax Information Buyer's Guide Top Digital Voice Recorders Top Accounting Software Top Multifunction Inkjet Printers Top Multifunction Laser Printers Top Laptop Cases Tools Find a Job Get a Quote Mortgage Loans Online Degrees Yellow Pages Forums Most Popular Articles Latest Articles Help > Marketing > Sales and Selling"}, {"tag": "h5", "text": "Hot Gadget Videos"}, {"tag": "p", "text": "Shopping for a Digital Camera Choosing an MP3 Player Portable Video Players Choosing a Cell Phone Choosing a DVR"}, {"tag": "h5", "text": "What's Hot"}, {"tag": "p", "text": "Web Site Content Theft Getting Radio Promotion UPC Bar Code Business Opportunities 2003 GST Registration"}, {"tag": "div", "text": "All Topics | Email Article | | Advertising Info | News & Events | Work at About | SiteMap | Reprints | Help Our Story | Be a Guide User Agreement | Ethics Policy | Patent Info. | Privacy Policy ©2006 About, Inc., Apart of The New York Times Company . All rights reserved."}]}
{"file_number": "159", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\""}, {"tag": "div", "text": "Sign \n                          up for EXPRESS SCIENCE NEWS delivery"}, {"tag": "div", "text": "������"}]}
{"file_number": "160", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/1999/REC-html401-19991224/loose.dtd\""}, {"tag": "div", "text": "Join Now | Sign In | Shopping Cart Tuesday, December 26, 2006 You Are Here: Home > School of Business > Business > More Information for Creating the Business of Your Dreams"}, {"tag": "p", "text": "- Areas of Study - Accounting Alternative Medicine Arts and Photography Business Career Training Computers & Tech Cooking Course Series Crafts & Hobbies Entrepreneurship Finance GED Training General Education Health Care & Fitness Home and Garden Home Schooling How To Start... Industrial Technology Language Arts Law/Legal/Criminal Loan Processing Mathematics Medical Billing New Age Office Skills Parenting and Family Performing Arts Personal Care Pet and Animal Care Psychic Studies Psychology Real Estate Reference Religious Studies Sciences Self-Help Social Work Special Education Staff Picks Teacher Tools Terminology Test Preparation Web Development Writing Skills New Courses Degrees / Programs"}, {"tag": "p", "text": "Do you want the best chances of success in your new business venture? Would you like to know some ways to advertise yourself with little or no money? Would you like to keep the energy of your excitement going even through turbulent times? Is you answered yes, then this course is for you!"}, {"tag": "div", "text": "Have a question? Contact us for more information regarding this course. Your Na m e : Yo ur Em a il : Yo ur Co mm ents/Quest ion s :"}, {"tag": "div", "text": "About Us | Having a Problem? | Contact Us Disclaimer | Terms of Service | Privacy Policy"}, {"tag": "p", "text": "© 1999-2006 Universal Class, Inc.  All rights reserved."}]}
{"file_number": "161", "non_ground_truth": [{"tag": "div", "text": "Jump to Weather | Traffic | Mariners | Seahawks | Sonics | Forums | Calendar"}, {"tag": "div", "text": "NEWS Local Sports Nation/World Business/Tech Environment Education Webtowns Photos/Multimedia Special Reports Blogs LIFE & ARTS Calendar Restaurants SeattleNoise TV Listings Movie Times A&E Lifestyle Food Dining NW Gardens Seattle@Home Wheels Susan Paynter Advice Popping Off Health & Fitness Getaways Comics & Games Horoscope COMMENTARY Opinion/Columnists Letters David Horsey Forums Soundoffs P-I ANYWHERE E-mail Newsletters RSS/Web Feeds Mobile Feeds On Your Site e-Edition MARKETPLACE • Jobs • Autos • Homes • Rentals • Classifieds • Place an ad • Photo Reprints • NWsource • Shopping • Personals"}, {"tag": "div", "text": "OUR AFFILIATES"}, {"tag": "div", "text": "HEADLINES"}, {"tag": "p", "text": "Hike Of The Week: Beauty trumps damage to Carbon River Road Old, young, fast and not-so-fast hit the trails to rekindle the riding spirit Short Trips: 'Essential Seattle' sifts through 150 years The Gear Junkie: Metal lacks the mettle for rugged activities Ski Wear: When it comes to work and play in the snow, use what the pros know Outdoors Report: Bad time for boaters Area Recreation Clubs Ski/board Web Sites"}, {"tag": "div", "text": "Home | Archives | Corrections | Front Page | About the P-I | P-I Jobs | Contact Us | Home Delivery 101 Elliott Ave. W. Seattle, WA 98119 (206) 448-8000 Home Delivery: (206) 464-2121 or (800) 542-0820 Send comments to newmedia@seattlepi.com ©1996-2006 Seattle Post-Intelligencer Terms of Service/Privacy Policy also available by e-mail also available by RSS AP: TOP HEADLINES · Iraq court upholds Saddam death sentence · Senators nix pre-9/11 hijacker ID theory · Bush in Texas to rethink Iraq course · U.S. soldiers' death toll climbs in Iraq · Doctor says Castro doesn't have cancer more MOST READ · Father, son stop holiday burglar · Life's moved on at the house where 7 died · Seattle's Woodland Park receives $6 million anonymous gift · Operation he invented saves doctor · Man survives car crash into apartment more MOST PRINTED · Operation he invented saves doctor · West of state's mainland finds new niche in people · Prostate cancer seed therapy is growing · New rules for homeless: No job search, no shower · Find a cure for 'contagious shooting' more MOST E-MAILED · Aperfectly adequate Christmas letter · Real estate agents take dramatic turn for sales · New rules for homeless: No job search, no shower · Operation he invented saves doctor · Prostate cancer seed therapy is growing more POPULAR SOUNDOFFS · No more passing the buck -- let's hold storm hearings · Boy hurt by cannon blast feels twice wounded · Hawks puttering to finish line on four flat tires · U.S. Military: Bittersweet cheer · Don't judge Snohomish by actions of a few more help/troubleshoot Send comments to newmedia@seattle-pi.com"}, {"tag": "p", "text": "© 1999 The Associated Press. All rights reserved. This material may not be published, broadcast, rewritten or redistributed. © 1999 Seattle Post-Intelligencer. All rights reserved."}]}
{"file_number": "162", "non_ground_truth": [{"tag": "p", "text": "Home delivery Contact us"}, {"tag": "div", "text": "Traffic | Weather | Your account Movies | Restaurants | Today's events"}, {"tag": "p", "text": "Advanced search Home Local Eastside Snohomish Co. Politics Education Columnists Nicole Brodeur Danny Westneat David Postman Sherry Grindeland Letter from Washington Inside The Times Here and Now Nation / World Business / Tech Editorials / Opinion Columnists Sports Entertainment Comics / Games Living Pacific Northwest Magazine Travel / Outdoors Real estate Obituaries Special reports Photography Corrections Archive Alerts / E-mails Marketplace Jobs Autos Homes Rentals Classifieds Shopping NWsource Personals Post an ad Services Your account Contact us Submit listings Send us news tips Seattle Times store Advertise with us RSS feeds Wireless Newspapers In Education Home delivery e-Edition Sunday, June 19, 2005 - Page updated at 12:00 AM Born gay? How biology may drive orientation By Sandi Doughton Seattle Times science reporter"}, {"tag": "p", "text": "PREV | of | NEXT"}, {"tag": "div", "text": "E-mail article Print view Search Most e-mailed Most read RSS"}, {"tag": "p", "text": "E-mail this article Print this article Search archive More local news headlines..."}, {"tag": "p", "text": "Marketplace"}, {"tag": "div", "text": "Jobs Autos Shopping Homes Rentals Post an ad"}, {"tag": "p", "text": "NWsource shopping"}, {"tag": "div", "text": "Daily find Chic New Year's hats Romanza's classy toppers will have you singing \"Auld Lang Syne\" at first sight."}, {"tag": "p", "text": "More shopping"}, {"tag": "div", "text": "Sales & events Articles Store guides"}, {"tag": "p", "text": "seattletimes.com home Home delivery | RSS feeds | Low-graphic | Search archive Site map | webmaster@seattletimes.com | Contact us | Privacy statement | Terms of service NWclassifieds | NWsource | Advertise with us | The Seattle Times Company | Employment opportunities Back to top"}]}
{"file_number": "163", "non_ground_truth": [{"tag": "h3", "text": "Contents"}, {"tag": "div", "text": "When the Shakespeare Authorship page began 10 years ago, it was the only site on the Internet dedicated to countering claims that someone other than William Shakespeare wrote the lion's share of the works professional literary historians have always assigned to Shakespeare.  We have more company now (as you can see from the sites listed in our Bardlinks area below), and we'd like to direct your attention to Tom Veal's blog, which contains some of the best recent commentary on the authorship of Shakespeare's works. Tom responds to The Truth Will Out by Brenda James and William D. Rubinstein, a book claiming that Sir Henry Neville really wrote Shakespeare's works. A New \"Shakespeare\" More on the \"New\" Shakespeare Arguing Further With Professor Rubinstein The Neville-Shakespeare Theory: An Aperu Tom looks critically at Roger Stritmatter's Ph.D. dissertation in comparative literature, which took as its starting point the assumption that the Earl of Oxford really wrote Shakespeare's works. Part One Part Two Part Three Part Four Part Five Tom replies to Michael Brame and Galina Popova, who in Shakespeare's Fingerprints claimed that 17th Earl of Oxford wrote not only Shakespeare's works but also just about everything else written in the last half of the 16th Century. VERitable Lunacy"}, {"tag": "h3", "text": "Bardlinks Elsewhere on the Web"}, {"tag": "div", "text": "Shakespeare's Works Complete\nWorks (from MIT) Old-spelling editions of Quarto & Folio texts. Search Engine for\nCollected Works David Kathman's Biographical Index of English Drama Before 1660 is a \ndraft list of all people known to have been involved with theater in England between \n1558 and 1642. Collections of Shakespeare Links Terry A. Gray's Mr. \nWilliam Shakespeare and the Internet : in addition to the most\ncomprehensive guide to Shakespearean resources on the internet, this\nindispensable site also includes many documents relating to Shakespeare\nthat are available nowhere else on the web, such as an annotated version\nof Nicholas Rowe's 1709 biography . Find more links to material by and about Shakespeare (and a great many\nother writers of the English Renaisance and 17th Century) at the Voice\nof the Shuttle Since 1990, scholars and common readers have discussed the works and life of Shakespeare on the SHAKSPER mailing list, which is edited by Hardy M. Cook. Oxford's Writings Alan Nelson has put up a great deal of information about the 17th earl of Oxford including transcriptions of his letters and memoranda, an analysis\nof his spelling habits, and information about his trip to Italy.  (Of\nrelated interest is our list of the annotations\nin Oxford's Bible.)  In addition, Nelson has also made available new\nevidence of the relationship between\nShakespeare and Sir George\nBuc , the Master of Revels from 1610 to 1622. Versions of Poems\nby Oxford (and others) were \ninexpertly edited by J. Thomas Looney. Caveat lector . General Discussions of Authorship The Shakespeare Birthplace Trust discusses various responses that have\nbeen given to The Shakespeare \nAuthorship Question . Links to websites of the candidates may be found on the Authorship\nDebates page of J. M. Pressley's Shakespeare Resource Center John George Robertson's 1911 essay \"The Shakespeare-Bacon Theory\" appeared in the Encyclopedia Britannica and has been put online by TheatreHistory.com Ward Elliott tells the history of The Shakespeare Clinic , a project that used stylometric methods to investigate the authorship of Shakespeare's works. Using stylometrics, Ward Elliott and Robert Valenza calculate the odds against Oxford's having written Shakespeare in Oxford by the Numbers In Two Tough Nuts to Crack , Elliott and Valenza test whether their methods support the view that Shakespeare contributed to Sir Thomas More and Edward III . Irvin Leigh Matus 's site WillyShakes.com contains several essays on the authorship of Shakespeare's works. Steven Dutch, a scientist at the University of Wisconsin-Green Bay,\nbelieves that antistratfordianism is at best a Pseudoscience . Clark Holloway's Shakespeare page includes a look at The \nAuthorship \"Problem\" James Boyle blends law and literature\nin The\nSearch for an Author: Shakespeare and the Framers Diana Price argues in her new book Shakespeare's Unorthodox Biography that he was not a writer. Alan Nelson has responded to Price. The Wikipedia includes an entry on Shakespearean authorship Alan Haley describes a moot court Authorship Debate between supporters of Shakespeare and of Oxford. Brad Strickland asks Who Wrote Shakespeare? , and asnwers,\n\"Shakespeare did.\" Amanda J. Crawford reviews Irvin Matus's Shakespeare,\nIN FACT Authorship is also a popular topic on the newsgroup humanities.lit.authors.shakespeare . After the release of Shakespeare in Love , the authorship of Shakespeare's \nworks became a topic at Mr. Cranky The topic sometimes arises on a German Shakespeare\nForum Authorship issues are often discussed in The Elizabethan Review , a\ntwice-yearly journal edited by Gary Goldstein. The Shakespeare\nAuthorship Rountable does not\nendorse any alternative candidate -- but they're pretty sure the\nauthor was someone other than Shakespeare. Ian Chadwick goes In\nSearch of the Real Bard Meg Greene Malvasi asks, Did \nHe or Didn't He? at the History for Children site. Polly Rance reviews John Michell's Who \nWrote Shakespeare? . . .  as does Jim Loy on his book review page. Nigel Davies offers an authorship Q&Aat Who\nWrote Shakespeare? Summarizes the case against Oxford at Why Oxford wasn't Shakespeare Shows how angrams can be used to \"prove\" just about anything at Shakespeare Ciphers From Austria, Patricia Hoda asks Wer war Shakespeare? T. L. Hubeart looks briefly at The Shakespeare\nAuthorship Question Asite for schools in Urbana, Ohio, asks Who\nWrote Shakespeare? From Richard Stockton College, a brief listing of points for and against Shakespeare's authorship of his works. Libby Maia asks, Were\nThere Two Shakespeares? Barbara Rosson Davis describes her screenplay about the authorship of Shakespeare's works. Oxford The founding tract of Oxfordianism is J. Thomas Looney's 'Shakespeare'\nIdentified in Edward de Vere the Seventeenth Earl of Oxford . The Shakespeare Oxford \nSociety Home Page is the principal Oxfordian web site. The Oxfordian Shakespeare Fellowship site includes essays from the group's magazine Shakespeare Matters . Mark Alexander's Shakespeare Authorship\nSourcebook , an Oxfordian survey of materials related to Shakespeare\nand Oxford. Nina Green's Oxford Authorship Site credits Edward de Vere with being not merely himself and Shakespeare but also Martin Marprelate, Thomas Nashe, and Robert Greene. The Oxfordian musings of Randall Barron total 31 brief\nchapters (so far). The Oxfordian case was promoted by the PBS Frontline program, \"The\nShakespeare Mystery.\" In 1991, the Oxfordian case was debated in The\nAtlantic Monthly In 1999, the Oxfordian case was debated in Harper's magazine . Anumber of pieces by the late Oxfordian Charlton Ogburn Jr. are\navailable online: The  Man Shakespeare Was Not | Shakespeare's Self-Portrait | Interview with Charlton Ogburn | Shakespeare and the Fair Youth Mark Anderson's obituary of Ogburn. Joseph Sobran sprinkles his Oxfordian writings with laments that he\ndoesn't get enough respect from Shakespearean scholars: The Problem of the Funeral Elegy | Bible holds proof of Shakespeare's identity | Shakespeare's Disgrace | The Mystery of\nEmaricdulfe | David Kathman and the \"Historical Record\" | The Bards Orphans Sobran's Oxfordian tract Alias Shakespeare has been reviewed by Jeffrey Gantz Favorable comments about Sobran's book by Kathleen van Schaijik led to a lively online discussion. Richard Whalen's Shakespeare:\nWho Was He? The Oxford Challenge to the Bard of Avon is reviewed\nby Paul Franssen . Peter Morton reviews two novels promoting the\nOxfordian view and also Denis Baron's De \nVere is Shakespeare Ruth Loyd\nMiller has republished some of the basic Oxfordian tracts. David Roper's Shakespeare Story holds that ciphers in Shakespeare's monument point to Oxford as the \"real\" author of Shakespeare's works. Robert Brazil has put up OXPIX , a page of\n\"images relevant to the Shakespeare-Oxford debate\" as well as chapters\nfrom his book The\nTrue Story of the Shakespeare Publications Dennis Hirsch thinks The Mystery of Shake-speare's Sonnets goes away if Oxford is assumed to be the real author. Barbara Van Duyn asks the unmusical question Shakespeare, \nEarl of Oxford? Time magazine's Howard Chua-Eoan wonders whether Oxford was The Bard's Beard . Paige Norris ponders The Shakespearean Controversy The Seattle Times covered a 1997\ndebate between Joseph Sobran and Alan Nelson.  (You may have to register to view this article, but there is no charge to do so). L. James Hammond offers a summary of the Oxfordian case quarried from Ogburn. Oxfordian Eric Altschuler thinks Hamlet contains a Cosmic\nClue to Bard's Identity , according to Constance Holden. Volker Multhopp thinks Oxford collaborated on the Shakespeare plays\nwith John Lyly; his Small Shakespeare Authorship Page includes a response to David Kathman's Dating the Tempest John Rollett's notion that the dedication to Shakespeare's Sonnets contains\nOxfordian cryptograms was discussed in Chance News . Old Arcadia has a pretty (and pretty unreliable) Oxfordian site . A. C. Challinor is also an\nOxfordian-centered\ngroupist. His publisher's website classifies his book The\nAlternative Shakespeare as fiction. Oxford was a twig on the deVere \nFamily Tree , though that does not mean he was Shakespeare. Lazy students might want to peek at this sample Oxfordian term paper . A Geronimo Reviewer supports Oxford. Amie Ader sees a case for Oxford in The Great\nConspiracy Joseph Eldredge thinks Oxford may have had Martha's Vineyard in mind as the setting fot The Tempest . Introduce schoolchildren to Oxfordianism by playing Who Was\nShakespeare? A Mock Trial Nicole Blank, a 9th grader at Willits (California) High School, asks, Is Shakespeare A Fraud? Oxfordianism is all the rage at California's Carmel Shake-speare Festival, but the local\npaper isn't convinced. The Ojai Shakespeare Festival also \nseems interested in Oxfordianism. The Edward de Vere Studies\nConference is held every April at Concordia University \nin Portland OR. Oxfordianism in Italy: was the name \"Shakespeare\" actually the pseudonimo del poeta e drammaturgo Edward de Vere ? Norma Howe's Blue Avenger Cracks the Code presents the exploits of a teen-aged Oxfordian superhero. The Oxfordian Stephanie\nCaruana has written a play to promote her views. Jerry Fey's Oxfordian fantasy Oxford's Will has been performed by the Colony Theater in Los Angeles. Francis Bacon The principal Baconian site is Shake-n-Bacon Another handsome Baconian site: Lawrence Gerald's Sir\nFrancis\nBacon's New Advancement of Learning Is Shakespeare\nDead? is a classic Baconian text by Mark Twain. Was Twain's book the product of plagiarism?  Read contemporary\nnews accounts from the New York Times: May 1, 1909 | June 9, 1909 | June 10, 1909 | June 11, 1909 Read Twain's friend and biographer Albert Bigelow Paine on Shakespeare-Bacon\nTalk and \"Is\nShakespeare Dead?\" Walt Whitman wrote a poem on the Baconian\ncontroversy. Aclassic response to Baconism is Andrew Lang's 1912 book, Shakespeare, Bacon and the Great Unknown . Penn Leary has written extensively on the Baconian ciphers he finds in\nShakespeare's works.   Leary died on March 9th, 2005 . Mather Walker invites you to download an acrostic-anagrammatic Bacon cipher Another person interested in Baconian ciphers\nis Kevin Scott Boomsma , a student in a cryptography seminar at the\nUniversity of Illinois Chicago. Virginia Fellows believes that secrets are hidden behind Bacon and Shakespeare Cyphers . Baconian Grant Scicluna is sure\nthat William\nShakespeare Did Not Exist Francis Carr insists that Bacon was not\nonly Shakespeare but\nalso Cervantes . Jerome Harner, a Baconian, explains why he is not an Oxfordian Brian Jarvis thinks a collaboration between Shakespeare and Bacon may explain everything. Marlowe Claims for Marlowe's authorship of Shakespeare's works may be found\nat the Marlowe Society Another Marlovian site: Peter Farey's A Deception in Deptford A. D. Wraight also\nbelieves in Marlowe. John Baker is responsible for the Marlowe/Shakespeare\nSchool of Thought Emporium . Jean\nJofen thinks that Marlowe was Jewish and that he also wrote the Martin\nMarprelate tracts when he wasn't writing the works of Shakespeare (she\nthinks Bacon and Oxford helped Marlowe be the bard). Carolyn\nGage has very personal reasons for supporting Marlowe Other Candidates John Raithel looks into the possibility that the works were penned by William Stanley, the sixth Earl of Derby Patrick Buckridge puts his money on Sir Edward Dyer . Would you believe the\nEarl of Rutland ? Ilya Gililov does, according to the Christian\nScience Monitor . Gililov's work has been reviewed (in Russian) by Anna\nBernikova and by Boris\nKuz'minsky Joanne Ambrose believes Shakespeare's works were written by Edmund Campion . Was Shakespeare Sicilian?  See Antonio \nCasa's news account of Martino Iuvara's notion (would it surpise anyone to learn that Iuvara himself is \nSicilian?).  Iuvara's idea was considered newsworthy by the Times of London. Peter Zenner thinks somebody named William Pierce was not only Shakespeare\nbut also Edmund Spenser, John Donne, Christopher Marlowe, Francis Bacon, John Milton and many others. Thanks to Seven\nWonders for naming the SHAKESPEARE AUTHORSHIP Home Page the Site of\nthe Day on April 23, 1996. This page is managed by David Kathman and Terry Ross . We thank all our visitors (we've been counting you), and we invite your comments."}]}
{"file_number": "164", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01//EN\" \"http://www.w3.org/TR/html4/strict.dtd\" Yahoo! My Yahoo! Mail Welcome, Guest [ Sign In ] Yahoo! Search Search: Shopping Home Help My Lists Shop for: in all departments Bargains Beauty Books Clothing Computers & Office Movies & DVDs Electronics Flowers & Gifts Health Home & Garden Jewelry & Watches Music Sports & Outdoors Toys & Baby Results 1 - 1 out of 1 for Women's Loose Fit Tapered Pants YOU ARE HERE: Shopping > Clothing, Accessories & Shoes > Women's Clothing > Women's Pants > Loose Fit > Tapered"}, {"tag": "h2", "text": "Price"}, {"tag": "div", "text": "From $ To $"}, {"tag": "h2", "text": "Material"}, {"tag": "h2", "text": "Keyword Group Products"}, {"tag": "div", "text": "One Product Per Store All Products"}, {"tag": "div", "text": "ADVERTISEMENT <SCRIPT language='JavaScript1.1' SRC=\"http://ad.doubleclick.net/adj/N763.starcom.yahoo/B1996895.18;abr=!ie;sz=160x600;ord=1167178050949908?\"></SCRIPT><NOSCRIPT><A HREF=\"http://us.ard.yahoo.com/SIG=12f8eeqp9/M=533904.9954346.10651046.7270451/D=shp/S=96426596:WSKY/_ylt=A9htfnNCuZFFi34AFgBkWr8F/Y=YAHOO/EXP=1167185250/A=4072624/R=0/SIG=13io9fo5d/*http://ad.doubleclick.net/jump/N763.starcom.yahoo/B1996895.18;abr=!ie4;abr=!ie5;sz=160x600;ord=1167178050949908?\"><IMG SRC=\"http://ad.doubleclick.net/ad/N763.starcom.yahoo/B1996895.18;abr=!ie4;abr=!ie5;sz=160x600;ord=1167178050949908?\" BORDER=0 WIDTH=160 HEIGHT=600 ALT=\"Click Here\"></A></NOSCRIPT>"}, {"tag": "div", "text": "SPONSOR RESULTS Taper Candleholder - Unique & exclusive home furnishings to decorate your home with style. www.touchofclasscatalog.com Looking for Loose Fit? - Looking for men's clothing? From blazers to vests, new or used, you can find it on eBay. www.ebay.com Sort by Top Results Sort by Price Ascending Sort by Price Descending Sort by Product Rating Ascending Sort by Product Rating Descending Show Grid View"}, {"tag": "p", "text": "Save to My Lists"}, {"tag": "div", "text": "$34.00 distinctionsplus.c... Merchant Rating"}, {"tag": "div", "text": "SPONSOR RESULTS Taper Candleholder - Unique & exclusive home furnishings to decorate your home with style. www.touchofclasscatalog.com Looking for Loose Fit? - Looking for men's clothing? From blazers to vests, new or used, you can find it on eBay. www.ebay.com Search the web for Women's Loose Fit Tapered Pants Take our survey and enter to win $1,000! Shop for: in all departments Bargains Beauty Books Clothing Computers & Office Movies & DVDs Electronics Flowers & Gifts Health Home & Garden Jewelry & Watches Music Sports & Outdoors Toys & Baby Find, Compare, Read Reviews & Buy Women's Loose Fit Tapered Pants Online @ Yahoo! Shopping"}, {"tag": "p", "text": "Find, Compare, Read Reviews & Buy Clothing, Accessories, and Shoes Want to see your products in Yahoo! Shopping? Build your own online store or Advertise with us . Current Advertisers Sign In Help improve Yahoo! Shopping by participating in our user studies - View RSS Feed Questions, comments, suggestions? Send us feedback . Work at Yahoo! Shopping Make money with Yahoo! Shopping APIs , now powering Yahoo! Tech .  Learn more about our paid syndication program ."}, {"tag": "div", "text": "Copyright ©2006  Yahoo! Inc. All Rights Reserved. Privacy Policy - Terms of Service - Copyright/IP Policy - Security and Disclaimer . Information about prices, products, services and merchants is provided by third parties and is for informational purposes only.  Yahoo! does not represent or warrant the accuracy or reliability of the information, and will not be liable for any errors, omissions, or delays in this information or any losses, injuries, or damages arising from its display or use."}]}
{"file_number": "165", "non_ground_truth": [{"tag": "p", "text": "< ready to introduce a new world with a shrug | ??? | instant gratification >"}, {"tag": "p", "text": "skazat is a sketchbook of mine. My name is Justin Simoni . Iam an artist living in Denver, Colorado, USA. Ilike music. your email, for my updates : _the ephemeris (flip to a random page) :: days"}, {"tag": "p", "text": ":: months"}, {"tag": "p", "text": "December 1 entry November 6 entries October 4 entries September 2 entries August 3 entries"}, {"tag": "p", "text": "July 1 entry"}, {"tag": "p", "text": "June 5 entries May 4 entries April 1 entry February 1 entry"}, {"tag": "p", "text": ":: years"}, {"tag": "p", "text": "2006 2005 2004 2003 2002 2001 2000 1999 :: things RSS feed _the assemblage books i've read MySpace page LiveJournal Dribble Flickr write a letter to me"}, {"tag": "p", "text": "justin simoni aolim: skazat8 present location: denver, co < ready to introduce a new world with a shrug | ??? | instant gratification >"}]}
{"file_number": "166", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "p", "text": "Skip to main content"}, {"tag": "div", "text": "Go to: Guardian Unlimited home UK news World news Comment is free blog Newsblog Sport blog arts & entertainment blog Podcasts ---------------------- Archive search Arts and entertainment Books Business EducationGuardian.co.uk Environment Film Football Jobs Life and health MediaGuardian.co.uk Money Music The Observer Politics Science Shopping SocietyGuardian.co.uk Sport Talk Technology Travel Been there ---------------------- Audio Email services Special reports The Guardian The northerner The wrap ---------------------- Advertising guide Crossword Events / offers Feedback Garden centre GNM press office Graduate GuardianFilms Headline service Help / contacts Information Living our values Newsroom Notes & Queries Reader Offers Soulmates dating Style guide Syndication services Travel offers TV listings Weather Web guides Working for us ---------------------- Guardian Abroad Guardian Monthly Guardian Weekly Money Observer Public Learn Guardian back issues Observer back issues Guardian Professional <a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Society&amp;section=110464&amp;country=(none)&amp;rand=3807361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Society&amp;section=110464&amp;country=(none)&amp;rand=3807361\"\n\t\t\t\t\t\twidth=\"468\"\n\t\t\t\t\t\theight=\"60\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a> Read today's paper · Jobs"}, {"tag": "div", "text": "Search: Guardian Unlimited Web Home Health Communities Local government Voluntary sector Social care Talk Conferences Books Big issues Comment Careers advice Jobs Help"}, {"tag": "div", "text": "Search Society"}, {"tag": "div", "text": "<a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=05&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=05&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\"\n\t\t\t\t\t\twidth=\"128\"\n\t\t\t\t\t\theight=\"64\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a>"}, {"tag": "p", "text": "<a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=06&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=06&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\"\n\t\t\t\t\t\twidth=\"128\"\n\t\t\t\t\t\theight=\"64\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a> <a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=07&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=middle&amp;spacedesc=07&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\"\n\t\t\t\t\t\twidth=\"128\"\n\t\t\t\t\t\theight=\"64\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a>"}, {"tag": "div", "text": "Recent articles Labour must focus on child poverty,  says minister Yasmin Jackson: Prostitution is about a lot more than drugs, and getting out isn't easy Catherine Bennett on press coverage of tthe Ipswich killings Letters: Sex workers forced into the shadows Plan to offer friends for young families Sleeping with the enemy Poor communities get free-to-use cash machines Simon Jenkins: Blair is blinded by a belief that big is always beautiful Tory support for marriage echoes Major's back-to-basics Polly Toynbee: Areturn to Tory terra firma: it's the poor's own fault"}, {"tag": "div", "text": "At a glance"}, {"tag": "div", "text": "16.03.2005: The main points"}, {"tag": "div", "text": "Full text"}, {"tag": "div", "text": "16.03.2005: The chancellor's budget speech"}, {"tag": "div", "text": "Special report"}, {"tag": "div", "text": "Budget 2005"}, {"tag": "div", "text": "Useful links"}, {"tag": "div", "text": "The Treasury"}, {"tag": "div", "text": "Factfile"}, {"tag": "div", "text": "16.03.2005: Briefcase encounters: the history of the budget"}, {"tag": "div", "text": "Talk about it"}, {"tag": "div", "text": "Have your say on our talkboards Printable version | Send it to a friend | Save story <a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=bottom&amp;spacedesc=03&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=bottom&amp;spacedesc=03&amp;site=Society&amp;navsection=2663&amp;section=110464&amp;country=(none)&amp;rand=3807361\"\n\t\t\t\t\t\twidth=\"128\"\n\t\t\t\t\t\theight=\"64\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a>"}, {"tag": "div", "text": "Privacy policy | Terms & conditions | Advertising guide | A-Zindex | About this site SocietyGuardian.co.uk © Guardian News and Media Limited 2006"}]}
{"file_number": "167", "non_ground_truth": [{"tag": "div", "text": "School \n  of Management at Binghamton University, State University of New York PO Box 6000, Binghamton, New York 13902-6000 E-mail SOM som home l about som l academic \n  programs l student resources l faculty & research executive programs l alumni & development l corporate relations l campus links"}]}
{"file_number": "168", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" Skip Navigation (press 2) + Visit the NASA Portal + S.O.N. Home TaSS HOME SUN-EARTH VIEWER TRACKING THE PERFECT STORM SPACE WEATHER RESOURCES"}, {"tag": "div", "text": "SUNSPOT REGIONS STORM SIGNALS MAGNETOSPHERE AURORAS"}, {"tag": "h3", "text": "TEACHER'S EDITION Grades 10th and up"}, {"tag": "div", "text": "+ From Students + From Observatories - Kp Index - Kiruna, Sweden - Baker Lake, Canada - Canada - Tromso, Norway - Alaska - U.S. Observatories - Tixie Bay, Russia + From Satellites"}, {"tag": "p", "text": "Acomplete list of real-time data links is located in the Space Weather Resources section."}, {"tag": "div", "text": "Content Enhancement Student's Edition + Privacy Policy NASA Official: Dr. James Thieman Project Manager: Don Robinson-Boonstra Website Manager: Bryan Stephenson"}]}
{"file_number": "169", "non_ground_truth": [{"tag": "div", "text": "<< Previous day Overview page Next day >> Home About How\n        to help Issues News Links Lens Photos Contact\n        us"}, {"tag": "p", "text": "SSFI's mission is to share the love of Jesus Christ with the people\n      of southern Sudan  in a way that leads  them towards peaceful\n      and self-reliant living from the grassroots level, so that available\n      resources will meet the needs of their communities. Copyright\n      (c) 1999 by SSFI. All rights reserved."}]}
{"file_number": "170", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "p", "text": "Skip to main content"}, {"tag": "div", "text": "Go to: Guardian Unlimited home UK news World news Comment is free blog Newsblog Sport blog arts & entertainment blog Podcasts ---------------------- Archive search Arts and entertainment Books Business EducationGuardian.co.uk Environment Film Football Jobs Life and health MediaGuardian.co.uk Money Music The Observer Politics Science Shopping SocietyGuardian.co.uk Sport Talk Technology Travel Been there ---------------------- Audio Email services Special reports The Guardian The northerner The wrap ---------------------- Advertising guide Crossword Events / offers Feedback Garden centre GNM press office Graduate GuardianFilms Headline service Help / contacts Information Living our values Newsroom Notes & Queries Reader Offers Soulmates dating Style guide Syndication services Travel offers TV listings Weather Web guides Working for us ---------------------- Guardian Abroad Guardian Monthly Guardian Weekly Money Observer Public Learn Guardian back issues Observer back issues Guardian Professional <a href=\"http://ads.guardian.co.uk/click.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Sport&amp;section=116640&amp;country=(none)&amp;rand=0508361\">\n\t\t\t\t\t\t<img src=\"http://ads.guardian.co.uk/image.ng/Params.richmedia=yes&amp;location=top&amp;spacedesc=banner&amp;site=Sport&amp;section=116640&amp;country=(none)&amp;rand=0508361\"\n\t\t\t\t\t\twidth=\"468\"\n\t\t\t\t\t\theight=\"60\"\n\t\t\t\t\t\tborder=\"0\"\n\t\t\t\t\t\talt=\"Advertisement\"></a> Read today's paper · Jobs"}, {"tag": "div", "text": "Search: Guardian Unlimited Web Home Football Cricket Rugby union Small talk Tennis Horse racing Golf Blog Betting The Ashes Rugby league The Spin Chess Formula one The Gear"}, {"tag": "div", "text": "Search Sport"}, {"tag": "div", "text": "Search all jobs Lions tour 2005"}, {"tag": "div", "text": "Printable version | Send it to a friend | Save story"}, {"tag": "div", "text": "Privacy policy | Terms & conditions | Advertising guide | A-Zindex | About this site Guardian Unlimited © Guardian News and Media Limited 2006"}]}
{"file_number": "171", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""}, {"tag": "p", "text": "Please note: Your browser has been unable to\nload the stylesheet that accompanies this page.  The page is still readable. [ Accessibility statement ] [ Skip to navigation ]"}, {"tag": "div", "text": "Websites Scotsman.com websites News Sport Business The Scotsman Scotland on Sunday Edinburgh Evening News Dating Jobs Motors Property Business Finder Member Centre Web Feeds Media Pack Site Help Digital Archive 1817-1950 Photo Gallery Reader Holidays Scotsman Calendar Money Fantasy Golf Haggis Hunt Edinburgh Festivals Heritage & Culture Living Weather Webcams Search | Site map Jobs | Property | Motors | Dating | Money Log in Register now - free! Member Centre Wednesday, 27th December 2006"}, {"tag": "div", "text": "Sun 28 Nov 2004 Printer friendly Send to friend"}, {"tag": "div", "text": "UEFA http://www.uefa.com/ Hearts FC http://www.heartsfc.co.uk Rangers FC http://www.rangers.co.uk"}, {"tag": "p", "text": "Related topics"}, {"tag": "div", "text": "UEFA Cup http://sport.scotsman.com/topics.cfm?tid=668 Rangers FC http://sport.scotsman.com/topics.cfm?tid=63"}, {"tag": "p", "text": "This article: http://sport.scotsman.com/topics.cfm?tid=668&id=1367012004 Last updated: 28-Nov-04 01:13 GMT"}, {"tag": "h2", "text": "UEFA Cup: page 23"}, {"tag": "div", "text": "RSS Email Alerts Transformed Alkmaar threatening to spoil Ricksen's homecoming party (28-Nov-04) Race row casts a dark shadow over clubs' successes (28-Nov-04) Calculated gamble paid off in Basel (27-Nov-04) Co-efficient rise could see six sides in Europe (27-Nov-04) O'Neill blast for Rijkaard over 'anti-football' jibe (27-Nov-04) Swiss bliss for John as Hearts soar (26-Nov-04) Dramatic strike seals glory night for Hearts (26-Nov-04) Neilson snatches a famous victory (26-Nov-04) Jambo feat could boost Scots game (26-Nov-04) McLeish keen to stay top (26-Nov-04) Rangers up the gears to hit top spot (26-Nov-04) Imissed my glory goal (26-Nov-04) Victory has McLeish targeting top finish (26-Nov-04) Robinson fears UEFA rap for fans' pitch charge (26-Nov-04) Ateam full of heroes (26-Nov-04) Schalke stay on course (26-Nov-04) Page 23 of 47"}, {"tag": "h2", "text": "Web links"}, {"tag": "div", "text": "UEFA Hearts FC Rangers FC"}, {"tag": "h3", "text": "HUNTING SEASON"}, {"tag": "p", "text": "It's open season on haggis once more as the annual hunt gets under way"}, {"tag": "div", "text": "haggishunt.com"}, {"tag": "h3", "text": "SCORE FOR YOUR SCHOOL"}, {"tag": "p", "text": "Register now and you could win CIS kit, SFA training and equipment for your school"}, {"tag": "div", "text": ">>"}, {"tag": "h3", "text": "SUPERSCOTCASINO"}, {"tag": "p", "text": "Play SuperScotCasino - win, win, win! All prizes paid in cash"}, {"tag": "h3", "text": "FOLLOW HEARTS?"}, {"tag": "p", "text": "Sign up for FREE Hearts alerts and get all the latest news direct to your mobile"}, {"tag": "div", "text": "Find out more >>"}, {"tag": "h3", "text": "FOOTBALL BRIEFING"}, {"tag": "p", "text": "Aweekly dose of gossip and rumours from the football  grounds of Scotland"}, {"tag": "div", "text": "Sign up now >>"}, {"tag": "h3", "text": "FOOTBALL"}, {"tag": "div", "text": "Tables - Results - Reports"}, {"tag": "h3", "text": "FOLLOW HIBS?"}, {"tag": "p", "text": "Sign up for FREE Hibs alerts and get all the latest news direct to your mobile"}, {"tag": "div", "text": "Find out more >>"}, {"tag": "h2", "text": "Navigation menu"}, {"tag": "h3", "text": "Sections"}, {"tag": "div", "text": "Top Stories Latest News Football Rugby Golf Racing Motorsport Cricket Tennis Athletics Boxing Snooker Other Sports Article Index"}, {"tag": "h3", "text": "Topics"}, {"tag": "div", "text": "State of Scottish Golf UEFA Cup Andrew Murray Champions' League Heineken Cup Topics Ato Z"}, {"tag": "h3", "text": "Other Sites"}, {"tag": "div", "text": "News Business The Scotsman Scotland on Sunday Evening News Heritage & Culture Living Money ©2006 Scotsman.com | contact | terms & conditions"}]}
{"file_number": "172", "non_ground_truth": [{"tag": "div", "text": "Yahoo! My Yahoo! Mail Yahoo! Search Search: Sign In New User? Sign Up Sports Home - Help"}, {"tag": "div", "text": "Home NFL MLB NBA NHL NCAAF NCAA Hoops NASCAR Golf Tennis Soccer More Fantasy Shop"}, {"tag": "div", "text": "NASCAR Home Features Standings Schedule & Results Stats Drivers Photos Rumors"}, {"tag": "div", "text": "ADVERTISEMENT <script language=\"JavaScript\" type=\"text/javascript\">document.write('<a href=\"http://us.ard.yahoo.com/SIG=12j3r32pu/M=567024.10007603.10691801.1806201/D=sports/S=96657732:LREC/Y=YAHOO/EXP=1167185291/A=4303347/R=1/SIG=12kjn4h5b/*http://clk.atdmt.com/NYC/go/yhxxxccs0220000907nyc/direct/01/?time=1167178091642596\" target=\"_blank\"><img src=\"http://view.atdmt.com/NYC/view/yhxxxccs0220000907nyc/direct/01/?time=1167178091642596\"/></a>');</script><noscript><a href=\"http://us.ard.yahoo.com/SIG=12j3r32pu/M=567024.10007603.10691801.1806201/D=sports/S=96657732:LREC/Y=YAHOO/EXP=1167185291/A=4303347/R=2/SIG=12kjn4h5b/*http://clk.atdmt.com/NYC/go/yhxxxccs0220000907nyc/direct/01/?time=1167178091642596\" target=\"_blank\"><img border=\"0\" src=\"http://view.atdmt.com/NYC/view/yhxxxccs0220000907nyc/direct/01/?time=1167178091642596\" /></a></noscript>"}, {"tag": "div", "text": "Sponsor Results Mark Martin Diecast Mark Martin diecast, Viagra, Kraft, Pfizer, Folgers, Stroh's Light, Orange retro signed. www.thesundayhauler.com Mark Martin Merchandise at Tailgate Town Find a large selection of Mark Martin merchandise. Auniversal shopping store, Tailgate Town offers a 100% satisfaction guarantee. www.universalshopping.com Mark Martin Online Mega Store Buy online from our huge selection of Mark Martin diecast and apparel. www.copperstateracing.com More from Jerry Bonkowski"}, {"tag": "div", "text": "• Offseason caps: Rudd, Bodine, Wood Dec 26, 2006 Archive"}, {"tag": "div", "text": "Recent News"}, {"tag": "div", "text": "• Offseason caps: Rudd, Bodine, Wood • Auto Racing 2006: Johnson, Hornish win big but quietly • Plan for Washington track lacks legislative support"}, {"tag": "div", "text": "Search: Yahoo! Sports Yahoo! News The Web for"}, {"tag": "div", "text": "Copyright © 2006 Yahoo! Inc. All rights reserved. Privacy Policy - Terms of Service - Copyright/IP Policy - Help - Site Map"}]}
{"file_number": "173", "non_ground_truth": [{"tag": "div", "text": "Stereophile :: Home Theater :: Ultimate AV :: Audio Video Interiors :: Shutterbug :: Home Entertainment Show"}, {"tag": "div", "text": "Here's the fastest way to bring home the only magazine that entertains, informs and educates its readers about the latest technology-- Stereophile Magazine --at no risk!  During this special online offer, you can get a TRIAL ISSUE and receive 11 more (a total of 12 issues) for ONLY $12.97- you save over $58 off the cover price! If you choose not to subscribe, just write \"cancel\" on your invoice, send it back and owe nothing. Either way the trial issue is yours to keep--without obligation.  Just complete the information below and click submit. GIVE A GIFT"}, {"tag": "div", "text": "Email: First Name: Last Name: Address Line 1: Address Line 2: City: State: Zip: Select a payment option:"}, {"tag": "div", "text": "Charge my credit card Bill me later"}, {"tag": "div", "text": "Do you have a promotional coupon code? Enter Code: Please send me special offers and exclusive promotions from Stereophile's premiere partners."}, {"tag": "div", "text": "> Recent Additions > Budget Components > Tube Preamps > Tube Power Amps > Solid-State Preamps > Solid-State Power Amps > Integrated Amps/Receivers > Phono Preamps > Cables > Phono Accessories > Powerline Accessories > Room Acoustics Treatments > Stands/Racks > Headphones/Headphone Accessories > Miscellaneous > Floorstanding Loudspeakers > Standmounted/Bookshelf Loudspeakers > Subwoofers > CD Players/Transports > Hi-Rez Disc Players/Transports > Digital Processors > Computer Audio > Media Servers/MP3 Players > Turntables > Tonearms > Phono Cartridges > FM Tuners > As We See It > Listening / Art Dudley > The Fifth Element / John Marks > Music in the Round / Kal Rubinson > Fine Tunes / Jonathan Scull > Special Features > Reference > Interviews > Think Pieces > Historical > Recording of the Month > Records 2 Die 4 > Music/Recordings > Wes Phillips > Stephen Mejias > Robert Baird > Forums > Galleries > Vote > Previous Votes > Audio News > Past eNewsletters > CES 2006 Reports > FSI 2006 Reports > HE 2006 Reports > CEDIA 2006 Reports > Hi-Fi News 2006 Reports > RMAF 2006 Reports > China 2006 Reports > Record Reviews > Groove Migrations > Vikuiti See Clear Now > XM Experience > Dealer Locator > AV Links > Current Issue > Master Article Index > Audiophile Societies > Contact Us > Customer Service > Recordings > Backissues > More . . . > AV Marketplace > Phono Preamp > Hi-Fi > Phono Cartridge > Amplifiers > Stereo Speakers > Ultimate AV > Home Theater > Audio Video Interiors > Shutterbug > Home Entertainment Show"}, {"tag": "div", "text": "Home/News | Subscribe | Give a Gift | Sub Services | Recordings | Back Issues | Buyer's Guide | AV Marketplace Print & Web Media Kit | Privacy | Terms of Use | Contact Us Copyright © Primedia Magazines, Inc.  All rights reserved."}]}
{"file_number": "174", "non_ground_truth": [{"tag": "div", "text": "Filed under: Presidential Politics — Jimmie @ 9:22 pm"}, {"tag": "h2", "text": "1 Comment »"}, {"tag": "p", "text": "Actually, Iheard “internets”.  There are rumours out there on them “internets”. Comment by ip dispassionately — October 08, 2004 @ 9:31 pm RSS feed for comments on this post. TrackBack URI"}, {"tag": "h2", "text": "Leave a comment"}, {"tag": "p", "text": "Name (required) Mail (will not be published) (required) Website"}, {"tag": "div", "text": "The Shack Staff: Jimmie The Shack Disclaimer: What's written here belongs to the author and is the author's opinion only. We don't speak for our employers, our schools, or any particular political candidate who might later pay us to be a \"technical consultant\". We like e-mails, but we also consider e-mails about our posts to be blogging-fodder. Don't troll. We hate trolls. Play nice in the comments or your comment could get edited or deleted. General Sundry Samples Political Pontifications Presidential Politics Moonbat Nonsense The Quotable Howard Dean Blogs and Blogging The Shack Guest Blogging Stand The Watchers’ Council Stuff I Like Music Pop Culture Hey, Mr. Science Guy! It’s Entertainment! My Beloved Redskins Our Foreign Policy Stopping Terrorism Huh? What?? List O’Rama A Voice From the Outer World Oh, THAT liberal media. Cool Columnists and Other Such Media Critters Easongate The Good Old US of A Free Speech (?) The Economy and Your Money Oh Maryland My Maryland. The World At Large Alliances and Allies Anti-Americanism Our Friends, The Europeans Gimme that Old Time Religion Project Hero Our New Democratic Overlords The Social Issues The Republican Minority No More Tyrants The Long War Here At Home Washington Wizards and Other Hoops Happenings"}, {"tag": "h2", "text": "Recent Comments:"}, {"tag": "div", "text": "Cassandra on \"Merry Christmas!\" EdWonk on \"So, Mr. President. What Will It Be?\" harrison on \"Senator Santorum and the Speech You Must Read\" Ms. Cornelius on \"RIP - Ambassador Kirkpatrick\" harrison on \"Iran's Plan, on the Second Page\""}, {"tag": "h2", "text": "Recent Trackbacks:"}, {"tag": "div", "text": "Andrew Olmsted dot com on So, Mr. President. What Will It Be? The Glittering Eye on So, Mr. President. What Will It Be? Andrew Olmsted dot com on Iran's Plan, on the Second Page The Glittering Eye on Iran's Plan, on the Second Page Anonymous on Snuggling Tyrants for Stability Blogroll Me! The Chickenhawk FAQ Monthly Archives Yep, everything here is free for you. But if you want to make a donation, who's going to stop you? Ibet you'll get a lot of gratitude! But you won't get gratuitous begging here. Just this note. If you want to donate to Jimmie, you can either visit his wish list or make a donation by clicking on the button below. Who Links Here"}, {"tag": "p", "text": "Designed by: Powered by: Hosted by:"}, {"tag": "div", "text": "Login Register RSS 2.0 Comments RSS 2.0 Valid XHTML The Watcher's Council Watcher of Weasels The Education Wonks Right Wing Nut House The Glittering Eye Gates of Vienna Rhymes with Right The Strata-Sphere Socratic Rhythm Method Shrink Wrapped Done With Mirrors Joshua Pundit AbbaGav Iraq-America Freedom Alliance Potomac Ponderings No Pundit Intended Blog Iran! Qand O James Lileks: The Bleat The Washington Post The Washington Times James Taranto's Best of the Web The New York Times Fox News The Baltimore Sun SciTech Daily CBC Online Sky News The National Review Online The New Republic Online City Journal OpinionDuel - The New Republic vs. The National Review The Weekly Standard Fact Check MEMRI Trebuchets! The X-Prize The X-Prize Cup everypoet.com Web Gallery of Art Astronomy Pic of the Day The Libertarian Party Homestar Runner How Stuff Works Men's News Daily css Zen Garden SharpReader RSS Aggregator The Classical Archive"}]}
{"file_number": "175", "non_ground_truth": [{"tag": "div", "text": "Contact About Links Gallery Hotels Living and investing in Switzerland"}, {"tag": "div", "text": "Home Swiss Residency Swiss bank accounts Tourist Guide Table of contents Geneva Lake Geneva Lausanne Valais The arc jurassien Basel Mittelland Bern Bernese Oberland Lucerne Zentralschweiz Zurich Northeast Graubuenden Ticino Swiss culture Travel basics Getting there Red tape Insurance Information and maps Money and costs Currency Carrying and changing money Plastic money Cash and cheques Some basic costs Getting around Hotels Swiss food Health Travellers with disabilities The media Sports Business hours Trouble and the police Post, phone and internet Directory Index Photo Gallery Museums Hotels Swiss Maps Links Photo Gallery Business Guide Relocation Guide Celebrities in Switzerland Contact us About us Site map Visit our other sites : Swiss-bank-accounts.com Live-in-switzerland.com www.housesearch.ch"}, {"tag": "div", "text": "Copyright Rough Guides The information contained in this website is not meant to substitute qualified legal advice given by a specialist knowing your particular situation. We can accept no responsibility for the consequences of decisions made following information found on this website. Mic heloud & Cie is not a bank and neither sollicits nor accepts deposits. Currency conversion and interest rates provided on this website are listed for informational purpose only and may not be up-to-date. More >>"}, {"tag": "div", "text": "Mi ch el oud & Cie 2006     No part of this site may be reproduced in any form or by any means without our prior written permission. Printed from http://Switzerland.isyours.com/e/guide/basics/carrying.html"}]}
{"file_number": "176", "non_ground_truth": [{"tag": "div", "text": "TEACHERS | ADMINISTRATORS | GROUPS MY LINKS: chat center Chatboards Chat Center Teachers Administrators Librarians Grade Level EC/Pre-K Kindergarten Primary Elem Upper Elem Middle School High School College Instr Adult Educ Multiage Classrm Subject Area Math English Science SS/Geog/Hist Art Music Region US States Canadian Teachers.Net UK Teachers.Net NZ/AU Teachers.Net Interest Groups Administrators Librarians/Media Specialists Montessori Teachers Professional Readings Beginning Teachers Student Teachers Substitute Teachers Gifted/AP (GATE) Special Educ Teachers Private School Teachers Classroom Discipline Classroom Management Brain-Compatible Learning Counselors Retired Teachers NBPTS/EC-GEN NBPTS/ES-GEN Classifieds Help Wanted Books for Sale Items Wanted Teaching Supplies Teacher Created Manipulatives Educ Games Educ Software Fundraising Miscellaneous Educ Programs Distance Learning Distance Teaching Continuing Education Tutors Wanted Tutoring Services Lessons New Lessons Add a Lesson Browse Lessons Search Lessons Jobs Search Jobs Post Resume Post Job Listings Resume Search Distance Learning Mailrings Harry Wong Projects Project Switchboard Classroom Centers Professional Readings Grant Writing Fundraising Eco-Chatboard 100 Days Traveling Buddies Classroom Pets Pen Pals Post Cards Live Chat Advertising"}, {"tag": "div", "text": "Teachers.Net Nav Chat Center Teachers Administrators Help Wanted Classified Ads"}, {"tag": "div", "text": "TEACHERS.NET GAZETTE APRIL 2001 Volume 2 Number 4"}, {"tag": "div", "text": "COVER STORY Harry & Rosemary Wong provide more sage advice for the new teacher.  Tune in to this month's Gazette cover story and hear what the Wongs have to say about mentoring and teacher induction...."}, {"tag": "div", "text": "COLUMNS Effective Teaching by Harry & Rosemary Wong Promoting Learning by Marv Marshall Alfie Kohn Article 4 Blocks by Cheryl Sigmon School Psychologist by Beth Bruno Jan Fisher Column BCL Classroom by Kim Tracy The Arts by Fink & Heath ARTICLES ADD Kids & Success in Classroom Beginning Teacher Induction Science Teacher Workshops Around the Block With... Adapting for the Sight Impaired Between the Lines Software To Improve Reading Skills Role Of Language In Science Classrooms Internet Navigation Tips and Toys Tolerance Using The Web For Student-Writers The Relevance of The Gifts of All Children Non-Ability Grouping for Reading Instruction From The Peace Corps Back To Teaching On Spelling/Reading Relationships Coping with a School Fire Technology Integration's Motto: Ready, Fire, Aim M.Ed. Degree Without Leaving Home Preparing a Life Resume Gazette Authors in Print! Super Sarah Word Warrior Brain Research Oversold? Communication In Distance Learning Our Schools Today QChord Receives EC Awards REGULAR FEATURES Upcoming Ed Conferences Letters to the Editor New in the Lesson Bank Help Wanted - Teaching Jobs Gazette Back Issues Gazette Home Delivery:"}, {"tag": "div", "text": "About Cheryl Sigmon... Cheryl Sigmon is the author of Implementing the 4-Blocks Literacy Model (Carson-Dellosa, 1997) and the co-author with Pat Cunningham and Dottie Hall of The Teachers Guide to the Four Blocks (Carson-Dellosa, 1999).  Cheryl was a classroom teacher for a number of years. For nine years she was a language arts consultant for the SC Department of Education, where she worked in K-12 classrooms to help schools strengthen language arts programs. Since January 1999, she has been a freelance consultant, helping thousands of teachers across the United States implement the Four Blocks Model."}, {"tag": "p", "text": "More articles by Cheryl Sigmon ."}, {"tag": "div", "text": "The 4 Blocks Center... Teachers.Net is proud to support Pat Cunningham ( patcunningham@teachers.net ), Cheryl Sigmon ( cherylsigmon@teachers.net ), and their colleagues in the research and development of the 4 Blocks method.  Join our community of teachers across the country working with 4 Blocks every day.  Visit and contribute to the 4 Blocks and Building Blocks chatboards, and subscribe to a Four Blocks Mailring.  It's like having the foremost authorities in 4 Blocks teaching right next door!"}, {"tag": "p", "text": "Bookmark the 4 Blocks Center ."}, {"tag": "div", "text": "Best Sellers"}, {"tag": "p", "text": "True Stories From 4 Blocks Classrooms $21.99 from Amazon.com More information Teachers Guide To Building Blocks $18.75 from Amazon.com More information Implementing the 4-Blocks Literacy Model by Cheryl Sigmon $16.99 from Amazon.com More information Classrooms That Work : They Can All Read and Write by Patricia Cunningham $20.00 from Amazon.com More information Making More Words : Multilevel, Hands-On Phonics and Spelling Activities by Patricia M. Cunningham, Dorothy P. Hall $14.39 from Amazon.com More information"}, {"tag": "div", "text": "Web Teachers.Net"}, {"tag": "div", "text": "Site Map: Jump to... --------- Teacher Jobs Chatboards Lesson Plans Local Network Project Center Chatrooms Meetings Mailrings Classified Ads ** Forums ** Teacher Chatboard Administrators Media Spec/Lib Retired Teachers Pre-School(EC) Kindergarten Primary Elem Upper Elem Middle School High School College Profs Student Teachers Begin Teachers Subst Teachers Classroom Mgmt Classrm Disci Multiage Classrm Adult Educ Gifted/Talented Special Educ Private School Montessori Prof Reading Counseling Jobhunters Math Teachers Science Teachers Social Studies Music Teachers Fine Art Teachers Health Chatboard PE/Coaching Brain-Compatible School Humor MESSAGE CENTER Letters to Editor Ed Advocacy Current Events Politics Gatherings Social Chatboard Golden Apples Inspirations Feedback ENGLISH CENTER Reading/Writing HS English Books & Liter Remedial Reading AR Chatboard 4Blocks Lit Bldg Blocks(K) 6Traits Writing Read Across Amer NBPTS STANDARDS EC-GEN Elem/Secondary LANGUAGE CENTER EFL/ESL French Teachers Spanish Teachers Trav/Study Abroad PROJECT CENTER Project Switchbd Classroom Centers Grant Writing Fundraising Earth Day 100 Days Traveling Buddies Classroom Pets Pen Pals Postcards TECH CENTER Computer/Tech Web Authors Ed Software Apple/Mac STATE TEACHERS AL Teachers AK Teachers AZ Teachers AR Teachers CA Teachers CO Teachers CT Teachers DE Teachers FL Teachers GA Teachers HI Teachers ID Teachers IL Teachers IN Teachers IA Teachers KS Teachers KY Teachers LA Teachers ME Teachers MD Teachers MA Teachers MI Teachers MN Teachers MS Teachers MO Teachers MT Teachers NE Teachers NV Teachers NH Teachers NJ Teachers NM Teachers NY Teachers NC Teachers ND Teachers OH Teachers OK Teachers OR Teachers PA Teachers RI Teachers SC Teachers SD Teachers TN Teachers TX Teachers UT Teachers VT Teachers VA Teachers DC Teachers WA Teachers WV Teachers WI Teachers WY Teachers -- AU/NZ Teachers Canadian Teachers UK Teachers Home Search Jobs Classifieds Lessons Contacts PR Advertise"}, {"tag": "div", "text": "© 1996 - 2006. All Rights Reserved. Please review our Terms of Use , Mission Statement , and Privacy Policy ."}, {"tag": "div", "text": "#\n312219"}]}
{"file_number": "177", "non_ground_truth": [{"tag": "p", "text": "About the Center Address & Directions E-mail Distribution List Executive Board History & Mission In the News Press Releases Sponsors Staff & Faculty Programs & Activities CIP Project Conferences Networked Economy Summit Science & Trade Policy Other Programs & Activities Site Navigation Search Site Map"}, {"tag": "div", "text": "1999-2003 George Mason University.  All rights reserved."}]}
{"file_number": "178", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "p", "text": "About Us | Privacy Policy December 26, 2006"}, {"tag": "div", "text": "Find a Therapist powered by Psychology \nToday New Search | Back To Results Previous Profile | Next Profile"}, {"tag": "div", "text": "Taking the first step toward getting help is often the most difficult --\nplease don't hesitate to: email the therapist(s) or send these details to a \nfriend now."}, {"tag": "div", "text": "Health Ato Zlists:"}, {"tag": "p", "text": "News & Views | Diseases & Conditions | Symptoms & Signs | Procedures & Tests | Medications | Medical Dictionary"}, {"tag": "div", "text": "Popular health centers:"}, {"tag": "p", "text": "Allergies | Arthritis | Cancer | Diabetes | Digestion | Healthy Kids | Heart | Men's Health | Mental Health | Women's Health | More..."}, {"tag": "div", "text": "Publications:"}, {"tag": "p", "text": "ePublications (PDFs) | XML News via RSS | Audio Newsletters & Podcasts | Email \n    Newsletters"}, {"tag": "div", "text": "MedicineNet.com:"}, {"tag": "p", "text": "About Us | Privacy Policy | Help | Search | Site Map | WebMD® | Medscape® | eMedicine® | eMedicineHealth® | onhealth & living® | RxList® 1996-2006 MedicineNet, Inc. All rights reserved. Notices and Legal Disclaimer. Information on this web site is provided for informational purposes only and is not a substitute for professional medical advice. You should not use the information on this web site for diagnosing or treating a medical or health condition. You should carefully read all product packaging. If you have or suspect you have a medical problem, promptly contact your professional healthcare provider. Statements and information regarding dietary supplements have not been evaluated or approved by the Food and Drug Administration. Please consult your healthcare provider before beginning any course of supplementation or treatment."}]}
{"file_number": "179", "non_ground_truth": [{"tag": "div", "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis!"}, {"tag": "div", "text": "Comments (0) // posted by Aaron @ 8:44 AM"}, {"tag": "h6", "text": "Links"}, {"tag": "div", "text": "Expert Witness Directory Michigan Lawyer Aaron Larson Personal Injury Information Lawyer Jokes The Political Graveyard Google Web Directory ExpertLaw Law Forums"}, {"tag": "h6", "text": "Interesting Reads"}, {"tag": "div", "text": "Talking Points Memo CJR Daily Fragmenta Philosophica Explananda Lies.com Polygon The Dancing Bear"}, {"tag": "h6", "text": "Legal Topics"}, {"tag": "div", "text": "Crime & Federalism Evan Schaeffer's Legal Underground How Appealing Michigan Medical Malpractice Appellate Law & Practice TalkLeft Greatest American Lawyer Have Opinion, Will Travel Mythago"}, {"tag": "h6", "text": "ARCHIVES"}, {"tag": "div", "text": "10/19/2003 - 10/25/2003 10/26/2003 - 11/01/2003 11/02/2003 - 11/08/2003 11/09/2003 - 11/15/2003 11/16/2003 - 11/22/2003 11/23/2003 - 11/29/2003 11/30/2003 - 12/06/2003 12/07/2003 - 12/13/2003 12/14/2003 - 12/20/2003 12/21/2003 - 12/27/2003 12/28/2003 - 01/03/2004 01/04/2004 - 01/10/2004 01/11/2004 - 01/17/2004 01/18/2004 - 01/24/2004 01/25/2004 - 01/31/2004 02/01/2004 - 02/07/2004 02/08/2004 - 02/14/2004 02/15/2004 - 02/21/2004 02/29/2004 - 03/06/2004 03/07/2004 - 03/13/2004 03/14/2004 - 03/20/2004 03/21/2004 - 03/27/2004 03/28/2004 - 04/03/2004 04/04/2004 - 04/10/2004 04/11/2004 - 04/17/2004 04/18/2004 - 04/24/2004 04/25/2004 - 05/01/2004 05/02/2004 - 05/08/2004 05/09/2004 - 05/15/2004 05/16/2004 - 05/22/2004 05/23/2004 - 05/29/2004 05/30/2004 - 06/05/2004 06/06/2004 - 06/12/2004 06/13/2004 - 06/19/2004 06/20/2004 - 06/26/2004 06/27/2004 - 07/03/2004 07/04/2004 - 07/10/2004 07/11/2004 - 07/17/2004 07/18/2004 - 07/24/2004 07/25/2004 - 07/31/2004 08/01/2004 - 08/07/2004 08/08/2004 - 08/14/2004 08/15/2004 - 08/21/2004 08/22/2004 - 08/28/2004 08/29/2004 - 09/04/2004 09/05/2004 - 09/11/2004 09/12/2004 - 09/18/2004 09/19/2004 - 09/25/2004 09/26/2004 - 10/02/2004 10/03/2004 - 10/09/2004 10/10/2004 - 10/16/2004 10/17/2004 - 10/23/2004 10/24/2004 - 10/30/2004 10/31/2004 - 11/06/2004 11/07/2004 - 11/13/2004 11/14/2004 - 11/20/2004 11/21/2004 - 11/27/2004 11/28/2004 - 12/04/2004 12/05/2004 - 12/11/2004 12/12/2004 - 12/18/2004 12/19/2004 - 12/25/2004 01/02/2005 - 01/08/2005 01/09/2005 - 01/15/2005 01/16/2005 - 01/22/2005 01/23/2005 - 01/29/2005 01/30/2005 - 02/05/2005 02/06/2005 - 02/12/2005 02/13/2005 - 02/19/2005 02/20/2005 - 02/26/2005 02/27/2005 - 03/05/2005 03/06/2005 - 03/12/2005 03/13/2005 - 03/19/2005 03/20/2005 - 03/26/2005 03/27/2005 - 04/02/2005 04/03/2005 - 04/09/2005 04/10/2005 - 04/16/2005 04/17/2005 - 04/23/2005 04/24/2005 - 04/30/2005 05/01/2005 - 05/07/2005 05/08/2005 - 05/14/2005 05/15/2005 - 05/21/2005 05/22/2005 - 05/28/2005 05/29/2005 - 06/04/2005 06/05/2005 - 06/11/2005 06/12/2005 - 06/18/2005 06/19/2005 - 06/25/2005 06/26/2005 - 07/02/2005 07/03/2005 - 07/09/2005 07/10/2005 - 07/16/2005 07/17/2005 - 07/23/2005 07/24/2005 - 07/30/2005 07/31/2005 - 08/06/2005 08/07/2005 - 08/13/2005 08/14/2005 - 08/20/2005 08/21/2005 - 08/27/2005 08/28/2005 - 09/03/2005 09/04/2005 - 09/10/2005 09/11/2005 - 09/17/2005 09/18/2005 - 09/24/2005 09/25/2005 - 10/01/2005 10/02/2005 - 10/08/2005 10/09/2005 - 10/15/2005 10/16/2005 - 10/22/2005 10/23/2005 - 10/29/2005 10/30/2005 - 11/05/2005 11/06/2005 - 11/12/2005 11/13/2005 - 11/19/2005 11/20/2005 - 11/26/2005 11/27/2005 - 12/03/2005 12/04/2005 - 12/10/2005 12/11/2005 - 12/17/2005 12/18/2005 - 12/24/2005 12/25/2005 - 12/31/2005 01/01/2006 - 01/07/2006 01/08/2006 - 01/14/2006 01/15/2006 - 01/21/2006 01/22/2006 - 01/28/2006 01/29/2006 - 02/04/2006 02/05/2006 - 02/11/2006 02/12/2006 - 02/18/2006 02/19/2006 - 02/25/2006 02/26/2006 - 03/04/2006 03/05/2006 - 03/11/2006 03/12/2006 - 03/18/2006 03/19/2006 - 03/25/2006 03/26/2006 - 04/01/2006 04/02/2006 - 04/08/2006 04/16/2006 - 04/22/2006 04/23/2006 - 04/29/2006 04/30/2006 - 05/06/2006 05/07/2006 - 05/13/2006 05/14/2006 - 05/20/2006 05/21/2006 - 05/27/2006 05/28/2006 - 06/03/2006 06/04/2006 - 06/10/2006 Thomas Dew"}]}
{"file_number": "180", "non_ground_truth": [{"tag": "div", "text": "The Library of Congress > THOMAS Home > Committee Reports > \n        Search Results"}, {"tag": "div", "text": "THIS SEARCH THIS DOCUMENT GOTO Next Hit Forward New Search Prev Hit Back Home Page Hit List Full Display Help Contents Display"}, {"tag": "div", "text": "Full Display Related Information PDF Printer Friendly Display Bill Summary and Status Full Text of Bill"}, {"tag": "div", "text": "THIS SEARCH THIS DOCUMENT GOTO Next Hit Forward New Search Prev Hit Back Home Page Hit List Full Display Help Contents Display"}, {"tag": "div", "text": "THOMAS Home | Contact | Accessibility | Legal | FirstGov"}]}
{"file_number": "181", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "User: Password: Register | Login help"}, {"tag": "div", "text": "My       pages Projects Communities"}, {"tag": "div", "text": "Get Involved java-net Project Request a Project Project Help Wanted Ads Publicize your Project Submit Content Get Informed About java.net Articles Weblogs News Events Also in Java Today java.net Online Books java.net Archives Get Connected java.net Forums Wiki and Javapedia People , Partners , and Jobs Java User Groups RSS Feeds Search Web and Projects: Online Books: Advanced Search"}, {"tag": "div", "text": "E-mail Print Discuss Blog"}, {"tag": "p", "text": "Showing messages 1 through 6 of 6."}, {"tag": "div", "text": "Novel but nova 2004-09-16 21:49:53 ricahrdc\n\n\n\n[ Reply | View ] Nova as in no go in spanish. Its just that we allready have a standard. Iv used it and frankly theres just not enough power in it as of right now to warrent the training for what is in my opinion little more than eye candy. Looking glass installation 2004-07-15 22:15:51 patryckson\n\n\n\n[ Reply | View ] ok.. i have a linux instaled on my pc.... i already install a jdk1.5.0 beta 2, Java 3D SDK 1.3.2-build4,  Java Advanced Imaging API (JAI) 1.1.2 JDK  and  lg3d-0.5.tar.gz... but i have a problem when i run the lg3d-dev aplication.. nothing happens...just appears at screen this message: /home/knoppix/plg/lg3d/bin /home/knoppix/plg/lg3d/bin /home/knoppix/plg/lg3d/bin [1] 1042 what i must to do to solve this problem? patryckson@hotmail.com Looking glass installation 2004-10-26 07:23:51 blackhex\n\n\n\n[ Reply | View ] Ihave same problem on Fedora Core 2 :-( Looking glass installation 2004-08-13 03:34:07 bobitavu\n\n\n\n[ Reply | View ] Hi, what's your videocard? Did you follow all insrtuctions about screendepth ? Looking glass installation 2004-07-16 05:18:45 wiverson\n\n\n\n[ Reply | View ] You should post these problems to the forums/mailing lists at: https://lg3d.dev.java.net/ Iam definitely looking forward for it. 2004-07-07 18:11:31 roguexz\n\n\n\n[ Reply | View ] After having seen a demo of OSX and the  way it has animation induced into its desktop environment, i am definitely looking forward to have a 3-Ddesktop environment on my m/c ;) -rogue"}, {"tag": "div", "text": "java.net RSS"}, {"tag": "div", "text": "Feedback | FAQ | Press | Terms of Use Privacy | Trademarks | Site Map Your use of this web site or any of its content or software indicates your agreement to be bound by these Terms of Participation . Copyright © 1995-2006 Sun Microsystems, Inc. Powered by Sun Microsystems, Inc., O'Reilly and CollabNet"}]}
{"file_number": "182", "non_ground_truth": [{"tag": "div", "text": "Enter Keywords in field and click Go International Travel Home Passports Home Visas Home Children & Family Home News and Updates Laws, Regulation & Public Policy About The Bureau of Consular Affairs External URLs"}, {"tag": "div", "text": "International Travel Home Traveling to the Caribbean, Bermuda, Panama, Mexico, or Canada? International Travel Information Travel Warnings Consular Information Sheets Public Announcements Avian Flu Fact Sheet Tips for Traveling Abroad Registration with Embassies Plan Your Trip Regional Information Safety Issues Health Issues Emergencies and Crises Family and Children's Issues U.S. Embassies and Consulates Travel Brochures Document Requirements Living Abroad Tips Residing Abroad Drugs Abroad Studying Abroad Teaching Abroad Benefits for Students & Teachers Additional Resources About Overseas Citizens’ Services Who We Are How to Contact Us"}, {"tag": "div", "text": "Home > International Travel Home > Tips for Traveling Abroad print email"}, {"tag": "div", "text": "No"}, {"tag": "h4", "text": "Other Government Websites"}, {"tag": "div", "text": "First Gov Service Locator Department of Homeland Security The White House more >"}, {"tag": "p", "text": "This site is managed by the Bureau of Consular Affairs, U.S. Department of State. External links to other Internet sites\n                     should not beconstrued as an endorsement of the views contained therein. Copyright Information Disclaimers"}]}
{"file_number": "183", "non_ground_truth": [{"tag": "div", "text": "This Hot Erotica Web Ring site owned by Hot Erotica"}, {"tag": "p", "text": "[ Prev | List | Stats ] [ Join | Rand | Next ] Powered by RingSurf !"}, {"tag": "h2", "text": "AWARDS"}, {"tag": "div", "text": "Society and Culture & fun cool stuff Progressive Women's Blog Ring Join | List | Previous | Next | Random | Previous 5 | Next 5 | Skip Previous | Skip Next Powered by RingSurf"}, {"tag": "h2", "text": "Recent Posts"}, {"tag": "div", "text": "Long Work Hours Suck The Life Out Of Your Marriage And Destroy Your Sex Life A Great Christmas Gift For Your Sweetie And You Thought Barbie Saying \"Math Is Hard\" Was Bad Deck The Halls My Life Was Made Into A Very Bad Movie Starring Malcolm McDowell Boy, Did This Quiz Nail Me Y'Almost Got Me Talk About Giving Good Buzz Male Birth Control Pill In The Works Death Popcorn - The Best Kind There Is Syndicate this site (XML) Add me to your TypePad People list Powered by TypePad"}, {"tag": "div", "text": "moon phases"}, {"tag": "div", "text": "SEARCH"}, {"tag": "h2", "text": "Recent Comments"}, {"tag": "div", "text": "Tata on My Life Was Made Into A Very Bad Movie Starring Malcolm McDowell on Male Birth Control Pill In The Works on Male Birth Control Pill In The Works zuzu on Long Work Hours Suck The Life Out Of Your Marriage And Destroy Your Sex Life ginmar on Male Birth Control Pill In The Works TramadoL69399 on Death Popcorn - The Best Kind There Is TramadoL38112 on Death Popcorn - The Best Kind There Is Angelina San Jurjo on Angelina Jolie's Humanitarian Work TramadoL50627 on Death Popcorn - The Best Kind There Is TramadoL54535 on Death Popcorn - The Best Kind There Is"}, {"tag": "h2", "text": "Archives"}, {"tag": "div", "text": "December 2006 November 2006 October 2006 September 2006 August 2006 July 2006 June 2006 May 2006 April 2006 March 2006"}, {"tag": "h2", "text": "Erotica Blogs/Web Sites"}, {"tag": "div", "text": "Ellora's Cave Romantica Publishing - Home/New Releases ErosBlog Erotica Readers & Writers Association NaughtyWords Sex-Kitten.net ~ Home of playful, modern pin-up women Tit-Elation Writer's Guidelines Vibrator.com"}, {"tag": "h2", "text": "Food Blogs"}, {"tag": "div", "text": "eat stuff Cooking With Amy Chocolate and Zucchini Amuse Bouche A La Cuisine! Accidental Hedonist The Sneeze"}, {"tag": "h2", "text": "Poli-Blogs"}, {"tag": "div", "text": "A Blog Around The Clock Action Figures Sold Separately Alas A Blog (Ampersand) American Street Armed Liberal Atrios Bitch, PhD. Blog Sisters Blogcritics BlondeSense Brutal Women Cruella Culture Cat Daily Kos Dru Blood Fatshadow feminist blogs Feministe Feministing Ginmar Hugo Schwyzer INTL-NEWS Iconochron Illia's Dreams Ilyka Damen Julie Saltman Karmalised Kathryn Kramer Kevin Drum (Washington Monthly) Lance Mannion Liberal Oasis Long Story, Short Pier Mad Kane’s Political Madness Media Girl - Empowered Meryl Yourish Michael Berube Noli Irritare Leones One Good Thing Pacific Views Pandagon AlterNet: Blogs: Peek Pharyngula Pinko Feminist Hellcat Plum Crazy Preemptive Karma Pseudo-Adrienne Rad Geek Random Thoughts Reclusive Leftist� politics, feminism, and random pedantry from the reclusive Dr. Violet Socks Red State Feminist Rob Findlay Rox Populi Rugo's Ramblings San Francisco Knitter Sappho's Breathing Shakespeare's Sister sinister girl Skippy State of Grace StoutDemBlog The Heretik The Sideshow The Well-Timed Period Tild~ Todas Utopian Hell Wampum Who Tends The Fires Willow Tree"}, {"tag": "h2", "text": "Law Blogs"}, {"tag": "div", "text": "A Soft Answer American Blog Association Davidson's Law Irritant #4 LawPundit NNFLP Not For Sheep Redux Talk Left"}, {"tag": "h2", "text": "The Liberal Coalition"}, {"tag": "div", "text": "All Facts and Opinions (Natalie Davis) And Then... Archy Bark Bark Woof Woof BlogAmy Bloggg Chris Collective Sigh Corrente Dohiyi Mir Echidne of the Snakes Edwardpig Iddybud It's Craptastic Kick the Leftist Left Is Right Make Me A Commentator MercuryX23's Fantabulous Blog Musing's Musings New World Blogger Norbizness Pen-Elayne (Elayne Riggs) Respectful of Otters Rick's American Cafe Rook's Rant Rubber Hose Sooner Thought Speedkill Steve Gilliard T. Rex's Guide to Life The Fulcrum The Gamer's Nook The Gotham City 13 The Invisible Library Trish Wilson's Blog (yeah, me) WTF Is It Now? Words On A Page Yellow Doggerel Democrat"}, {"tag": "h2", "text": "My Links"}, {"tag": "div", "text": "Emerging Women Writers Expository Magazine Feminista! My Web Site (mirror site) My Web Site, The Women's Network Scarlet Xodtica Romance"}, {"tag": "h2", "text": "Other Links"}, {"tag": "div", "text": "American Politics Journal Bartcop Fark Findlaw Irene Stuber Law.com Sexual Harassment Law Firms The Liz Library The Onion The Raw Story The Smoking Gun"}, {"tag": "h2", "text": "Categories"}, {"tag": "div", "text": "April Fools Archeology Books Current Affairs Darren Mack Family Issues and Family Law Fathers 4 Justice Fathers' Rights Film Food and Drink Friday Cat Blogging Fun Shit Games Humor Lowell Jaks/ANCPR Media Music News Religion Science Sexuality Stuck On Stupid Stuff I'm Reading Today Television Uru: Ages Beyond Myst Weblogs Weird Shit Without A Trace, CSI, Cold Case Women's And Children's Issues"}, {"tag": "p", "text": "« Crank Up Your iTunes! | Main | Black Women Bloggers »"}]}
{"file_number": "184", "non_ground_truth": [{"tag": "h4", "text": "Go to the previous page of reviews Go to the next page of reviews Return to my IF page Return to my home page"}, {"tag": "div", "text": "Paul O's 2002 Competition Game Reviews -- Page 4 / Paul O'Brian / obrian at colorado.edu / Revised November 2002"}]}
{"file_number": "185", "non_ground_truth": []}
{"file_number": "186", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\""}, {"tag": "div", "text": "Printer-friendly format Email this article"}, {"tag": "div", "text": "USC General Releases"}]}
{"file_number": "187", "non_ground_truth": []}
{"file_number": "188", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""}, {"tag": "div", "text": "Advanced Search/Archive Español | Français | Pycckuú | | |"}, {"tag": "p", "text": "You Are In: USINFO > Products > Washfile"}, {"tag": "div", "text": "Created:15 Jun 2005      Updated: 15 Jun 2005 Page Tools: Print this article E-mail this article"}, {"tag": "div", "text": "USINFO delivers information about current U.S. foreign policy and about American life and culture. \nThis site is produced and maintained by the U.S. Department of State's Bureau of International \nInformation Programs. Links to other internet sites should not be construed as an endorsement of the views contained \ntherein. Home | About USINFO | Site Index | Contact Us | Privacy Topics | Regions | Resource Tools | Products"}]}
{"file_number": "189", "non_ground_truth": [{"tag": "div", "text": "\"With our progress we have destroyed our only weapon against tedium: that rare weakness we call imagination.\" – Oriana Fallaci"}, {"tag": "p", "text": "December 26, 2006 New Why Radical Islam - And Why Now? by Victor Davis Hanson A Symphony Unheard by Craig Bernthal Whose Fiasco? by Victor Davis Hanson Curiosities Lest We Forget Update: 12/8/06 Angry Reader Update: 12/8/06 Pajama's Media Blog Update: 12/10/06 Calendar Update: 11/12/06 Questions for the Author Commentary What is Annanism? by Victor Davis Hanson High Anxiety by Bruce Thornton Talking to Iran by Victor Davis Hanson War-Making and the Machines of War by Victor Davis Hanson Israel Did It! by Victor Davis Hanson Our Pearl Harbor by Victor Davis Hanson Holy Wisdom by Bruce Thornton Losing the Enlightenment by Victor Davis Hanson Blood and Oil by Victor Davis Hanson Conquest and Concession by Raymond Ibrahim War Stories by Victor Davis Hanson Tough Idealism by Victor Davis Hanson Vanity Care by Dr. Linda Halderman Twisted Proverb by Raymond Ibrahim Will the West Stumble? by Victor Davis Hanson More Bark Than Bite? by Victor Davis Hanson The Fighting over the Fighting by Victor Davis Hanson Rethinking Illegal Immigration by Victor Davis Hanson The Sage and the Sword by Bruce Thornton My Bizarre Libyan Holiday by Victor Davis Hanson James Webb and Lessons in Make-Believe by Victor Davis Hanson Kerryism by Victor Davis Hanson Before Iraq by Victor Davis Hanson Last Month's Commentary Books & Things Who Were We? by Victor Davis Hanson The New Appeasement by Victor Davis Hanson The Wolf Pack by Bruce Thornton Worldly Ambitions by Bruce Thornton History and the Movie \"300\" by Victor Davis Hanson Free at Last by Victor Davis Hanson More Books and Things American Student in Paris Red-Carding America by Sarah Bernthal The Rights of Men? by Sarah Bernthal"}, {"tag": "div", "text": "Advertisement"}, {"tag": "p", "text": "More \"Why Radical Islam - And Why Now?\" December 24, 2006 A Symphony Unheard Go see The Nativity Story. by Craig Bernthal Private Papers"}, {"tag": "p", "text": "More \"A Symphony Unheard\" December 23, 2006 Whose Fiasco? by Victor Davis Hanson Policy Review Areview of Fiasco: The American Adventure in Iraq by Thomas E. Ricks (Penguin Press, 2006, pp. 496)"}, {"tag": "div", "text": "Home Author Archives Commentary Speaking Books About Us"}, {"tag": "p", "text": "Advertise on blogs"}, {"tag": "div", "text": "Advertisement"}, {"tag": "p", "text": "Contributors' Archives Victor Davis Hanson Bruce Thornton New Book See reviews of A War Like No Other Pajamas Media: VDH Blog"}, {"tag": "p", "text": "Click to send questions for the authors at this website. Donations You can donate to the development of Private Papers . For a donation of $30, you will receive 2 DVD set with interviews with VDH on warfare and his works. For a donation of $50, you will receive an autographed copy of A War Like No Other . For a donation of $75, you will receive both an autographed copy of A War Like No Other and the DVD set of interviews with VDH. Patrons who join the \"Voices of our Past\" tour of Classical Greece will also receive an autographed copy of A War Like No Other along with the DVD set of interviews with VDH. Private Papers is a production of Samwise Enterprises"}, {"tag": "div", "text": "Calendar of Speaking Events"}, {"tag": "p", "text": "At this time, there are no public events scheduled. We will update the calendar as information becomes available."}, {"tag": "div", "text": "Carnage and Culture Wars of the Ancient Greeks The Western Way of War"}]}
{"file_number": "190", "non_ground_truth": [{"tag": "div", "text": "Web Curator: Valerie Huemer"}]}
{"file_number": "191", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "div", "text": "Who Are We? Subscribe E-Mail Policy Linking Policy Stuff Blogroll Archives Pre-2004 Archives Search Home"}, {"tag": "div", "text": "[ Eugene Volokh , May 18, 2005 at  5:51pm ] 0 Trackbacks / Possibly More Trackbacks More on Women and Last Names:"}, {"tag": "h3", "text": "Contact"}, {"tag": "p", "text": "Dale Carpenter David Kopel David Bernstein David Post Erik Jaffe Eugene Volokh Fernando Tesón (guest-blogging) Ilya Somin Jim Lindgren Joanne Jacobs (guest-blogging) Jonathan Adler Puzzleblogger Kevan Choset Orin Kerr Randy Barnett Russell Korobkin Sasha Volokh Stuart Benjamin Todd Zywicki Tyler Cowen"}, {"tag": "h3", "text": "Subscribe"}, {"tag": "p", "text": "Headline RSS feed Full-content RSS feed Email Notification Get Posts by Email"}, {"tag": "h3", "text": "Features"}, {"tag": "p", "text": "Email Policy Linking Policy Select-A-Blogger Search Archives (2004-now) Archives (2002-2004)"}, {"tag": "h3", "text": "Stuff from us"}, {"tag": "p", "text": "Academic Legal Writing : personalized copies West Academic online store Sources on the Second Amendment Testimony on the Second Amendment Shards: Poems from the War"}, {"tag": "h3", "text": "Blogroll"}, {"tag": "p", "text": "InstaPundit OpinionJournal Federation Agoraphilia Althouse Bainbridge Becker-Posner BlackProf Concurring Opinions Conglomerate Dan Drezner Discourse.Net ecitsuJ Election Law Empirical Legal Studies Eric Muller Georgetown Law Faculty Blog Jack Balkin Language Log LawCulture Lawrence Solum Liberty & Power Marginal Revolution Michael Dorf Opinio Juris Orin Kerr Patry © PrawfsBlawg RantingProfs Reality-Based Community Religion Clause Right Coast Truth on the Market U Chicago Law Faculty Blog X-Judge How Appealing Decision of the Day Cal. App. Report Agora Appellate Law & Practice Michael Barone Best of the Web Blue Mass. Group Cathy Young CrimLaw Dave Kopel Legal Fiction Iain Murray Knowledge Problem Overlawyered Point of Law Technology Liberation Front Tom Palmer WSJ Law Blog Andrew Sullivan Cathy Seipp David Frum Emmanuelle Richard Geitner Simmons Hit & Run Joanne Jacobs KausFiles Ken Layne Lileks Matt Welch Milt's File Right on Race Ryan Lizza The Torch Virginia Postrel Wonkette Betsy's Page CalPundit Chris Newman Crescat Sententia Freespace GeekPress Gil Milbauer Intel Dump Janes' Blogosphere Max Power The National Debate NoodleFood OxBlog PejmanPundit Purr Se Rosenbergs Stuart Buck Matt Yglesias Reason Day by Day ScrappleFace"}, {"tag": "h3", "text": "Archives"}, {"tag": "p", "text": "Home 2006.12.24 - 2006.12.30 2006.12.17 - 2006.12.23 2006.12.10 - 2006.12.16 2006.12.03 - 2006.12.09 2006.11.26 - 2006.12.02 2006.11.19 - 2006.11.25 2006.11.12 - 2006.11.18 2006.11.05 - 2006.11.11 2006.10.29 - 2006.11.04 2006.10.22 - 2006.10.28 2006.10.15 - 2006.10.21 2006.10.08 - 2006.10.14 2006.10.01 - 2006.10.07 2006.09.24 - 2006.09.30 2006.09.17 - 2006.09.23 2006.09.10 - 2006.09.16 2006.09.03 - 2006.09.09 2006.08.27 - 2006.09.02 2006.08.20 - 2006.08.26 2006.08.13 - 2006.08.19 2006.08.06 - 2006.08.12 2006.07.30 - 2006.08.05 2006.07.23 - 2006.07.29 2006.07.16 - 2006.07.22 2006.07.09 - 2006.07.15 2006.07.02 - 2006.07.08 2006.06.25 - 2006.07.01 2006.06.18 - 2006.06.24 2006.06.11 - 2006.06.17 2006.06.04 - 2006.06.10 2006.05.28 - 2006.06.03 2006.05.21 - 2006.05.27 2006.05.14 - 2006.05.20 2006.05.07 - 2006.05.13 2006.04.30 - 2006.05.06 2006.04.23 - 2006.04.29 2006.04.16 - 2006.04.22 2006.04.09 - 2006.04.15 2006.04.02 - 2006.04.08 2006.03.26 - 2006.04.01 2006.03.19 - 2006.03.25 2006.03.12 - 2006.03.18 2006.03.05 - 2006.03.11 2006.02.26 - 2006.03.04 2006.02.19 - 2006.02.25 2006.02.12 - 2006.02.18 2006.02.05 - 2006.02.11 2006.01.29 - 2006.02.04 2006.01.22 - 2006.01.28 2006.01.15 - 2006.01.21 2006.01.08 - 2006.01.14 2006.01.01 - 2006.01.07 2005.12.25 - 2005.12.31 2005.12.18 - 2005.12.24 2005.12.11 - 2005.12.17 2005.12.04 - 2005.12.10 2005.11.27 - 2005.12.03 2005.11.20 - 2005.11.26 2005.11.13 - 2005.11.19 2005.11.06 - 2005.11.12 2005.10.30 - 2005.11.05 2005.10.23 - 2005.10.29 2005.10.16 - 2005.10.22 2005.10.09 - 2005.10.15 2005.10.02 - 2005.10.08 2005.09.25 - 2005.10.01 2005.09.18 - 2005.09.24 2005.09.11 - 2005.09.17 2005.09.04 - 2005.09.10 2005.08.28 - 2005.09.03 2005.08.21 - 2005.08.27 2005.08.14 - 2005.08.20 2005.08.07 - 2005.08.13 2005.07.31 - 2005.08.06 2005.07.24 - 2005.07.30 2005.07.17 - 2005.07.23 2005.07.10 - 2005.07.16 2005.07.03 - 2005.07.09 2005.06.26 - 2005.07.02 2005.06.19 - 2005.06.25 2005.06.12 - 2005.06.18 2005.06.05 - 2005.06.11 2005.05.29 - 2005.06.04 2005.05.22 - 2005.05.28 2005.05.15 - 2005.05.21 2005.05.08 - 2005.05.14 2005.05.01 - 2005.05.07 2005.04.24 - 2005.04.30 2005.04.17 - 2005.04.23 2005.04.10 - 2005.04.16 2005.04.03 - 2005.04.09 2005.03.27 - 2005.04.02 2005.03.20 - 2005.03.26 2005.03.13 - 2005.03.19 2005.03.06 - 2005.03.12 2005.02.27 - 2005.03.05 2005.02.20 - 2005.02.26 2005.02.13 - 2005.02.19 2005.02.06 - 2005.02.12 2005.01.30 - 2005.02.05 2005.01.23 - 2005.01.29 2005.01.16 - 2005.01.22 2005.01.09 - 2005.01.15 2005.01.02 - 2005.01.08 2004.12.26 - 2005.01.01 2004.12.19 - 2004.12.25 2004.12.12 - 2004.12.18 2004.12.05 - 2004.12.11 2004.11.28 - 2004.12.04 2004.11.21 - 2004.11.27 2004.11.14 - 2004.11.20 2004.11.07 - 2004.11.13 2004.10.31 - 2004.11.06 2004.10.24 - 2004.10.30 2004.10.17 - 2004.10.23 2004.10.10 - 2004.10.16 2004.10.03 - 2004.10.09 2004.09.26 - 2004.10.02 2004.09.19 - 2004.09.25 2004.09.12 - 2004.09.18 2004.09.05 - 2004.09.11 2004.08.29 - 2004.09.04 2004.08.22 - 2004.08.28 2004.08.15 - 2004.08.21 2004.08.08 - 2004.08.14 2004.08.01 - 2004.08.07 2004.07.25 - 2004.07.31 2004.07.18 - 2004.07.24 2004.07.11 - 2004.07.17 2004.07.04 - 2004.07.10 2004.06.27 - 2004.07.03 2004.06.20 - 2004.06.26 2004.06.13 - 2004.06.19 2004.06.06 - 2004.06.12 2004.05.30 - 2004.06.05 2004.05.23 - 2004.05.29 2004.05.16 - 2004.05.22 2004.05.09 - 2004.05.15 2004.05.02 - 2004.05.08 2004.04.25 - 2004.05.01 2004.04.18 - 2004.04.24 2004.04.11 - 2004.04.17 2004.04.04 - 2004.04.10 2004.03.28 - 2004.04.03 2004.03.21 - 2004.03.27 2004.03.14 - 2004.03.20 2004.03.07 - 2004.03.13 2004.02.29 - 2004.03.06 2004.02.22 - 2004.02.28 2004.02.15 - 2004.02.21 2004.02.08 - 2004.02.14 2004.02.01 - 2004.02.07 2004.01.25 - 2004.01.31 2004.01.18 - 2004.01.24 2004.01.11 - 2004.01.17 2004.01.04 - 2004.01.10 The Volokh Conspiracy uses and recommends :"}, {"tag": "div", "text": "Find ANY word Find ALL words Find EXACT phrase Help"}]}
{"file_number": "192", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "div", "text": "You are here: About > Health > Walking > Pedometer Walking > Walking Idol - Walking Minutes Challenge Walking Health Walking Essentials Walk Off Weight Walk of Life 10-Week Program Best Walking Shoes 10 Walking Mistakes Log Your Walks Topics Walking Off Weight Pedometer Walking Treadmills Beginners Fitness Walking & Workouts Walking Programs Walking Fast Half Marathon & Marathon Blisters and Heel Pain Get Healthy Walking What to Eat and Drink Walking Clubs and Partners Trails, Walk Events & Tours Walking Clothing & Gear Walking Shoes Buyer's Guide Best Pedometers Best Walking Shoes Budget Treadmills Treadmill Buying Tips Walking Gadgets Tools About Video Library Clinical Trials Finder Drug Finder Medical Encyclopedia Forums Most Popular Articles Latest Articles Help Walking Idols Newsletters & RSS Email to a friend Digg this story"}, {"tag": "h5", "text": "Related Blogs"}, {"tag": "p", "text": "Happy Feet Starling Fitness Discover Walking Walktopia Nordic Walking News The Fat Man Walking SportsGeezer"}, {"tag": "h5", "text": "Most Popular"}, {"tag": "p", "text": "Calories Per Day Calculator - Basal Metabolic Rate Best Pedometers Calories Burned Walking How to Walk for Weight Control Best Budget Treadmills"}, {"tag": "h5", "text": "Related Sites"}, {"tag": "p", "text": "Exercise Weight Loss Sports Medicine Yoga Running / Jogging"}, {"tag": "div", "text": "From Wendy Bumgardner , Your Guide to Walking . FREE Newsletter. Sign Up Now!"}, {"tag": "h5", "text": "Top Health Videos"}, {"tag": "p", "text": "How to Relax in 2 Minutes Bird Flu 101 Cold Medicine & Kids Controlling Food Portions Balancing Family & Self"}, {"tag": "h5", "text": "What's Hot"}, {"tag": "p", "text": "Nike Hatphones Grilled Swordfish Recipe Fat for the Holidays? Fat for the Holidays? Exercise and Nutri... Do I Need Bigger Shoes?"}, {"tag": "div", "text": "All Topics | Email Article | | Advertising Info | News & Events | Work at About | SiteMap | Reprints | Help Our Story | Be a Guide User Agreement | Ethics Policy | Patent Info. | Corrections | Privacy Policy ©2006 About, Inc., Apart of The New York Times Company . All rights reserved."}]}
{"file_number": "193", "non_ground_truth": [{"tag": "div", "text": "html PUBLIC \"-//w3c//dtd html 4.0 transitional//en\""}]}
{"file_number": "194", "non_ground_truth": [{"tag": "div", "text": "President Signs Medicare Rx Bill Into Law President George W. Bush signs H. R. 1, the Medicare Prescription Drug, Improvement and Modernization Act of 2003 on Dec. 8, 2003. Internship Opportunities Committee on Ways and Means Internship Opportunities Committee on Ways & Means U.S. House of Representatives | 1102 Longworth               House Office Building | Washington D.C. 20515 Phone: (202) 225-3625 | Fax: (202) 225-2610"}, {"tag": "div", "text": "Privacy Statement Home Adobe Acrobat Reader"}]}
{"file_number": "195", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\""}, {"tag": "div", "text": "JOIN US VISITING ISU ACADEMICS RESEARCH ATHLETICS ISU TODAY"}, {"tag": "div", "text": "Research Services Faculty Development Undergraduate IT Training Instructional \n\n\t\t\t\tTechnologies Interactive and Multimedia Design Services About Us Staff Directory"}, {"tag": "div", "text": "OFFICE OF INFORMATION TECHNOLOGY"}, {"tag": "div", "text": "PROSPECTIVE \n\nSTUDENTS ALUMNI \n\n& FRIENDS PARENTS \n\n& FAMILY BUSINESS \n\n& COMMUNITY ISU \n\nA-Z MyISU SEARCH"}, {"tag": "div", "text": "Caleb Mills Award Nomination Form"}, {"tag": "div", "text": "Last modified:  20-Nov-06     Maintained by: egruenert@isugw.indstate.edu 200 North Seventh Street, Terre Haute, Indiana, USA 47809-9989 Copyright 2006 by Indiana State \n\nUniversity . 1-800-GO-TO-ISU | 1-800-468-6478"}]}
{"file_number": "196", "non_ground_truth": [{"tag": "p", "text": "Dateline January 21-26 Events are open to the public free \n          of charge unless noted; films are shown at 7 and 9:30 p.m. in Gulick \n          Theatre (GT) and Hepburn 218 (H 218) unless noted. For More Information These Web sites have further news and notes\n  for the St. Lawrence community: Master \n          Calendar of Events NetNews News Releases Sports Releases Staff in the News TechBytes Pollstar Northcountrynow North Country\n  Public Radio Ticketmaster Ticketmaster Canada Musi-Cal Monday, January 21 Martin Luther King Jr. Day (see below) Classes Begin · Martin Luther King Jr. Day Observances: \n          Chapel service with remarks by President Sullivan, 5 p.m., followed \n          by a candlelight procession to The Underground for an \"open microphone\" \n          and video screening of I Have A Dream . Tuesday, January 22 · Women's Basketball: vs. Potsdam, \n          6 p.m. · Film: Training Day (GT), \n          R. · Men's Basketball: vs. Potsdam, \n          8 p.m. Wednesday, January 23 · Zen Meditation, Herring-Cole, 7:30 \n          p.m. Thursday, January 24 · Film: The Others (GT), \n          PG-13. Friday, January 25 · Men's Hockey: vs. Colgate, 7 p.m. Saturday, January 26 · Squash: SLU Tournament (Middlebury, \n          Connecticut College, William Smith), 10 a.m. · Indoor Track: SLU Classic, noon. · Film: Serendipity (GT), \n          PG-13. · Men's Hockey: vs. Cornell, 7 p.m. In Brush Gallery \"Out of the Woods and into the Fire,\" Bruce Gundersen and \n          Jerilea Zempel (sculptural works by two artists based in New York City \n          and the Adirondacks), January 21-February 13; \"Countdown to Eternity: \n          Photographs by Benedict J. Fernandez\" (photographs of Martin Luther \n          King Jr. and the Civil Rights Movement), January 21-February 13."}]}
{"file_number": "197", "non_ground_truth": [{"tag": "p", "text": "www.whyslopes.com advice & directions for students , parents ,\n  and teachers ,\n  approximately correct. Even if you have seen a site topic, look through site coverage for unique viewpoints not seen in your earlier days as a student or instructor. Volume 3, Why Slopes and More Math All results 5 results 10 results 20 results 30 results 50 results 100 Results [ Back ] [ Volume Entrance ] [ Next ] 22 Complex #'s put your ad here. (V) signals RealPlayer webvideo present. Area Content Foreword 1. Introduction 2. Second Preview Begins 2 Skier in Motion (V) 2 The Skier (V) 2. Position Dependent (V) 3 Slope & Extrema (V) 4 Single Factor Analysis (V) 4 Two Factor (V) 4 More Factors (V) 4 With Divisors (V) 5 Maxima & Minima Tests 6 Jumps & Discontinuities 8 Review  (optional) 9 On Calculus Studies 11 Slope of Slope 13  Acceleration 14 Limits & Error Control (V) 14 Limit of a Fn. 14. Ltd Error Control 14 Signif. Digits 14 Cauchy Limits 14 Sequence Limits 14 Decimal Arith. 15 What is Slope (V) 15 Slope Calculation (V) 15 Slope, a Limit 15 Tangent Lines 15 Linear Approx., 15 Limits via Algebra (V) 15 Recap. PS.Chain Rule for Polys PS Chain Rule- General  (V) - PS More Chain Rule (V) PS - Sign Analysis (V) 16 What is Velocity 17  What is Area 18 Integration 18 Area Calculation 18  Fn DefN, 6 Ways 19 Logs & Powers 19 Natural Log. 19 Exponential Fn. 20 What's Next 21 Add Vectors 22 Complex #'s 23 Complex #'s 23 Trig Identity 23 Proofs of. 24 Complex Logs etc"}, {"tag": "div", "text": "Units in Calculations: 7 Velocity 7 Varying Velocity Example 7. Velocity Calculation 7 Changing Units 7 Same Velocity  Motions 10 Slopes without Units. 10 Units & Slopes 10  Units in Cost vs. Quantity 10  How Units  Appear 10 Unit  Elimination 10 Partial Elimination 10 Interest & Units 12 More on Units Content Guide"}, {"tag": "div", "text": "again."}, {"tag": "p", "text": "What is a Variable? Introduction Variation between Examples Variation of Letters Aletter denotes a variable Cases of Double Variation Three Notions of a Variable Constants,Parameters,Variables Talking about numbers Arithmetic Videos Fractions Primes Greatest Common Divisors Least Common Multiples Square Root Simplification Online Volumes 1 Elements of Reason 1A. Pattern Based Reason 1B. Mathematics\nCurriculum Notes 2. Three Skills for\nAlgebra 3. Why\nSlopes and More Math More Site Areas : Helping\nYour Child or Teen Learn . Analytic\nGeometry Solving\nLinear Equations with Stick Diagrams Fractions, \nRatios, Rates, Proportions & Units Euclidean\nGeometry Analytic\nGeometry Number\nTheory . Calculus\nIntro Complex\nNumbers Odds & Ends Quebec\nMaths Education Real\nAnalysis LaTeX2HotEqn Good news: Site pages  identify what you need\nto study. Bad news: Site pages do not explain\neverything Worse news: Learning takes time, yours. Site Message: Calculus & calculus preparation give\na first reason & focus for learning and teaching most mathematics in school\nand  college. [ Top ] [ Back ] [ Volume Entrance ] [ Next ] site entrance site\nreviews Feedback\nand Contact Form Site uploaded with SmartFTP. Favourite Sites : BBC News and the Mathematics portion of English\nNational Curriculum Francais : || Dfinition\nd'une variable || Algbre || Arithmetique || Logique | | All trademarks and copyrights\non this page are owned by their respective owners. Copyright to comments &\ncontributions are owned by the Poster. The Rest  1995 onward by site author\nAlan Selby, Ph. D.  All Rights Reserved."}]}
{"file_number": "198", "non_ground_truth": [{"tag": "div", "text": "Operators Session leader(s): Amanda Hubbard,John Rice Physics operator(s): Ian Hutchinson Engineering operator(s): Gary Dekow,Bill Parkin Data Plots (hover mouse over plot to see maximum value)"}]}
{"file_number": "199", "non_ground_truth": [{"tag": "div", "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""}, {"tag": "div", "text": "Last update: 16 February 2005"}]}
{"file_number": "200", "non_ground_truth": [{"tag": "div", "text": "Read other stories in this issue. Return to our home page ."}]}
