{
  "url": "http://1-las-vegas-real-estate.com/homes/sellers/list_today/",
  "file_number": "1",
  "content_hash": "4bfd3df17846bba60dbe697ba199a0208c82acf8ff05dde007a65d455f5864b3",
  "total_blocks": 84,
  "retained_blocks": 19,
  "ignored_blocks": 65,
  "blocks": [
    {
      "tag": "h1",
      "text": "Las Vegas Realtor - House Sell - Sales - Real Estate Agent - Las Vegas NV Realtors"
    },
    {
      "tag": "div",
      "text": "Home | Current House Value | Hot NEW Listings | Las Vegas Index | Best of Las Vegas Blogs | Las Vegas Reservations"
    },
    {
      "tag": "p",
      "text": "Our Team Ask a Professional Market Trends"
    },
    {
      "tag": "div",
      "text": "Buyer Services"
    },
    {
      "tag": "div",
      "text": "Vegas Hot Spots - Map Las Vegas Real Estate Resale Homes New - Las Vegas Homes Las Vegas Condos Distress Sales Las Vegas Townhouses High Rise Luxury Condos Las Vegas Golf Homes Las Vegas Retirement Las Vegas Luxury Homes Home Loans Representation Agreement Request Buyer Guarantee Rental Homes"
    },
    {
      "tag": "div",
      "text": "Buyers Reports"
    },
    {
      "tag": "div",
      "text": "Why is the Info Free? Buy with ZERO Down Stop Paying Rent Danger! Buyer Traps Save Thousands Moving UP? 6 Buyer Mistakes Beware! 13 Extra Costs New Homes vs Resale Hot NEW Listings"
    },
    {
      "tag": "div",
      "text": "Sellers Reports"
    },
    {
      "tag": "div",
      "text": "27 Seller Tips Pricing Your Home Sell for More! Avoid These Mistakes For Sale by Owner Pass Your Inspection Divorce and Your Home Your House Didn't Sell When Will It Sell? Talking Houses Buy First or Sell First Emptying the Nest Getting the Best Price"
    },
    {
      "tag": "div",
      "text": "Sellers Services"
    },
    {
      "tag": "div",
      "text": "Get Listed & Sold Seller Guarantee FREE Home Evaluation Prices In Your Area"
    },
    {
      "tag": "div",
      "text": "Contact"
    },
    {
      "tag": "div",
      "text": "Contact Us SiteMap XML SiteMap HTML Tell a Friend"
    },
    {
      "tag": "div",
      "text": "Vegas Info"
    },
    {
      "tag": "div",
      "text": "Advertising List Your Site Las Vegas Info"
    },
    {
      "tag": "h2",
      "text": "If you feel it's time to start taking action and get your \n  property sold FAST and for TOP DOLLAR; here's a good \n  place to start."
    },
    {
      "tag": "p",
      "text": "Your Home Will Sell Fast For Top Dollar With the Least Amount of Hassle You will get these results because of our: Unique Team System Innovative Consumer Programs Leading Edge Technology Specialized Knowledge"
    },
    {
      "tag": "p",
      "text": "72% of homeowners are dissatisfied with their agent's performance Why? The Major Reason: Poor Communication The ABC's of Real Estate Marketing (What Most Realtors Do) Advertise themselves Bang a sign into your lawn Create an ad for the paper \n            (and maybe run it) Download your listing to the \n            MLS Encourage their office to show \n            it Figure they might try an open \n            house Get on their knees and pray it \n            will sell This is the way real estate has been \n            practiced for the past 100 years, and it's still the way many agents \n            operate today, but... ... these traditional methods have \n            proven to be less and less effective. That's why we use the latest \n            technology and proven consumer innovations which go far beyond this \n            antiquated ABC approach."
    },
    {
      "tag": "div",
      "text": "Andrea Scott - Sales Agent, REALTOR (702) 648-4500 10750 W. Charleston - Las Vegas, Nevada 89135 - Contact Us Representing BOTH Buyers & Sellers ALL  RIGHTS  RESERVED Copyright -\r\n        Website by Aspen Services - Homes-Real-Estate.US | Kim \r\nHampton | Las Vegas \r\n        Condos | Las Vegas Realtor | Link Exchange Nevada Homes | Las Vegas New Homes | Real Estate Blogs | Las Vegas Real Estate | LasVegas Real Estate | Home Loans | Leads | AAA Mattresses | Great Camping | Las Vegas Tours | Discount Stuff | Mortgage \r\nRefinancing Anthem - Sun City Summerlin - Del Webb - \r\n    Southern Hills - Painted Desert - Townhouses - Custom - Desert Shores - South \r\n    Shores Peccole West Ranch - The Lakes - Foothills - Spanish Oaks - Spanish Trail - \r\n    Rhodes Ranch - Green Valley - Seven Hills - KB Homes - Richmond Homes - \r\n    American Pardee Homes - Seniors Citizens Housing - Townhomes - LAS VEGAS REAL ESTATE - LAS VEGAS HOMES - Las Vegas Home Pricing / Information"
    }
  ]
}