{
  "url": "http://lists.w3.org/Archives/Public/ietf-discuss/2000Sep/0002.html",
  "file_number": "100",
  "content_hash": "bc1e6cf0651618a2a28692076f1695fd91fa9facf605cf342f005b08499e9cf8",
  "total_blocks": 11,
  "retained_blocks": 6,
  "ignored_blocks": 5,
  "blocks": [
    {
      "tag": "p",
      "text": "W3C home > Mailing\n    lists > Public > ietf-discuss@w3.org > September 2000"
    },
    {
      "tag": "h1",
      "text": "Re: Mobile Multimedia Messaging Service"
    },
    {
      "tag": "div",
      "text": "This message :\n[ Message body ]\n [ Respond ]\n [ More options ] Related messages : [ Next message ]\n[ Previous message ] [ Next in thread ]\n [ Replies ] From : James P. Salsman < bovik@best.com > Date : Fri, 15 Sep 2000 14:52:03 -0700 (PDT) Message-Id : <200009152152.OAA28455@shell9.ba.best.com> To : Jim.Mathis@Motorola.com , ned.freed@innosoft.com , paf@cisco.com Cc : discuss@apps.ietf.org , ietf-mmms@imc.org , ietf@ietf.org"
    },
    {
      "tag": "pre",
      "text": "If there has been no charter proposed for a MMMS working group, Iintend to propose one as follows.  Iwould like to know how the \nArea Directors feel about the following ideas, many of which are \ninformed by the comments of Patrik, Ned, and others in the Apps \nDiscussion archives -- http://wilma.cs.utk.edu/mail-archive/discuss.1999-12 Proposed MMMS working group purpose:  The MMMS working group will \nproduce a series of Internet-Drafts, and attempt to produce RFCs, \ndescribing the use of end-to-end Internet multimedia messaging and \nrelated services on mobile devices.  The specifications will concern \napplication-level services as well as general end-to-end Internet \nservice specifications and lower-level services such as non-wireless \nserial PPP access from mobile devices.  No new protocols will be \ncreated; only existing open Internet standards and protocols free from\nany intellectual property encumbrance will be incorporated into MMMS \nspecifications, along with specific implementation interoperability \nguidelines.\n\nProposed special document status and process for MMMS specifications:  \nRecognizing that it may be impossible to achieve consensus on topics \nin which large and diverse corporate concerns have vested interests \nopposed to open standards, the MMMS working group will have a special \ngoal to produce Internet-Drafts which will identified as \"Frozen MMMS \nRFC-track Internet-Drafts.\"  These documents might never become RFCs \nbecause of an expected lack of consensus, but upon identification as \nsuch by the Working Group, they will be announced and archived as \nfrozen documents.  Developers may rely on such documents as static \nand vendors and customers will be encouraged to refer to them in their \nprocurement process.  The level of consensus required to designate \nFrozen MMMS RFC-track Internet-Drafts will be a simple majority of \nthose working group participants who are not affiliated with \norganizations having direct or indirect financial interests in \nclosed-protocol mobile services.  Any member of the working group not \naffiliated with organizations having direct or indirect financial \ninterests in closed-protocol mobile services may call a vote on the \ndesignation of any Internet-Draft as a Frozen MMMS RFC-track \nInternet-Draft, and if after one week's time there are more such MMMS \nWG participants in favor than dissenting, the WG Chair, the author of \nthe draft, or the participant calling the vote will then take steps to \nestablish a permanent archive of the draft and publish an announcement \nof its availability to the IETF community.  Anyone affiliated with \norganizations having direct or indirect financial interests in \nclosed-protocol mobile services may not call a vote or vote on such \nspecial designation, but all participants will have normal consensus \nrights in the traditional RFC process, and all Internet-Drafts must \nfollow the existing IESG intellectual property disclosure process.  \n\nProposed milestones:  The goals of the MMMS WG will include the \npublication of specifications, as described above, on the following \ntopics:  interoperable end-to-end Internet service access on mobile \ndevices, including descriptions of existing end-to-end wireless \nInternet service arrangements; implementation guidelines for multimedia \nmessaging services on mobile devices using existing Internet messaging \nstandards; guidelines concerning performance implications of link \nconstraints, including TCP behaviors during extended periods of \nwireless link downtime; and wired PPP access from mobile Internet \ndevices.\n\nJim Mathis:  Would you be interested in chairing a MMMS working group \ncharted as described above?  Would your organization's current apparent \ncommitment to closed-protocol mobile messaging solutions make you an \ninappropriate chair for such a group?  If you would not want to, or do \nnot feel you would be an appropriate chair, Iwould volunteer to serve \nas an interim chair.\n\nCheers,\nJames\n\n> At the November meeting, about 90 people attended the Mobile \n> Multimedia Messaging Service BOF:\n>\n> http://www.ietf.org/proceedings/99nov/46th-99nov-ietf-42.html > \n> But the mailing list has been dead:\n>\n> http://www.imc.org/ietf-mmms/mail-archive/threads.html >\n> MMMS-related topics seem to be fairly prevalent on the general \n> IETF discussion list, with a lot of general agreement that the \n> status quo has some real problems.\n> \n> Has anyone started on a working group charter?\n> \n> There needs to be an organized effort to provide explicit and \n> well-documented alternatives to the closed-protocol, \n> pseudo-internet mobile access consortia, who are a real barrier \n> to easy and reasonable mobile multimedia messaging services.  \n> Ifor one would certainly contribute a great deal of time and \n> effort to the success of such a working group."
    },
    {
      "tag": "div",
      "text": "Received on Friday, 15 September 2000 17:53:45 GMT This message : [ Message body ] Next message : Patrik Fältström : \"Re: Mobile Multimedia Messaging Service\" Previous message : comunicado@elcultural.com: \"Noticias de actualidad\" Next in thread : Patrik Fältström : \"Re: Mobile Multimedia Messaging Service\" Reply : Patrik Fältström : \"Re: Mobile Multimedia Messaging Service\" Reply : Leslie Daigle: \"Re: Mobile Multimedia Messaging Service\" Maybe reply : James P. Salsman: \"Re: Mobile Multimedia Messaging Service\" Mail actions : [ respond to this message ] [ mail a new topic ] Contemporary messages sorted : [ by date ] [ by thread ] [ by subject ] [ by author ] Help : [ How to use the archives ] [ Search in the archives ]"
    },
    {
      "tag": "p",
      "text": "This archive was generated by hypermail 2.2.0 + W3C-0.50 : Thursday, 23 March 2006 20:11:27 GMT"
    }
  ]
}