{
  "url": "http://ask.yahoo.com/ask/20011019.html",
  "file_number": "14",
  "content_hash": "51d5a41746568346bf5e9d387ef02aa17fad2de53d0ed2363349b7cdc0280cec",
  "total_blocks": 127,
  "retained_blocks": 8,
  "ignored_blocks": 119,
  "blocks": [
    {
      "tag": "div",
      "text": "Ask Home - Yahoo! - Help"
    },
    {
      "tag": "p",
      "text": "Ask Yahoo! Ask a question"
    },
    {
      "tag": "p",
      "text": "Friday October 19, 2001 Previous | Next"
    },
    {
      "tag": "p",
      "text": "Dear Yahoo!: What exactly is a U.S. Marshal? Mack New Orleans, Louisiana Dear Mack: The Web is teeming with information covering every governmental topic, issue, and agency. (As a matter of fact, we recently featured an incredibly useful government resource, FirstGov , in Yahoo! Picks of the Week .) To find the answer to your question, we searched on the term \" U.S. Marshal \" and quickly found the answer at the U.S. Department of Justice web site. The United States Marshals Service section provided all the information we needed. The first thing we spotted was the U.S. Marshals Service mission statement:"
    },
    {
      "tag": "blockquote",
      "text": "The mission of the United States Marshals Service is to protect the\nFederal courts and ensure the effective operation of the judicial system."
    },
    {
      "tag": "p",
      "text": "That statement provided a good start, but we wanted to know more about a U.S. Marshal's day-to-day activities. Fortunately, all we had to do was continue reading. The role of the U.S. Marshal is constantly changing depending on the state of the union. In the past, they were responsible for such duties as taking the census and protecting the president. In recent years, the U.S. Marshals have been responsible for \"providing protection for the federal judiciary, transporting federal prisoners, protecting endangered federal witnesses and managing assets seized from criminal enterprises.\" We also learned that U.S. Marshals arrest more federal fugitives than all other federal agencies combined, making\naround 55 percent of all federal arrests. In the wake of the recent attacks in New York and Washington, D.C., there has been a great deal of discussion about the implementation of a Federal Air Marshal program. We weren't sure whether the two programs were related, so we searched on the term \" air marshal \" and discovered that they are indeed different governmental programs. The Federal Air Marshal program provides \"an anti-hijacking capability for U.S. civil aviation\" and is part of the Federal Aviation Administration . Visit the FAA's Career Opportunities section for information on becoming a Civil Aviation Security\nSpecialist, otherwise known as a Federal Air Marshal. Related Links · How can Ibecome an FBI Special Agent? · What the heck is a \"corporate trainer\" anyway? · Federal Air Marshal Program More Questions About · Law Enforcement · Yahoo! Answers - Law Enforcement & Police Get Ask Your Way · Most Popular · Email · Yahoo! Toolbar ·"
    },
    {
      "tag": "p",
      "text": "Email this page - Save to del.icio.us Save to My Web Digg This"
    },
    {
      "tag": "p",
      "text": "Copyright © 2001 Yahoo! Inc. All rights reserved. Privacy Policy - Terms of Service - Copyright/IP Policy All information available through or in connection with Ask Yahoo! is informational only and provided \"as is\" without warranties, representations, or guarantees of any kind. Yahoo! disclaims any and all implied warranties respecting Ask Yahoo!. Use of Ask Yahoo! is entirely at your own risk and is not a substitute for conducting your own research."
    }
  ]
}