{
  "url": "http://bcresourcedirectory.org/posttreat.htm",
  "file_number": "17",
  "content_hash": "68745a66a93d4857e83b6ea6ebcdd85074ba315d9e648b6730e4d1a37c650aef",
  "total_blocks": 266,
  "retained_blocks": 14,
  "ignored_blocks": 252,
  "blocks": [
    {
      "tag": "p",
      "text": "Home Contact Us Table of Contents Directory Sponsors Donate Hormone Replacement Therapy Lymphedema Menopause Osteoporosis Sexuality RESOURCES: Organizations Books and More Web sites"
    },
    {
      "tag": "div",
      "text": "Resources: North Carolina Hospitals Breast Cancer Services"
    },
    {
      "tag": "p",
      "text": "Who's\r\n    at Risk and What Can You Do? What is Breast Cancer? Risk Factors What Doesn't Cause Breast Cancer Reducing Your Risk Screening Making the Diagnosis Mammography Other Diagnostic Tests Test Descriptions Clinical Breast Exams Breast Self Exams After the Diagnosis Getting a Second Opinion The Surgeries The Therapies Reconstruction Breast Prostheses Rehabilitation Managing Side Effects Fatigue Hair Loss Nutrition and Problems with Eating Pain Post-Treatment Issues Hormone Replacement Therapy Lymphedema Menopause Osteoporosis Sexuality Lymphedema Therapists in North Carolina County-by-County Listing Advanced Breast Cancer Metastatic Breast Cancer Recurrences Some Ways to Cope Clinical Trials What Are Clinical Trials Types of Trials Questions to Ask Links to Clinical Trial Lists Genetic Testing, Counseling BRCA1 and BRCA2 p53 Risks and Benefits of Testing Genetic Counseling Informed Consent North Carolina Genetic Counselors Bone Marrow Transplants Peripheral Stem Cell Transplants About the Procedures Risks, Complications, Side Effects Current Studies and Trends Home Health Care What is Home Health Care Who Pays For It How to Choose an Agency Hospice and End of Life Planning Ahead What is Hospice Paying for Care Financial, Other Assistance Treatment Mammograms, Breast Exams Medication Medical Supplies, Prostheses, Wigs Lodging Transportation Telephone Expenses Utilities Meals Information & Referral Insurance, Legal, Employment Health Insurance Life Insurance Legal Issues Employment Issues Laws and Legislation Mastectomy & lymphedema products, wigs Breast Prostheses, Trained Fitters Post-Mastectomy Bras, Swimwear Lymphedema Supplies Wigs, Wig Stylists Hats, Turbans, etc. Products for African-Americans N.C. Support Groups Types of Support Groups Support Tips Support Groups in North Carolina Online Support Groups Family & Caregiver Issues Some Tips for Caregivers Signs of Burnout Children's Issues Suggestions for Talking with Children Children of Different Ages Complementary Therapies Centers in North Carolina Some Therapies and Resources Retreats, Camps, Workshops Ethnicity-Specific Resources African-Americans Hispanics Native Americans Asians Free Cancer Booklets in Spanish Young Women Breast Cancer in Younger Women (Under 40) Fertility/Infertility Resources Lesbian Resources Lesbians and Breast Cancer Male Breast Cancer About Breast Cancer in Men Signs and Symptoms Advocacy About Breast Cancer Advocacy One Woman's Story Ways to Be an Advocate Poem--\"Tried Not to Be an Advocate\" Women Building Bridges One-on-One Buddy Support Get Connected Volunteer Web sites Hundreds of Links in Over 38 Topics about Breast\r\n    Cancer North Carolina Links Featured You have to accept whatever comes, And the only important thing Is that you meet it with courage— Eleanor Roosevelt Once you have completed your treatments\r\n    for breast cancer (including surgeries, chemotherapy, radiation therapy, etc.), you will\r\n    naturally want to \"get on with your life.\" Although each of us goes through the\r\n    experience of being diagnosed with and treated for breast cancer differently, there may be\r\n    some common issues that you will need to deal with either immediately or long after our\r\n    treatment is over.  Having an awareness of the possibilities puts you in a better\r\n    position to know how to deal with them or where to turn for help if one arrives in your\r\n    life. In this section, as in the previous one,\r\n    we have chosen to address some of the more common \"post-treatment\" issues which\r\n    many breast cancer survivors may be concerned with. Along with the resources we list at\r\n    the end of this section, you should talk with your doctor about any health situation that\r\n    gives you concern. HORMONE\r\n    REPLACEMENT THERAPY Ihave breast cancer and had been taking\r\n    hormone replacement therapy.  Should Icontinue to take it? Your doctor should advise you about whether\r\n    to continue HRT (hormone replacement therapy) at the time you are diagnosed with breast\r\n    cancer. Generally, hormone replacement therapy is not recommended for women who have been\r\n    diagnosed with breast cancer. Why would hormone therapy be given to\r\n    women with breast cancer? Researchers have found a way to use\r\n    hormones as therapy against breast cancer. This is different than HRT (hormone replacement\r\n    therapy), which is given to imcrease levels of hormones (such as estrogen and\r\n    progesterone) that are decreased in the body due to menopause. One hormone therapy drug for breast\r\n    cancer is Tamoxifen.  By blocking estrogen, Tamoxifen can block the growth of cancer\r\n    cells. If your tumor is estrogen receptor positive (called \"ER positive\") this\r\n    may be a good treatment for your breast cancer.  (Estrogen receptors are found in the\r\n    nucleus or center of the tumor cell. The ER allows cells to use estrogen to grow).  \r\n    Tamoxifen can be used alone, with chemotherapy, or following chemotherapy. Tamoxifen is\r\n    also being used to prevent breast cancers from developing. You may want to ask your doctor\r\n    about this. LYMPHEDEMA"
    },
    {
      "tag": "div",
      "text": "lymphedema therapists in North\r\n    Carolina"
    },
    {
      "tag": "p",
      "text": "What is lymphedema? Lymphedema is the collection of lymph\r\n    fluid that can occur in your arm and hand after your lymph nodes have been removed or\r\n    damaged from your underarm area (axilla) during breast cancer surgery. What is lymph fluid? Lymph fluid is a colorless fluid\r\n    containing the white blood cells that fight infection and disease. Lymph fluid travels\r\n    through channels of the lymph system throughout your body much like blood travels through\r\n    arteries and veins. What are lymph nodes? Lymph nodes are small, pea-sized organs\r\n    located along the lymph channels. They are grouped in clusters. Their job is to trap\r\n    foreign bodies such as bacteria or cancer cells to keep them from spreading throughout the\r\n    body. The nodes are clustered in areas throughout your body such as underams (axilla),\r\n    groin, neck, chest and abdomen. The ones in your chest and underarm are the ones that\r\n    collect the lymph fluid from your breast. This is why they are often removed at the time\r\n    of surgery. What causes the arm to swell after\r\n    surgery? Not every woman's arm swells after surgery.\r\n    It swells because the number of pathways for the lymph to drain from the arm are reduced\r\n    by the removal of or damage to the lymph tissue during surgery or radiation therapy. Fewer\r\n    channels to drain the fluid can result in collection of fluid in the arm (or swelling).\r\n    The extent of lymph tissue removed or damaged relates to how much swelling you may\r\n    experience. Swelling may occur weeks, months or even years after treatment. Are there any safety precautions Ishould be aware of? Yes. Because the lymph channels and nodes\r\n    have been removed (or decreased) on the side of your surgery, you must take extra caution\r\n    to protect your hand and arm from injury, cuts, scrapes and insect bites. You may have\r\n    less protection against infection in that arm. Some people wear a medical alert bracelet\r\n    with this information on it. It is important to remind healthcare workers to avoid drawing\r\n    blood and measuring your blood pressure on that arm. It is also recommended that you wear\r\n    gloves while doing housework, gardening and other activities that may put your arm or hand\r\n    at risk for injury. In addition, it is possible for lymphedema to occur years after you\r\n    have finished your treatment; therefore, taking care and being aware are your two best\r\n    keys to avoiding or managing lymphedema. What about using antiperspirant or\r\n    deodorant under my arm? You should not use deodorants or\r\n    antiperspirants while you are healing from surgery on the armpit on the side of your\r\n    surgery. Once you are healed, you may use either antiperspirants or deodorants. Some\r\n    doctors may recommend use of deodorants only. You should talk about this with your\r\n    healthcare team. What can Ido about the swelling? Is\r\n    it permanent? You should talk with your doctor about\r\n    this. Sometimes, elevation of the arm for brief periods throughout the day is adequate to\r\n    promote fluid drainage. Other methods to reduce swelling include arm exercises and gentle\r\n    massage that specifically promote lymph drainage. Your doctor should refer you to a\r\n    practitioner who specializes in lymphedema treatment if you have a persistent problem with\r\n    this. More severe cases may require use of pressure sleeves to compress the arm.\r\n    Lymphedema can be a permanent condition in some cases. How do Ichoose a lymphedema\r\n    therapist? Lymphedema therapists have a range of\r\n    training options. The programs they attend vary in length. When you are choosing a\r\n    therapist, you might want to consider how much training he or she has. The programs include: LeDuc (6 days of\r\n    training), Lerner (14 days), Casley-Smith(14 days), Academy of Lymphatic Studies (ALS; 14\r\n    days), Klose-Norton (15 days), Foldi (20 days), and Vodder (20 days; some programs teach\r\n    Vodder \"techniques\", but only therapists who have completed the entire program are Vodder credentialed). Recently, the Lymphology\r\n    Association of North America (LANA) began certifying lymphedema therapists who also passed\r\n    a comprehensive national exam. If you have questions about the trainings, call the\r\n    National Lymphedema Network at 800.541.3259 or see http://www.lymphnet.org . Also, see the listing of lymphedema therapists in North Carolina in this directory."
    },
    {
      "tag": "p",
      "text": "Some\r\n        questions to ask the lymphedema treatment center"
    },
    {
      "tag": "p",
      "text": "Does it provide combined decongestive\r\n            therapy (CDT)? (This includes skin care, manual lymphatic drainage (MLD), bandaging\r\n            and exercises.) What training/experience do its therapists\r\n            have in CDT? Is there a physician with training in\r\n            lymphedema available for consultation? Does the center provide patient education\r\n            in exercises, skin care, self-massage and self-bandaging? Will the initial therapy be done daily,\r\n            and for how many days? (Generally, therapy is given at least five days in a row for early\r\n            stage, and up to four weeks if the lymphedema is more advanced.)"
    },
    {
      "tag": "p",
      "text": "What is Manual Lymph Drainage? Manual Lymph Drainage is a massage technique used to\r\n    improve the flow of lymph using light, rhythmic strokes.  This therapy may be\r\n    effective for the lymphedema that sometimes follows breast surgery. MENOPAUSE (Natural & Chemotherapy-Induced) What is menopause? Menopause is the absence of menstrual\r\n    periods due to reduced function of the ovaries. This can occur naturally with aging, or\r\n    from damage to the ovaries. This naturally occurs in women beginning in their 40s and 50s. Will chemotherapy cause me to experience\r\n    menopause? Before menopause, your ovaries produce\r\n    estrogen. Estrogen is responsible for your monthly menstrual cycle and reproduction. Some\r\n    chemotherapy drugs interrupt (temporarily or permanently) ovarian function, which can\r\n    result in early (or chemotherapy-induced) menopause. This type of menopause can be\r\n    permanent and has the same effect on your body as naturally-occurring menopause. What are some of the typical side effects\r\n    of menopause? Hot flashes, night sweats, vaginal\r\n    dryness, and irregularity or absence of monthly menstrual periods are the most common\r\n    effects of menopause. Menopause is also associated with bone loss due to reduced calcium\r\n    stores in the bone. After chemotherapy treatment, some women\r\n    resume their menstrual cycle. If you do not, you should seek advice about calcium\r\n    replacement and exercise to promote bone health. What can Ido to manage side effects\r\n    of menopause, such as hot flashes and vaginal dryness? You should discuss menopause management\r\n    strategies with your doctor or nurse. For hot flashes, there are medications available;\r\n    also, many people are beginning to explore the use of alternative therapies, such as soy\r\n    products or herbs. You should check with your doctor before proceeding with this approach.\r\n    You must always be cautious about the possibility of drug interactions when taking\r\n    supplements or herbals in addition to medications. Other considerations include choosing\r\n    loose-fitting, comfortable clothing and regulating the temperature control to suit your\r\n    preference. Vaginal dryness can be addressed through\r\n    the use of lubricants prior to sexual activity. There are many products available without\r\n    prescription to remedy this problem. Persistent vaginal itching should be investigated to\r\n    rule out the possibility of infection (see also the section below on Sexuality ). OSTEOPOROSIS (Natural & Chemotherapy-Induced) What is osteoporosis? Osteoporosis or \"porous bones\"\r\n    is a condition of decreased bone mass. Bone is living tissue that continuously undergoes\r\n    breakdown and rebuilding (at a cellular level) as a normal body process. Peak bone mass is\r\n    usually reached by age 38. After that, bone begins to lose mass as part of the aging\r\n    process. As bone mass is lost, bones become brittle. Men generally lose 20-30% of their\r\n    bone mass over their lifetime, and women generally lose 45-50% of their bone mass.\r\n    Decreased bone mass can lead to an increased risk of bone breakage and disability. Why is this important to me now, and what\r\n    are the risk factors? As a person receiving cancer treatment,\r\n    you are at increased risk for osteoporosis. Risk factors for osteoporosis include:"
    },
    {
      "tag": "p",
      "text": "Early hormone deficiency (menopause) Chronic malnutrition Smoking Alcohol consumption Limited weight-bearing exercise Family history Ethnicity—more prevalent in\r\n        Caucasian (white) and Asian women Small body frame"
    },
    {
      "tag": "p",
      "text": "Chemotherapy can interfere with your\r\n    normal production of hormones due to its effect on ovarian function. Reduction or failure\r\n    of ovarian function automatically places you at increased risk for osteoporosis. It is\r\n    important that you discuss prevention and treatment strategies with your doctor or nurse. Would Iknow if Ihad osteoporosis? Can Ibe tested for it? Early changes in bone density are usually\r\n    painless. Most people don’t know they have osteoporosis until they break a bone. That\r\n    is why it is important to know the risk factors and to learn what you can do to prevent\r\n    bone deterioration. Testing can be done for osteoporosis.\r\n    First, you should have a thorough health history and physical exam to determine your risk\r\n    factors for osteoporosis. Then, your doctor will discuss or recommend your having a bone\r\n    mineral density test if you are considered to be at high risk. It is a safe, painless and\r\n    non-invasive test. This establishes your baseline bone density and provides useful\r\n    information in determining the best course of action for you. In North Carolina, bone mineral density\r\n    (BMD) tests are available in some pharmacies. The cost of measuring the BMD in the heel is\r\n    generally around $30, and this correlates well with the trabicular (spine) bone. This test\r\n    reveals very little about the cortical (hip) bones, so you will not get the whole picture.\r\n    However, the test will give you a reasonable assessment and baseline information that you\r\n    can take to your doctor to see if further testing is needed. The test takes about five\r\n    minutes or less and is pain free. You can have this test done without a referral from your\r\n    doctor. Can Ihelp prevent osteoporosis from\r\n    happening to me? Yes. There are a number of prevention\r\n    strategies that are recommended to reduce your risk for osteoporosis:"
    },
    {
      "tag": "p",
      "text": "Eating a well-balanced, nutritious diet Including Vitamin Dand calcium in your\r\n        diet Avoiding animal protein, salt and caffeine Quitting smoking and avoiding excessive\r\n        alcohol intake Taking medications that reduce the natural\r\n        bone breakdown process Increasing your weight-bearing exercise,\r\n        such as walking or lifting weights."
    },
    {
      "tag": "p",
      "text": "Again, your healthcare team should advise\r\n    you in regard to these strategies, but you should not hesitate to initiate this discussion\r\n    with them. SEXUALITY Every woman’s image of their body\r\n    and sexuality is unique. No two people have exactly the same response or feelings when\r\n    they learn they have breast cancer. If a mastectomy is performed, this can be overwhelming\r\n    and emotionally difficult for some women. For others, it is a relief to have the cancer\r\n    removed. Treatment for cancer, such as chemotherapy, can cause physical changes that may\r\n    interfere with a woman's sexuality. In addition, breasts are a part of many\r\n    womens' sexual identity. Breasts are symbolic of nurturing, sustaining new life and\r\n    intimacy. The loss of a breast can be threatening to body image and sense of self. If Ihave a mastectomy, will Ibe\r\n    disfigured? Mastectomies today are done to preserve\r\n    muscle, so there is much less disfigurement than there used to be.  It is very\r\n    important that you discuss this topic fully with your surgeons. If you are interested in\r\n    reconstruction, you may want to consider options regarding breast reconstruction at the\r\n    time of your initial surgery. If so, you should be referred to a plastic surgeon for a\r\n    full discussion of your options. In some situations, reconstruction is not advised at the\r\n    time of your initial surgery, but can be done at a later date after all of your cancer\r\n    treatment has been completed. Reconstruction can also be chosen years down the road. What if Ichoose not to have\r\n    reconstruction? If you wish to use one, external breast\r\n    prosthetics (breast forms) are available to help minimize the visual alteration of losing\r\n    a breast. There are many different options available to you. You might want to consider\r\n    this, too, when deciding about surgery and potential reconstruction options.  (Also\r\n    see the section on Reconstruction in After\r\n    the Diagnosis in this directory). Will my sex life be different after breast cancer? Chemotherapy for breast cancer can sometime cause a woman to go into\r\n    premature, or early, menopause. This can be difficult for a woman physically, emotionally\r\n    and sexually. The symptoms of early menopause are sometime more severe than those that\r\n    occur with natural menopause. These symptoms can include hot flashes, vaginal dryness, and\r\n    low sexual desire, as well as depression, anxiety and increased irritability. Other\r\n    menopausal issues include increased risk of heart disease and osteoporosis. Are there solutions to the sexual problems Imight face? The good news is that there are solutions for these problems. Hot\r\n    flashes can be treated with specific drugs prescribed by a doctor. Some women also have\r\n    found Vitamin Eor soy products to be helpful. Vaginal dryness can be improved by the liberal use of a lubricant such\r\n    as Lubrin, K-Y Jelly, Ortho Personal Lubricant, Surgilube, Today Personal Lubricant or\r\n    Astroglide. Replens, a vaginal moisturizer, can be used three times a week. Recent studies\r\n    have found that both Estrace, a estrogen cream used vaginally, or Estring, a vaginal ring\r\n    with slow release of estrogen, restore the vaginal tissues without increasing estrogen in\r\n    the rest of the body.  Ask your doctor about these options. Persistent, low sexual desire is sometimes treated with androgens. You\r\n    can have your hormone levels checked and discuss this option with a doctor. Other ways of\r\n    increasing desire are reading erotic literature or watching erotic videos. Almost all\r\n    women who were orgasmic before cancer treatment can be so again although sometimes it\r\n    takes relearning and practice. If needed, doctors can also prescribe therapies that address other\r\n    menopausal issues (depression, anxiety, irritability, increased risk of heart disease and\r\n    osteoporosis). Several new, improved therapies are now available. See the publications and organizations in Resources below\r\n    for more help with managing menopausal symptoms. How will my spouse or lover feel about me\r\n    after surgery? It is very important that you discuss\r\n    this with your partner. Open, honest communication about your feelings and theirs is very\r\n    beneficial to your overall sense of well being and the intimacy you experience before and\r\n    after treatment. Your healthcare team may include a social worker or psychologist who can\r\n    specifically help you to address your feelings and fears regarding sexuality and intimacy.\r\n    Your acceptance of your body changes will affect how others react to you.  It is\r\n    important for you to be open about your feelings to yourself and to your spouse, lover or\r\n    partner. Always remember that who you are has\r\n    nothing to do with your breasts (although perhaps they may have played a part in your\r\n    self-esteem or sexual identity prior to your surgery).  You are special no matter\r\n    what the size of shape of your body, and you deserve to be in an open, honest and loving\r\n    relationship with someone who cares about you--and accepts you--because of who you are in\r\n    your heart, mind and soul. I'm single and not in a relationship.\r\n      How and when do Itell someone new in my life about my breast cancer and surgery? This is not a question with any easy\r\n    answers, but there are some things you can consider when you find yourself in a new\r\n    relationship:"
    },
    {
      "tag": "p",
      "text": "First, have you reached your own\r\n        personal level of acceptance of your body and your experience with breast cancer? Have you accepted the possible changes\r\n        to your body which might later be issues in a relationship, such as early menopause\r\n        and inability to bear children, or possibility of recurrence? Are you comfortable enough with\r\n        yourself and your experience to share it with someone else? Decide whether this new person is one\r\n        who would be caring and sensitive to your needs. Are you comfortable enough to open\r\n        yourself up and share it with this person? If not, then perhaps either the timing is not\r\n        right or the person is not the one for you. Only you can decide whether you are\r\n        ready to enter into a new relationship with someone. And you alone are the only person who\r\n        can know whether you feel comfortable and \"safe enough\" in a new relationship to\r\n        share your feelings, your experience and your body."
    },
    {
      "tag": "p",
      "text": "RESOURCES Organizations American Cancer Society, Inc. (ACS) 800-227-2345 or 800-282-4914 http://www.cancer.org Publishes \"Sexuality and Cancer\", an excellent, free resource to address the\r\n    sexual needs of women with a cancer diagnosis or in premature menopause. Call to order or\r\n    see the web site.   ACS provides information and services for all forms of\r\n    cancer; diagnosis, treatment, and many other topics. Programs offered by ACS include:\r\n    CanSurmount, I Can Cope (coping support), Reach to Recovery (rehabilitation after surgery\r\n    and support), and Resources Information and Guidance. Free educational materials available\r\n    on a wide variety of topics relating to cancer. American Menopause Foundation 212-714-2398 menopause@americanmenopause.org http://americanmenopause.org Provides support and assistance on issues concerning menopause. The AMF has support groups\r\n    across the country. Call or write to order articles on menopause-related issues such as\r\n    anxiety, coping, sexuality, hormone replacement therapy, phytoestrogens, bone health,\r\n    premature ovarian failure, etc. The Breast Cancer Fund 415-543-2979 or 800-487-0492 info@breastcancerfund.org http://www.breastcancerfund.org Has information on breast cancer and treatments. Web site has good resource links to\r\n    books, organizations, and breast cancer awareness events. Cancer Care, Inc. 212-221-3300 or 800-813-4673 info@cancercare.org http://www.cancercare.org All services free. Provides emotional support, information, and practical help. Staffed by\r\n    trained oncology social workers. One to one counseling, support groups, information,\r\n    educational programs, and referrals for services available. Publishes A Helping Hand, a\r\n    free resource guide for people with cancer. Call (800) 813-HOPE or order through Web site.\r\n    Web site has comprehensive resource information. The Hormone Foundation 1-800-HORMONE (1-800-467-6663) http://www.hormone.org Publishes \"Menopause: What Every Woman Should Know\", an excellent, free resource\r\n    about menopause helpful for women who have had breast cancer. Call 1-800-HORMONE to order\r\n    or see the web site to download free. Lilly Center for Women’s Health 888-WMN-HLTH http://www.lillywomenshealth.com Provides information about breast cancer, menopause, and other women’s health issues. Living Beyond Breast Cancer 610-645-4567 or 888-753-5222 lbbc@earthlink.net http://www.lbbc.org Addresses post-treatment needs of women with breast cancer through educational programs,\r\n    newsletter, call in help-line for survivors and family members. Toll-free survivor's\r\n    helpline 888-753-LBBC available Tuesdays 11am-3pm. Many conference tapes, workshop tapes,\r\n    and videotapes about survivor issues also available. National Alliance of Breast Cancer Organizations\r\n    (NABCO) 212-889-0606 or 888-806-2226 NABCOinfo@aol.com http://www.nabco.org This network of organizations is an information and education resource on breast cancer.\r\n    Publishes a yearly, comprehensive Breast Cancer Resources booklet which includes many\r\n    aspects of breast cancer diagnosis, treatment and issues. Call to order one, or view the\r\n    resource list online at their excellent Web site. National Lymphedema Network, Inc. 510-208-3200 or 800-541-3259 http://www.lymphnet.org Education and guidance for lymphedema patients, healthcare professionals, and the general\r\n    public. Referrals to treatment centers, health care professionals and support groups.\r\n    Resource materials, a toll-free recorded information line, pen pals/net pals peer support,\r\n    lymphedema alert bracelets, and newsletter also available. Extensive guide on how to avoid\r\n    lymphedema. National Osteoporosis Foundation (NOF) 202-223-2226 http://www.nof.org Offers education, information, support and advocacy. Publishes several informational\r\n    booklets (including a Spanish language one) and an osteoporosis exercise video. Has an\r\n    electronic support group called \"Linking Up\" which offers peer support for men\r\n    and women ages 20-50; call or email supgroup@nof.org to sign up. Web site has much\r\n    information and an online \"Find a Doctor\" service; bone health newsletters\r\n    offered by email. National Women’s Health Network 202-628-7814 http://www.womenshealthnetwork.org Anational, nonprofit advocacy and public interest organization devoted solely to women's\r\n    health issues. Call the clearinghouse Tues. and Thurs. 9-5:30 to request information on a\r\n    range of topics, including breast alternative therapies for menopause; osteoporosis;\r\n    tamoxifen, and others. Can also see Web site for fact sheets on different topics. National Women’s Health Resource Center 877-986-9472 info@healthywomen.org http://www.healthywomen.org Offers comprehensive information on women's health topics. North American Menopause Society 440-442-7550 or 800-774-5342 info@menopause.org http://www.menopause.org Promotes understanding of menopause. Has much information and publications about menopause\r\n    and menopause-related issues. Has lists of menopause clinicians, discussions groups, and a\r\n    reading list. Much of their information is available for download on their Web site. Osteoporosis and Related Bone Diseases-- National\r\n    Resource Center (ORBD-NRC) 202-223-0344 or 800-624-BONE (2663) TDD: 202-223-0344 orbdnrc@nof.org http://www.osteo.org Clearinghouse for information about osteoporosis, Paget's disease and related disorders.\r\n      Includes a sign-up for an osteoporosis listserv (online discussion group). Osteoporosis Coalition in North Carolina Older Adult Health Program Post Office Box 29605, Raleigh, NC 27620 Provides information about osteoporosis programs in North Carolina. Resolve: National Infertility Association 617-623-0744 resolveinc@aol.com http://www.resolve.org Provides support and information about infertility. Has information about infertility, how\r\n    to select an infertility specialist, and other topics. Offers a Helpline to order\r\n    publications, give information and direct you to resources in your area. Sexuality Information & Education Council Resource Center and Reference Library 212-819-9770 Provides information and suggestions about how to manage problems related to sexuality\r\n    after breast cancer. Books\r\n    and More After Cancer: A Guide to Your New Life , by Wendy\r\n    Schlessel Harpham, MD (HarperCollins, Inc., 1995). Awarm, informative overview written by\r\n    a physician and cancer survivor. She discusses sexuality in the chapter \"Where did my\r\n    Libido Go?\" and offers practical advice. Coping With Lymphedema: A Practical Guide to\r\n    Understanding, Treating and Living with Lymphedema , by Joan Swirsky, RN, and Diane\r\n    Sacket Nannery (Avery Publishing Group, 1998). Apractical guide to understanding,\r\n    treating and living with lymphedema caused by treatment for breast cancer. Can be ordered\r\n    by calling 800-548-5757, Ext. 123. Dr. Susan Love’s Hormone Book: Making Informed\r\n    Choices About Menopause by Susan M. Love, MD, with Karen Lindsey (Random House, 1997).\r\n    Offers comprehensive information on menopause and coping with symptoms, and addresses\r\n    concerns about breast cancer. Also includes a listing of resources. Living in the Post-Mastectomy Body: Learning to Live\r\n    in and Love Your Body Again by Becky Zuckweiler, MS, RN, CS (Hartley & Marks,\r\n    1998). As a nurse, psychotherapist and breast cancer survivor (who had a double\r\n    mastectomy), Zuckweiler guides women through all aspects of recovery, focusing on\r\n    regaining confidence in your body and developing a comfortable self-image and intimate\r\n    relationships. Lymphedema , by Jeanne Petrek, MD, Peter I.\r\n    Pressman, MD, Robert A. Smith, PhD (1998). Results from a workshop on breast cancer\r\n    treatment-related lymphedema and lymphedema resource guide. Abit technical and\r\n    scientific; useful for health professionals. Order online at American Cancer\r\n    Society’s web site at http://www.cancer.org/bookstore/lym_pub.html or call toll-free 888-227-5552. Lymphedema: A Breast Cancer Patient’s Guide to\r\n    Prevention and Healing , by Jeannie Burt and Gwen White, PT (Hunter House, 2000).\r\n    Provides clear information on what lymphedema is and why it occurs. Describes treatment\r\n    procedures to suit a range of needs and emphasizes that lymphedema can be treated\r\n    successfully. Covers preventing lymphedema, reducing lymphedema through professional\r\n    therapy and self-massage and more. Managing Menopause (magazine) Includes helpful\r\n    information on dealing and living with symptoms of menopause and other interesting\r\n    articles regarding women’s health. Published biannually ( free in OB-GYN\r\n    offices) by American College of Obstetricians and Gynecologists. Contact 202-484-3321. See\r\n    also http://www.acog.org Sexuality and Cancer: For the Woman Who Has Cancer and\r\n    Her Partner (# 4657), by American Cancer Society. (FREE) Abrochure available from the\r\n    ACS. Call 800-ACS-2345 or see their web site at http://www.cancer.org Sexuality and Fertility After Cancer by Leslie R.\r\n    Schover, Ph.D. (John Wiley and Sons, 1997). Addresses how treatment may interfere\r\n    emotionally and physically with male and female sexual function and fertility. Offers help\r\n    for survivors and their partners learn to enjoy sex again and make informed choices about\r\n    having children. (Schover also wrote the influential 1988 book, Sexuality and Cancer:\r\n    For the Woman Who Has Cancer and Her Partner .) On American Cancer Society’s\r\n    booklist. Strong Women, Strong Bones: Everything You Need to\r\n    Know to Prevent, Treat and Beat Osteoporosis , by Miriam Nelson, Ph.D., with Sara\r\n    Wernick, PhD. (Putnam Publishing Group, 2000). This book teaches women how to recognize,\r\n    prevent and treat osteoporosis through exercise (strength training, weight-bearing aerobic\r\n    exercise, stretching and balance) and nutrition. Tufts University nutrition researcher,\r\n    Miriam Nelson, and award-winning health writer, Sarah Wernick team up on their third\r\n    \"Strong Women\" book to bring you the latest science about osteoporosis. What Every Woman Facing Breast Cancer Should Know\r\n    About Lymphedema: Hand and Arm Care Following Surgery or Radiation Therapy for Breast\r\n    Cancer , by American Cancer Society (ACS). (FREE) Abrochure available from the\r\n    American Cancer Society. Call 800-ACS-2345 or see http://www.cancer.org Without Estrogen: Natural Remedies for Menopause and\r\n    Beyond by Dee Ito & Barbara Herbert (Crown Publishing, 1995). Offers options for\r\n    managing the symptoms of menopause for women who cannot or choose not to rely on hormone\r\n    replacement therapy. Web\r\n    Sites Lymphedema Bosom Buddies: Breast Cancer and Lymphedema\r\n    Support Group http://www.go-icons.com/bosombuddies.htm Web site has info about lymphedema, case histories, compression pumps and more. Circle of Hope Lymphedema Foundation http://lymphedemacircleofhope.org Anon-profit organization to promote education, awareness, research, assistance, and\r\n    support to lymphedema patients and their doctors. Website has info about lymphedema,\r\n    including travel, psychological aspects, insurance and other issues. Also \"Ask A\r\n    Therapist\" online. National Lymphedema Network http://www.lymphnet.org Information about lymphedema, finding support groups, finding/choosing a therapist,\r\n    lymphedema alert bracelets, news, a resource guide, and educational materials. Sexuality, Premature\r\n    Menopause, HRT Breast Cancer and Sexuality: Surviving and\r\n    Thriving http://www.cancercare.org/campaigns/breast1.htm Information on the ways breast cancer can affect sexuality and how to cope with\r\n    difficulties in sexuality and intimacy. Menopause From Breast Cancer, from INFO Breast\r\n    Cancer http://www.infobreastcancer.cyberus.ca/meno.htm Has info about menopause secondary to breast cancer, how to help with hot flashes, and a\r\n    resource list. Oncolink’s Page About Cancer and Sexuality http://www.oncolink.upenn.edu/psychosocial/sexuality Has several resources and information about about sexuality and cancer, including a link\r\n    to sexuality after breast cancer. Power Surge: Awarm and caring community for\r\n    women in menopause http://power-surge.com Information and frequently-asked questions about menopause, interactive chats, medical\r\n    consultants, message board, Ask the Experts, resources, bookstore and more. Questions and Answers About Hormone Replacement\r\n    Therapy, from the National Cancer Institute http://rex.nci.nih.gov/massmedia/pressreleases/hormone_qa.html Questions and answers about menopause, HRT, types of HRT, risks and benefits,\r\n    alternatives, etc. Sexuality from the American Cancer Society http://www.cancer.org The site has a comprehensive sexuality section for women who have cancer and their\r\n    partners. Click to the left on \"Living With Cancer,\" then choose \"Coping\r\n    with Cancer.\" Choose Sexuality & Cancer from the list of topics. Sexuality from the National Cancer Institute http://cancernet.nci.nih.gov/coping/emotional_concerns.shtml Discusses sexual problems after cancer (psychological and physical factors) and\r\n    treatment. Online Support\r\n    Groups (note:  ACOR.org, the source of most of\r\n    these groups, is called the Association for Online Resources.  They have over 100\r\n    public online support groups which provide information and community to patients,\r\n    caregivers, or anyone looking for answers about cancer or related conditions). CANCER-FERTILITY http://www.acor.org On the web site, click on Mailing Lists to the left, then page down to\r\n    \"CANCER-FERTILITY\" to sign up.  This group is for people concerned with\r\n    fertility issues after cancer. CANCER-SEXUALITY http://www.acor.org On the web site, click on Mailing Lists to the left, and page down to\r\n    \"CANCER-SEXUALITY\" to sign up.  The group is concerned with sexuality after\r\n    a cancer diagnosis. LYMPHEDEMA http://www.acor.org On the web site, click on Mailing Lists, then page down to \"LYMPHEDEMA\" to\r\n    sign up.  The group is for people concerned with lymphedema. OSTEO-Phttp://www.acor.org On the web site, click on Mailing Lists on the left, then page down to \"OSTEO-P\"\r\n    to sign up.  This group is concerned with osteoporosis."
    }
  ]
}