{
  "url": "http://class.lancasteronline.com/display.php?category=6&class=165",
  "file_number": "35",
  "content_hash": "816169a6da33d3b67e732a13eb193b92397b484a24f4588ec655f0c949a1c273",
  "total_blocks": 881,
  "retained_blocks": 18,
  "ignored_blocks": 863,
  "blocks": [
    {
      "tag": "div",
      "text": "Cars | Jobs | Homes | Customer \n          Care Center"
    },
    {
      "tag": "div",
      "text": "LancasterOnline\n                Keyword"
    },
    {
      "tag": "div",
      "text": "Home"
    },
    {
      "tag": "div",
      "text": "News » Top Stories Local News US/Nation Pennsylvania Off Beat International Washington Weather Sports » Local Sports Penn State Auto Racing Baseball Basketball Boxing College Sports Football Soccer Hockey Golf Tennis Business » Morning Briefing Local Business News Consumer News Market Reports Board of Trade Stock Charts Mortgage Rates Savings & Loan Money & Finance Entertainment » Local Television Movies Off Beat Recordings Movie Showtimes TV Listings Sudoku Technology Health Archives »"
    },
    {
      "tag": "p",
      "text": "Search for... Within: 30 days 60 days 6 months 1 year 2 years 2006 2005 2004 2003 2002 2001 2000 1999 1998 1997 1996 1995 1994 1993 1992 1991 1990 1989 All years"
    },
    {
      "tag": "div",
      "text": "en Espaol » Noticias Deportes Espectculos Finanzas Salud Tecnologa Rarezas Services Classifieds Cars Realty Wizard Apartments Shopping Personals Community Visit Lancaster My Headlines Talkback eEditions Features Celebrations Obituaries Special Sections Columns » Ad Crable Among the Living Editorially Speaking Footlights Jeff Hawkes Larry Alexander New Era Voices Political Animals Smart Remarks The Scribbler Interests » Today In History Letters to the Editor Lifestyle Living Outdoors Recipes Religion Your Life Customer Service Subscribe Care Center Place an Ad Advertising Contact Us Live Support Site Site Map Keyword Index RSS Feeds Need a Website?"
    },
    {
      "tag": "p",
      "text": "Home > Employment > General Help"
    },
    {
      "tag": "p",
      "text": "There are 112 results on \n              12              page \n                            s Sort by Date"
    },
    {
      "tag": "p",
      "text": "Search \n                            Classifieds AND OR Search In: General Help All Employment All Categories Refine \n                            Results #/Page"
    },
    {
      "tag": "div",
      "text": "10 20 30 40 50 All"
    },
    {
      "tag": "p",
      "text": "Member \n                          Menu"
    },
    {
      "tag": "p",
      "text": "Username Password Don't have an account? Member benefits"
    },
    {
      "tag": "p",
      "text": "My AdBox Login AdBox #: Passcode:"
    },
    {
      "tag": "div",
      "text": "Forgot your passcode?"
    },
    {
      "tag": "p",
      "text": "My Clipboard Items on clipboard: 0 View \n                          My Clipboard"
    },
    {
      "tag": "p",
      "text": "1 2 3 4 5 6 7 8 9 10 Next Add to My Clipboard 12-20-06 Cornwall Manor offers excellent benefits, a com- petitive starting salary, and good working conditio... View this ad 12-13-06 GROUNDS KEEPING Do you have knowledge & interest in lawn, shrub and tree care? Then we have the job ... View this ad 12-20-06 HELP WANTED School Crossing Guard Apply in Person LITITZ BOROUGH OFFICE 7 South Broad St., Lititz, P... View this ad 12-20-06 LESS THAN 1 WEEK LESS THAN 1 WEEK 'TIL CHRISTMAS! 'TIL CHRISTMAS! HAPPY HOLIDAYS TO ALL! HAPPY HOL... View this ad 12-13-06 MAINTENANCE FOREPERSON Lancaster Owned & Based Property Manage- ment Co. seeking energetic applicant... View this ad 12-1-06 Part Time or Full Time- Fun & Flexible Ideal for a person with person- ality plus! Perform promotion... View this ad 11-1-06 PART-TIME OFFICE SUPPORT person is needed for our small, re- laxed office. Some of the job respon- s... View this ad 11-11-06 People from all walks of life make Great Lancaster Newspaper Carriers AVAILABLE PAPER ROUTES must be... View this ad 12-20-06 Production Workers AFP advanced food products llc is a premier aseptic food manufacturer of puddings... View this ad 12-20-06 RN Part-time 2nd Shift - Every other weekend only LPN Part-time Day Shift CNA Part-time 1st & 2nd Sh... View this ad 1 2 3 4 5 6 7 8 9 10 Next"
    },
    {
      "tag": "p",
      "text": "Generated in 0.0283 \n              seconds"
    },
    {
      "tag": "p",
      "text": "© 2004-2006 Lancaster Newspapers PO Box 1328, Lancaster PA 17608, (717) 291-8811 Terms of\n      Service Privacy Policy"
    }
  ]
}