{
  "url": "http://cybermissions.org/articles/localchurch.htm",
  "file_number": "41",
  "content_hash": "f77339924285fea84cb61c81d939b01cc34d2bccb714394687628bbb3740c79c",
  "total_blocks": 58,
  "retained_blocks": 19,
  "ignored_blocks": 39,
  "blocks": [
    {
      "tag": "h1",
      "text": "How A Local Church Can Have A Global \n    Presence Through Cybermissions"
    },
    {
      "tag": "p",
      "text": "Summary: How your church can have a volunteer team of \n    cyber-missionaries that can minister cross-culturally to unreached peoples \n    at a total cost of between $1000 to $5000 a year and see between 100 and 1100 \n    decisions for Christ in that people group. Cybermissions - is the front-line use of the Internet for cross-cultural evangelism, \n    discipleship, church-planting and training."
    },
    {
      "tag": "h4",
      "text": "Some \n    Statistics"
    },
    {
      "tag": "p",
      "text": "Worldwide \n    Internet Population: 445.9 million (eMarketer) 533 million (Computer Industry Almanac) Projection \n    for 2004: 709.1 million (eMarketer) 945 million (Computer Industry Almanac) Online \n    Language Populations (September 2002) English 36.5%; Chinese 10.9%, Japanese 9.7%, \n    Spanish 7.2%, German 6.7%, Korean 4.5%, Italian 3.8%, French 3.5%, Portuguese 3.0%, Russian 2.9%, Dutch 2.0% (Source: \n    Global Reach) From the above statistics it is clear that \n    the Internet is no longer predominantly an English speaking medium and that \n    Asian languages such as Chinese, Japanese and Korean now occupy a significant \n    portion of cyber-space along with major European languages such as Spanish., \n    Portuguese and French. There are over 275 million Internet searches \n    each day and 80% of all Internet sessions begin at a search engine (Internetstatistics.com). \n    Religion is one of the main topics people search for. Pew Internet surveys \n    found that 28 million Americans get religion information online, that three \n    million do so daily, and that 25 % of net users search for religion-related \n    topics. Barna Research estimates that up to 50 million Americans may worship \n    solely over the Internet by 2010. There is every indication that the Internet \n    is a major source of religious information where people of many cultures and \n    languages collect their spiritual facts and opinions in private. Thus its \n    a place where missionaries must be."
    },
    {
      "tag": "h3",
      "text": "What Is The Role \n    Of A Local Church?"
    },
    {
      "tag": "p",
      "text": "Local churches can create a Cybermissions \n    Project Team (CPT) that uses the church website, chat rooms and email to reach \n    a specific ethnic group for Christ. Awell-run cybermissions website can see \n    three people a day or about 1100 people a year make commitments to Jesus as \n    Lord and Savior. This is because the website is a perpetual \n    evangelist that works away 24/7 witnessing to seekers about Christ. The Internet \n    is seeker-driven. People using the Internet are seeking information via search \n    engines and links on other sites. When people arrive at your website its not \n    an accident. They have typed a query into a search engine and arrived there. \n    People not interested in God simply dont arrive at your church website  \n    they end up somewhere else, reading the weather or the news. So virtually \n    100% of the people you minister to will already have some level of interest. \n    This makes evangelism so much easier! You can witness, via the Internet 24/7 \n    to people who are already interested in finding out about God!"
    },
    {
      "tag": "h3",
      "text": "OK how do Istart?"
    },
    {
      "tag": "div",
      "text": "1. Form a small group of say 6 to 8 people which should include \n  a few techie computer types, a few bible types and someone with enthusiasm \n  for missions. The \n  pastor does not need to lead the group, he/she can just give it some guidelines \n  and get a monthly report. The group should be led by someone with a passion \n  for missions on the Internet. The group can fit into the church structure in \n  a similar way to creative ministry teams."
    },
    {
      "tag": "p",
      "text": "2. Read the articles on cybermissions at http://www.aibi.ph/missions/ for some ideas to get you started. 3. Get some web space . You need a domain name yourchurch.com \n    and some space on a server. We use ChristianWebHost.com and have found them to be both affordable and reliable. 4. Pray about what people group you should be ministering to. For a list of the 43 nations most suitable for \n    a cybermissions strategy click \n    here. Then go to our mission \n    links site and do some research on your chosen nation at any of the mission \n    portal sites listed there e.g strategicnetwork.org ."
    },
    {
      "tag": "div",
      "text": "5. Decide on an initial strategy (you can tweak it later) and start designing the website. Use the articles in \n  point 2 above for some ideas."
    },
    {
      "tag": "p",
      "text": "6. Spend at least four hours a week working on the website and improving it. 7. Reply to the emails that come \n    in promptly and start ministering to people in your target group. 8. Become a member of Cybermissions.Org and hang out with other people doing the same thing - its free. (Cybermissions.Org will open officially on 12th August 2003 as a web portal \n    for cybermissionaries.)"
    },
    {
      "tag": "h3",
      "text": "How Much Does Running A Cybermissions \n    Project Team Cost?"
    },
    {
      "tag": "p",
      "text": "You will probably pay around $19.95 a year \n    for the domain name. Then around $10 a month for reliable ad-free \n    hosting and $29.95 a month for broadband access at your home or church office. \n    ($480 per annum) Then work on replacing a computer every two \n    years so - $1000 p.a. Then maybe you want some expensive software \n    - $1500 a year And you do some online advertising at $150 \n    a month - $1800 Total costs = $4800 per annum. Or around \n    $5000 per annum for a well-equipped active evangelistic outreach that may \n    well bring between 100 to 1100 people to Christ."
    },
    {
      "tag": "h3",
      "text": "On A Shoe-String Budget?"
    },
    {
      "tag": "p",
      "text": "You can start for $1000 per annum, $500 \n    for the basics, (website, domain name, broadband) and $500 for extras. For \n    good free open-source software go to http://www.sourceforge.net"
    },
    {
      "tag": "h3",
      "text": "What Sort Of Things Can The CPT Do?"
    },
    {
      "tag": "div",
      "text": "Share testimonies in the \n      target groups language. Have a chat room/bulletin \n      board Have a pen-pals page Have a pray for healing \n      page so they can ask the church to pray for sick relatives. Have cross-over articles \n      say on an area of secular interest (say camel-racing if you want to reach \n      Saudi Arabia) then tag a short Christian message at the end or a link to \n      an evangelistic page. Address the spiritual \n      questions they have: demon-possession, sacrifices to idols, magic, how to \n      endure suffering, who is really God, etc Online artwork that is \n      culturally appropriate. Christian songs in their \n      national language. Recipes for the favorite foods of the target \n    people group. Have a personal advice \n      column and articles on family life, relationships, loneliness etc. Share bible portions, \n      tracts and brief evangelistic sermons. Have news and weather \n      of that country. Have a membership section \n      so they keep coming back."
    },
    {
      "tag": "h3",
      "text": "Who Can We Contact For Help and Advice?"
    },
    {
      "tag": "p",
      "text": "Contact John Edmiston at johned@aibi.ph Ive been doing this since 1991, and Id love to help. Cybermissions.Org AIBI Missions Page"
    }
  ]
}