{
  "url": "http://dvd.ign.com/articles/491/491629p1.html",
  "file_number": "48",
  "content_hash": "afe568ff761a21bcbe7084262c9d2ed45bdebf1db494917e7d7ba1de71ec2730",
  "total_blocks": 388,
  "retained_blocks": 19,
  "ignored_blocks": 369,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" /* AD from: http://ssa.ign.com/js.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN+DVD&size=entryinterstitial&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review& */ Article ID: 491629 Object ID: 608816 begin: HorizontalNav IGN.com | PC Games | PS2 | PS3 | PSP | Xbox | Xbox 360 | GameCube | Wii | DS | GBA | Wireless | FilePlanet | Cheats | Movies | TV | DVD | Music | Comics | Gear | Sports | Cars | Babes end: HorizontalNav Search: The Web IGN.com IGN DVD Search begin: LEADERBOARD ROW On Our Six Take a quick tour and browse today's big stories by clicking the images to the right: Best 0f 2006 Lost Moments See Silver Surfer! Halo 3 Video Doc Free Guides /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=hotbutton6&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351988&altlocdir=ign&altLocFile=hotbutton_6_uk.js& */ TYPE=flashlight SIZE STYLE=html end: LEADERBOARD ROW BEGIN LEFT COLUMN SECTIONS · Best of 2006 · Year in Review · DVDs · Reviews · Reader Reviews · Previews · Videos · Features · News · Editors' Choice · Release Dates · Easter Eggs · Mailbag · Message Boards · Compare Prices · Download Movies CHANNELS Insider Members · Insider Channel · Hi-Res Movies · Strategy Guides · Founders' Club Games · PC Games · PlayStation 2 · PlayStation 3 · Sony PSP · Xbox · Xbox 360 · GameCube · Nintendo Wii · Nintendo DS · Game Boy · Wireless · N-Gage · PlayStation · N64 · Dreamcast · PC Downloads · Top Games · VE3D · Vault Network Entertainment · Movies · TV · DVD · Music · Comics · Gear · Sports · Cars · Babes · Sci-Fi Brain · Horror Brain Cheats & Codes · PC Cheats · PS2 Cheats · PS3 Cheats · Xbox 360 Cheats · Wii Cheats · DS Cheats · Top Cheats · FAQs · Game Guides Club.IGN · Message Boards · Blogs · Lists · My Account GET GAMES Direct2Drive Compare Prices · PC Games · PS3 Games · Xbox 360 Games · Wii Games · DS Games /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=120x60&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351987& */ TYPE=smallbutton SIZE STYLE=html end: LEFT COLUMN BEGIN CENTER COLUMN IGN » Entertainment » DVD » Reviews /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=title&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351990& */ TYPE=title SIZE STYLE=html Babylon 5: The Complete Fourth Season Blogs Boards News Reviews Previews Features Babylon 5: The Complete Fourth Season It was the year of fire... the year of destruction ... It was the year everything changed. by Sergio Non /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=300x250&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351982& */ TYPE=mediumrectangle SIZE STYLE=img"
    },
    {
      "tag": "p",
      "text": "February 11, 2004 - Talk all you want about special effects, spaceships and alien costumes, but above all, the enduring mark of great sci-fi is ideas. It's especially true for sci-fi TV shows, which love to bludgeon viewers with Major Themes: Being Human (Spock, Data, The Doctor, various clones); Cultural Diversity (aliens, we love you); What Is Real? (time travel; holodecks; shape shifters); Privacy and Individual Rights (telepaths); Religion (The Force); and of course, The Meaning of Life (Yoda). But Babylon 5 wielded the biggest, bluntest instrument of all, and it smashed through season four to create an outsized beast of grandiosity. Everything about this set screams of self-conscious ambition. The Show Ultimately, Babylon 5 was all about the ideas of its creator and executive producer J. Michael Straczynski, who wrote the screenplays for the majority of the shows, including every episode of the last two seasons. His ambition dominated Babylon 5 throughout its run: \"I'm pretty rigorous in my scripts most of the time. Idon't tend to allow for a lot of improvisation or a lot of changing around.\" The content certainly drips with self-importance -- operatic music; exaggerated, acting; didactic dialogues about Really Important Topics; sweeping shots of battle -- and in its desperate attempt to be taken seriously, Babylon 5 ends up stagey and affected. Why show consequences when his characters can tell us (and tell us and tell us and tell us) about them? Who needs naturalistic dialogue when there's preaching to be done? What's the use of small gestures when gesticulation can chew up the camera? Why cap the big showdown between Shadows and Vorlons with an exciting fight when you can end with a long-winded Sheridan speech? Viewers might have thought the Shadow conflict - which powered the show for much of Babylon 5's first three years -- would take an entire season to complete, but it was resolved by the sixth show, Into the Fire , making the next 16 episodes feel a bit like one long denouement. start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video A Babylon 5 Season 4 DVD Menu."
    },
    {
      "tag": "p",
      "text": "end image table By the time Babylon 5 finally delivers a massive space battle in episode 20, Endgame , it's hard to care. It didn't help that Straczynski mixed senseless space battle cliches like all-weapons-and-shields-are-down-so-let's-ram-them with one clever idea involving telepaths and ships. Yet the maddening and unintentionally comic elements of Babylon 5 often worked. Sometimes the outsized, over-the-top acting and dialogue approaches brilliance. The devious, sneering Ambassador Londo Mollari might be one of the greatest TV sci-fi characters of all time, and his actor, Peter Jurasik, gets to bluster and show off his outlandish accent to full effect in season four. Mira Furlan's breathless portrayal of Ambassador Delenn and Jerry Doyle's smartass, grumpy cop take on Chief Garibaldi are weirdly compelling. And for all his wordiness, Straczynski can write remarkable scenes. Season 4's last episode, The Deconstruction of Falling Stars , offered a microcosm of the show's best and worst traits. Set up as a far-future historian's look back at the effect of Babylon 5 on Earth history, the script insists on  extolling the greatness of Sheridan and his cohorts - you can't get more heavy-handed than Delenn glaring at a trio of academic strawmen and wheezing that Sheridan \"was a good man.\" start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video If Worf can be a merry man, Ican be a court jester."
    },
    {
      "tag": "p",
      "text": "end image table On the other hand, Deconstruction includes a wonderful vignette that -- in a nod to the classic novel Canticle for Leibowitz --  features an older monk defending the Babylon 5 \"myth\" against the questions of his younger colleague; it's a touching, eloquent defense of religious belief, and especially surprising coming from a skeptic like Straczynski. Lots to dislike, but even more to love. The ideas and their build-up make Babylon 5 worth watching, especially in its climactic season. If only the payoff were better. Score: 9 out of 10 start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video The typical reaction to watching Star Trek: Enterprise"
    },
    {
      "tag": "p",
      "text": "end image table The Video Sadly, the video quality can make the watching a little hard on the eyes. Considering this is a science-fiction show with some fairly sophisticated 3D graphics, it wouldn't have been asking too much to clean up the video for DVD distribution. Instead, the ongoing insistence on painting Babylon 5 as an Epic For Our Time may have actually made picture quality worse on DVDs. The live action sequences were shot in 16:9 format with high-definition television screens in mind, but to save money, the special effects were created for 4:3 viewing. Thus, all CGI effects are, in effect, blown-up on the DVDs, which present the show 16:9, in keeping with Straczynski's original vision. The end result? For any scene with special effects, including composite shots that mix live-action and CGI, the same problems noted in IGN's previous review exist here: graininess, jagged edges and digital errors, even on non-HD television sets. If you don't have a high-definition television, try watching this on a PC's DVD player -- you may find yourself wondering if you're watching a DivX downloaded from the Internet or an actual DVD. The quality on the trailers is even worse. Score: 4 out of 10 start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video Excuse me, what were you saying about my hair?"
    },
    {
      "tag": "p",
      "text": "end image table Audio and Languages Babylon 5 does a workmanlike job with its 5.1 sound. Muscular surround sound systems can show off with the bombastic \"No Surrender, No Retreat\" musical suite -- you'll definitely know if your subwoofer works, and your rear speakers , while not used as extensively as in a high-quality theatrical release, get more of a workout than from most TV shows. As far as the show itself, careful listeners will pick up a few incidental noises, as well as echo effects of computer voices -- check out the final sequence in Deconstruction for a good sample. However, as is often the case with TV shows, Babylon 5's battle sounds -- which rear speakers should be carrying more than any other track -- are generally front-loaded. The set has subtitles in English, French and Spanish. Happily, the subtitles remain during the audio commentaries. Score: 7 out of 10 start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video Shame that 200 years from now, we still won't have a cure for baldness."
    },
    {
      "tag": "p",
      "text": "end image table Packaging and Extras The 6-disc set comes in a thin Amaray holders. It includes a pamphlet with brief synopses of each episode. Audio commentaries include one for episode 4, Falling Toward Apotheosis , with actors Jurasik, Doyle, Bruce Boxleitner (who played Sheridan) and Patricia Tallman (telepath Lyta Alexander). Apparently it was recorded via remote, since some of the actors indicate they're in different locations. It's also entirely useless for anyone seeking insight into the show - the group spends most of its time cracking jokes about the shape of Doyle's head, followed by Boxleitner's ability (or lack thereof) to remember lines, and the Londo hairpiece that Jurasik wore. start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video Hey baby, come here often?"
    },
    {
      "tag": "p",
      "text": "end image table Perhaps the actors kept it breezy, knowing that Straczynski would more than make up for it with his excessively thoughtful audio supplement to two episodes, The Face of the Enemy and the aforementioned Deconstruction . The former also includes comments from director Michael Vejar. Straczynski also sits down for a separate interview that serves as an introduction to and overview of the entire show. Disc Six includes a short documentary about the show's composer, Christopher Franke, a performance of the \"No Surrender, No Retreat\" orchestral suite, a gag reel and a Universe of Babylon 5 feature with tidbits about various Babylon 5 elements. Preview trailers are included for each episode. Warner Brothers should have left them out -- what's the point of trailers for episodes that can already be watched at will? - and used the extra space for higher video quality. Score: 7 of 10 start image table"
    },
    {
      "tag": "div",
      "text": "Warner Home Video This is what happens when some people try to hook up their own satellite dish."
    },
    {
      "tag": "p",
      "text": "end image table"
    },
    {
      "tag": "div",
      "text": "ign_inc_score_box.jsp IGN's Ratings for Babylon 5: The Complete Fourth Season Rating Description out of 10 click here for ratings guide 9 The Movie We love it, we love it not. We love it, we love it not. We love it... 4 The Video Very poor, especially for a science fiction show. 7 The Audio Fairly front-loaded for a 5.1 mix. 7 The Extras Similar to previous efforts. 7 OVERALL (out of 10 / not an average) /ign_inc_score_box.jsp mediaTabs Blogs Boards News Reviews Previews Features /mediaTabs Related Links"
    },
    {
      "tag": "p",
      "text": "Babylon 5 S5 Due In April Final season looks to be as loaded as previous sets. Babylon 5 Revival Follow-Up Jerry Doyle speaks out regarding plans for a B5 revival. And JMS responds! Straczynski on Spidey 2 ? IGN FilmForce has the truth about the latest rumor. Babylon 5 on DVD: The Interview J. Michael Straczynski talks to IGN about DVDs, Legend of the Rangers, comics, and more. 10 Questions: J. Michael Straczynski The creator of Babylon 5 and Rising Stars gives his 10 answers. Interview with J. Michael Straczynski (Conclusion) \"As things unravel, it's a larger conspiracy, so basically  after the second year – the show you think Crusade is would be a whole different show, with much more depth to it...\" Interview with J. Michael Straczynski (Part 3 of 4) \"Iwould go back in time and do it again... Iwould not do it a second time, because it damn near killed me the first time.\" Interview with J. Michael Straczynski (Part 2 of 4) My log line on Jake and the Fatman was 'He cant walk. He can't act. Together they fight crime.'\" Interview with J. Michael Straczynski (Part 1 of 4) \"Ive sold about maybe 85-90% of everything Ive ever written. Ihave no explanation.\""
    },
    {
      "tag": "div",
      "text": "/* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=connbox&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351983& */ TYPE=mdf SIZE STYLE=img Add IGN to Google Send This Page to a Friend Contact the Editors / end id=\"colCenterContact\" end: CENTER COLUMN BEGIN  RIGHT COLUMN /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=countdown&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351980& */ TYPE=countdown SIZE STYLE=html ign_inc_detailsbox.jsp ign_inc_dvd_detailsbox.jsp objectDetailsBox DVD Details for Babylon 5: The Complete Fourth S... colRightBox objectDetailsBoxTop ign_inc_detailsbox_lists.jsp userToolsHead /userToolsHead userToolsControls note: the span parent tags of the img tags are required.  ajaxlist_oop.js uses the parent span tags to swap out the child img icon with a loader gif For the cList parameter: 0-Wishlist, 1-Collection, 2-Favorite, 1000-Now Playing/Watching, 1100-Email Alerts , 10-Played/Watched, -9-Neither Webservice uses these id's for object types:  1-video game, 3-dvd, 6-umd user checkboxes Watching Now Get Alerts /user checkboxes user radios Wishlist Collection Neither edit list details Edit List Details /edit list details /user radios user tools buttons blog this /blog this /user tools buttons /userToolsControls align height of userTools with the box shot /align height of userTools with the box shot without this br, IE6 will have text from buttons spill outside of form element /ign_inc_detailsbox_lists.jsp /objectDetailsBoxTop objectDetails MPAA Rating: NR MSRP: $99.98 Publisher: Warner Home Video Running Time: 996 Minutes Genre: Sci-Fi Release Date: January 6, 2004 /objectDetails Click Here for More DVD Info /ign_inc_detailsbox.jsp IGN TV: Tune in Today 12/22 Beauty and the Geek 3 : Meet the Girls 12/22 Dirt: \"Pilot\" Advance Review 12/22 2006 Year in Review: TV /tvPromoBoxText /tvPromoBoxContent /colRightBox /tvPromoBox BEGIN ScoreBox ign_inc_scoresbox.jsp EHLO /ign_inc_scoresbox.jsp end:ScoreBox /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=largesweeps&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351979& */ TYPE=countdown SIZE STYLE=html Latest Articles Box Content Latest\n\t\n\t DVD Reviews A Scanner Darkly The Simpsons - The Complete Ninth Season Black Christmas (Special Edition) Richard Pryor: Live in Concert Four Weddings and a Funeral /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=side300x250&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351981& */ TYPE=sidemediumrectangle SIZE STYLE=html end: RIGHT COLUMN begin: HorizontalNav IGN.com | PC Games | PS2 | PS3 | PSP | Xbox | Xbox 360 | GameCube | Wii | DS | GBA | Wireless | FilePlanet | Cheats | Movies | TV | DVD | Music | Comics | Gear | Sports | Cars | Babes end: HorizontalNav FOOTER FRAME ADS HOT CONTENT /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=s728x90&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351985& */ TYPE=transparentpixel SIZE STYLE=html /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=text&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351989& */ TYPE=text SIZE STYLE=html /*Start of Google External JS Include*/ /*EXTERNAL_JS_SRC=\"http://www.google-analytics.com/urchin.js\"*/ /*End of Google JS Include*/ /*Start of Google JS*/ /*End of Google JS*/ FOOTER HOT CONTENT Hot DVDs: A Scanner Darkly | The Simpsons - The Complete Ninth Season | American Pie Presents The Naked Mile (Unrated) | Black Christmas (Special Edition) | Jackass: Number Two (Unrated) /FOOTER HOT CONTENT /ADS HOT CONTENT FOOTER NETWORK WRAPPER LOGO AND SITES IGN.com | GameSpy | Arcade | Arena | TeamXbox | GameStats | Planets | Vaults | VE3D | AskMen.com CheatsCodesGuides | FilePlanet | 3D Gamers | Direct2Drive | Rotten Tomatoes | GamerMetrics /LOGO AND SITES CORPORATE By continuing past this page, and by your continued use of this site, you agree to be bound by and abide by the User Agreement . Copyright 1996-2006, IGN Entertainment, Inc. About Us | Support | Advertise | Privacy Policy | User Agreement | IGN's enterprise databases running Oracle, SQL and MySQL are professionally monitored and managed by Pythian Remote DBA . /CORPORATE /FOOTER NETWORK WRAPPER /FOOTER FRAME /* AD from: http://ssa.ign.com/html.ng/platform_id=0&network=uk&section_id=451&section_id=451&topic_id=46&reginsider=n&pagetype=article&subdomain=uk.dvd.ign.com&object1_id=608816&aggregate=country_uk_IGN%2BDVD&size=richmedia&server=linapp4.in.snowball.com&PageId=1167177351945&property=ign&gob_id=608816&page_type=article&hosted_id=7528&article_id=491629&article_id=491629&channel_id=72&object1=608816&dechannel=igndvd&site=dvd&articleid=491629&network_id=12&random=1167177351945&articletype=Review&tile=1167177351986& */ TYPE=richmedia SIZE STYLE=html APPS16 Page generation time: 0:00:09.312 linapp4.in.snowball.com: http://dvd.ign.com/articles/491/491629p1.html page generation time: 170ms"
    }
  ]
}