{
  "url": "http://admin-clerical.careerbuilder.com/ac.ic/Pennsylvania_Lancaster_DataEntry.htm",
  "file_number": "5",
  "content_hash": "e265ce40ac40f0aabdf53bf3b46f3676aa27091fb0b3a5e87dfd6120bef08340",
  "total_blocks": 403,
  "retained_blocks": 33,
  "ignored_blocks": 370,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" Already Registered?  Sign In >> Employers: Search Resumes Post Jobs Advice Job Seekers: Home My CareerBuilder Find Jobs Job Recommendations Post Resumes Job Alerts Advice & Resources Advice & Resources Career Resources Career Fairs Job Seeker Toolkit Career Advice CB Bookstore Salary Calculator"
    },
    {
      "tag": "p",
      "text": "Location: Admin & Clerical : Data Entry : Pennsylvania : Lancaster : \r\n\tSearch Results Sign In"
    },
    {
      "tag": "div",
      "text": "Email Address or Password is Invalid The feature you requested is only available to members.  Please sign in to continue... New user? Register here Email Address: Password: Forgot Password? Automatically sign me in next time. What's this? Login"
    },
    {
      "tag": "p",
      "text": "Sorry!"
    },
    {
      "tag": "div",
      "text": "You must be logged in to use this feature, but Login is currently unavailable while we perform necessary maintenance. Please try again later. Close"
    },
    {
      "tag": "p",
      "text": "Authorizing..."
    },
    {
      "tag": "div",
      "text": "Thanks for your patience - we'll be done shortly."
    },
    {
      "tag": "p",
      "text": "Save Search"
    },
    {
      "tag": "div",
      "text": "Sign in Successful! Name your search: Select your Job Alert email frequency: No Job Alert Daily Monday only Tuesday only Wednesday only Thursday only Friday only Saturday only Sunday only Save this search >>"
    },
    {
      "tag": "p",
      "text": "Save Search - Alert!"
    },
    {
      "tag": "div",
      "text": "You have the maximum number of Saved Searches. Before you can save this new search, you need to delete one of your other searches."
    },
    {
      "tag": "div",
      "text": "Your Searches Job Alert"
    },
    {
      "tag": "div",
      "text": "ASP.NET Tuesday Delete ASP.NET Tuesday Delete ASP.NET Tuesday Delete ASP.NET Tuesday Delete ASP.NET Tuesday Delete"
    },
    {
      "tag": "div",
      "text": "Cancel"
    },
    {
      "tag": "p",
      "text": "Search Saved"
    },
    {
      "tag": "div",
      "text": "Your search has been saved. View your saved searches in My CareerBuilder. Close"
    },
    {
      "tag": "p",
      "text": "Saving this search..."
    },
    {
      "tag": "div",
      "text": "Thanks for your patience - we'll be done shortly."
    },
    {
      "tag": "p",
      "text": "Sorry!"
    },
    {
      "tag": "div",
      "text": "Saved Search is currently unavailable. Please try again later. Close Save this search View saved jobs"
    },
    {
      "tag": "h1",
      "text": "23\r\n        Admin & Clerical - Data Entry jobs found within 5 miles 10 miles 20 miles 30 miles 50 miles of\r\n                \r\n                \r\n                Lancaster, Pennsylvania"
    },
    {
      "tag": "div",
      "text": "[ Modify this Search ] Search Again Advanced Search Keywords: Location: Posted within: Last 30 Days Last 7 Days Last 3 Days Last 24 Hours"
    },
    {
      "tag": "h2",
      "text": "Narrow Search"
    },
    {
      "tag": "div",
      "text": "Category: Admin & Clerical (23) Customer Service (13) Facilities (3) Other (2) Health Care (2) General Business (1) Human Resources (1) Sales (1) Skilled Labor - Trades (1) Business Development (1) Strategy - Planning (1) Nurse (1) Business Opportunity (1) Company: Reading Hospital and... (3) Aerotek Professional... (2) CareersUSA (2) Integrity Staffing... (2) confidential (1) Westfield Insurance (1) WellSpan Health (1) TempStar Staffing (1) Schaller Anderson (1) SHS Staffing Solutions (1) Raymour & Flanigan (1) OfficeTeam (1) JPMorgan Chase (1) International Reading... (1) Home Business Solutions (1) CNA Insurance (1) Allied Barton Security... (1) City: Newark (8) Reading (7) York (4) Coatesville (1) Lancaster (1) Lebanon (1) Mesa (1) State: Pennsylvania (14) Delaware (8) Arizona (1) Keyword(s): Use: All of these words Any of these words Location(s): (Enter up to 3) Include Jobs Within: 5 miles 10 miles 20 miles 30 miles 50 miles of these locations Jobs Posted Within: Last 30 Days Last 7 Days Last 3 Days Last 24 hours Job Type: - Select a Job Type - Admin Administrative Assistant Clerical Clerk Contracts Administration Data Entry Executive Assistant Office Manager Receptionist Degree: Not Specified None High School 2 Year Degree 4 Year Degree Graduate Degree Include all lower degrees Employment Type: Full time Contractor Part time Intern Salary Range: $0 $10,000 $20,000 $30,000 $40,000 $50,000 $60,000 $70,000 $80,000 $90,000 $100,000 $110,000 $120,000 > $120,000 to $0 $10,000 $20,000 $30,000 $40,000 $50,000 $60,000 $70,000 $80,000 $90,000 $100,000 $110,000 $120,000 > $120,000 Exclude Criteria Exclude Keyword(s): Exclude Job Title: Exclude Company: Exclude national and regional jobs Exclude jobs that don't include salary information Find Salary Information for these Jobs >> E-mail this job to a friend... Or yourself! Sending... This job was successfully e-mailed. Error. Please check that the e-mails are valid. An unknown error has occurred. Please try again later. From (your e-mail) : To (recipient's e-mail) : Your name : Notes : Sort by Relevancy Date Title Company Location Search Results Page 1 of 1 | Jump to page 1"
    },
    {
      "tag": "div",
      "text": "Job Title / Description ( show titles only ) Company Location Posted"
    },
    {
      "tag": "div",
      "text": "T-OT-Administrative Assistant Job type: Contractor\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $0.00 - $10.00/hour Classification: Temporary Compensation: Pay up to $10.00 per hour Local CPA firm is seeking a qualified Administrative Assistant. The ideal candidate... View full job description Save to MyCareerBuilder Email to a friend OfficeTeam PA - READING 5 Days Ago Customer Service Positions Job type: Part time Customer Service Representatives Looking for a career with advancement opportunities? Come work for the best in the furniture retail industry! Raymour... View full job description Save to MyCareerBuilder Email to a friend Raymour & Flanigan PA - Reading 5 Days Ago Secretary III Job type: Full time Join us for an opportunity of a lifetime for professional and personal growth. The Reading Hospital is a 804-bed tertiary care facility, so you'll... View full job description Save to MyCareerBuilder Email to a friend Reading Hospital and Medical Center PA - Reading 6 Days Ago CODING TECHNICIAN Job type: Full time CNA has provided essential insurance to businesses for more than 100 years. We are respected worldwide as experts in understanding risks with an... View full job description Save to MyCareerBuilder Email to a friend CNA Insurance PA - Reading 1 Week Ago Administrative Assistant - (posted 12/19/06) Job type: Full time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $10.00 - $15.00/hour Administrative Assistants Excellent opportunity for Administrative Assistants with all skill sets to work for multiple companies in the Newark, DE... View full job description Save to MyCareerBuilder Email to a friend CareersUSA DE - Newark 1 Week Ago Admininstrative Assistant - Full Time Job type: Full time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $18.00/hour Full-time Administrive Consulting Position This excellent opportunity is currently available with our client, who is a highly reputable global... View full job description Save to MyCareerBuilder Email to a friend Integrity Staffing Solutions DE - Newark 1 Week Ago Mail File Clerk Typist Job type: Full time Westfield Insurance- Lancaster PA office Mail and File Clerk Typist Great entry-level opportunity Full-time hours 7:00 AM- 3:30 PM Westfield Group is... View full job description Save to MyCareerBuilder Email to a friend Westfield Insurance PA - Lancaster 1 Week Ago Office Assistant Job type: Full time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $8.00 - $10.00/hour OFFICE ASSISTANT- Now accepting applications/resumes for experienced Office Assistant for York area company. This is a front office position and will... View full job description Save to MyCareerBuilder Email to a friend confidential PA - York 1 Week Ago Office Assistant Job type: Full time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $8.00 - $10.00/hour OFFICE ASSISTANT- SHS Staffing Solutions is now accepting applications/resumes for experienced Office Assistant for our Lebanon, Pa. Office location.... View full job description Save to MyCareerBuilder Email to a friend SHS Staffing Solutions PA - Lebanon 1 Week Ago Human Resources Generalist Job type: Full time We are Delaware Physicians Care, Inc., part of the growing Schaller Anderson family of health care management and consulting services. Serving members... View full job description Save to MyCareerBuilder Email to a friend Schaller Anderson DE - Newark 1 Week Ago Clerical Support Job type: Full time Purpose: On a day to day basis, this person will be responsible for answering phones and greeting visitors in the facilities department. This person... View full job description Save to MyCareerBuilder Email to a friend Aerotek Professional Services PA - Coatesville 2 Weeks Ago Customer Service, Clerical and Administrative to Work from Home Job type: Full time/Part time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $0 - $100k/year Customer Service, Clerical and Administrative to Work from Home. 6 people needed in your area Established US and Canadian companies are looking for... View full job description Save to MyCareerBuilder Email to a friend Home Business Solutions US-Nationwide 2 Weeks Ago Administrative Support Job type: Full time/Part time SEVERAL FULL AND PART-TIME OPPORTUNITIES FOR THE FOLLOWING: Clerical ~ Accounting ~ Legal Administrative Support ~ Medical Office ~ Collections ~... View full job description Save to MyCareerBuilder Email to a friend TempStar Staffing PA - Reading 2 Weeks Ago Clerk Job type: Full time Join us for an opportunity of a lifetime for professional and personal growth. The Reading Hospital is a 804-bed tertiary care facility, so you'll... View full job description Save to MyCareerBuilder Email to a friend Reading Hospital and Medical Center PA - Reading 2 Weeks Ago Administrative Assistant Job type: Contractor Purpose: Alarge manufacturing company in York, is seeking a qualified candidate for an immediate opening as an Administrative Assistant. The position... View full job description Save to MyCareerBuilder Email to a friend Aerotek Professional Services PA - York 2 Weeks Ago Order Processing Agent Job type: Part time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $10.00 - $12.00/hour Temporary position 01-08-07 through 04-05-07 - Seeking Individual to process customer orders, handle customer service issues and respond to mail. AA/... View full job description Save to MyCareerBuilder Email to a friend International Reading Association DE - Newark 3 Weeks Ago Office Clinician (Medical Assistant or LPN) Job type: Full time/Part time Office Clinician I General Summary: Under the general supervision of the Clinical Coordinator and the Practice Manager, provides safe, therapeutic and... View full job description Save to MyCareerBuilder Email to a friend WellSpan Health PA - York 3 Weeks Ago Receptionist Job type: Full time AlliedBarton is currently accepting applications for an administrative support person with security experience in the area of York, PA. This person... View full job description Save to MyCareerBuilder Email to a friend Allied Barton Security Services PA - YORK 3 Weeks Ago Front Desk / Office Clerk - (posted 12/13/06) Job type: Full time\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $11.00 - $14.00/hour Front Desk / Office Clerk Medical office in the Newark, DE area is seeking a Front Desk / Office Clerk for its busy medical facility. Responsibilities... View full job description Save to MyCareerBuilder Email to a friend CareersUSA DE - Newark 3 Weeks Ago Clerk III Job type: Full time Join us for an opportunity of a lifetime for professional and personal growth. The Reading Hospital is a 804-bed tertiary care facility, so you'll... View full job description Save to MyCareerBuilder Email to a friend Reading Hospital and Medical Center PA - Reading 3 Weeks Ago Sr. Customer Service Specialist Job type: Full time Provide JPM Chase HNW (High Net Worth) customers with a convenient way to satisfy their property and casualty insurance needs with no sales pressure,... View full job description Save to MyCareerBuilder Email to a friend JPMorgan Chase DE - Newark Nov-28 Data Entry Specialist Job type: Contractor\r\n\t\t\t\t\t\t\t    |\r\n\t\t\t\t\t\t\t    Pay: $10.00/hour Data Entry Specialist Specialist This excellent data entry opportunity is currently available with our client, who is a highly reputable global... View full job description Save to MyCareerBuilder Email to a friend Integrity Staffing Solutions DE - Newark Nov-27 Data Entry Handle incoming calls Job type: Full time Data Entry Handle incoming calls w/excellent phone manners while providing order entry with speed & accuracy Apply Foxfire Printing 750 Dawson Dr... View full job description Save to MyCareerBuilder Email to a friend DE - Wilmington Region 4 Days Ago"
    },
    {
      "tag": "div",
      "text": "Page 1 of 1  | Jump to page: 1 Click Here to Access Your Saved Searches"
    },
    {
      "tag": "dt",
      "text": "CareerBuilder.com:"
    },
    {
      "tag": "dd",
      "text": "CareerBuilder Job Seeker Customer Service: (866) 438-1485 Ask CareerBuilder Help Feedback Email this page to a friend About Us Work at CareerBuilder Affiliate Program Advertising Info Our Partners Privacy Fraud Terms"
    },
    {
      "tag": "dt",
      "text": "International Sites:"
    },
    {
      "tag": "dd",
      "text": "CareerBuilder UK CareerBuilder Canada CareerBuilder Germany CareerBuilder India"
    },
    {
      "tag": "dt",
      "text": "Partner Sites:"
    },
    {
      "tag": "dd",
      "text": "Freelance & Contract Jobs College Scholarships Candidate Screening Shopping Apartments Cars FSBO Real Estate News Local Newspapers Rental Homes 50+ Lifestyle Guide Salary Calculator"
    }
  ]
}