{
  "url": "http://jodi.ecs.soton.ac.uk/Articles/v01/i08/Hunter/",
  "file_number": "91",
  "content_hash": "0ecaa01dcb5f00edd4135674774ab414646464d18cc14823d17f52ac537e43b6",
  "total_blocks": 242,
  "retained_blocks": 67,
  "ignored_blocks": 175,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\""
    },
    {
      "tag": "p",
      "text": "Journal of Digital Information , Volume 1 Issue 8 Article No. 42, 2001-02-08 To cite this paper please include the details above in the full reference Themes: Digital libraries , Information discovery Peer reviewed paper Printable version available."
    },
    {
      "tag": "h1",
      "text": "MetaNet - A Metadata Term Thesaurus to Enable Semantic Interoperability Between Metadata Domains"
    },
    {
      "tag": "div",
      "text": "Jane Hunter DSTC Pty Ltd, University of Queensland, Qld, 4072, Australia Email: jane@dstc.edu.au Web: home page Key features References ; Figures 1 , 2 , 3 , 4 ; Tables 1 , 2 , 3 , 4"
    },
    {
      "tag": "h3",
      "text": "Contents"
    },
    {
      "tag": "div",
      "text": "1 Introduction 2 Definitions of Terms 3 Related Work 4 Overview of the ABC Underlying Metadata\r\nModel 5 A Simple Example Structural Mapping Rules 6 An Evaluation of XSLT for Metadata\r\nMappings 7 Semantic Mapping via a Mapping Matrix 8 Development of MetaNet, a Metadata Term\r\nThesaurus Intrathesaurus and Interthesaurus\r\nRelations Description of MetaNet 9 Linking MetaNet to XSLT 10 Conclusions, Limitations and Future\r\nWork Acknowledgements Appendix A ABC Description of Example Resource Simple Resource-centric Description of Example\r\nResource Dublin Core Description of Simple Example MPEG-7 Description ID3 Description Appendix B XSL for Transforming from ABC to DC XSL for Transforming from ABC to ID3 XSL for Transforming ABC to MPEG-7"
    },
    {
      "tag": "h3",
      "text": "Abstract"
    },
    {
      "tag": "div",
      "text": "Metadata interoperability is a fundamental requirement for\r\naccess to information within networked knowledge organization systems.\r\nThe Harmony international digital library project [1] has developed a common underlying data model (the ABC model) to enable\r\nthe scalable mapping of metadata descriptions across domains and media\r\ntypes. The ABC model [2] provides a set of basic building\r\nblocks for metadata modeling and recognizes the importance of 'events'\r\nto describe unambiguously metadata for objects with a complex history.\r\nTo test and evaluate the interoperability capabilities of this model, we\r\napplied it to some real multimedia examples and analysed the results of\r\nmapping from the ABC model to various different metadata domains using\r\nXSLT [3] . This work revealed serious limitations in the\r\nability of XSLT to support flexible dynamic semantic mapping. To overcome\r\nthis, we developed MetaNet [4] , a metadata term thesaurus\r\nwhich provides the additional semantic knowledge that is non-existent within\r\ndeclarative XML-encoded metadata descriptions. This paper describes MetaNet,\r\nits RDF Schema [5] representation and a hybrid mapping\r\napproach which combines the structural and syntactic mapping capabilities\r\nof XSLT with the semantic knowledge of MetaNet, to enable flexible and\r\ndynamic mapping among metadata standards."
    },
    {
      "tag": "h2",
      "text": "1 Introduction"
    },
    {
      "tag": "div",
      "text": "Networked knowledge organisation systems typically contain objects of mixed\r\nmedia types which are described using a multitude of diverse metadata schemas.\r\nHence machine understanding of metadata descriptions which conform to schemas\r\nfrom different domains is a fundamental requirement for access to information\r\nwithin networked knowledge organization systems. In particular, there are\r\nthree main scenarios in which interoperability among metadata descriptions\r\nis required: To enable a single search interface across heterogeneous metadata descriptions; To enable the integration or merging of descriptions which are based on\r\ncomplementary but possibly overlapping metadata schemas or standards; To enable different views of the one underlying and complete metadata description,\r\ndepending on the user's particular interest, perpective or requirements. Metadata descriptions from different domains are not semantically distinct\r\nbut overlap and relate to each other in complex ways. Achieving interoperability\r\nbetween such metadata descriptions via manually-generated one-to-one crosswalks [6] is useful, but this approach does not scale to the many metadata vocabularies\r\nthat will develop. Amore scalable and cost-effective approach is to exploit\r\nthe fact that many entities and relationships - for example, people, places,\r\ncreations, organisations, events, etc. - occur across all of the domains.\r\nThe Harmony project [1] has been investigating this more\r\ngeneral approach towards metadata interoperability and in the process has\r\ndeveloped the ABC model and vocabulary [2] ."
    },
    {
      "tag": "p",
      "text": "The hypothesis is that such an approach will lead to more efficient,\r\nscalable machine-translations between heterogeneous metadata descriptions.\r\nTo test this hypothesis and to evaluate the interoperability capabilities\r\nof the ABC model, we applied it to some real multimedia examples and analysed\r\nthe results of mapping from the ABC model to various different metadata\r\ndomains using XSLT [3] . This work revealed serious limitations\r\nin XSLT's ability to support flexible dynamic semantic mapping. To overcome\r\nthis, we developed MetaNet [4] , a metadata term thesaurus\r\nwhich provides the additional semantic knowledge that is non-existent within\r\ndeclarative XML-encoded metadata descriptions. This paper describes the optimum metadata mapping approach determined\r\nfrom applying the ABC model to a small test set of multimedia examples.\r\nThis approach combines: the ABC event-aware metadata model, developed within the Harmony project,\r\nas the underlying model for scalable generic mappings between domain-specific\r\nvocabularies, with; XSLT for parsing XML descriptions and performing structural and syntactic\r\nmapping, and; MetaNet, a metadata term thesaurus, to provide the semantic knowledge required\r\nto enable semantic mapping between metadata terms from different domains\r\nor standards."
    },
    {
      "tag": "h2",
      "text": "2 Definitions of Terms"
    },
    {
      "tag": "p",
      "text": "This section defines the key terms used throughout the remainder of the\r\npaper: Metadata - data about data - or more commonly \"descriptive information\r\nabout Web resources\". The use of standardized descriptive metadata can\r\nsubstantially improve the discovery and retrieval of relevant networked\r\nresources. Different communities or domains have developed their own standardized\r\nmetadata vocaularies to meet their specific needs. Vocabularies - shared terminologies with commonly agreed-upon semantics\r\nfor a domain. Common vocabularies enable search engines, agents, authors\r\nand users to communicate within a domain. Schemas - provide a standard way of defining standard domain-specific\r\nvocabularies by defining a common set of elements, their semantics and\r\nthe relationships between the elements. Ontology - a formal description of the concepts, roles and relationships\r\nthat exist for an agent or community of agents. Ontologies provide a shared\r\nand common understanding of a domain that can be communicated across people\r\nand applications, and play a major role in supporting information exchange\r\nand discovery. Thesaurus - the vocabulary of a controlled indexing language, formally\r\norganized so that the a priori relationships between concepts (for\r\nexample \"broader\" and \"narrower\") are made explicit. [7] Metadata Thesaurus - a thesaurus (defined according to ISO 2788\r\nstandard for monolingual thesauri [7] ) which defines the\r\nrelationships between metadata terms from different domain vocabularies."
    },
    {
      "tag": "h2",
      "text": "3 Related Work"
    },
    {
      "tag": "p",
      "text": "Thesauri have been used to improve the precision and recall of information\r\nretrieval systems for over 30 years. The introduction of automated information\r\nretrieval has caused a dramatic increase in the demand for vocabulary control,\r\nparticularly in the last decade. Examples of well known thesauri used to\r\nprovide authority control over the terms used for indexing documents in\r\nthe bibliographic, medical and cultural domains respectively are: the Library\r\nof Congress Subject Headings (LCSH) [9] , the Medical Subject\r\nHeadings (MeSH) [10] and the Art and Architecture Thesaurus\r\n(AAT). [11] In addition, thesauri have been used within\r\ninformation retrieval systems to improve retrieval effectiveness by providing\r\nsemantic roadmaps. [12] , [13] , [14] Since the emergence of the Internet, a great deal of effort has been\r\ninvested in the development of metadata vocabularies to enable the exchange\r\nand discovery of information across different applications and domains.\r\nMetadata vocabularies such as Dublin Core [15] , USMARC [16] ,\r\nINDECS [17] , MPEG-7 [18] , FGDC [19] ,\r\nIEEE LOM [20] and CIDOC CRM [21] provide\r\nstandardized sets of descriptive elements to enable the exchange of resources\r\nfor specific applications or domains. Although these standards enable interoperability\r\nwithin domains, they introduce the problem of incompatibility between disparate\r\nand heterogeneous metadata descriptions or schemas across domains. Aliterature survey reveals many different proposals for improving interoperability\r\nbetween domain-specific vocabularies, thesauri and ontologies in the context\r\nof information retrieval and exchange. These range from database schema\r\nintegration [22] , to the use of ontologies in organizing\r\nand integrating networked information systems (e.g. OBSERVER [23] ,\r\nInfoSleuth [24] , OntoSeek [25] ) to\r\nthe merging of monolingual [26] and multilingual thesauri. [8] Two of the major research issues have been categorizing the complex kinds\r\nof interthesaurus semantic relationships which exist [27] and automating the detection of these relationships during the merging\r\nprocess. [28] More recently the approach to merging thesauri has been to represent\r\nthem formally using RDF Schemas [29] and to use inference\r\nengines to automate the merging - such as has been proposed in the Ontology\r\nInference Layer (OIL). [30] In this paper we are not so much concerned with the specific process\r\nby which MetaNet is generated or with expressing the complete set of possible\r\nterm relations (as described in ISO 2788) in MetaNet. Our primary objective\r\nis to generate a thesaurus which specifies (an albeit simplified) set of\r\nsemantic relationships between metadata terms from a number of different\r\ndomain schemas relative to the ABC underlying vocabulary (the preferred\r\nterms) and hence also to each other. Our goal is then to demonstrate how\r\nthis semantic knowledge can be represented in a machine-readable format\r\n(RDF Schema) and extracted and combined with the syntactic and structural\r\nmapping capabilities of XSLT to enable the implementation of flexible dynamic\r\nmappings between metadata descriptions from different domains."
    },
    {
      "tag": "h2",
      "text": "4 Overview of the ABC Underlying Metadata Model"
    },
    {
      "tag": "p",
      "text": "The Harmony Project [1] is investigating a generic approach\r\nto metadata interoperability through the development of an event-aware\r\nmetadata model. The ABC model [2] defines a set of fundamental\r\nclasses which provide the building blocks for expression (through sub-classing)\r\nof application-specific or domain-specific metadata vocabularies. The base\r\nclasses, shown below, were determined by analysing commonalities between\r\ndifferent communities' metadata models (including: Dublin Core [15] ;\r\nINDECS [17] ; MPEG-7 [18] ; CIDOC CRM [21] ;\r\nIFLA [31] .) Resources Events Inputs and Outputs Acts Agents Roles Context Time Place Event Relations ABC adopts an event-aware view for modeling the relationship between the\r\nvarious manifestations of a creation. This event-aware view provides semantically\r\nclear attachment points for the association of properties among the various\r\nmanifestations, events and contributors (agents) involved in a resource's\r\nlifecycle. In addition, ABC provides a multiple views philosophy for metadata\r\nmodeling and recipes for inter-conversion between those views. If life-cycle\r\ninformation is required, the event model can be used. When single resource\r\nmetadata is needed, a resource-centric state model is used. Figure 1 shows\r\nthe UML representation for the ABC metadata model. Figure 1. UML representation of the ABC metadata model"
    },
    {
      "tag": "h2",
      "text": "5 A Simple Example"
    },
    {
      "tag": "p",
      "text": "To test the ABC model and evaluate XSLT for metadata mapping, we considered\r\nthe following simple illustrative example:"
    },
    {
      "tag": "blockquote",
      "text": "\"Aresource which is a 130 min audio (MP3) recording of a 'Live\r\nat Lincoln Center' performance. The Orchestra is the New York Philharmonic.\r\nThe performance was on April 7, 1998 at 8 pm Eastern Time. The musical\r\nscore performed is 'Concerto for Violin'. Copyright for the entire performance\r\nis held by Lincoln Center for the Performing Arts.\""
    },
    {
      "tag": "p",
      "text": "First we describe this resource using the ABC model. We then attempt to\r\nmap from the ABC description to Dublin Core, MPEG-7 and ID3 [32] descriptions respectively, using XSLT. Figure 2 illustrates the two steps\r\ninvolved in mapping from the ABC metadata model to resource-centric models\r\nsuch as Dublin Core, MPEG-7 and ID3: The structural mapping step involves transferring event properties to the\r\noutput resource and creating a relationship between the output and input\r\nresources associated with the event. The semantic mapping step involves mapping the properties attached to the\r\noutput resource to semantically-equivalent properties in the output domain. Appendix Acontains the corresponding ABC, Resource-centric,\r\nDublin Core, ID3 and MPEG-7 descriptions. Figure 2. Transformation from the ABC event-aware model to three different\r\nresource-centric models"
    },
    {
      "tag": "h3",
      "text": "5.1 Structural Mapping Rules"
    },
    {
      "tag": "p",
      "text": "For events which generate an output resource from an input resource, the\r\ntransformation from an event-aware metadata model to a simple resource-centric\r\nmetadata model consists of the following steps: The Date, Time and Place properties within the Event's Context node can\r\nbe qualified using the Event Type and transferred to the target output\r\nresource, e.g. Date.Performance, Time.Performance, Place.Performance; The Role property of each Act associated with an event becomes a qualifier\r\non the Agent property which is attached to the target output resource and\r\nits value is the Act's Agent Name, e.g. the Agent.Orchestra property has\r\nvalue \"New York Philharmonic\"; A Relation property arc is generated from the event type (e.g. Performance\r\n-> Relation.isPerformanceOf) and is attached to the target output resource.\r\nThe value of this property is the patient input resource of the event (e.g.\r\n\"comp523\"). All other existing properties of the input and output resource remain the\r\nsame. Other inheritance and metadata derivation rules may be possible but these\r\nrequire further investigation. For example, a Description property for the output resource can be\r\ngenerated from the Event Type and the input resource's Title e.g. \"Performance\r\nof 'Concerto for Violin'\". Or in many cases, the Title property\r\ncan be inherited by the output resource directly from the Title property\r\nof either the input resource or the event."
    },
    {
      "tag": "h2",
      "text": "6 An Evaluation of XSLT for Metadata Mappings"
    },
    {
      "tag": "p",
      "text": "The Extensible Style Language (XSL) [3] consists of a\r\ntransformation language (XSLT) and a formatting language. The transformation\r\nlanguage XSLT (which acts independently of the formatting language) provides\r\nelements that define rules for how one XML document is transformed into\r\nanother XML document. The transformed XML document may use the markup and\r\nDTD of the original document or it may use a completely different set of\r\ntags. The ability of XSLT to transform data from one XML representation\r\nto another makes it appear to be ideal for metadata interchange applications. An XSL document contains a list of templates and rules. Atemplate rule\r\nhas a pattern specifying the trees it applies to and a template to be output\r\nwhen the pattern is matched. When an XSL processor formats an XML document\r\nusing an XSL style sheet, it scans the XML document tree looking through\r\neach sub-tree in turn. As each tree in the XML document is read, the processor\r\ncompares it with the pattern of each template rule in the style sheet.\r\nWhen the processor finds a tree that matches a template rule's pattern,\r\nit outputs the rule's template. This template generally includes some markup,\r\nsome new data and some data copied out of the tree from the original XML\r\ndocument. Using XSLT and the Xalan [33] XSLT processor we developed\r\nXSL programs for transforming the ABC description above to DC, ID3 and\r\nMPEG-7 descriptions, respectively. Appendix Bshows the resulting XSL files. The mapping implementations in Appendix Brevealed\r\nthat although XSLT works well for the structural mapping from an event\r\nmodel to a resource-centric model based on the set of rules described in\r\nSection 3.1, it is inadequate for implementing flexible dynamic semantic\r\nmappings between metadata vocabularies. This is due to: XSLT's limited capabilities for handling variable input descriptions based\r\non schemas which are not tightly constrained; The non-existence of machine-understandable semantic information in declarative\r\nXML-encoded metadata descriptions; Processor-dependent handling of input parameters and procedural code extensions; Limited string manipulation and comparison functions, e.g. it is not possible\r\nto perform case-insensitive string comparisons within XSLT. The mappings revealed that if the input XML descriptions are relatively\r\nfixed and tightly constrained, then the semantic mappings can be hardwired\r\nand XSLT is adequate. But if the input descriptions are at all variable\r\nor unpredictable (e.g. undefined domain specific sub-classing and attributes)\r\nthen XSL simply cannot cope. Cawsey investigated the use of XSLT for customizing\r\nRDF descriptions, reaching similar conclusions. [34] Below are listed a number of possible approaches to handling the semantic\r\nmapping problem. The approach chosen is a balance between simplicity on\r\nthe one hand, and flexibility or scalability on the other. The wider the\r\ntargeted scope of interoperability, the more difficult it is to achieve\r\naccurate, precise mappings. Below is a list of mapping approaches in increasing\r\norder of both scope and difficulty: Hardwire crosswalks between metadata terms from specific metadata domains\r\n(easy, but only works for fixed input); Extract mappings from a pre-defined multiple-domain mapping matrix; Determine the semantic mappings from a metadata term ontology; Determine the semantic mappings from a generic ontology such as WordNet; Determine the semantic mappings from a dynamically generated ontology created\r\nby using inferencing to merge multiple domain-specific ontologies. By reducing the scope of the problem to interoperability between existing\r\nmetadata standards, then the fully generic approaches (e.g., 4 and 5 above)\r\nbecome unnecessarily complex. Hence in the remainder of this paper we investigate\r\nthe less complex but still moderately flexible approaches (2 and 3) based\r\non a mapping matrix and a metadata term ontology, respectively."
    },
    {
      "tag": "h2",
      "text": "7 Semantic Mapping via a Mapping Matrix"
    },
    {
      "tag": "p",
      "text": "The second approach in the list above involves linking a mapping matrix\r\nto the XSLT processor. The mapping matrix explicitly defines the semantic\r\nmappings between a fixed set of metadata vocabularies from a number of\r\ndifferent domains. Figure 3 illustrates such a mapping matrix. If XPath [35] is used to specify the elements, then to some extent both the structural\r\nand semantic mappings can be defined. Table 1. Metadata mapping matrix ABC Element DC Element ID3 Element MPEG-7 Path Resource/Title Title TIT2 CreationMetaInformation/Creation/Title/TitleText (@TitleType=\"original\") Event/Act/Agent Creator TPE1 CreationMetaInformation/Creation/Creator (@role=\"creator\") Publisher TPUB UsageMetaInformation/Publication/Publisher Contributor IPLS(involved People List), TCOM(Composer), TENC(Encoder), TEXT(Lyricist), TOLY(OriginalLyricist), TOPE(Original Artist), TPE2(Band, Orchestra, Accompaniment), TPE3(Conductor), TPE4 (Interpreter, Remixer, Modifier) CreationMetaInformation/Creation/Creator (@role) Resource/Subject Subject TIT1 CreationMetaInformation/Creation/Classification/PackagedType Resource/Description Description TIT3 CreationMetaInformation/Creation/CreationDescription Event/Context/Date Date.Creation - CreationMetaInformation/Creation/CreationDate Date.Publication - UsageMetaInformation/Publication/PublicationDate Date.Recording TRDA - Resource/Type Type TCON CreationMetaInformation/Classification/Genre Resource/Format Format TFLT MediaInformation.MediaProfile/MediaFormat/FileFormat Format.length TLEN - Format.size TSIZ - Resource/Identifier Identifier UFID MediaInformation/MediaIdentification/Identifier Event/Input Source TOAL (Title of original recording or source) - Event/Context/Place Coverage.Place - - This approach has certain debilitating limitations, however. Amatrix\r\nis only capable of specifying mappings which involve fairly simple one-to-one\r\nmappings, and a two-dimensional matrix will only work if the mappings are\r\nsymmetrical in both directions across all the domains. If the mappings\r\nare asymetrical then the matrix becomes highly complex and multi-dimensional.\r\nHowever, the primary limitation of this approach is that it simply does\r\nnot scale - as the number of domains grows and the mappings become asymmetrical,\r\nthen the matrix becomes excessively complex and unwieldy."
    },
    {
      "tag": "h2",
      "text": "8 Development of MetaNet, a Metadata Term Thesaurus"
    },
    {
      "tag": "p",
      "text": "Rather than limiting the semantic mapping to a fixed number of domains/vocabularies\r\n(i.e. the number of columns in the mapping matrix), a more generic approach\r\nis to extract the mapping dynamically from a thesaurus of metadata terms,\r\ngenerated by formally defining relationships between metadata terms from\r\na number of different domains' standardized vocabularies."
    },
    {
      "tag": "h3",
      "text": "8.1 Intrathesaurus and Interthesaurus Relations"
    },
    {
      "tag": "p",
      "text": "The ISO2788 standard for the identification and documentation of monolingual\r\nthesauri [7] identifies the following types of intrathesaurus\r\nrelations: hierarchical associative equivalence The hierarchical relation occurs between concepts having \"broader/narrower\"\r\nmeanings. This can be further specialized into the generic (BTG/NTG), whole-part\r\n(BTP/NTP) and instance (BT/NT) relations. For the sake of simplicity, we\r\nhave chosen only to model the BTG/NTG relation (a common practice among\r\nthesauri developers) and the equivalence relation, and not to include associative\r\nrelations within MetaNet. The ISO5964 standard for the documentation and establishment of multilingual\r\nthesauri [8] identifies the following types of interthesaurus\r\nrelations: exact equivalence partial equivalence single to multiple equivalence inexact equivalence. These relations indicate that the semantic relations between terms from\r\ndifferent metadata vocabularies are likely to be much more complex than\r\none-to-one exact equivalence and that even \"exact equivalence\" will be\r\nan approximation. However, because the scope of our problem is limited\r\nto relations between terms in a number of standardized English metadata\r\nvocabularies, then we can expect the frequency of more complex mappings\r\nto be less than for general natural language thesauri. For the first draft\r\nof MetaNet, we decided only to consider exact and partial equivalence relations\r\nand to combine them in the ET relation which defines equivalent/overlapping\r\nterms. If two different domains use two different metadata terms which\r\nare ETs in our thesaurus then we make the assumption that the domains are\r\nreferring to semantically equivalent concepts. Consequently the metadata term thesaurus which we have developed, MetaNet [4] ,\r\ncontains only preferred terms (the ABC core vocabulary), equivalent/overlapping\r\nterms (ET), narrower terms (NT) and broader terms (BT), and attempts to\r\nencompass terms from the most significant and widely-used metadata vocabularies\r\n(Dublin Core, IFLA, IEEE LOM, INDECS)."
    },
    {
      "tag": "h3",
      "text": "8.2 Description of MetaNet"
    },
    {
      "tag": "p",
      "text": "The objective of the MetaNet thesaurus is to provide the semantic\r\nknowledge required to enable machine understanding of equivalence and hierarchical\r\n(subtyping) relationships between metadata terms from different domains.\r\nThe scope of this thesaurus is limited to the most significant metadata\r\nmodels/vocabularies used for describing attributes and events associated\r\nwith resources and their life cycles. This encompasses metadata vocabularies\r\nfrom the bibliographic, museum, archival, record keeping and rights management\r\ncommunities. It has been developed by performing WordNet [36] searches using the core terms from the ABC vocabulary, and extracting those\r\nsynonyms and hyponyms which could conceivably be used in a metadata scheme\r\nto represent the original core term. In addition, the results have been\r\ncompared with the vocabularies of the DC, INDECS, IFLA, IMS and CIDOC CRM\r\nvocabularies to check that the majority of the terms used in these metadata\r\ndictionaries have been incorporated into the thesaurus. Amachine-readable RDF Schema representation of this thesaurus has been\r\ndeveloped. [37] The RDF and RDF Schema elements, Class , subClassOf , property , subPropertyOf are used to define the hierarchical/subtyping and\r\nentity/attribute relationships between metadata elements. The RDFS label element is used to specify semantically equivalent terms which may be used.\r\nThe ABC core vocabulary is used as the top-level set of preferred terms.\r\nAlthough this thesaurus has been generated manually, it could conceivably\r\nbe generated automatically by using inferencing mechanisms to merge RDF\r\nSchemas from different domains, as has been proposed in the Ontology Inference\r\nLayer (OIL). [30] For example, consider \"Agent\", which is a core term of the ABC vocabulary\r\nand hence a preferred term in the MetaNet thesaurus. Semantically equivalent\r\nterms for \"Agent\", commonly used within other metadata vocabularies, include: actor, contributor, creator, player, doer, worker, performer Possible narrower terms or hyponyms for \"Agent\" include: author, composer, artist, musician, . . etc. Table 2 is an excerpt from the RDF Schema which illustrates the representation\r\nfor the \"Agent\" metadata term as well as its equivalent terms and a partial\r\nhierarchy of its narrower terms. Table 2. Excerpt from the RDF Schema"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<rdf:RDF xml:lang=\"en\"\r\n       xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\r\n       xmlns:rdfs=\"http://www.w3.org/2000/01/rdf-schema#\">\r\n\r\n<rdfs:Class rdf:ID=\"Agent\">\r\n\r\n    <rdfs:comment  xml:lang=\"en\">The resources which contribute to or act\r\n        in an event. Typically agents are people, groups of people, \r\n        organisations or instruments.</rdfs:comment>\r\n\r\n    <rdfs:label xml:lang=\"en\">Actor</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Contributor</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Creator</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Player</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Doer</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Worker</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Performer</rdfs:label>\r\n\r\n    <rdfs:subClassOf\r\n        rdf:resource=\"http://www.w3.org/2000/01/rdf-schema#Resource\"/>\r\n\r\n</rdfs:Class>\r\n\r\n<rdfs:Class rdf:ID=\"Author\">\r\n    <rdfs:label xml:lang=\"en\">Writer</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Wordsmith</rdfs:label>\r\n    <rdfs:subClassOf\r\n               rdf:resource=\"#Agent\"/>\r\n</rdfs:Class>\r\n\r\n<rdfs:Class rdf:ID=\"Journalist\">\r\n    <rdfs:label xml:lang=\"en\">Columnist</rdfs:label>\r\n    <rdfs:label xml:lang=\"en\">Reporter</rdfs:label>\r\n    <rdfs:subClassOf\r\n               rdf:resource=\"#Author\"/>\r\n</rdfs:Class>\r\n\r\n</rdf:RDF>"
    },
    {
      "tag": "p",
      "text": "A Web search and browse interface to MetaNet has also been developed. [4] Users can search on any common metadata term and retrieve a list of equivalent\r\nterms, broader terms and narrower terms. Figure 3 shows the results of\r\na search on the term \"author\". Figure 3. Results of MetaNet search"
    },
    {
      "tag": "h2",
      "text": "9 Linking MetaNet to XSLT"
    },
    {
      "tag": "p",
      "text": "Using XSLT it is possible to parse an input XML description and for each\r\nelement encountered call a Java procedural code extension which determines\r\nthe equivalent term in the output domain from the semantic realtionships\r\nspecified in the MetaNet thesaurus. For example, suppose the Java program, Mapping.java, contains an extension\r\nfunction readMetaNet . For each element encountered during parsing\r\nof the input metadata description, the input element name (e.g. abc:Agent)\r\nand the output domain schema definition (e.g. the Dublin Core schema) are\r\npassed to the readMetaNet function. This function searches the MetaNet\r\nRDF Schema file for an element in the output schema definition that is\r\nequivalent to the input element name (e.g. dc:contributor), and returns\r\nthis value. XSL creates a new output element with this name in the output\r\ndescription. Figure 4 illustrates the program flowchart. Figure 4. Program flow for metadata description mappings The XSL code in Table 3 illustrates how to call a Java extension function, readMetaNet ,\r\nfrom the main XSL file. Table 3. XSL code to call a Java extension function, readMetaNet, from the main XSL file"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?> \r\n<xsl:stylesheet version=\"1.0\" \r\n       xmlns:xsl=\"http://www.w3.org/1999/XSL/Transform\"\r\n       xmlns:dc =\"http://purl.org/dc/elements/1.1/\">\r\n       xmlns:lxslt=\"http://xml.apache.org/xslt\"\r\n       xmlns:mapping=\"Mapping\"\r\n       extension-element-prefixes=\"mapping\"\r\n       version=\"1.0\">\r\n\r\n   <lxslt:component prefix=\"mapping\" elements=\"*\" functions=\"readMetaNet\">\r\n        <lxslt:script lang=\"javaclass\" src=\"Mapping\"/>\r\n   </lxslt:component>\r\n\r\n    <xsl:template match=\"ABC\">\r\n            <xsl:apply-templates />\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"*\">\r\n        <xsl:element name=\"mapping:readMetaNet(., 'dc')\"/>\r\n           <xsl:value-of select=\".\"/>\r\n        </xsl:element>\r\n    </xsl:template>        \r\n\r\n</xsl:stylesheet>"
    },
    {
      "tag": "p",
      "text": "Below is a high-level, simplistic algorithm describing the mapping process\r\nthat is performed within the readMetaNet Java function in Figure 4. Table 4. Algorithm describing the mapping process within the readMetaNet Java function in Figure 4"
    },
    {
      "tag": "pre",
      "text": "For each element in the input description\r\n{\r\n    Search for the input element name in the output domain schema;\r\n    if (found) {\r\n       Map the input element to the equivalent output domain element;\r\n    }\r\n    else {\r\n       Extract the Equivalent Terms (ETs) for the input element from MetaNet;\r\n       Search the output domain schema for each of the ETs;\r\n       if (an ET is found)\r\n       {\r\n          Map the input element to the equivalent output domain element;\r\n       }\r\n       else {\r\n          Extract the broader terms (BTs) for the input element from MetaNet;\r\n          Search for each BT in the output domain namespace;\r\n          if (a BT is found)\r\n          {\r\n             Map the input element to the broader output domain element;\r\n          }\r\n          else {\r\n             Extract the narrower terms (NTs) for the input element from MetaNet;\r\n             Search for each NT in the output domain namespace;\r\n             if (a NT is found)\r\n             {\r\n                Map the input element to the narrower output domain element;\r\n             }\r\n         }\r\n      }\r\n    }\r\n} endFor"
    },
    {
      "tag": "h2",
      "text": "10 Conclusions, Limitations and Future Work"
    },
    {
      "tag": "h3",
      "text": "10.1 Conclusions and Limitations"
    },
    {
      "tag": "p",
      "text": "Our evaluation of XSLT for mapping between metadata descriptions from different\r\ndomains revealed that although XSLT is good for syntactical and structural\r\nmapping, semantic mappings need to be hardwired into the code. Flexible\r\nsemantic mapping is only possible with the assistance of semantic knowledge\r\nbases provided by ontologies or thesauruses such as the MetaNet thesaurus\r\ndescribed above. The MetaNet thesaurus described here is a first draft English version,\r\nbased on the vocabulary of the ABC model. Although it has only been applied\r\nto a relatively small sample set, some of the limitations of this thesaurus\r\nare already evident. These include its inability to support metadata vocabularies\r\nwhich use: Tokens, e.g. ID3 tags such as TPE2, which are semantically meaningless.\r\nThis limitation can be overcome by either explicitly including such tags\r\nin the thesaurus or searching the definitions (rather than element names)\r\nin the output namespace for the input element name or its semantically\r\nequivalent terms; Abbreviations, e.g. acc.no.; Qualifers or hybrid words joined by a variety of connectors, e.g. UserClass,\r\nAssistant Editor, Art_Director, Time-span. This problem can be solved to\r\nsome extent by including \"associated terms\" in the thesaurus and by ignoring\r\ntypical \"connectors\". In addition, the inherently ambiguous nature of language leads to the following\r\nproblems: Metadata terms with multiple possible meanings, e.g.\"condition\" - this\r\ncould be the current state of an object or it could be a restriction on\r\nthe permissable use of a resource. This can be overcome by the use of unambiguous\r\nmetadata terms by schema designers. Multiple possible spellings for the same word, e.g. artefact/artifact,\r\ncolour/color. This thesaurus is based on nouns, e.g. \"creator\", \"publisher\", and does\r\nnot search for related verbs, adverbs, adjectives in various tenses which\r\ncould be used to express the same semantics, e.g. \"created_by\", \"published_by\".\r\nThis problem could, to some extent, be overcome through the use of stemming. Currently only English is supported. However, we believe that this thesaurus\r\ncould be extended to provide equivalent or overlapping terms for the ABC\r\nvocabulary in other languages by following the recommendations specified\r\nin ISO5964. [8]"
    },
    {
      "tag": "h3",
      "text": "10.2 Future Work"
    },
    {
      "tag": "p",
      "text": "So far the ABC model has only been tested on a relatively small sample\r\nset. We intend carrying out more extensive evaluation of both the ABC model\r\nand the hybrid mapping approach, by applying them to metadata tranformations\r\nbetween large sets of sample records provided by a number of different\r\nCIMI [38] member organisations. The plan is to build\r\na testbed using multimedia museum resources and metadata descriptions provided\r\nby CIMI members and to use this testbed to implement and evaluate metadata\r\ninteroperability between different museums' descriptions. The Harmony ABC model exhibits many similarities with the CIDOC Conceptual\r\nReference Model (CRM) [21] , a domain ontology developed\r\nby the CIDOC Committee of the International Council of Museums. In the\r\nnear future we plan to investigate the possible merging of the Harmony\r\nmodel and the CIDOC CRM model into a single ontology. We plan to use the\r\nCIMI testbed described above to evaluate the \"super\" ontology resulting\r\nfrom harmonization of these two models. The mapping implementations above have all involved mapping from an\r\nevent-aware metadata model to a resource-centric metadata model. We are\r\nalso interested in the rules and mechanisms required for machine translations\r\nbetween metadata descriptions based on different event-aware metadata models,\r\ne.g. from ABC to INDECS or CIDOC CRM. We would also like to investigate mapping between \"application profiles\"\r\nor schemas which mix metadata elements imported from multiple different\r\nnamespaces. The test examples considered so far only present the problem\r\nof mapping from a single domain's metadata description to another single\r\ndomain's metadata description, e.g. pure DC to pure MPEG-7. Asituation\r\nthat will become increasingly common in the future is the need to map from\r\na schema which imports elements from multiple namespaces to another schema\r\nwhich imports a different set of elements from multiple namespaces. In\r\naddition, each schema may impose its own local structural constraints, e.g. parent/child relationships cardinality/occurrence constraints datatyping, enumeration and formatting constraints on the element values. We believe the approach proposed in this paper will support mapping between\r\nmixed-domain \"application profiles\", but need to test this through further\r\nresearch involving machine translations between metadata descriptions which\r\nconform with both complex local usage constraints, (defined by XML Schemas [39] ),\r\nas well as namespace-specific semantic definitions (defined by RDF Schemas)."
    },
    {
      "tag": "h2",
      "text": "Acknowledgements"
    },
    {
      "tag": "p",
      "text": "The author acknowledges the valuable contributions which discussions with\r\nDan Brickley, Carl Lagoze, Martin Doerr and Sigge Lundberg have made to\r\nthis work. The work reported in this paper has been funded by the Cooperative Research\r\nCentre for Enterprise Distributed Systems Technology (DSTC) through the\r\nAustralian Federal Government's CRC Programme (Department of Industry,\r\nScience and Resources)."
    },
    {
      "tag": "h2",
      "text": "References"
    },
    {
      "tag": "p",
      "text": "[ 1]The Harmony Project Home Page http://www.ilrt.bris.ac.uk/discovery/harmony/ [ 2] C. Lagoze, J. Hunter and D. Brickley (2000) \"An\r\nEvent-Aware Model for Metadata Interoperability\". ECDL 2000 , Lisbon,\r\nSeptember [ 3] XSL Transformations (XSLT) Version 1.0 (1999) W3C\r\nRecommendation, 16 November http://www.w3.org/TR/xslt.html [ 4] MetaNet Search Page http://sunspot.dstc.edu.au:8888/Metanet/Top.html [ 5] RDF\r\nSchema Specification 1.0 (2000) W3C Candidate Recommendation, 27 March http://www.w3.org/TR/rdf-schema/ [ 6] Dublin Core/MARC/GILS Crosswalk (1999) November http://lcweb.loc.gov/marc/dccross.html [ 7] ISO 2788 (1986) Documentation -- Guidelines for\r\nthe Development and Establishment of Monolingual Thesauri [ 8] ISO 5964 (1985) Documentation -- Guidelines for\r\nthe Development and Establishment of Multilingual Thesauri [ 9] Library of Congress Subject Headings, Cataloging\r\nDistribution Service, Library of Congress http://lcweb.loc.gov/cds/lcsh.html [ 10] Medical Subject Headings home page http://www.nlm.nih.gov/mesh/meshhome.html [ 11] Art and Architecture Thesaurus Browser, Getty\r\nResearch Institute http://shiva.pub.getty.edu/aat_browser/ [ 12] C. Paice (1991) \"A Thesaural Model of Information\r\nRetrieval\". Information Processing and Management , 27(5):433-447 [ 13] A.R. Aronson (1994) \"Exploiting a Large Thesaurus\r\nfor Information Retrieval\". RIAO 94, New York, October [ 14] W. Bruce Croft and J. Yufeng (1994) \"An Association\r\nThesaurus for Information Retrieval\". RIAO 94, New York, October [ 15] Dublin Core Metadata Initiative http://purl.org/dc/ [ 16] MARC Standards, Library of Congress Network Development\r\nand MARC Standards Office http://lcweb.loc.gov/marc/marc.html [ 17] G. Rust and M. Bide (1999) \"The indecs Metadata\r\nSchema Building Blocks\". Indecs Metadata Model, November http://www.indecs.org/pdf/schema.pdf [ 18] MPEG-7 Home Page http://www.darmstadt.gmd.de/mobile/MPEG7/index.html/ [ 19] Content Standard for Digital Geospatial Metadata\r\n(CSDGM) http://www.fgdc.gov/metadata/contstan.html [ 20] IEEE Learning Technology Standards Committee's\r\nLearning Object Meta-data Working Group, Approved Working Draft WD5 Learning\r\nObject Meta-data Scheme http://ltsc.ieee.org/wg12/ [ 21] ICOM/CIDOC Documentation Standards Group (1999)\r\nRevised Definition of the CIDOC Conceptual Reference Model, September http://www.geneva-city.ch:80/musinfo/cidoc/oomodel [ 22] C. Batini, M. Lenzerini and S.B. Navathe (1986)\r\n\"Acomparative analysis of methodologies for database schema integration\". ACM Computing Surveys , 18(4):323-364, December [ 23] E. Mena, V. Kashyap, A. Sheth and A. Illarramendi\r\n(1996) \"OBSERVER: An Approach for Query Processing in Global Information\r\nSystems based on Interoperation across Pre-existing Ontologies\". Proceedings\r\nof the 1st IFCIS International Conference on Cooperative Information Systems (CoopIS'96), Brussels, Belgium, June (IEEE Computer Society Press) [ 24] R. Bayardo, et al. (1997) \"InfoSleuth:\r\nAgent-based Semantic Integration of Information in Open and Dynamic Environments\". Proceedings of ACM SIGMOD Conference on Management of Data , Tucson,\r\nArizona, May, pp. 195-206 [ 25] N. Guarino, C. Masolo and G. Vetere (1999) \"Ontoseek:\r\nContent-based Access to the Web\". IEEE Intelligent Systems , Vol.\r\n14, No. 3, May/June, 70-80 [ 26] H. Mili and R. Rada (1988) \"Merging Thesauri:\r\nPrinciples and Evalauation\". IEEE Transactions on Pattern Analysis and\r\nMachine Intelligence , 10(2):204-220 [ 27] M. Doerr and I. Fundulaki (1998) \"Aproposal on\r\nextended interthesaurus links semantics\". Technical Report TR-215, Institute\r\nof Computer Science-FORTH, March [ 28] M. Sintichakis and P. Constantopoulos (1997) \"A\r\nMethod for Monolingual Thesauri Merging\". Proceedings of the 20th ACM\r\nInternational Conference on Research and Development in Information Retrieval (ACM SIGIR), Philadeplphia, PA, USA, July [ 29] B. Amann and I. Fundulaki (1999) \"Integrating\r\nOntologies and Thesauri to Build RDF Schemas\". In ECDL'99: Research and\r\nAdvanced Technologies for Digital Libraries, Paris, France, September,\r\nLecture Notes in Computer Science (Springer-Verlag), pp. 234-253 [ 30] Ontology Inference Layer http://www.ontoknowledge.org/oil/ [ 31] International Federation of Library Associations\r\nand Institutions (IFLA) (1998) Functional Requirements for Bibliographic\r\nRecords, March http://www.ifla.org/VII/s13/frbr/frbr.pdf [ 32] ID3 Tag Version 2.3.0 http://www.id3.org/id3v2.3.0.html [ 33] Xalan-Java Overview http://xml.apache.org/xalan/overview.html [ 34] A. Cawsey (2000) \"Presenting tailored resource\r\ndescriptions: Will XSLT do the job?\". WWW9 conference , Amsterdam,\r\nMay http://www.cee.hw.ac.uk/~alison/www9/paper.html [ 35] XML Path Language (XPath) Version 1.0 (1999) November http://www.w3.org/TR/xpath [ 36] WordNet - a Lexical Database for English http://www.cogsci.princeton.edu/~wn/online/ [ 37] RDF Schema Representation of the MetaNet Thesaurus\r\n(2000) October http://archive.dstc.edu.au/maenad/metanet.rdf [ 38] CIMI Consortium for Interchange of Museum Information http://www.cimi.org/ [ 39] XML Schema Language http://www.w3.org/XML/Schema"
    },
    {
      "tag": "h2",
      "text": "Appendix A"
    },
    {
      "tag": "h3",
      "text": "A.1 ABC Description of Example Resource"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<ABC>\r\n\r\n  <Event id=\"E1\" Type=\"Performance\">\r\n    <Title>Live At the Lincoln Centre</Title>\r\n    <Context>\r\n      <Date>7/4/98</Date>\r\n      <Time>20:00</Time>\r\n      <Place>Lincoln Centre</Place>\r\n    </Context>\r\n    <Act id=\"Act1\">\r\n      <Agent>New York Philharmonic</Agent>\r\n      <Role>Orchestra</Role>\r\n    </Act>\r\n    <Input id=\"comp523\"/>\r\n    <Output id=\"audio821\"/>\r\n    <Rights>\r\n        Lincoln Center for Performing Arts\r\n    </Rights>\r\n  </Event>\r\n\r\n  <Resource id=\"comp523\">\r\n     <Type>Musical Score</Type>\r\n     <Title>Concerto for Violin</Title>\r\n  </Resource>\r\n\r\n  <Resource id=\"audio821\">\r\n    <Type>audio</Type>\r\n    <Format>MP3</Format>\r\n    <Length units=\"mins\">\r\n        130\r\n    </Length>\r\n  </Resource>\r\n\r\n<ABC>"
    },
    {
      "tag": "h3",
      "text": "A.2 Simple Resource-centric Description of Example Resource"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n   <Resource id=\"audio821\">\r\n        <Title>Live At Lincoln Center</Title>\r\n        <Date.Performance>1998-07-04</Date.Performance>\r\n        <Time.Performance>20:00</Time.Performance>\r\n        <Place.Performance>Lincoln Centre</Place.Performance>\r\n        <Agent.Orchestra>New York Philharmonic</Agent.Orchestra>\r\n        <Relation.isPerformanceOf>comp523</Relation.isPerformanceOf>\r\n        <Description>Performance of 'Concerto for Violin'</Description>\r\n        <Rights>\r\n             Lincoln Center for Performing Arts\r\n        </Rights>\r\n        <Type>audio</Type>\r\n        <Format>MP3</Format>\r\n        <Length units=\"mins\">\r\n             130\r\n        </Length>\r\n   </Resource>"
    },
    {
      "tag": "h3",
      "text": "A.3 Dublin Core Description of Simple Example"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<!DOCTYPE rdf:RDF SYSTEM \"http://purl.org/dc/schemas/dcmes-xml-20000714.dtd\">\r\n<rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\r\n             xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\r\n   <rdf:Description about=\"audio821\">\r\n        <dc:Title>Live At Lincoln Center</dc:Title>\r\n        <dc:Date.Performance>1998-07-04T20:00-05:00</dc:Date.Performance>\r\n        <dc:Coverage>Lincoln Centre</dc:Coverage>\r\n        <dc:Contributor.Orchestra>New York Philharmonic</dc:Contributor.Orchestra>\r\n        <dc:Relation.isPerformanceOf>comp523</dc:Relation.isPerformanceOf>\r\n        <dc:Description>Performance of 'Concerto for Violin'</dc:Description.Performance>\r\n        <dc:Rights>\r\n             Lincoln Center for Performing Arts\r\n        </dc:Rights>\r\n        <dc:Type>audio</dc:Type>\r\n        <dc:Format>MP3</dc:Format>\r\n   </rdf:Description>\r\n<rdf:RDF>"
    },
    {
      "tag": "h3",
      "text": "A.4 MPEG-7 Description"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<MPEG-7 id=\"audio821\">\r\n  <CreationMetaInformation>\r\n    <Creation>\r\n      <Title>Live at Lincoln Center</Title>\r\n      <Creator>\r\n        <Role>Orchestra</role>\r\n        <Name>New York Philharmonic</Name>\r\n      </Creator>\r\n      <CreationDate>\r\n        <day>7</day>\r\n        <month>4</month>\r\n        <year>1998</year>\r\n      </CreationDate>\r\n      <Location>\r\n        <PlaceName>Lincoln Center</PlaceName>\r\n      </Location>\r\n    </Creation>\r\n    <Classification>\r\n      <Genre>Performance</Genre>\r\n    </Classification>\r\n  </CreationMetaInformation>\r\n  <MediaInformation>\r\n    <MediaProfile>\r\n      <MediaFormat>\r\n         <Medium>MP3</Medium>\r\n         <Length><m>130</m></Length>\r\n      </MediaFormat>\r\n    </MediaProfile>\r\n  </MediaInformation>\r\n  <UsageMetaInformation>\r\n    <Rights>\r\n       <RightsId IdOrganization='Lincoln Center'/>\r\n    </Rights>\r\n  </UsageMetaInformation>\r\n</MPEG-7>"
    },
    {
      "tag": "h3",
      "text": "A.5 ID3 Description"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<ID3>\r\n<!-- Unique Identifier -->\r\n  <UFID>audio821</UFID> \r\n  \r\n<!-- Title -->\r\n  <TIT2>Live At Lincoln Center</TIT2>\r\n\r\n<!-- Orchestra -->\r\n  <TPE2>New York Philharmonic</TPE2>\r\n\r\n<!-- Type or Genre -->\r\n  <TCON>Performance</TCON>\r\n\r\n<!-- Media Type sound originated from-->\r\n  <TMED>Audio/MP3</TMED>\r\n\r\n<!-- Date Recorded -->\r\n  <TDAT>7/4/98</TDAT>\r\n\r\n<!-- Time Recorded -->\r\n  <TIME>2100</TIME>\r\n\r\n<!-- Length in millisecs-->\r\n  <TLEN>7800000</TLEN>\r\n\r\n<!-- Original recording or source -->\r\n  <TOAL>comp523</TOAL>\r\n\r\n<!-- Copyright Message -->\r\n  <TCOP>Lincoln Center of Performing Arts</TCOP>\r\n</ID3>"
    },
    {
      "tag": "h2",
      "text": "Appendix B"
    },
    {
      "tag": "h3",
      "text": "B.1 XSL for Transforming from ABC to DC"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?> \r\n<xsl:stylesheet version=\"1.0\" \r\n     xmlns:xsl=\"http://www.w3.org/1999/XSL/Transform\"\r\n     xmlns:dc =\"http://purl.org/dc/elements/1.1/\">\r\n\r\n    <xsl:output method=\"xml\" indent=\"yes\"/>\r\n\r\n    <xsl:template match=\"ABC\">\r\n       <rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\r\n                xmlns:dc =\"http://purl.org/dc/elements/1.1/\">\r\n         <rdf:Description>\r\n           <xsl:apply-templates select=\"Event\"/>\r\n           <xsl:apply-templates select=\"Resource\"/>\r\n         </rdf:Description>\r\n       </rdf:RDF>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Event\">\r\n       <xsl:apply-templates select=\"Output\"/>\r\n       <xsl:apply-templates select=\"Context\"/>\r\n       <xsl:apply-templates select=\"Act\"/>\r\n       <xsl:apply-templates select=\"Input\"/>\r\n       <xsl:apply-templates select=\"Title\"/>        \r\n       <xsl:apply-templates select=\"Rights\"/>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Output\">\r\n       <xsl:attribute name=\"about\">\r\n          <xsl:value-of select=\"@id\"/>\r\n       </xsl:attribute>\r\n       <xsl:copy-of select=\"*\"/>       \r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Context\">\r\n       <xsl:apply-templates select=\"Date\"/>\r\n       <xsl:apply-templates select=\"Place\"/>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Date\">\r\n       <xsl:element name=\"dc:Date.{../../@Type}\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Place\">\r\n       <xsl:element name=\"dc:Coverage\">\r\n          <xsl:value-of select='.'/>      \r\n       </xsl:element>\r\n    </xsl:template>    \r\n\r\n    <xsl:template match=\"Act\">\r\n       <xsl:element name=\"dc:Contributor.{Role}\">\r\n          <xsl:value-of select='Agent'/>      \r\n       </xsl:element>\r\n    </xsl:template>      \r\n\r\n    <xsl:template match=\"Input\">\r\n       <xsl:element name=\"dc:Relation.is{../@Type}Of\">\r\n         <xsl:value-of select=\"@id\"/> \r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Title\">\r\n       <xsl:element name=\"dc:Title\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Rights\">\r\n       <xsl:element name=\"dc:Rights\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Resource\">\r\n       <xsl:if test=\"@id=../Event/Output/@id\">\r\n          <xsl:apply-templates select=\"Type\"/>\r\n          <xsl:apply-templates select=\"Format\"/>\r\n       </xsl:if>\r\n       <xsl:if test=\"@id=../Event/Input/@id\">\r\n          <xsl:element name=\"dc:Description\">\r\n            <xsl:value-of select=\"../Event/@Type\"/> of \r\n            <xsl:text>\"</xsl:text>\r\n            <xsl:value-of select=\"Title\"/>\r\n            <xsl:text>\"</xsl:text>\r\n          </xsl:element>\r\n       </xsl:if>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Type\">\r\n       <xsl:element name=\"dc:Type\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Format\">\r\n       <xsl:element name=\"dc:Format\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n</xsl:stylesheet>"
    },
    {
      "tag": "h3",
      "text": "B.2 XSL for Transforming from ABC to ID3"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?> \r\n<xsl:stylesheet version=\"1.0\" \r\n    xmlns:xsl=\"http://www.w3.org/1999/XSL/Transform\"\r\n    xmlns:id3 =\"http://www.id3.org/id3v2.3.0\">\r\n\r\n    <xsl:output method=\"xml\" indent=\"yes\"/>\r\n\r\n    <xsl:template match=\"ABC\">\r\n       <id3:ID3 xmlns:id3=\"http://www.id3.org/id3v2.3.0\">\r\n         <xsl:apply-templates select=\"Event\"/>\r\n         <xsl:apply-templates select=\"Resource\"/>\r\n       </id3:ID3>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Event\">\r\n       <xsl:apply-templates/>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Output\">\r\n       <xsl:element name=\"id3:UFID\">\r\n          <xsl:value-of select=\"@id\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Context\">\r\n       <id3:TDAT>\r\n          <xsl:value-of select=\"Date\"/>\r\n       </id3:TDAT>\r\n       <id3:TIME>\r\n          <xsl:value-of select=\"Time\"/>\r\n       </id3:TIME>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Act\">\r\n       <xsl:element name=\"id3:TPE2\">\r\n          <xsl:value-of select='Agent'/>      \r\n       </xsl:element>\r\n    </xsl:template>      \r\n\r\n    <xsl:template match=\"Input\">\r\n       <xsl:element name=\"id3:TOAL\">\r\n         <xsl:value-of select=\"@id\"/> \r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Title\">\r\n       <xsl:element name=\"id3:TIT2\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Rights\">\r\n       <xsl:element name=\"id3:TCOP\">\r\n          <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Resource\">\r\n         <xsl:if test=\"@id=../Event/Output/@id\">\r\n           <xsl:apply-templates select=\"Format\"/>\r\n           <xsl:apply-templates select=\"Length\"/> \r\n         </xsl:if>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Format\">\r\n       <xsl:element name=\"id3:TMED\">\r\n          <xsl:value-of select=\".\"/>/<xsl:value-of select=\"../Type\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Length\">\r\n       <xsl:element name=\"id3:TLEN\">\r\n          <xsl:value-of select=\".*60*1000\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n</xsl:stylesheet>"
    },
    {
      "tag": "h3",
      "text": "B.3 XSL for Transforming ABC to MPEG-7"
    },
    {
      "tag": "pre",
      "text": "<?xml version=\"1.0\"?>\r\n<xsl:stylesheet version=\"1.0\" \r\n     xmlns:xsl=\"http://www.w3.org/1999/XSL/Transform\"\r\n     xmlns:mpeg7 =\"http://www.mpeg7.org/2000/MPEG7_schema/\">\r\n     \r\n    <xsl:output method=\"xml\" indent=\"yes\"/>\r\n       \r\n    <xsl:template match=\"ABC\">    \r\n       <MPEG-7>\r\n           <xsl:apply-templates select=\"Event\"/>\r\n           <xsl:apply-templates select=\"Resource\"/>\r\n       </MPEG-7>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Event\">\r\n       <xsl:apply-templates select=\"Output\"/>\r\n    \r\n       <CreationMetaInformation>\r\n           <Creation>\r\n                <xsl:apply-templates select=\"Title\"/>\r\n                <xsl:apply-templates select=\"Act\"/>\r\n                <xsl:apply-templates select=\"Context\"/>\r\n                <xsl:apply-templates select=\"Input\"/>\r\n           </Creation>\r\n                \r\n           <Classification>\r\n               <xsl:element name=\"Genre\"> \r\n                  <xsl:value-of select=\"@Type\"/>\r\n               </xsl:element>\r\n           </Classification>\r\n       </CreationMetaInformation>          \r\n           \r\n       <xsl:apply-templates select=\"Rights\"/>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Output\">\r\n       <xsl:attribute name=\"id\">\r\n          <xsl:value-of select=\"@id\"/>\r\n       </xsl:attribute>      \r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Title\">\r\n       <xsl:element name=\"Title\"> \r\n           <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Act\">\r\n       <Creator>\r\n       <xsl:element name=\"Role\">\r\n          <xsl:value-of select='Role'/>      \r\n       </xsl:element>\r\n       <xsl:element name=\"Name\">\r\n          <xsl:value-of select='Agent'/>      \r\n       </xsl:element>       \r\n       </Creator>\r\n    </xsl:template> \r\n\r\n    <xsl:template match=\"Context\">\r\n       <CreationDate>\r\n           <xsl:variable name=\"date\" select='Date'/>\r\n           <xsl:variable name=\"my\" select=\"substring-after($date,'/')\"/>\r\n           <xsl:element name=\"day\"> \r\n               <xsl:value-of select=\"substring-before($date,'/')\"/>\r\n           </xsl:element>\r\n           <xsl:element name=\"month\"> \r\n               <xsl:value-of select=\"substring-before($my,'/')\"/>\r\n           </xsl:element>\r\n           <xsl:element name=\"year\"> \r\n               <xsl:value-of select=\"substring-after($my,'/')\"/>\r\n           </xsl:element>\r\n       </CreationDate>\r\n       <Location>\r\n           <xsl:element name=\"PlaceName\"> \r\n               <xsl:value-of select='Place'/>\r\n           </xsl:element>\r\n       </Location>\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Input\">\r\n    </xsl:template>\r\n\r\n    <xsl:template match=\"Rights\">\r\n       <UsageMetaInformation>\r\n           <Rights>\r\n              <xsl:element name=\"RightsId\">\r\n                <xsl:value-of select=\".\"/>\r\n              </xsl:element>\r\n           </Rights>\r\n       </UsageMetaInformation>\r\n    </xsl:template>\r\n\r\n\r\n    <xsl:template match=\"Resource\">\r\n       <xsl:if test=\"@id=../Event/Output/@id\">\r\n          <MediaInformation>\r\n              <MediaProfile>\r\n                  <MediaFormat>\r\n                      <xsl:apply-templates select=\"Format\"/>\r\n                      <xsl:apply-templates select=\"Length\"/>\r\n                  </MediaFormat>\r\n              </MediaProfile>\r\n          </MediaInformation>\r\n       </xsl:if>\r\n    </xsl:template>   \r\n\r\n    <xsl:template match=\"Format\">\r\n       <xsl:element name=\"Medium\">\r\n           <xsl:value-of select=\".\"/>\r\n       </xsl:element>\r\n    </xsl:template>\r\n    \r\n    <xsl:template match=\"Length\">\r\n        <Length>\r\n           <xsl:if test=\"@units='mins'\">\r\n                <xsl:element name=\"m\">\r\n                   <xsl:value-of select=\".\"/>\r\n                </xsl:element>\r\n           </xsl:if>\r\n        </Length>   \r\n    </xsl:template>\r\n    \r\n</xsl:stylesheet>"
    }
  ]
}