{
  "url": "http://laluni.helloyou.ws/netnews/bk/bethlehem/beth1058.html",
  "file_number": "94",
  "content_hash": "0580f43c65cf07518144321147eb7b0c682efdb7b0cbfbce7b43b5ed940cdf0f",
  "total_blocks": 26,
  "retained_blocks": 3,
  "ignored_blocks": 23,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\" Meta page description To Netnews Homepage Previous Next Index Table of Contents From Bethlehem to Calvary - Chapter Five - The Fourth Initiation - The\r\n    Crucifixion The difference lay in the point in evolution which humanity\r\n    itself had reached. The cycle which Christ inaugurated has been one in which men have\r\n    become strictly human. Up till that Incarnation there had always been those who, having\r\n    achieved humanity, had then passed on to demonstrate divinity. But now the whole race is\r\n    at the point of so doing. Although today men are predominantly animal-emotional, yet\r\n    through the success of the evolutionary process - leading as it has to our widespread\r\n    educational systems and the general high level of mental awareness - men have reached the\r\n    point where the masses themselves, given proper encouragement, can \"enter into the\r\n    kingdom of God.\" Who can say that it is not this realization, dim and uncertain as it\r\n    may be, which prompts the universal unrest and the widespread determination to better\r\n    conditions? That we interpret the kingdom of God in terms of the material is inevitable at\r\n    first, but it is a hopeful and spiritual sign that we are today so [192] busy cleaning\r\n    house, and thus attempting to raise the level of our civilization. Christ incarnated when,\r\n    for the first time, humanity was a complete whole, as far as the form side its nature was\r\n    concerned, with all the qualities manifesting - physical, psychic and mental - which\r\n    distinguish the human animal. He brought to us a manifestation of what the perfect man\r\n    could be who, regarding that form side as the temple of God, but recognizing his innate\r\n    divinity, strives to bring it to the foreground, first of all in his own consciousness and\r\n    then before the world. This Christ did. The mysteries had always been revealed to the\r\n    individual who fitted himself to penetrate into a hidden arcanum or temple, but Christ\r\n    revealed them to humanity as a whole, and enacted the whole drama of the God-Man before\r\n    the race. This was His major achievement, and this we have forgotten - the living Christ -\r\n    in the emphasis we have laid upon man himself, on his relation to himself as a sinner, and\r\n    to God as the One against Whom he has sinned."
    },
    {
      "tag": "p",
      "text": "Again, every great organization or group\r\n    religion or cult of any kind has originated with a person, and from that person the idea\r\n    has spread out into the world, gathering adherents as time elapsed. Christ in this way\r\n    precipitated the kingdom of God upon earth. It had always existed in the heavenly places.\r\n    He caused it to materialize, thus becoming a fact to the consciousness of men. Preparedness for the Kingdom, and the arrival of the time when men in large numbers\r\n    could be initiated into the mysteries, required from them a recognition of an unworthiness\r\n    and a sinfulness which only the development of the mind could give. The age of\r\n    Christianity has been an age of mental unfoldment. It has been an age also wherein much\r\n    emphasis has been laid upon sin and evil doing. There is no consciousness of sin in the\r\n    animals, though there may be indications of a conscience among the domesticated animals,\r\n    due to their association with man. Mind produces the power to analyze a observe, to\r\n    differentiate and distinguish; and so with the [193] advent of mental development there\r\n    has been, for a long time, a growing sense of sinfulness, of contrition, and of an almost\r\n    abject attitude to the Creator, producing in humanity that strongly marked inferiority\r\n    complex with which today psychologists have to deal. Against this sense of sin, with its\r\n    concomitants of propitiation, at-one-ment and the sacrifice of Christ for us, there has\r\n    been a revolt; and in this really wholesome reaction there is the normal tendency to go\r\n    too far. Fortunately, we are never able to get too far from divinity; and that, as a race,\r\n    we shall swing back into a state of greater spirituality than ever before is the sincere\r\n    belief of all who know. Theology over-reached itself with its \"miserable sinner\"\r\n    complex and its emphasis upon the necessity for the purification by blood. This teaching\r\n    of purification through the blood of bulls and of rams (or lambs) was part of the ancient\r\n    mysteries, and was inherited by us primarily from the Mysteries of Mithra. These\r\n    mysteries, in their turn, inherited the teaching, and thus formulated their doctrine,\r\n    which Christianity absorbed. When the sun was in the zodiacal sign of Taurus the Bull, the\r\n    sacrifice of the bull was offered as a forecast of that which Christ came later to reveal.\r\n    When the sun passed (in the precession of the equinoxes) into the next sign, that of Aries\r\n    the Ram, we find the lamb was sacrificed and the scapegoat sent into the wilderness.\r\n    Christ was born into the next sign, Pisces the Fishes, and it is for this reason that we\r\n    eat fish on Good Friday, in commemoration of His coming. Tertullian, one of the early\r\n    Church Fathers, speaks of Jesus Christ as the \"Great Fish,\" and of us, His\r\n    followers, as the \"little fishes.\" These facts are well known, as the following\r\n    extract will indicate: \"The\r\n      ceremonies of purification by the sprinkling or drenching of the novice with the blood of\r\n      bulls or rams were widespread, and were to be found in the rites of Mithra. By this\r\n      purification a man was 'born again' and the Christian expression 'washed in the blood of\r\n      the Lamb' is undoubtedly a reflection of this idea, the reference thus being clear in the\r\n      words of the Epistle to the Hebrews: 'It is not possible that the blood of bulls and of\r\n      goats should take away [194] sins.' In this passage the writer goes on to say: 'Having\r\n      boldness to enter into the holiest by the blood of Jesus, by a new and living way which he\r\n      hath consecrated for us through the veil, that is to say his flesh... let us draw near...\r\n      having our hearts sprinkled from an evil conscience, and our bodies washed with pure\r\n      water.' But when we learn that the Mithraic initiation ceremony consisted in entering\r\n      boldly into a mysterious underground 'holy of holies' with the eyes veiled, and there\r\n      being sprinkled with blood, and washed with water, it is clear that the author of the\r\n      Epistle thinking of those Mithraic rites with which everybody at that time must have been\r\n      so familiar.\" - The Paganism in Our Christianity , by Arthur Weigall, pp. 132, 133. Christ came\r\n    to abolish these sacrifices by showing us their true meaning, and in His Person as perfect\r\n    man He died the death of the Cross to show us (in picture form and through actual\r\n    demonstration) that divinity can be manifested and can truly express itself only when man,\r\n    as man, has died in order that the hidden Christ may live. The lower carnal nature (as St.\r\n    Paul loved to call it) must die in order that the higher divine nature may show forth in\r\n    all its beauty. The lower self must die in order that the higher self can manifest on\r\n    earth. Christ had to die in order that once and for all mankind might learn the lesson\r\n    that by the sacrifice of the human nature the divine aspect might be \"saved.\"\r\n    Thus Christ summed up in Himself the significance of all the past world sacrifices. That\r\n    mysterious truth which had been revealed only to the pledged and trained initiate when he\r\n    was ready for the fourth initiation was given out by Christ to the world of men. He\r\n    died for all so that all might live. But this is not the doctrine of the vicarious\r\n    at-one-ment which was pre-eminently St. Paul's interpretation of the Crucifixion, but the\r\n    doctrine which Christ Himself taught - the doctrine of divine immanence (see St. John\r\n    XVII), and the doctrine of the God-Man. Christianity inherited many of its interpretations, and the teachers and interpreters\r\n    of the early Christian times were no more free from the thralldom of ancient beliefs than\r\n    are we [195] from the interpretations given to Christianity during the past two thousand\r\n    years. Christ did give us the teaching that we must die in order to live as Gods, and\r\n    therefore He died. He did sum up in Himself all the traditions of the past for He\r\n    \"not only fulfiled the Judaic Scriptures, but He also fulfiled those of the pagan\r\n    world, and therein lay the great appeal of early Christianity. In Him a dozen shadowy Gods\r\n    were condensed into a proximate reality; and in His crucifixion the old stories of their\r\n    ghastly at-oning sufferings and sacrificial deaths were made actual and given a direct\r\n    meaning.\" (Ibid., p. 166.) But His death was also the consummating act of a life of\r\n    sacrifice and service, and the logical outcome of His teaching. Pioneers and those who\r\n    reveal to men their next step, those who come forth as the interpreters of the divine\r\n    Plan, inevitably are repudiated, and usually die as the result of their courageous\r\n    pronouncements. To this rule Christ was no exception. \"Advanced Christian thinkers\r\n    now regard the Crucifixion of our Lord as the supreme sacrifice made by Him for the sake\r\n    of the principles of His teaching. It was the crowning act of His most heroic life, and it\r\n    affords such a sublime example to mankind that meditation upon it may be said to produce a\r\n    condition of at-one-ment with the Fountainhead of all goodness.\" (Ibid., p. 166.)"
    },
    {
      "tag": "div",
      "text": "To Netnews Homepage Previous Next Index Table of Contents Last updated Monday, July 6, 1998\r\n               1998 Netnews Association. All\r\n    rights reserved."
    }
  ]
}