{
  "url": "http://leshumas.insa-lyon.fr/crl/anglais/anglais_eng/Internet%20listening.htm",
  "file_number": "96",
  "content_hash": "9ce76e6d8e5d64700bc045283e5757d12f8aa5b5150515befb6b58ed07a51517",
  "total_blocks": 32,
  "retained_blocks": 3,
  "ignored_blocks": 29,
  "blocks": [
    {
      "tag": "p",
      "text": "Internet listening"
    },
    {
      "tag": "div",
      "text": "Being able to understand what is said in English in many \r\n    different situations is essential. There is no mystery here; the more you \r\n    listen, the more you will understand. However, many students complain that they dont get enough opportunities to \r\n    listen to spoken English. Well, wake up to the age of multimedia! Everything \r\n    you need is on the internet and you can listen to whatever you want; songs, \r\n    news, radio, sound tracks Some resources are especially for esl (English as a 2 nd language) \r\n    learners use them! Once you become more confident, start listening \r\n    to sources for native English speakers; you will be surprised at how quickly \r\n    you can progress, provided you listen regularly of course."
    },
    {
      "tag": "p",
      "text": "Here are just a few examples of what is available: http://news.bbc.co.uk Extensive site including video & audio versions of news \r\n    stories to improve your listening comprehension skills. You can listen to TV \r\n    and radio broadcasts. Click on worldservice or radio. http://www.cnn.com Dont forget that CNN provides video and audio. http://www.voanews.com Voice of America (VOA), is an extensive site with lots of \r\n    resources for listening. Several language versions are available. If you \r\n    click on \"special English\" you find a webpage containing links to webcasts, \r\n    dictionaries, foreign student services. If you click directly on \r\n    webcasts and then on one of the themes (business, science etc) you will \r\n    reach a page with the headlines of the audio material. Click on a headline \r\n    that interests you & you'll find the script with the audio link.  \r\n    However, remember that this site is government run. http://literacynet.org/cnnsf This is a goldmine. Go directly to story archives & start \r\n    exploring. You can listen and read at the same time, do comprehension \r\n    exercises, work on vocabulary, and more. What they say: \" Each module includes the full text of each \r\n    story and interactive activities to test comprehension. The learner can \r\n    choose to read the text, listen to the text, and view a short video clip of \r\n    the story. Each module is designed for ease of use so the learner can use it \r\n    independently.\" http://www.bbc.co.uk/worldservice/learningenglish/multimedia/index.shtml This is an excellent multimedia site. Check out 'video \r\n    nation' which is a way to meet people from across the UK and hear what they say \r\n              about their lives and the world around them. Watch \r\n                  the video clips and test your comprehension \r\n                  in Listen out! Check what you have heard by looking at \r\n                  the tapescripts. http://www.esl-lab.com Listening comprehension for all levels. Try it out! http://listening.englishclub.com/ Links to sites where you can listen to English, but some \r\n    of the links dont work (e.g. voice of America) http://sciencefriday.com This site allows you to listen to reports about topics \r\n    relating to science & technology. Unfortunately, no tapescripts are \r\n    available. http://learnenglish.org.uk In the left-hand menu click on 'songs & lyrics'. Here you'll \r\n    find a site that provides links to a new song every week. You can listen to \r\n    the song, read the lyrics & do some language practice activities in relation \r\n    to the song. You can also click on 'archives' to find a database of songs \r\n    that have been worked on. Top"
    }
  ]
}