{
  "url": "http://library.adoption.com/Holiday-ideas/A-Birthday-Party-with-Meaning/article/2367/1.html",
  "file_number": "97",
  "content_hash": "dbfa88dcdff4a38d0c1cf014f09b49554d8a117e5346c6803c9899f769bd3566",
  "total_blocks": 86,
  "retained_blocks": 17,
  "ignored_blocks": 69,
  "blocks": [
    {
      "tag": "h1",
      "text": "A Birthday Party with Meaning!"
    },
    {
      "tag": "div",
      "text": "We had a wonderful party for Zachary. He turned seven years old and following a good rule, we allowed only one child per year of age, so it was a small and intimate affair. Knowing that Waldorf teachers do not make a large salary, and as we are fortunate to have Zachary's birthday in the summer, Iasked our local teacher to \"work\" at his party and gave her a donation of $40.00 for 2 hours to \"supervise the children\". Want to Adopt? Pregnant? Free Services click here Ididn't purchase any \"party favors\" but instead chose to make our own with Zachary's help. We sought out polished stones, shells and healthy naturally sweet treats (carob raisins & nuts and granola bars from the local health food store). We sewed beanbags with ribbon streamers coming off one end. We carefully wrapped the polished stones along with some glass pebbles in colorful tissue and ribbons. We also found a lovely sticker store and found delightful fairy stickers. Instead of store bought goodie bags we went to our local craft shop and purchased simple bags made from recycled paper. We cut 2 holes into the front and weaved a ribbon through which we then tied. Also, across the front of the bag we pulled out our rubber stamps and placed a lovely border across the front, along the bottom of each bag. We also tried to remember how we \"do\" goodie bags at our home... well, Zachary remembered that we don't give them to each child as they come in, instead we wait until the very end. This is so that the children have something to take home and keep, and they are not consuming too much sugary sweets in such a short time! Guests arrived at 2:00. Miss Michele (the teacher) had several games planned for the children. They were all drawn to her sweet singing voice as she began to sing a circle song. They played several circle and movement games which kept them very active and moving for about 30 minutes. After that she rang her little hand held bell and announced that there would be a story under the tree at the far corner of our lawn. Meanwhile, Iset up the cake, candles, and matches on a small table. Iplaced 2 chairs by the table and our long (3 yard) rainbow silk running from the 2 chairs, like a red carpet, down a walkway. Iplaced flowerpots at the ends to hold it into place and Iasked all of the parents to help by placing themselves and their children into a circle around the silk. Ipassed out small cupcakes each with a small beeswax candle in it to all of the children. Iexplained to all of the children that the way we do birthdays is that we each get to have the candle on our cupcakes lit and we each get to make a wish for Zachary, so Miss Michele walked from child to child, lighting the candle and asking each child what they wished for Zachary. \"Iwish you to get lots of presents\", \"Iwish for you to play with me everyday\", \"Iwish for you to be happy\" were some of the wishes. Each child delighted in that they had the opportunity to blow out a candle and make a wish (and an important lesson is that they made the wish for someone other than themselves!) After that, Miss Michele told the wonderful story of Zachary's Rainbow Bridge As she told the story, all of the children (and parents) were in awe of Zachary. He sat tall and proud, after all, this is a celebration of the day of his birth! As she spoke of him coming over the rainbow bridge, he stood up, walked proudly to us and then sat with us. He was so pleased, he was squeezing my hand very hard because it had such a \"ceremonial\" feel to it. She then went on with the story and for each year of Zachary's life with us, she lit a candle. When all of the candles were lit, she carried the cake to Zachary who made a wish and blew out the candles. We all sang \"Happy Birthday to You\" and the every one went off to eat cake, cupcakes, and play. Ihad written on the invitations that it was a \"picnic style party\" and asked everyone to bring their favorite blanket or lawn chair to sit on. It was very comfortable and calm, outside under the trees with the cool summer breeze blowing. Miss Michele took the children on a nature walk through the Bamboo jungle (we lived on an 8 acre Bamboo Nursery at the time) and the children loved it. Meanwhile, Idid a quick clean up and set out a place for the opening of gifts. Now maybe Ijust have a personal peeve here, but Ihave noticed that at each and every party we have ever been to, the gifts get piled high, the cards and tags fall off, and the child rips through from one gift to the next. Ihave always tried to teach that a person puts much time, care and love into choosing a gift, and that needs to be acknowledged. So, for that reason, at our house, the gift giving is done a bit differently... Each child (and parent) holds onto their gift. When it is nearing the end of the party, we sit in a huge circle and Iask that everyone please be patient as Zachary opens the gifts. This may sound kind of tedious for many, but the actual experience is a great \"lesson\" for all of us home and un schoolers. Also, as each child carries and presents his gift, Zachary gives them the goodie bag. It's nice because each child gets to open a gift, plus they don't lose it during the 2 hours of the party... it goes home intact! I've taught Zachary to thank each person by looking into their eye and either offering them a hug or a hand shake and Itruly believe that giving and receiving go completely hand in hand and lend themselves to the \"breathing in-breathing out\" rhythm. Iam pleased to say that it went very well. Of course, we will now spend the next few days preparing lovely Thank you notes, and at our house... doing that is almost as much fun! Kytka Himar-Jezek, Ph.D., is a writer, Certified Childbirth Educator, Labor Assistant, Doctor of Naturopathy, Minister, Soul Counselor, Reiki Master/Teacher, Life Coach and most importantly, a mother. She is the publisher of several family & parenting websites, two books and a regular weekly column. Reprinted with permission, this originally appeared in the \"Ask Kytka\" column at W.I.S.H."
    },
    {
      "tag": "p",
      "text": "©"
    },
    {
      "tag": "h2",
      "text": "library"
    },
    {
      "tag": "div",
      "text": "Archives Coping in the Aftermath of a Disaster After a Disaster: A Guide for Parents and Teachers After a Disaster: Self-Care Tips for Dealing with Stress After Disaster: What Teens Can Do Children and the News Disaster Counseling Skills Helping Children after a Disaster Helping Children Cope With Fear & Anxiety more... Adoption Answering Adoption Questions Adoptees, Birthparents & Search Adoption Language Adoptive Parenting Costs & Financial Help Domestic Infant Adoption Domestic Waiting Child Adoption more... Foster Parenting Foster Care and Adoption for Waiting Children Why Become a Foster Parent? Am I Ready to Become a Foster Parent? New Hope for Kids in Foster Care Advocating For Kids Behavior Control with a Behavior Plan for Foster Children Document! Document! Document! more... Child and Family Welfare - System Child Protective Services The First Lady on Child Welfare Promising Practices: Addressing Racial Disproportionality in Child Welfare Child Welfare Laws and Legal Issues Child Welfare Child Welfare Law and Practice Pregnancy Attendant, Place and Timing, and Use of Obstetric Interventions of U.S. Births Change Over Past Deca How Childbirth Choices Affect Breastfeeding Transmission of HIV from Mother to Child Ask the Author: Nutrition for Expectant Parents National Center for Health Statistics Mother's Educational Level Influences Birth Rate New Study Profiles Hispanic Births in America U.S. Pregnancy Rate Lowest in Two Decades more... Parenting and Families A Gripe Box A History of Meeting Needs A Mother's Beatitudes A Wonderful Mother Acceptance Accidents & Keeping Safe ACF Announces Four New Projects to Study Healthy Marriage more... Adoption Statistics Overview Numbers & Trends Birth Family Search Cost of Adopting Disruption & Dissolution Drug Exposure Filing Trends 1988-1997 more... Adoption Poetry Adoption Stories Celebrities Adoptive Parent Biographies Birth Parent Biographies Famous Adoptees & Fosterees A-Z Index Indexes FAQs Adoptee Issues Adopting Advertising e-Magazine Forums & Chat Foster Care General Topics more... Search Adoption Laws State Laws (full text) Summaries of State Laws Federal Laws Adoption Music Lullaby Library As You Sleep Before I Go to Sleep Go to Sleep Sing-a-Longs To The Crying Child CMS Test Glossary Encyclopedia News E-Magazine Subscribe"
    },
    {
      "tag": "h2",
      "text": "Helping birth mothers find the right adoptive family."
    },
    {
      "tag": "div",
      "text": "Rick & Jan (IL)"
    },
    {
      "tag": "h3",
      "text": "are hoping to adopt"
    },
    {
      "tag": "div",
      "text": "more profiles | add yours A Service of Adoption Profiles,LLC"
    },
    {
      "tag": "p",
      "text": "SPONSOR"
    },
    {
      "tag": "div",
      "text": "- Select One - General Info Iam Pregnant I Want to Adopt Adopt Internationally China Guatemala Russia Ukraine Site Map"
    },
    {
      "tag": "p",
      "text": "See Your Ad Here"
    },
    {
      "tag": "div",
      "text": "AdoptionShop Beyond the Great Mountains Our price: $17.95 waiting children Brandon (3,857) photolisting of US & international waiting children see other children"
    },
    {
      "tag": "p",
      "text": "email page to a friend | feedback | advertise | about us | privacy policy | site map adoptions adopting.org 123 adoption Canada UK infertility parent profiles share space family (sponsor) © Adoption Media, LLC 1995-2006. This site should not substitute personal professional, legal or medical advice. The accuracy and personal applicability of this information is not guaranteed. By using it you agree to the terms of service , including jurisdiction and limitation of liability provisions."
    },
    {
      "tag": "div",
      "text": "local adoption | parent profiles (sponsor) | blogs | wiki | links | espaol Home"
    },
    {
      "tag": "div",
      "text": "- Select\r\n\t\t\t\tOne - Learn More Looking to Adopt? Pregnant, Need Help? Waiting Families www.AdoptionNetwork.com"
    },
    {
      "tag": "div",
      "text": "Pregnant? Where Do I Start? First Questions Parent Profiles Maternity Homes Due Date Calculator open adoption legal questions Support Adopting create a profile photolistings open adoption faiths local Canada U.K. Parenting Just Adopted ages & stages issues for parents issues for children support family types activities & fun tools & resources Reunite how to search reunion registry birth family local info adoptees DNA testing birth family International photolisting travel legal issues types of adoption considerations U.S. Government Visa info Foster getting started foster adoption forms daily rates transitions challenging behavior Professionals find professionals for professionals list your organization parent profiles advertise jobs Library stories lullabies laws poems famous adoptees glossary encyclopedia statistics Shop books art announcements jewelry magazines Audio/video scrapbooking Community forums chat games journals photo albums e-magazine email lists events you are here: adoption.com > library > archives > parenting and families > holiday (ideas) > a birthday party with meaning!"
    }
  ]
}