{
  "url": "http://www.eskimo.com/~leiba/history.html",
  "file_number": "406",
  "content_hash": "f5189627060194986021566266a2c7e740f4deee435bb05c07313384c8d99a70",
  "total_blocks": 43,
  "retained_blocks": 2,
  "ignored_blocks": 41,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\" Iwas born September 30,\n1955 at 11:07 P.M. weighing 6 lbs 1\n1/4 oz. I've gained weight since\nthen...."
    },
    {
      "tag": "p",
      "text": "This is a collection--in no particular\norder--of my weight at different ages. As you'll see, my body weight was\na defining and persistently pervasive part of my life from a very early\nage. Iam the fat daughter of a fat\nwoman who desperately wanted to save me from the pain she'd suffered as\na child, including the taunts and hateful messages of inadequacy and undesirability\nthat came from her mother. These words are written to document my\nlife experience as a chubby child, fat teenager, and super-sized adult.\nThere is no blame, and Iam not angry at my Mother...This is My story, and Ithink it needs to be told. For those of you who are\nnot, and/or never have been fat, the numbers alone may not provide enough\ninformation or insight. Wherever possible, Iam including childhood pictures\nwhich can be viewed by clicking on my age at the beginning of the paragraph.\nIwill add pictures over time as Ifind and scan them. Please keep my story in mind\nwhen judging yourself, or someone you love (which actually, should be one\nand the same;-) Teach yourself, and the fat people in your life that their\nvalue should not be determined by their body shape, size or any of a hundred\nother variables. Learn to be beautiful, smart and strong on the inside first .\nThis will radiate from your center regardless of your physical size, and everyone will know how beautiful you are! If you'd like to see how Istarted\nout, click here and Iwill share a few pictures of myself as an infant and toddler. Age 5: We lived in garden apartments,\nand an older boy of 7 named Kevin called me fat . Someone told me\nthat he drew a picture of me in chalk on the front of the brick building.\nIt was a crude stick figure with a circle for the head and a larger bubble\nfor the body. That's the first time Iremember being called fat. Age 7: During a trip to the doctor\nfor my usual earache problems, it is decided that Ishould be put on\na diet. Idon't recall my exact weight, but what Ido remember is\ngoing home with a piece of paper which inspired my Mom to give me a bowl\nof Wheaties with skim milk and no sugar for dinner. The rest of\nthe family had steak, or hamburgers. Iwas markedly different from\nthis moment on. Age\n8 : 88 lbs, Ithink. Ihave a clear, but distant memory of being at\nmy cousin Selma's country home, and she gives me a pair of shorts to try\non. They don't fit, and she tells me that a little girl my age shouldn't\nweigh this much, and that if Ilose 40 lbs she will buy me all the new\nshorts Iwant...Iadore Selma, so Ipromise to do it--because even\nthough I'm sure she loves me, I'm somehow certain that she'll love me more if I'm not chubby. During this same year, Ialso had diet pills for the first time. Age\n9 : 121 lbs. Mrs Wise's fourth grade class is lined up outside the nurse's\noffice at Ridge Ranch School in Paramus, NJ. We are being weighed, and\nwhen it's my turn, Iam logged at 121 lbs. The nurse points out that Iweigh more than even the biggest and strongest boys in the school. Ihear\nsome of the boys in my class laughing and exclaiming \"Wow, what a tub of\nlard--Mason weighs over a hundred pounds!\" This fact is mentioned much\nmore often than the fact that Ilearned a monologue in Norwegian-- as\nwell as designing and creating the scenery for the class play--a feat Ipersonally found much more impressive. Age 10: 131 lbs. My Mother takes\nme to Dr Di Donato because Ihave an earache. Of course, Iam weighed (ear\ninfections are directly linked to fatness, right?) and when the doctor\ncomes into the examination room, he shakes his head in disgust and exclaims,\n\"131 pounds! My nurses don't weigh that much!!!\" Iam humiliated, looking\nto my Mother for comfort--who in turn looks at the doctor and says, \"Doctor,\ndidn't you know? Susan is going to be wearing my clothes to school\nthis fall!\" The doctor seemed to ignore my Mother's remark, but says \"We've\ngot to do something about her,\" as though Iwere not even present. Iwas\ngiven diet pills again , and Iremember later that year telling my\nteacher that Iwasn't taking them, but flushing them down the toilet. Iwas proud of that, having read that diet pills can be dangerous...but Idon't think she saw it that way, and though I'm not certain, Ithink she\nmight have called my parents and told them. Was Iclairvoyant, or simply\n\"too smart for my own good?\" Age 11: 156 lbs. My sixth grade\nteacher was Miss Fowler, who was a bastion of strictness. She kept me after\nschool one day to talk to me about the Girl Scouts--from which I'd just\nresigned. Miss Fowler told me that Iwas bright and talented, and oh, yeah--Ihad \"such a pretty face,\" but Ihad to lose weight... Age\n12 : 166 lbs. Before school started, my Mom took me shopping for back-to-school\nclothes. She held up a dress for my approval. Igasped and said \"I'm not\nreally that wide!\" My Mother replied, \"Yes, you are. We rarely see\nourselves as we really are...the way everyone else sees us. It's my first year in Junior\nHigh School. Mr. Cirinelli is my homeroom teacher, and he takes it upon\nhimself to mentor me in \"You'd better lose that weight now, 101.\" He\nhas just lost 66 lbs on Weight Watchers, and encourages me to join. So,\nIjoin the teen group of Weight Watchers that meets in the lunchroom of\nAlexander's Department Store on Friday nights. That first night, they weigh\nme and give me a report card which logs my weight and progress and also\ndisplays my goal weight, which is 88 lbs. The woman who weighs me in says\n\"You have to lose a whole person!\" Iwas very gung-ho for a while, but\nslipped up--no, Icheated! Mr. Cirinelli warned that Iwas going\nto ruin my life if Ididn't lose weight, and my Mother told me that it\nwas more important for me to stick to the diet than for her...my whole\nlife was ahead of me, but hers was already settled. She was 42. Age\n13 : I'd just survived the most interesting summer of my young\nlife. My parents sent me to diet camp in upstate New York. Iwas almost\n200 lbs, but can't recall the exact number. I'd never been to sleep-away\ncamp before, but Iwillingly went so that Icould transform my life and\nguarantee my future happiness through weight loss. The short version of this story\nis that the camp was a broken down hell-hole, and Iresponded appropriately\nto this situation with Civil Disobedience, a cornerstone of 60's politics\nfor change! The result? Iwas expelled from diet camp. The camp director\ncalled my Mother and said \"You've got to come and get her...she's got her\nwhole bunk on strike...girls are refusing to come to meals or go to activities.\nSusan has turned this place upside down and disrupted the entire camp!\" Iwas thrilled to be leaving.\nIswore I'd stick to my diet and make my parents proud. It had been the\nlongest four weeks of my life, and it wasn't until we were a few hours\naway from the camp that my Mother turned to me in anger and said \"We didn't\ncome to get you because we love you so much. We came because the camp director,\nSelma Ettenberg said you'd disrupted the entire camp, and they could not\nget things under control until you were gone!\" On the surface, Iwas devastated\nand embarrassed...but underneath, Iwas smiling. It was my first taste\nof power, and Iknew that Ihad been right! Age 14: 257 lbs. My freshman\nyear in high school, and the school nurse weighs me in at 257 lbs. I'd\nbeen admitted to Bergen County Vocational & Technical High School in\nHackensack, NJ. My entrance exam scored in the top 10%.  My plan was\nto study commercial art...but my memories of diets and fat-bashing are\nmuch more vivid than anything Iaccomplished in my academic career--including\nribbons won in a national Teen Arts Festival, and a very successful performance\nin a one-act play competition. After the sudden death of a beloved\nsecond cousin from cancer, Iwas determined to lose the weight \" so Marty\nwould be proud of me.\" That was my first go-round with Dr. Stillman.\nHamburgers, hot dogs, hard-boiled eggs and cottage cheese, plus 8 glasses\nof water a day. Ilost about 30 lbs or so before Ifaltered. Age16: 311 lbs. In an obesity\nclinic at Hackensack Hospital, Iweigh in at 311 lbs. The nurse in charge\nof my case is very nice. Ilike her a lot, and she convinces me that Ican do this--maybe even lose enough weight for someone to ask me to the\nprom next year. How sad...after all, Ididn't know that self-esteem would\nhave gone a long way in making me desirable. As usual, Ilose some weight,\nbut it's never enough.  This is also the year that Iauditioned for\nthe part of Mama Rose in Bergen Tech's production of \"Gypsy.\"  Despite\na standing ovation for my audition, Ididn't get the part--because of my\nweight.  Iwas told that Ijust didn't fit the image of Mama Rose\nbecause of my size.  Oy. Age 17: 321 lbs. Our family belonged\nto a camping club, and one of the people from the Jersey Skeeters was\na woman named Carol. She was well over 300 lbs, with a husband and children\nwho adored her. Suddenly during the last year or so, she got thin. On Weight\nWatchers, of course...so now that Ihad my drivers license, Ijoined the\nclass that Carol lectured. She told me how much everyone in the class adored\nme, and how much the rest of the world would, too--once I'd lost the weight.\nShe wanted to make a giant poster of my \"report card\" to motivate me and\nhelp the class monitor my progress. Duh. Can you say \"Make an example\nof me, and humiliate me any way you can?\" Acouple of months, and Iwas gone! Age 17 3/4: 356 lbs. My Mother\nworked at Castro Convertibles in Paramus, NJ. She was their first female\nsalesperson, and she was fat. One day, I'm in the store to\nsee her, and Inotice this man watching me. Ididn't like the way he was\nlooking at me, but Iignored him because Iwas in my Mom's place of business. That night, she tells me the\nstrange man was Bob, and he'd taken an interest in me because he'd lost\nover a hundred and fifty pounds on Weight Watchers. So...a few days after\nhigh school graduation, Ijoin yet another Weight Watchers group and weigh\nin at 356 lbs. Bob assures me that if Ido the right thing, I'll lose weight\nand someday, maybe even have a boyfriend. If Idon't, I'll never be happy. Age 19: 375 1/2 lbs. Iam accepted\nfor participation in an obesity research program at The New York State\nPsychiatric Institute at Columbia Presbyterian Hospital in New York City.\nBehavior modification, incarceration and the fear of being integrated with,\nor mistaken for a member of the general psychiatric population-- These\nwere a few of my favorite things. Istayed for the better part\nof six months and lost 88 1/2 lbs. Iwas under 300 lbs for the first time\nsince the age of 16... Age 20?: 375ish...again. Following\nan automobile accident and serious back injury, Iland in a drug rehab\nin Miami, FL on May 20, 1976 because my Mother has convinced them that\nmy compulsive eating is comparable to chemical abuse. I'm admitted because\nthe paperwork goes through, and the program gets the bucks. This place makes the diet camp\nlook like paradise. The food is horrendous, the facility (an old motel\njust a block off of Biscayne Bay) is roach infested, and worse...and a\nself-imposed regimen of arbitrary fasting is easy. Yeah, Ilost\nweight. And then Iregained it... Age 22/23: Still in Miami, now working in the program. One of the directors decides that Ihave to lose weight\nto set an example for our clients, so under the threat of \"lose weight,\nor lose your job,\" Igo to Mount Sinai Hospital on Miami Beach and enroll\nin the Optifast Program. David Kudzma, my doctor is very\ncool. He's searing, sarcastic and taunts me, telling me I'll never succeed.\nIdid though...Ilost 67 1/2 lbs, and he admitted that he might have\nbeen wrong. In the long run, he wasn't. And Ialready had the seeds of\nanorexic and bulimic behaviors planted within me. Iwasn't drinking my\n5 packets a day, thinking that somehow if Icut the 350 calories a day\nin half, I'd lose more weight...faster. Iended up in the hospital after\nnearly passing out--repeatedly over a period of a week or so. Iwas too\nweak to drive to the hospital, so a friend brought me. Ikeeled over in\nDr. Kudzma's office. Iremember \"spiraling\" toward the floor, and the next\nthing Iremembered was wondering how, if Iwas on the floor, the ceiling\nseemed so close...(Iwas actually being wheeled to the emergency room on\na gurney. Inever asked, and don't think Iwant to know how they got me\nup off of the floor.) Once I'd recovered from what\nwas referred to as an \"unknown viral thing,\" Iam determined to resume\nmy diet. Ibeg for an appointment with a staff surgeon who will perform\na gastro-intestinal bypass on me. The surgeon tells me about all\nof the risks, presumably to scare me, but Iam not afraid. \"Iam going\nto die anyway,\" Itell him. \"Just do it.\" He refused. I'll bet that's a\nrecord, huh? His name was Dr. Ackroyd and he was at Mount Sinai, too. Ihated him that day...but if Icould thank him now, Iwould. Age 24: 433 lbs. Icouldn't believe\nI'd broken the 400 pound mark, and with the blessing of the doctor by whom\nIwas employed, Iembarked on a high protein, low carbohydrate diet. When\nthat didn't yield long lasting results, Ihad my jaws wired shut. Ilost\nabout 22 lbs in 8 weeks. Every morning, Ibeat a raw egg into a glass of\norange juice. Idon't know how Isurvived--physically, or emotionally.\nOne of the things one must do when their jaws are wired is keep a pair\nof wire cutters handy in case the victim--er, dieter, that is, begins to\nvomit. The wires must be cut to avoid choking on ones own vomit. (If this\nfrightens or makes you uncomfortable, good. It ought to. Iwish I'd been\nfrightened instead of desperate.) Ihad to have the wires cut to\nhave emergency dental surgery, and chose not to get them re-wired. Ayear\nor so later, Iasked a dentist to remove the braces because Ihad no intention\nof being re-wired, and he refused at first. He wanted me to reconsider--and\nhe wasn't even the one who'd put them in! Age 25: 450-500 lbs (approximately)\nIcouldn't weigh myself, but this is a fair estimation. Age 26: 425 lbs on the morning\nof my Gastroplasty surgery. Age 27: 321 lbs, and Iam now\nanorexic and bulimic. Yes, really! Iknow, because Iwatched all the talk\nshows and read the books. The symptoms said that someone suffering from\nthese eating disorders is often emaciated, (but not always) The real key\nwas, and is behaviors! I'm not talking here about \"behavior modification,\"\nor discipline. I'm talking about the self-destructive, self-loathing behaviors\nthat destroy our bodies and our souls. Self-Esteem is the Penicillin that\nkeeps these destructive obsessions with dieting and airbrushed physical\nperfection at bay. Age\n44 : 420 or so (give or take a few pounds,) but does it really matter? Thoughts, feelings, comments?\nLet me know Return\nto my Home Page All materials on this site are\nthe intellectual, artistic and literary property of Susan Mason. You may not use any of this material without the expressed, written\npermission of the author. Copyright 1999-2000, Susan Mason"
    }
  ]
}