{
  "url": "http://www.everythingiknowiswrong.com/2004/04/the_torricelli_.html",
  "file_number": "413",
  "content_hash": "2bb65065a4d13fbc512cbaa93838473d6e3894dd0620eee8da05273e1e1d2e2e",
  "total_blocks": 230,
  "retained_blocks": 50,
  "ignored_blocks": 180,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\"\n\t\"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" <rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n         xmlns:trackback=\"http://madskills.com/public/xml/rss/module/trackback/\"\n         xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\n<rdf:Description\n    rdf:about=\"http://www.everythingiknowiswrong.com/2004/04/the_torricelli_.html\"\n    trackback:ping=\"http://www.typepad.com/t/trackback/652652\"\n    dc:title=\"The Torricelli Defence\"\n    dc:identifier=\"http://www.everythingiknowiswrong.com/2004/04/the_torricelli_.html\"\n    dc:description=\"I&apos;ve had an eerie feeling for about two days that Democrats are about to come to their senses and realalize that they&apos;re stuck with a complete stiff. John Kerry&apos;s ineptness as a campaigner has been obvious to objective observers all...\"\n    dc:creator=\"Sean\"\n    dc:date=\"2004-04-20T20:48:57-05:00\" />\n</rdf:RDF> banner"
    },
    {
      "tag": "h1",
      "text": "Everything I Know Is Wrong"
    },
    {
      "tag": "h2",
      "text": "Jumping into the pool with Demosthenes and Locke."
    },
    {
      "tag": "div",
      "text": "sidebar1"
    },
    {
      "tag": "h2",
      "text": "What They're Saying:"
    },
    {
      "tag": "div",
      "text": "\"Sean writes passionately... Make sure you read the whole\r\nthing.\" Captains\r\nQuarters"
    },
    {
      "tag": "p",
      "text": "\"Sean has more common sense than the entire New York Times editorial board,\r\nand his prose is better, too.\" Amy\r\nRidenour's National Center Blog \"This guy is blowing me away with his posts - I'm just sorry Ididn't start\r\nreading his blog sooner.\" Who Moved My Truth? \"Sean is so right he is wrong. It's good to be wrong when you're right. Right?\r\nFollow me? Follow Sean:\" Ryan's Head \"Sean at Everything I Know Is Wrong is, in my mind, rarely, if not never,\r\nwrong. [Ithink Ijust wore out my comma key] ... His website is one of my\r\nfavorites and Ireally enjoy reading his posts.\" The\r\nRocketsled to Hell"
    },
    {
      "tag": "h2",
      "text": "Good Blogs"
    },
    {
      "tag": "div",
      "text": "Amy Ridenour Best of the Web Captains Quarters ETalkinghead Fraters Libertas Hugh Hewitt InstaPundit James Lileks La Shawn Barber Michelle Malkin Patterico's Pontifications Powerline QandO Radio Blogger RedState SCSU Scholars ScrappleFace Shot In The Dark Spitbull SteynOnline TKS The American Thinker The Evangelical Outpost The Politburo Diktat Thomas Sowell Walter E. Williams"
    },
    {
      "tag": "h2",
      "text": "Fellow Travelers"
    },
    {
      "tag": "div",
      "text": "Aaron's Rantblog Adeimantus Alphecca American Digest BitsBlog Blame Bush CenterFeud Cranial Cavity Crush Kerry Dales' Electoral College Breakdown 2004 Doubleplusgood Infotainment Drink this... Election Projection Etalkinghead Ex Nihilo Exultate Justi Federal Review Free Iraqi FreeSpeech From the Rock Guardian WatchBlog Hammorabi Helloooo, Chapter Two Hugh Hewitt Inspired Blogs IRAQ THE MODEL Iraq at a glance Iraqi American Jay Reding Joefish's Freshwater Blog Live From Dallas McConchie on Bioethics Miller's Time Nabil's Blog New Covenant Nobody asked me, but... OneBigSwede Political Blog For The Politically Incorrect Quotes, Thoughts, and other Ramblings Ramblings' Journal Regime Change Iran Right Moment Right Wing News Ripples Ryan's Head Say Anything Spare Change Sun of Iraq THE MESOPOTAMIAN TalkRight Tempus Fugit The Big Picture The Daily Blogster The Diplomad The Galvin Opinion The Religious Policeman The Rocket Sled to Hell The Therapy Sessions Viper's Vietnam Veterans Page Waffles What Attitude Problem? What If? Where is Raed ? Who Moved My Truth? ihath - losing myself uBlog ¡No Pasarán!"
    },
    {
      "tag": "h2",
      "text": "Think Tanks"
    },
    {
      "tag": "div",
      "text": "Center of the American Experiment Climate Science Foundation for Defense of Democracies National Review Online National Taxpayers Union Project 21 The Claremont Institute The Heritage Foundation The National Center for Public Policy Reasearch TownHall.com"
    },
    {
      "tag": "h2",
      "text": "Pollsters"
    },
    {
      "tag": "div",
      "text": "Gallup Rasmussen Reports Zogby (just for laughs)"
    },
    {
      "tag": "h2",
      "text": "The Constitution of the United States"
    },
    {
      "tag": "div",
      "text": "Cornell L.I.I. National Archives"
    },
    {
      "tag": "h2",
      "text": "Archives"
    },
    {
      "tag": "div",
      "text": "October 22, 2006 - October 28, 2006 September 24, 2006 - September 30, 2006 September 10, 2006 - September 16, 2006 August 20, 2006 - August 26, 2006 August 13, 2006 - August 19, 2006 July 23, 2006 - July 29, 2006 July 16, 2006 - July 22, 2006 July 9, 2006 - July 15, 2006 July 2, 2006 - July 8, 2006 June 25, 2006 - July 1, 2006"
    },
    {
      "tag": "h2",
      "text": "News"
    },
    {
      "tag": "div",
      "text": "ABCNEWS ABCNEWS THE NOTE AD AGE DEADLINE AMERICAN CONSERVATIVE ANANOVA AP WORLD AP NATIONAL AP WASHINGTON AP BUSINESS AP ENTERTAINMENT AP ON THE HOUR AP HEADLINES AP BREAKING AP/REUTERS PHOTO\r\nWIRE AP\r\nAUDIO BBC BBC AUDIO BILLBOARD BLOOMBERG BOSTON GLOBE BOSTON HERALD BROADCASTING\r\n& CABLE CBS NEWS CBS PUBLIC EYE... C-SPAN\r\nSCHEDULE CHICAGO TRIB CHICAGO SUN-TIMES CHRISTIAN SCIENCE CNN CNN TRANSCRIPTS DAILY MAIL DAILY MIRROR DAILY RECORD DAILY VARIETY D.C. DAYBOOK DOW\r\nJONES E! ECONOMIST EDITOR & PUBLISHER EFE ELECTRONIC MEDIA EMIRATES TODAY... EMERGENCY NET EMPIRE ENT WEEKLY EVENING STANDARD EXPRESS FINANCIAL TIMES FORBES MAG FOX NEWS GUARDIAN HELLO! HILL H'WOOD\r\nREPORTER HUMAN EVENTS INDEPENDENT INDO-ASIAN NEWS SERVICE INSIGHT MAG INTERFAX INTERNATIONAL HERALD TRIB INVEST BUS DAILY ISLAMIC REPUBLIC WIRE ITAR-TASS JERUSALEM POST JEWISH WORLD REVIEW KNIGHT RIDDER [DC] KYODO LA DAILY NEWS LA TIMES LEXISNEXIS NEWS LUCIANNE.COM MEDIA CHECK MEDIA LIFE MEDIA WEEK MSNBC MUCHMUSIC NATION NATIONAL ENQUIRER NATIONAL REVIEW NEW REPUBLIC NEWS OF THE WORLD NY DAILY NEWS NY OBSERVER NY POST NY TIMES NEW YORKER NEWSBUSTERS NEWSBYTES NEWSWEEK N. KOREAN NEWS PEOPLE MAG PRAVDA PRESS ASSOCIATION PR NEWSWIRE PR WIRE R & R REASON MAG ROLL CALL SCRIPPS HOWARD SKY NEWS SLATE: PAPERS SMOKING GUN STAR STAR (U.K.) SUN SYDNEY MORNING HERALD TELEGRAPH TIMES TIME MAG TMZ TV SHOPTALK US INFO WIRE U.S. NEWSWIRE US NEWS USA TODAY VILLAGE VOICE WASH POST WASH TIMES WORLDWIRES THE WEEK WEEKLY STANDARD WORLDNETDAILY XINHUA"
    },
    {
      "tag": "h2",
      "text": "The 101st Fighting Keyboards Blogs for Bush"
    },
    {
      "tag": "div",
      "text": "content nav"
    },
    {
      "tag": "p",
      "text": "« John Kerry Stands By Statment He Didn't Make | Main | No Air for Air America »"
    },
    {
      "tag": "div",
      "text": "entry"
    },
    {
      "tag": "h2",
      "text": "April 20, 2004"
    },
    {
      "tag": "h3",
      "text": "The Torricelli Defence"
    },
    {
      "tag": "p",
      "text": "I've had an eerie feeling for about two days that Democrats are about to come to their senses and realalize that they're stuck with a complete stiff. John Kerry's ineptness as a campaigner has been obvious to objective observers all along but the evidence is piling up high enough so that even the Democrat base won't be able to see over the top for long. My question is this - what are they going to do when it really sinks in that Kerry isn't going to make it? Democrats have already proved they are willing to \"stretch\" election law to the breaking point. Al Gore's failed attempt to steal the 2000 presidential election was only the most visible attempt at legal attacks on legitimate processes. Don't forget that they successfully replaced scandal plagued Senator Robert Torricelli at the last moment, against the law as written, with former Senator Frank Lautenberg. Then there's the variation on that strategy that Dems used in Minnesota. They replaced Paul Wellstone, who was tragically killed in a small plane crash, at the last moment, against the law as written, with former Vice President Walter Mondale. It did not work that time and Republican Norm Coleman, against the best predictions of the particularly left leaning Star Tribune, won the election. Win or lose, it demonstrates Democratic willingness to use activist, predictably leftist, courts to rewrite election law on the fly. So, back to my question. What are they going to do when it really sinks in that they have nominated a stiff? There are any number of knight-in-shining-armor types in the wings, just waiting for the chance to step in. Hillary Clinton comes to mind right away. She has quite a machine ready to go at a moments notice. John Edwards is also someone to consider. He is relatively untarnished and could easily step in to increase the Democrat's charm factor a thousandfold. Howard Dean? Er... no. The DNC has to be turning this over and over trying to find an angle, a scenario, a loophole that will open the door to the Torricelli defense. What do you think they are going to do? ( Thanks to Hugh Hewitt for the title of this post. ) Posted by Sean in Election 2004 | Permalink"
    },
    {
      "tag": "h3",
      "text": "TrackBack"
    },
    {
      "tag": "p",
      "text": "TrackBack URL for this entry: http://www.typepad.com/t/trackback/652652 Listed below are links to weblogs that reference The Torricelli Defence :"
    },
    {
      "tag": "h3",
      "text": "Comments"
    },
    {
      "tag": "div",
      "text": "comment list"
    },
    {
      "tag": "p",
      "text": "They will enter Jamie S. Gorelick in the \"punt\" portion of the NFL'S Punt, Pass, and Kick competition. Posted by: marc | April 21, 2004 at 03:50 AM Actually, Ithink you are wrong on this one.  Ithink they do not realize how bad it is.  Kerry should remain close in the polls until after the Republican convention.  It won't be apparent to the other side until the debates begin. Now, will they do a \"Torch Maneuver\" atthat point?  That is one for Las Vegas to work out the odds on. Posted by: King of Fools | April 21, 2004 at 10:00 AM King, You are probably right that I'm wrong. It's just that, as a former Democrat, Ican't help but hope that they, too, will wake up to the nonsense that has become their party. Posted by: Sean | April 21, 2004 at 10:41 AM"
    },
    {
      "tag": "div",
      "text": "comment form"
    },
    {
      "tag": "p",
      "text": "The comments to this entry are closed."
    },
    {
      "tag": "div",
      "text": "sidebar2"
    },
    {
      "tag": "h2",
      "text": "December 2006"
    },
    {
      "tag": "div",
      "text": "Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31"
    },
    {
      "tag": "h2",
      "text": "Subscribe to EIKIW feed."
    },
    {
      "tag": "div",
      "text": "Subscribe to this blog's feed Add me to your TypePad People list"
    },
    {
      "tag": "h2",
      "text": "Day By Day Advertising One Google Search"
    },
    {
      "tag": "div",
      "text": "SiteSearch Google Everything I Know Is Wrong Web SiteSearch Google"
    },
    {
      "tag": "h2",
      "text": "\"Global Warming\" \"Climate Change\" Featured Posts"
    },
    {
      "tag": "div",
      "text": "Everything I Know Is Wrong If I Had a Party Affiliation The Decline of the Liberal Left Not \"He Lied\" Again 2+2=2 Tough Talk From The United Nations Global... What Exactly Panetta Said Bush Did Not Lie About Intel Calling All Democrats Justice Department Probe of Unethical Senate Conduct Sought By Definition Scandals Apply Only to the Right. What does John Kerry really believe in? Fess Up. News Flash: Democrats Now Party of Defense. A Flyer From John Kerry’s 1984 Senate Campaign Debate? An Apology Is Not Enough A Calm Discussion of Same Sex Marriage Missing the Point A Virus? Sheesh A Picture Is Worth A Thousand Words John Kerry: Chock Full Of New Ideas Kerry Backing Weak Among Democratic Leaders 10 Million Jobs? Democrats Blatantly Racist John Kerry Stands By Statment He Didn't Make The Torricelli Defense Kerryisms Truth Challenged The Old Switcheroo Kerry Bites Hand That Feeds Him If All Of Your Friends Jumped Off A Bridge...? Ah...ah...ahh-ch-rumsfeldshouldresign This Time They're Over The Line"
    },
    {
      "tag": "h2",
      "text": "Advertising Two Recent Posts Categories"
    },
    {
      "tag": "div",
      "text": "Current Affairs Economy Education Election 2004 eTalkinghead Family Global Warming Iraq Kerryisms Law Media Bias Political Philosophy Politics Racism Religion Science Sports The Big Lies The Constitution United Nations War on Terrorism Weblogs World Politics"
    },
    {
      "tag": "h2",
      "text": "Advertising Three Tracking"
    },
    {
      "tag": "div",
      "text": "a Start of StatCounter Code End of StatCounter Code webbot bot=\"HTMLMarkup\" startspan ALT=\"Site Meter\""
    },
    {
      "tag": "h2",
      "text": "TTLB Ecosystem The Alliance"
    },
    {
      "tag": "div",
      "text": "Glenn Reynolds says:\r\n\"Inever said that!\""
    }
  ]
}