{
  "url": "http://www.eweightlosstips.com/weightlossltr.htm",
  "file_number": "414",
  "content_hash": "10fed71b27e886ddddae8b01b95ac7c35b4ff240ac34f113d4a4ed2b348532d9",
  "total_blocks": 412,
  "retained_blocks": 23,
  "ignored_blocks": 389,
  "blocks": [
    {
      "tag": "div",
      "text": "﻿"
    },
    {
      "tag": "p",
      "text": "Urgent : Reading this \r\nbreaking report may turn your body into an ultimate fat burning machine."
    },
    {
      "tag": "p",
      "text": "\"I Dare You to Use These Proven Weightloss Secrets and NOT Dramatically Improve Your Metabolism, Your Weight loss,Your \r\nHealth, and Your Body's capacity to burn fat automatically -- 100% GUARANTEED!\" Or I Will Pay You $500 Out of MY Pocket . Hard to believe? You bet! But the fact \r\nis , the results from people just like you proves without a doubt that these \r\nsecret Ayurvedic principles work like magic for anyone..."
    },
    {
      "tag": "p",
      "text": "Testimonial \".... Ilost 20 pounds i     n      40 days!!..\" It's great.... Previously Ihad jogged daily for 2 hrs, \r\n                        tried most of the diet\r\n\t\t\t\t\t                \r\n\t\t\t\t\t programs, eaten so many diet pills before,but this is amazing.... Ilost 20 \r\n\t\t\t\t\tpounds within the first 40 days of trying your weight loss techniques!Iam feeling superbly fit too,mentally as well as physically. Uzair Khan - uzair_ngp@yahoo.com"
    },
    {
      "tag": "p",
      "text": "If you want to wake up tomorrow and know exactly how to and then start getting astonishing, \r\nimmediate results from small (even teeny) amounts of lifestyle and diet changes... or massive weight loss results from committed,disciplined diet and yoga  regimen-- then shut down your email, lock the door, unplug the phone and \r\ndevour this letter. You are in for the richest \"ride of your life\" as these Proven Weight Loss \r\nSecrets begin to transform your body overnight into the Fat Burning Furnace to make it look like the sexy  body you \r\ntruly deserve to have. What you are about to discover is the most powerfull technique you could ever have . No matter what \r\nis your current diet and routine, once you have these techniques you will always be able to wield its amazing power to your benefit. It will permanently transform your body into a made to order,finely sculpted,perfect hollywood shape that you always dream about Finally, you will firmly be in control \r\n                  of your Health and the way you look . Yes, this short, provocative report will change your life \r\nforever. Ipromise, it's that powerfull. From the desk of: Rajesh Shetty. Dear Friend, Let me ask you 3 intriguing questions, 1)How can a simple breathing technique \r\n                  remove 90% of the toxins and help remove fat from your body permanently and make you look and feel 10 years younger without you ever having to cut even a single calorie from your daily diet? ? 2)How can you melt away all the fat stubbornly deposited in every nook and corner of your body with the help of natural herbs recommended by Ayurveda medical science like a ball of wax kept on a hot stove? 3)How can you take advantage of these \r\n                  Ayurvedic secrets Now ,to make your Thyroid and Lever keep burning fat automatically for you this very moment without you wasting your time,money and health starving on the restrictive diets like the thousands of innocent,ignorant people ? That almost sounds too far fetched to be true right? But what if the answers as you will find below are absolutely, YES.. .....YES        and ............... YES! Let's just for a moment asssume they are. What would that mean to you? Listen, just imagine if you woke up tomorrow morning and magically \r\nmade it  happen. All of a sudden you now know exactly how to burn those fat cells, fire up \r\n                  your own metabolic organs so that you keep away toxins and fat \r\n                  from your body permanently, forever . Would that mean doubling the amount of weight you are currently losing every month.What would doubling your monthly weight loss mean to you? With the same effort you went from 5pounds a month to 10pounds a month,how much more weight can you lose this year? Unless you are philosophically opposed to being dramatically more successful \r\nin losing weight, then you would be hysterically ecstatic to wake up and know \r\nexactly how to do it with my proven weight loss secrets based on Ayurveda. So you WANT this to happen to \r\nyou today. And because of the dramatic weight loss results that you get, you would be saving much \r\nmore money that is getting wasted with your current diet plan and supplements.So if you are saving more money then the cost is \r\nnot a question. So the real question is... Time! Can you learn how to make these small lifestyle changes in just one lazy \r\nafternoon (or night) and see immediate results? That is what you want, correct. To sit down for a few hours tomorrow and have these Proven weight loss secrets \"magically\" transferred from my brain to yours. Then be able to make small changes in diet and lifestyle and immediately see (vast) improvements \r\nin your body, your mind, your health, your shape, your \r\nlooks,your self esteem -- in everything If Ishowed you other people, just like \r\nyou, who are enjoying exactly what you want...Would you at least believe it is possible for you? It all began four years back. Iwas on a routine visit to my dear friend Dr.Rasik Shah's house.That was the time when Iwas dejected with my health and the excess fat on my abdomen. Dr.Rasik Shah is an expert Ayurveda doctor who specialises in dissolving heart blocks with simple herbs.He routinely cures people with complex deseases \r\nlike heart blockages,asthma,blood pressure etc.with his herbs. Looking at the amazing success of his Ayurveda Medicinal practice,Ienquired him about whether he can do something about my abdominal fat. He immedietly said yes,why not?And gave me some simple tips and gave some herbs for quick results. As Iused these tips and the herbs that he recommended,within 3 weeks the fat started melting away from my abdomen like snow exposed to hot sun and Istarted feeling more and more energetic,enthusiastic and lighter from inside. Looking at this seemingly impossible weight loss experience,Idecided to interview him and extract every bit of knowledge he had about losing weight the Ayurveda way. As a combined result of this extensive interview and lots of my own studies of Ayurvedic books later,the e-book \"Proven weightloss secrets revealed\" was born. This e-book contains every bit of knowledge that Dr.Shah has about losing fat the Ayurveda way. If you don't know what is Ayurveda.Let me explain... Ayurveda is a 5000 year old medical science. Ayu\" means life,\"veda\" means science or knowledge. Ayurveda means science of life. According to Ayurveda every body is unique.It has divided different body types into 3 main categories and further sub-divisions. Ayurveda says that what is good for a certain persons body type may not suit your own body type.Hence the first requirement for any weight loss program to succeed is to know your own exact body type. Once this is done,the rest is easy job,Ayurveda has a store house of time tested solutions for every conceivable desease known to mankind,including Obesity. This is exactly what my e-book covers in a very simple language so that any body including you can benefit from this powerfull knowledge so far only available to a select few like Dr.Shah. Recently Igave this book to hundreds of weight loss aspirants as a test and..... What happened next even amazed me Dozens of letters like these poured in..........."
    },
    {
      "tag": "p",
      "text": "Testimonial \".... Ialready lost 3 pounds!!..\" Ihave just started following your recommendations and am using just two techniques and the fat is slowly melting away.Irecommended it to my friends who are ready to get a copy of your e-book for themselves. Neetta Testimonial \"...naturally, \r\n\t\t\t\twithout side effects ....excellent work\" \"The information that was presented was very helpful \r\n\t\t\tand wonderfully written. What better way to go about weight loss than naturally, \r\n\t\t\twithout side effects ......... excellent work, the herbs along with your \r\n\t\t\tinstructions on their use is very helpful. I’ve learned very\r\n\t\t\tmuch and thank you.\" Closna Veronica A.- veronicaclosna@phs.com Testimonial \".... this is perfect for me!\" \"Ihave read all your\r\n\t\t\tinformation and this is perfect for me! Ihave no metabolism and I'm sure my\r\n\t\t\torgans have years of toxins due to stress and the other toxins in the air and\r\n\t\t\tfood. Your weight loss suggestions are working for me. Please let me know when\r\n\t\t\tfat cutter will be released. Thank you.\" Diane Gaunt - BMWFAM0001@aol.com Testimonial \".... great value for money\" \"The e-book was easy to understand and very \r\n\t\t\tpractical. Loved the way all aspects of health were examined. \r\n\t\t\tEg. relieving stess and anxiety with the pranayama breathing exercises.\r\n\t\t\tIt is great value for money with all the information to act on and \r\n\t\t\tits a natural weight loss program, without side-effects.\" karyn b - kbilotto@bigpond.net.au"
    },
    {
      "tag": "p",
      "text": "Listen,You either lose weight or don't. Ninety-nine out of a hundred people who go on a diet still don’t\r\n\t\tlose weight . They blame it on their own self,their excess eating habits. Wrong. This page is about joining the one in a hundred who lose weight, really\r\n\t\tlose weight,forever. My best selling digital e-book \" Proven Weightloss Secrets Revealed \" based \r\n            on the secrets of Ayurveda medicinal science will show \r\n            you how to lose weight and keep it off, better\r\n\t\tthan ever. Lose WEIGHT no matter what. No matter who you are , in whatever condition you are, you must lose weight. Are you a modern woman eager for that sexy body like Britney spears ? Or, you are a man who wants to get rid off those love handles for an amazingly ripped midriff! Maybe, you have lost weight many times \r\n            before only to regain it later? And you just want to quickly lose those excess pounds to look and feel younger,healthier . But... You NEITHER have the time and inclination for hours of backbreaking exercises . NOR do you have the patience to endure an anorexic (starvation) diet\r\n\t\t\tplan . Still you want to lose 30.40.. 60 pounds ?? Don't despair, It just doesn't matter . No matter how much weight you want to lose, \" Proven Weightloss Secrets Revealed \" \r\n            will show you ,a dramatically easier and faster way for you to make amazing weight loss progress like no other book or program ever\r\n\t\thas. Just imagine yourself after losing most of your unwanted body fat. how light would it feel ? Like a huge burden lifted off you! Now imagine what wonderful changes will it bring in your personal relations ...your career ... the sudden love and respect your friends and colleagues start pouring on you . Or, enjoying the simple pleasures of a morning walk without the usual\r\n\t\tpanting and huffing, and you are just floating in the morning breeze... light...\r\n\t\treally...light as air! . Wouldn't it be amazing if you could eliminate completely,the\r\n\t\tdisease risks of \r\n            diabetes, heart disease, and colon cancer FOREVER FROM YOUR \r\n            LIFE , which always\r\n\t\tseem to follow an obese person like a shadow? Only Proven Weight loss Secrets gives you 100% Weightloss results that stays gone forever! When you use the practical 100% proven-to-perform weight loss \r\n            tips from my digital \r\n\t\tbook based on Ayurveda, Firstly, you will Lose toxins and then start burning fat , and once the fat is burnt you will keep it off forever . If you have allready tried one or more of the diet programs and failed or are currently on one,\r\n\t\tdoesn't matter, my e-book will show you exactly why\r\n\t\tyou failed and correct the problem from the root . Fortunately,with \r\n            \"Proven Weight Loss Secrets Revealed\" the things are in your control now .... It's all under your control Losing weight the \" Proven Weightloss Secrets Revealed \"\r\n\t\tway is far easier than by dieting and starving and juggling for hours\r\n\t\tin a gym . To succeed in losing weight this way, you only have to make good on three EASY\r\n\t\tSTEPS , each one directly under your control... STEP1--Eliminate nasty toxins from your body. STEP2--Eliminate fat from your body - By increasing metabolism. STEP3--Keep off the fat forever. If you master the big 3 , you must succeed in losing \r\n\t\tweight, why?....\r\n\t\tBecause there are no other variables. Yes, if you master the Big 3, you will succeed, but the \"catch\" is that\r\n\t\tyou must succeed at all three. \"Proven Weightloss Secrets Revealed\" masters the Big 3 . All the weight loss experts out there preach one thing…. Change your\r\n\t\tdiet…… Gulp some pills ( read chemicals ) and presto…….. the weight will\r\n\t\tdisappear. Too simplistic…. Sadly, it doesn't work that way . To truly succeed you need a scientific,comprehensive and cohesive approach, that\r\n\t\tworks . And it must be designed according to your own body’s \r\n\t\tunique requirements . Ihave included it all in \" Proven Weightloss Secrets Revealed \". There is simply no other alternative . Think about it this way.... Mastery of any single STEP would be useless without the other two\r\n\t\tpieces of the puzzle. For example.... Without eliminating accumulated toxins from your body, you simply can't eliminate fat just by changing your diet . At best you will lose some water making you think that you have lost weight.Which is merely an \r\n              illusion! Or If you have not increased your own body’s metabolism by improving/\r\n\t\t\tcorrecting the functioning of various organs of your body responsible for\r\n\t\t\tmetabolism, like your Thyroid gland, whatever\r\n\t\t\tweight you may lose by diet pills/diet plan comes right back on after a while. Moreover, prolonged use of these diet pills has a lot of side effects and\r\n\t\tIneed not tell you what effect yo-yo dieting has on your body and psyche. In both the cases you are finished, and back to the square one . If you want to significantly LOSE WEIGHT AND KEEP IT OFF FOREVER ... You must fit all three pieces together perfectly! You must excel at all three\r\n\t\tsteps. So \" Proven Weightloss Secrets Revealed \" Ayurveda package includes it all, mastery of all three steps."
    },
    {
      "tag": "dt",
      "text": "1.   Removing toxins from the body"
    },
    {
      "tag": "dd",
      "text": "Very little has been written about this all-important topic. Thoroughly\r\n\t\t\t\ttested and proven, this digital volume explains it all in simple and practical\r\n\t\t\t\tterms."
    },
    {
      "tag": "dt",
      "text": "2.   Eliminating fat from your body"
    },
    {
      "tag": "dd",
      "text": "Experts (who have never lost an ounce of fat themselves) have written books\r\n\t\t\t\ton low calorie dieting, on high fat dieting and on countless other weight loss\r\n\t\t\t\ttopics. But this is the one and only comprehensive book that says, from actual experience ..."
    },
    {
      "tag": "h4",
      "text": "\"HERE... HERE IS exactly how to lose fat from every part of your body\""
    },
    {
      "tag": "dt",
      "text": "3.   Keep off fat forever"
    },
    {
      "tag": "dd",
      "text": "Surprisingly, there is not much thought gone into this aspect of losing\r\n\t\t\t\tweight. If whatever weight you have lost in a short span of say 30-90 days is\r\n\t\t\t\tgoing to come back within the next 6 months or a year… what is the point of\r\n\t\t\t\tlosing it in the first place?"
    },
    {
      "tag": "p",
      "text": "This book narrows it down to what works , and how to accomplish\r\n\t\tit in the real word, now . Equally importantly , it steers you away \r\n\t\tfrom all the time and money wasting techniques that are so widely marketed. \" It’s great, only three steps to master \", you say, \" But exactly how do Isucceed at them ?\" HOW TO ABSOLUTELY NAIL THE BIG 3 , FIRST, REMOVE TOXINS FROM YOUR BODY ... Faulty diet, polluted environment and stressful living introduce a lot of toxins into your system. \r\n\t\tThese toxins are deposited in and around the fat\r\n\t\tcells of your body making them very stubborn to dislodge . So,Ayurveda says, a good weight loss program must begin with detoxification .\r\n\t\tBecause until and unless these toxins are removed from your body, there won’t\r\n\t\tbe any significant weight loss which can be sustained over a long period of\r\n\t\ttime. \"Shifting to a healthier diet plan without getting rid of the toxins in the \r\n\t\tbody is just like putting a freshly prepared cake in a bin full of garbage! The \r\n\t\tcake also becomes garbage in a short while\". So, the e-book covers How to get rid of 90% of toxins through breath? (The main cause of\r\n\t\t\texcess fat) What are the 5 secret whole body purification techniques recommended by Ayurveda for burning fat and removing toxins completely? How to get rid of pounds of impacted wastes and toxins in the colons\r\n\t\t\tforever? How to get rid of Stress-the No.1 factor for abdominal fat? How to apply the ancient Yoga practice to circulate energy throughout your body to flush out toxins and look and feel younger,be energetic like a teenager? Which\r\n\t\t\tspecific Yogasanas will give you instant relief from toxins and fat with a long term effect. Which brings us to the next step .... Once your body is free of toxins , it’s time to get rid of fat .... SECOND, BURN FAT Ok, you have eliminated toxins from your body. And lets assume that you have\r\n\t\tgreat patience and with lots of grit and determination-- you have stuck to a\r\n\t\tdefinite diet plan recommended by a leading diet company. What's the difference between success and failure ? ....Your own body's metabolism ! It's the make or break step."
    },
    {
      "tag": "h4",
      "text": "Lose Weight while you SLEEP"
    },
    {
      "tag": "p",
      "text": "Imust tell you that the most important factor for fat loss is your body's resting\r\n\t\tmetabolic rate (RMR). Your RMR is the body's most basic calorie burning rate. RMR keeps burning calories constantly irrespective of whether\r\n\t\tyou are sitting or sleeping. If you don't know it, RMR is responsible for burning 50-70% of\r\n\t\tcalories you eat. Hence, increasing RMR is the single most important factor in your weight loss (fat\r\n\t\tloss) goal. Sadly, dieting reduces metabolism(RMR)! . \"Proven Weightloss Secrets Revealed\" is jammed with \r\n\t\tscientifically proven, fully tested strategies for\r\n\t\tfiring up your metabolism and burn fat! No \"shoulds\" or \"coulds\" by diet experts who have never\r\n\t\tlost a pound themselves. \"Proven Weightloss Secrets Revealed\" works ! It doesn't matter whether you are the most sedentary, bulimic female \r\n\t\tout there or work in front of a computer for\r\n\t\t12 hours a day and surviving on a junk diet of pizzas and burgers, this book\r\n\t\twill simply boost your body’s metabolism like a wild jungle fire . It will simply convert your body fat into usable energy . \"Proven Weightloss Secrets Revealed\" covers it \r\n\t\tall ....everything and removes the guesswork and trial and error that you need to do with any other program. Here are just a few of the most important topics, researched \r\n\t\tand included to cover the best scientifically proven techniques and tricks right now .... What is the secret of the Ayurveda herbs that boost metabolism dramatically to burn\r\n\t\t\twhatever amount of fat you may have? How to re-activate your own body's fat burning organs so as to acieve weight loss naturally? How to use drinking water effectively to flush out toxins and easily burn fat? How to Increase your metabolism by 20% just by eating these foods? Know the 11 postures that automatically burn fat. You will become an expert in the art of burning fat and losing pounds of fat\r\n\t\tfrom anywhere on your body. The bottom line? When you finish reading the e-book, you will know exactly how to lose weight ! Naturally, when you have eliminated all the toxins, and\r\n\t\tstarted burning fat by increasing metabolism, all that is left is\r\n\t\tkeeping the burnt fat off. Easy, right? Nope! ..... \r\n\t\tBut definitely \" doable.... \" Third, keep off the fat forever... Once, you have got rid of the toxins responsible for stubborn fat cells,\r\n\t\tkick started your metabolism, it is time to continuously keep burning fat\r\n\t\tautomatically and not let any new fat deposition to take place in your body . There are hundreds of books on weight loss-Ihave read most of them. Ialso\r\n\t\tsubscribe to every newsletter, magazine on the subject. All these techniques for losing weight seem very interesting to read...but\r\n\t\tthey don’t work. If you have tried these methods you will agree that most of\r\n\t\twhat is written in there is extremely time in efficient. To be blunt.... Most of these strategies are ....huge time wasters. The basic approach of these experts itself is wrong. Ihave tried all these\r\n\t\tmethods, and through pains taking trial and error Ihave tested the principles\r\n\t\tof Ayurveda on my own self and perfected my own techniques, which work . Using these techniques Ihave eliminated toxins, burnt fat and kept fat off from my own body for over four years! The result? My body fat is consistently under 6% ……. for the last four \r\n            years in a row.Moreover Inever visited a physician during this entire period.Call it perfect health! Ihave used my strategies to lose whatever amount of weight (fat) Iwanted.\r\n\t\tThe result is there for everybody to see....it got to a point where Ibecame so\r\n\t\tskinny (by continuously trying these strategies) any more reduction, and Iwould simply vanish in thin air (just joking). Moral of the story? Simple....just followed my own advise from the book to lose\r\n\t\tweight. \"Proven Weightloss Secrets Revealed\" based \r\n            on Ayurveda is not theory... it really works . Secret of Secrets....... This book reveals it all. You will discover how to keep burning fat to keep\r\n\t\tit off forever in the most time efficient , money efficient ways\r\n\t\tpossible... with the least efforts . It reveals to you the one big secret of keeping fat off forever. And the\r\n\t\tsecret is...optimize the functioning of your own body’s organs responsible\r\n\t\tfor burning fat. Idevote special attention to the single most important fat burning\r\n\t\tmethod of all.... How to optimize the functioning of all the organs responsible for burning\r\n\t\tfat and keeping it off irrespective of whether you are putting conscious\r\n\t\tefforts or not?.... These organs are…. Thyroid gland Stomach Liver Kidney Pancreas Colons Spleen Lymphatic system Thymus gland Adrenals To lose fat and keep it off forever you MUST optimize the\r\n\t\tfunctioning of all these organs. Any imbalance in the functioning of any of these organs will mean added\r\n\t\tfat . Yes, no matter how seriously you may be dieting, how motivated you are\r\n\t\ttowards your goal of weight loss you cannot escape the rude fact that even if\r\n\t\tsomething is slightly wrong with these organs all your efforts will go down\r\n\t\tthe drain ! This book shows you step-by-step, exactly how to optimize the functioning of\r\n\t\tyour own body’s fat burning ability .... Simply, Naturally, Deadly effectively, Clinically, .... and in such a way that you need not lift a finger to lose weight and\r\n\t\tkeep it off.... your own body does it for you automatically day after day after\r\n\t\tmonth after MONTH...! \" This alone is worth many times the price of your package \" Fine Tune Your own Body to Burn Fat On Auto-Pilot... Day In And Day Out! Here is a quick look at the real juicy Fat burning secrets based on the secrets of \r\n            Ayurveda that you are going to learn How to get your liver to function at 100% efficiency,so that it keeps emulsifying stored fat day in and day out? How to \r\n              work up your thyroid so that it spews enough hormones to crank up your metabolism and burn fat for you,automatically while you sleep? Why do 98% of all the dieters who go on a diet fail to lose weight\r\n\t\t\t\tand regain more than whatever was there before\r\n\t\t\t\tdieting and how to avoid it completely? How to easily build lean muscle mass and and jumps start your RMR? What are the two main causes of abdominal \r\n              fat accumulation? and How to get rid of abdominal fat with \r\n              this one simple technique? How to improve your digestion efficiency by almost 300%\r\n\t\t\t\tso that you can keep on eating your favourite food (fat\r\n\t\t\t\tincluded) and still lose weight. Which wonder grass reduces fat by supplying the body\r\n\t\t\t\twith all the essential enzymes and minerals? What are the Six ingredients in the American diet, which are the root\r\n\t\t\t\tcause of all fat accumulation-how to avoid them to lose weight? Which ONE simple technique increases your metabolism by 20% in the \r\n\t\t\t\tmorning and all day long ?- more metabolism means more fat burn . There is so much theoretical information out there. Most of it sounds\r\n\t\tgood. But your time spent will not justify the negligible weight loss or the\r\n\t\tlack of long term results. My e-book completes the full package . From eliminating toxins ,\r\n\t\tto increasing\r\n\t\tmetabolism to burn fat , to keeping fat off by optimizing the organs you are in total control of your health and destiny . What Exactly Will You Get ? So what does \"Proven Weightloss Secrets \r\n\t\tRevealed\" cover exactly? In summary, here's what you get:"
    },
    {
      "tag": "p",
      "text": "You will get 200+ pages full of cutting edge tips tricks and\r\n\t\t\ttechniques to lose whatever amount of fat you wish to lose. \r\n\t\t\tThis includes all the secrets Ihave used personally to keep my body fat under 12% for the last three years\r\n\t\t\tin a row and are mentioned above. Table of contents. You will also get a body type chart to\r\n\t\t\tdetermine your unique body type and also a food recommendation\r\n\t\t\tchart for your unique type of body. What is included in the bonuses?- You get 6 free bonuses worth $395..... Secrets Of Diet Programs Revealed - A $50 value, this e-book reveals all the pros and cons of diet programs \r\navailable in the market today. 50 Best Of The Best Indian Recipes - A $50 value. These mouth watering Indian dishes will ensure that your \r\nweight loss journey is not boring and dull. My Million Dollar Online Consultancy - \r\nA $200 Value. This free 6 months online consultancy for any health \r\nproblem you or your family may have is a huge advantage for you. You just have \r\nto send across all the details of the health condition you are experiencing with \r\nrelevant reports by e-mail. Our expert ayurvedic doctors will analyze your \r\ncondition and give you free advise - for a period of 6 months . Diet Supplements Revealed - A $50 value, Evaluation of the diet supplements available in the market. Health Resources - A $25 value. \r\nFinest resources online for health, fitness and weight loss-Personally \r\nresearched and used by me. Calorie Counter -A $20 Value.Gives detailed \r\nanalysis of 1000 food items under the heads Food Calorie, Fats, Carbohydrates, \r\nProteins, Saturated Fats, Cholesterol."
    },
    {
      "tag": "p",
      "text": "\" How Can You Deliver So Much For so Little? \" Many people ask this question after buying my e-book. They have it in their\r\n\t\tmind even before they buy it, but once they see the contents, they can’t resist\r\n\t\tmailing me with this question. The answer is simple. My dear friend, Iknow that If you are like most people wanting to lose\r\n\t\tweight , you are struggling just to lose a pound or two . Whether you\r\n\t\thave tried diet programs, diet pills or purchased advise in the form of e-books\r\n\t\tfrom the self-proclaimed experts, you have been disappointed. The worst part is, with so much how to information in the market, you can\r\n\t\tbecome paralyzed.... and very frustrated. After a while you realize that you\r\n\t\tare racing against time . While you jump from one diet program to the other, with each passing day,\r\n\t\tyou are gaining weight and loosing the battle against obesity and\r\n\t\tthe healthy body which is rightfully yours--- once you lose control its very\r\n\t\tdifficult to come back to track . Ihonestly hate to think of you wasting a year of your life , and\r\n\t\tthousands of dollars, trying various weight loss products, only to discover\r\n\t\tthat your plan was flawed from the beginning. Ihave analyzed the prices and the contents of several diet programs\r\n\t\tavailable in the market today. Looking at what these packages offer, \"Proven Weightloss Secrets Revealed\" package\r\n\t\tcan be easily sold at $300. But that would put my product beyond the reach of most of the people who are\r\n\t\treally wanting to lose weight. Idon't want that to happen. My singular goal is to help as many\r\n\t\tpeople as possible with this unique knowledge of \r\n            Ayurveda that Ihave. With the secrets of Ayurveda contained in the e-book anybody who is serious can\r\n\t\teasily get rid of all the disease risks and problems associated with\r\n\t\texcess weight, and that’s what motivates me. Ideeply want you to succeed now . So just grab it now , when it’s within your reach...before it's too late . Take Full Advantage of the Money-Back Satisfaction Guarantee... You simply won't find a more hands-on,\r\n\t\teffective, total approach to weight loss at any price. And the price is just under $40."
    },
    {
      "tag": "p",
      "text": "My Personal Guarantee"
    },
    {
      "tag": "p",
      "text": "If you use my tips and techniques, Ipersonally guarantee that you will lose whatever amount of fat you like within a short period of time otherwise all these bonuses worth $395 are yours to keep and Iwill refund you the cost of the product without any\r\n\t\t\t\tquestions being asked. And the $395 worth of bonuses are yours to keep\r\n\t\t\t\tno matter what. - Rajesh Shetty"
    },
    {
      "tag": "p",
      "text": "The money back guarantee is my personal promise Just ask, and I'll refund... you immediately. So... Don't procrastinate... Don't \"bookmark us to come back later\"... Click here to download \"Proven Weightloss Secrets Revealed\" Right away. OR, if you're still not sure... Avoid the paralysis of procrastination by taking full advantage of the Guarantee! Here's how... Click here to order now.... (experts have called it \"an awesome onscreen read\".) Within minutes, you'll be downloading. Review it... If it's not everything that you hoped it to be, just ask for your money back. Yes, really. Yes, you can ask for your money back anytime. But if you do it right away, the credit will cancel out the charge, so it won't even touch your cash flow! After all, isn't that what a guarantee is for? Click here to make the single best and most important decision you will make\r\n\t\tthis year. - Rajesh Shetty P.S.:There are only 5 reasons not to get \"Proven Weight Loss Secrets Revealed\" e-book Today: 1. No money. If you are broke,it should be obvious that you are doing something wrong.Idon't mean that as judgmental.I've been broke too.But Ihad to face the reality that *I* was creating my state of wealth or lack of it. To make it clear,let's do some simple calculations.If you are on any diet program or supplements currently,how much are you spending yealry? $500..$1000? For what? Just to lose a pound or two that anyway you are going to get back sooner or later. On the other hand how much are you saving on your yearly medical bills,dietplan,supplement all put together if you are investing just $39.95 in my e-book and follow the Ayurveda principles for healthy living,How much?You do the math...is it $3,000? 2. No time. Iam with you here.But you know,Itake out time to read,watch cds,vcds,read manuals and books and keep investing in myself.Iattribute my perfect health to my ongoing self education.You can read this e-book in a lazy afternoon or night and apply the principles for your own self to stay slim and trim whole life. 3. No need. If you think your current body weight is ok.This e-book will open your eyes to a new way of healthy living that you only dream off.Afterall a perfectly healthy mind and body is definitely a lifetime asset for you. 4. No interest. If you've read this letter to this point,then you're clearly interested in knowing how to lose weight and improve your health.Some people say they aren't interested as a way to cover-up a deeper excuse,often to hide the fact that they don't have money.Well,see #1 above.If you are really not interested,why are you reading this? 5. No way This excuse covers everything from \"Iresist sales pitches\" to \"Ialready have stuff on Ayurveda\" to \"Ialready know all that\".Yeah,right.They are all excuses.They are coming from people not wanting to have a perfect health,and blaming that on circumstances and others when they get sick. You don't have \"Proven Weight Loss Secrets Revealed\" as it's never been released before.You don't know all that is in the e-book and the bonuses,because even Idon't know all that is in it and how the principles really work. Remember,these are secret \r\n                  principles of Ayurveda,a medical science which is 5000 years \r\n                  old.They work allright but how they really work is still a \r\n                  mystery.Only a select few practitioners like Dr.Rasik Shah \r\n                  have an inkling of the mechanics of Ayurveda.Modern science is \r\n                  busy researching all that is given in these ancient books to \r\n                  know how they work!. Do you really know it all? What's left? Unless you have a perfect \r\n                  body and health and you never visited your family doctor for \r\n                  the last 3 years, you simply need to take action right now and grab the package--today . There is absolutely no \r\n                  risk for you to try out these Proven weight loss secrets based \r\n                  on Ayurveda and see the results for yourself.If you are not \r\n                  completely satisfied,take me up on my \"no questions \r\n                  asked\" 90 day money-back guarantee. And if after putting to use the information in this course and it does not at least make you lose 30 pounds in 90 days,Iwill not only refund your money...Iwill also give you $500 cash from my own pocket. So get your own copy of \"Proven Weight Loss Secrets Revealed\" today, before the prices go up again- We started at $19.95 then $29.95 and now $39.95. Remember, where there is a will,there's a way. Simply click on the button below to go to the 128 BIT secure server page to complete the purchase.Your credit card information is absolutely secure.Nobody (that even includes Me) can access your card information except the bank which which is processing the card. IT'S 100% SAFE FOR YOU. Transtech Exports Corporation 5, Software Technology Park Link Road, Sadar, Nagpur - 440001, India Phone : (91-712-) 2527507, 2527477 Time : 10.30 am To 05.00 pm IST (GMT +05.30) Fax : 13094033364 E-mail : info@eweightlosstips.com Copyright \r\n            © 2003 Transtech Exports Corporation. All Rights Reserved AFFILIATES CLICK HERE"
    },
    {
      "tag": "div",
      "text": "[ Close ]"
    }
  ]
}