{
  "url": "http://www.fairfield-city.org/PubWorks/pwdump.cfm",
  "file_number": "415",
  "content_hash": "0c213b0bf5610ce00b36a982f8e21d9063fb2bc213b84e04208623a5de6cac40",
  "total_blocks": 395,
  "retained_blocks": 3,
  "ignored_blocks": 392,
  "blocks": [
    {
      "tag": "div",
      "text": "Site Tree: Home > Fairfield Government > Public Works > Operation Dump Truck CITY SIGHT HOW TO REACH US Public Works Department public_works@fairfield-city.org Telephone: 513-867-4200 Fax: 513-867-4205 8870 N. Gilmore Road Fairfield, Ohio 45014 WHAT'S NEW Golf gift certificates available Fairfield Lacrosse Club accepting registration Shuttle offers shopping transportation Work to restrict lanes at Gilmore and Mack City to revise floodway COMMUNITY CALENDAR December 2006 Next Su Mo Tu We Th Fr Sa 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Click bold dates to view event. QUICK LINKS Quick Resources ... Department Directory Codified Ordinances Forms Center Home TO HELP YOU GET THERE Navigate to ... Home About Fairfield Fairfield Government Living in Fairfield Learning in Fairfield Working in Fairfield Visiting Fairfield Online Services How Do I? Search the Site Contact Us How Do I? Site Map Contact Us Sometimes citizens may need assistance disposing of a large quantity of limbs and other brush that cannot be accommodated through the Call-In Limb Pickup Program . For those occasions, the City of Fairfield also offers its Operation Dump Truck program in an effort to meet those needs."
    },
    {
      "tag": "p",
      "text": "Under this program, the city will deliver to a city residence a roll-off dump box (or in some cases an actual dump truck) into which the resident may load limbs and other brush for disposal by the city. This service is offered on a first-come, first-served basis. In order to offer this service, the city asks residents to observe the following guidelines: Schedule a date. Sign up for the service is available at the city's Public Works Department facility located at 8870 North Gilmore Road on a first come first served basis. Normal office hours are 8 a.m. to 5 p.m. Monday through Friday. Residents will be required to sign a release form when the debris box is reserved. Available dates are generally scheduled far in advance — so be sure to plan ahead. For information, call 513-867-4200. Dump boxes will not be delivered, picked up or dumped on Saturdays, Sundays or scheduled holidays. The use of a dump box is limited to two consecutive days, and up to two occasions per year, per household. The city will only dump debris boxes once per day. Be prepared. Adump box will be delivered on the scheduled date between the hours of 7:00 and 8:00 A.M., and pick up will be on the scheduled date between the hours of 1:00 and 2:30 P.M.   The dump box will be placed on your driveway for you to load.  It is best to cut limbs to no more than four feet in length so that they will fit in the box. Overhanging loads are not permitted. The dimensions of the box are: 8-feet wide, 10-feet long and 42-inches deep. Include only biodegradable plant materials. No building materials, plastic bags or trash will be accepted. Grass clippings are also prohibited. The resident will be charged if a load is contaminated with trash or other unacceptable materials. Charges will include, but are not limited to, any disposal fees for load separation, and/or labor time and equipment required by city personnel. Violation of these guidelines will result in the termination of the service and the resident will be responsible for removal and disposal of debris. Aresident who combines items other than yard waste, will not be permitted to participate in the program in the future. Service Limits Both the Limb Pickup Program and Operation Dump Truck are intended to provide residents an option for normal trimmings and storm damage disposal. Residents contracting with professional tree trimming and removal services should include disposal in their contract since the city is unable to accommodate major disposal needs."
    },
    {
      "tag": "div",
      "text": "[ City of Fairfield Home | Disclaimer | Privacy Policy | Site Map | Contact Us Universal Access Design Standards | Instructions for Users with Disabilities ] Copyright © 2001-2006, All Rights Reserved. City of Fairfield Information Technology Division webmaster@fairfield-city.org"
    }
  ]
}