{
  "url": "http://www.familyrecords.gov.uk/focuson/womeninuniform/wrns_profile.htm",
  "file_number": "416",
  "content_hash": "37717ee2e122f45e6e2dcab4d444ac33ae03d9d81fe39ad63dc1082e580fc680",
  "total_blocks": 116,
  "retained_blocks": 17,
  "ignored_blocks": 99,
  "blocks": [
    {
      "tag": "div",
      "text": "Focus On... Women in Uniform"
    },
    {
      "tag": "div",
      "text": "Focus On... home page FamilyRecords home page"
    },
    {
      "tag": "div",
      "text": "Women's Royal Naval Service - Profile"
    },
    {
      "tag": "div",
      "text": "Introduction Nurses in the Crimea Nurses in the\r\n                British Army Almeric\r\n                Paget Military Massage Corps Scottish Women's Hospitals Women's Royal Naval Service"
    },
    {
      "tag": "p",
      "text": "1. Introduction 2. Profile 3. Sources 4.\r\n                      Further Reading"
    },
    {
      "tag": "div",
      "text": "Women in WWII Links Credits"
    },
    {
      "tag": "p",
      "text": "Evelyn Mary Mackintosh Evelyn Mary Mackintosh began her service with the Women's Royal\r\n                Naval Service in February 1918 and ended when she died in\r\n                December of the same\r\n                year. Evelyn was born 22nd October 1895 to Duncan H. and Louisa M.\r\n                Mackintosh in Tientsin, North China where her father worked for\r\n                the Hong Kong\r\n                and Shanghai Bank. She was described as “a very healthy\r\n                jolly looking girl of the Officer type” who was \"very\r\n                keen to go to the East\" by Edith A May, Divisional Director\r\n              for Scotland, W.R.N.S."
    },
    {
      "tag": "div",
      "text": "Detail from Evelyn Mackintosh's WRNS medical\r\n      certificate. See more - Opens in a new window (52k)"
    },
    {
      "tag": "p",
      "text": "At the time she was appointed\r\n                to the WRNS she was living in  Inverness and her first\r\n                 appointment was as \"Assistant Principal for non-administrative\r\n                duties\" at\r\n                  the Naval\r\n                  Transport\r\n                  Office at\r\n              Inverness. Her salary was £150 a year and in addition she\r\n              received a £20 uniform grant and a hat badge, which she collected\r\n              from Madam Elsmere, 146 Brompton Road, London."
    },
    {
      "tag": "div",
      "text": "Detail from Evelyn Mackintosh's performance report dated June 30th 1918. See more Opens in a new window (74k)"
    },
    {
      "tag": "p",
      "text": "In November 1918 she volunteered\r\n                  for service at Bizerta, a strategically important seaport in\r\n                 Tunisia, as a decoder and was highly recommended  by\r\n                her commanding\r\n                officer, Captain H.J. Rowley. She was turned down\r\n                as\r\n                she \"had no decoding\r\n                training\". This inspite of a report written by Edith A May\r\n                describing the nature of her work in Captain Rowley's office\r\n                as being \"decoding\r\n                and\r\n                confidential\r\n              transport work\"."
    },
    {
      "tag": "div",
      "text": "Detail from letter of reference for Evelyn Mackintosh from Captain H.J Rowley. See more Opens in a new window (74k)"
    },
    {
      "tag": "p",
      "text": "She\r\n                          went to London to visit her mother on leave on  November\r\n                  30th 1918 and she came down with influenza.\r\n                        This\r\n                        developed\r\n                        into pneumonia\r\n                        and\r\n                        on 18th December she died, aged 23, at   82\r\n                      Campden Hill Court, Kensington, her mother’s London\r\n                      home."
    },
    {
      "tag": "div",
      "text": "Detail from Death Cerificate of Evelyn Mackintosh. See more Opens in a new window (74k)"
    },
    {
      "tag": "p",
      "text": "The cause of death is listed on her death certificate\r\n                as \"Influenza 10 days. Double pneumonia 5 days with cardiac\r\n                failure\". She is buried at Daviot Parish Churchyard, Invernesshire,\r\n                Scotland in the family\r\n                  burial\r\n                plot. Evelyn Mackintosh's service records, held at The National Archives\r\n                (catalogue reference: ADM\r\n                318/169 ),\r\n                are a fairly typical example of what you might find in the service\r\n                records of any member of the Women's\r\n                Royal Naval Service during World War I. They include:"
    },
    {
      "tag": "div",
      "text": "Form of application & enrolment for admission\r\n                  as an officer Certificate of moral character Certificate of medical examination Certificate of enrolment Appointment as officer in Women’s\r\n                  Royal Naval Service Letters of reference Medical certificate Report of her death to Director WRNS Aletter from Mackintosh’s\r\n                  mother to Director WRNS Letters concerning her application for\r\n                  employment as a decoder at Bizerta Letter appointing her Assistant\r\n                    Principal for non-administrative duties at the Naval Transport\r\n                  Office at Inverness."
    },
    {
      "tag": "p",
      "text": "Details of Evelyn Mackintosh's commemoration from the Commonwealth War Graves Commission Name: Evelyn Mary Mackintosh Rank: Assistant Principal Service: Regiment: WRNS Date of Death: 18-12-1918 (age 23) Nationality: Scottish Additional Information: Daughter of Duncan H. and Louisa\r\n                        M. Mackintosh, of Drumalin, Invernesshire Cemetery: Daviot Parish Churchyard, Invernesshire Grave or reference panel no: South of Church This information can be viewed at http://www.cwgc.org/cwgcinternet/casualty_details.aspx?casualty=327555"
    }
  ]
}