{
  "url": "http://www.fire.ca.gov/FireEmergencyResponse/FirePlan/appendixb.html",
  "file_number": "423",
  "content_hash": "776f2ba6d2795504fa5661bf0c538c45b95ad76134854afe6a88f3c987a117fd",
  "total_blocks": 145,
  "retained_blocks": 11,
  "ignored_blocks": 134,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\"\r\n\"http://www.w3.org/TR/1999/REC-html401-19991224/loose.dtd\""
    },
    {
      "tag": "div",
      "text": "California Home"
    },
    {
      "tag": "div",
      "text": "MAIN LINKS CDF Home About CDF Fire and Emergency Resource Management State Fire Marshal State Fire Training Board of Forestry FRAP Careers With CDF Fire Safety Education En Español News Releases Related Links FAQs Calendar of Events CDF Newsletter CDF Fact Sheets CDF History CDF Photos and Videos"
    },
    {
      "tag": "div",
      "text": "Search Site Map CDF Contacts Doing Business With CDF (DVBE/Small Business) CDF Public Records Act Request Guidelines"
    },
    {
      "tag": "h3",
      "text": "Error 404"
    },
    {
      "tag": "p",
      "text": "Our pages have moved here . Please take a moment to update your bookmarks or links to this site, and then use the links on this page to navigate the site."
    },
    {
      "tag": "div",
      "text": "Quick Search"
    },
    {
      "tag": "div",
      "text": "Advanced Search"
    },
    {
      "tag": "div",
      "text": "Category Links Fire Information State Fire Training Air Program Mobile Equipment Law Enforcement Cooperative Efforts Conservation Camps Statistics and Events Forest Practice Forestry Assistance Pest Management State Forests State Nurseries Vegetation Management Urban Forestry Archaeology CDF Academy CDF Firefighter Memorial CDF Medal of Valor Honorees About CDF More Info... Executive Staff Bios CDF Organizational Chart What is CDF? (140K PDF) CDF At A Glance (81K PDF) CDF Fact Sheets This site uses Adobe Acrobat. This site uses  \r\n     Flash  8"
    },
    {
      "tag": "div",
      "text": "Back to Top of Page"
    },
    {
      "tag": "div",
      "text": "© 2006 State of California. Conditions of Use , Privacy Policy Contact the webmaster"
    }
  ]
}