{
  "url": "http://www.freerepublic.com/focus/f-news/1305291/posts",
  "file_number": "439",
  "content_hash": "63128827af552513efe11c6866d01ef0c65e8eaa9011f631b7ce77f75aea6ce0",
  "total_blocks": 360,
  "retained_blocks": 93,
  "ignored_blocks": 267,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""
    },
    {
      "tag": "div",
      "text": "Free Republic Home · Browse · Search News/Activism Topics · Post Article"
    },
    {
      "tag": "p",
      "text": "Skip to comments. The Blogospheres Smaller Stars [Buckhead and TankerKC mentioned] NRO ^ | December 20, 2004 | By La Shawn Barber Posted on 12/20/2004 12:19:30 PM PST by Jim Robinson Earlier this year, CBS aired a now-infamous 60 Minutes episode in which Rather presented typed memoranda supposedly written over 30 years ago by President George W. Bush’s Texas Air National Guard commander, the late Lieutenant Colonel Jerry B. Killian. The documents purported to show that Bush received preferential treatment while serving in the military. Hours after the broadcast, well-known bloggers like Little Green Footballs , Power Line , and the widely known Instapundit — as well as NRO's Kerry Spot & The Corner — were casting doubt on the documents’ authenticity. As the controversy grew, they posted frequent updates and became virtual clearinghouses of information. The rest is well-documented history, so to speak. The thing about history, though, is that the efforts of minor players often go unnoticed. During the scandal, high-trafficked bloggers were interviewed on radio and television and mentioned in countless news articles. Two appeared on the cover of Time magazine. But smaller, lesser-known, and lower-trafficked blogs that didn’t get press coverage served a valuable function during Rathergate. By linking to well-known blogs, articles, documents, and one another, they made worthy contributions. Afew even conducted their own independent, journalistic-style investigations (often scooping the professionals). “It all happened organically, without any controlling influence at all, and it happened fast,” says Jeff Harrell about the growth of the blogosphere-fueled controversy. Afreelance writer from Texas, Harrell’s blog, The Shape of Days , was frequently linked to by Instapundit as the story picked up steam. Once the story caught on, it spread rapidly across the web, though some bloggers were skeptical at first. “It just seemed the type of thing that could make the blogosphere look bad if people jumped the gun and start[ed] crying ‘forgery’ without actual evidence,” admits a blogger who goes by the name “Cassandra” and runs I Love Jet Noise . Rusty Shackleford, a political-science professor who hosts MyPetJawa , says he followed the story very closely but urged bloggers to proceed carefully. “My original post was quoted all over the blogosphere as a word of caution to those boring full speed ahead on indicting the Killian memo.” He eventually joined the blogosphere’s quest for the truth as he searched the National Archives to find out whether the U.S. Air Force had purchased a typewriter during the stated time frame capable of producing the memos. Other bloggers saw the frenzy as political noise. “Idespise partisan bickering,” insists Harrell. “Ithought this story was just another example…Idismissed it pretty early on.” Once the CBS memos seemed likely to be forgeries, some bloggers began investigating different aspects of the story. “Patterico,” a prosecutor in California, fact-checked ABC News and posted the results on his site, Patterico’s Pontifications . He said ABC News falsely concluded that posters on FreeRepublic.com — the conservative news forum where the hoax idea germinated — were the forgers of the documents. Patterico contends that ABC News’s conclusion was based on a misreading of the time-zone stamp on the posts, which they had assumed to be Eastern time. “ABCNEWS failed to note that the time stamp was Pacific time. Based on this simple mistake…[the network] falsely concluded that internet (sic) posters had posted their doubts about the documents before the program had ended,” he wrote. ABC News has since corrected the error on its website. Additionally, Patterico interviewed “Buckhead” and “TankerC,” the subjects of ABC’s report and the first to express doubt about the memos. “Iknew that these individuals would likely be the focus of some interest from the media, and that loonies would try to connect them to Karl Rove. Ithought it would be interesting for them to get their real stories before the public.” Now that’s journalism. Like Patterico, Harrell used the power of the web to gather information and answer questions. “[W]hile the typographic evidence of forgery was pretty good, there was one hole Iwanted to fill.” It seemed that the IBM Selectric Composer, an expensive typewriter from the 1970s, might have been able to produce the memos. While that possibility had been dismissed, Harrell continued to investigate. The expert he tracked down, a Composer owner, confirmed it could not have produced the documents. “Iwanted to rule it out conclusively,” Harrell said. While other bloggers parsed news reports and interviewed experts, Bill Dyer used his own expertise to add insight. Apracticing lawyer in Texas who runs the BeldarBlog , Dyer verified and posted the professional credentials of lawyer bloggers pursuing Rathergate — such as Glenn Reynolds (Instapundit) and Hugh Hewitt — after Jonathan Klein, former executive vice president of CBS News, referred to bloggers as “a guy sitting in his living room in his pajamas writing.” The effect bloggers have had on traditional journalism as they become fact-checkers, disseminators of information, and “citizen journalists” is still in flux. But the paradigm has clearly shifted in determining what is news and who is qualified to cover it, and smaller bloggers are playing an important role. Tom Maguire, host of the blog Just One Minute , also frequently linked to by Instapundit, says that smaller bloggers can do research to uncover overlooked angles and connections. Patterico believes smaller bloggers can be noticed. Although larger ones get the media coverage, smaller bloggers can still break stories. “[I]f your message is unique, there is still a good chance it will get attention.” Others see the importance of blogs and public interaction, particularly during Rathergate. “[B]y making the news cycle interactive, bloggers had essentially resurrected the front-porch aspect of civil life where folks used to gather to discuss the issues of the day,” Cassandra says. Blogging is “revitalizing democracy.” At least one journalist seems to agree. Chris Satullo, editorial-page editor at the Philadelphia Inquirer , recognizes the role of bloggers but stressed that journalists are still necessary. “The idea is not that journalists know what the best result is; it’s that democracy works best when issues get aired, real dialogue happens and ordinary people aren’t shut out of the deal by elites. [A]ny card-carrying civic journalist is going to celebrate the blogosphere.” Including its smaller stars. TOPICS: Free Republic ; News/Current Events KEYWORDS: 60MINUTES ; BLOGGERS ; BLOGS ; BUCKHEAD ; CBS ; DANRATHER ; FORGERY ; LITTLEGREENFOOTBALLS ; RATHERGATE ; TANKERKC ; WEBLOGS Navigation: use the links below to view more comments. first 1-50 , 51 next last"
    },
    {
      "tag": "div",
      "text": "1 posted on 12/20/2004 12:19:31 PM PST by Jim Robinson [ Post Reply | Private Reply | View Replies ] To: eyespysomething"
    },
    {
      "tag": "p",
      "text": "Thought you'd like this one"
    },
    {
      "tag": "div",
      "text": "2 posted on 12/20/2004 12:23:10 PM PST by SittinYonder (Tancredo and Iwanna know what you believe) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson At least one journalist seems to agree. Chris Satullo, editorial-page editor at the Philadelphia Inquirer, recognizes the role of bloggers but stressed that journalists are still necessary."
    },
    {
      "tag": "p",
      "text": "< Bloggers are journalists unlike, say, Inquirer editors."
    },
    {
      "tag": "div",
      "text": "3 posted on 12/20/2004 12:23:44 PM PST by Tribune7 [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson He said ABC News falsely concluded that posters on FreeRepublic.com — the conservative news forum where the hoax idea germinated — were the forgers of the documents."
    },
    {
      "tag": "p",
      "text": "LOL, ABC is as stupid as CBS!"
    },
    {
      "tag": "div",
      "text": "4 posted on 12/20/2004 12:24:31 PM PST by xJones [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Thanks for the post Jim. Thanks for what you have created Jim."
    },
    {
      "tag": "div",
      "text": "5 posted on 12/20/2004 12:29:00 PM PST by PGalt [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson journalistic-style investigations"
    },
    {
      "tag": "p",
      "text": "S/Bas journalist-SHOULD BE-style investigations !!!!!!!!!!"
    },
    {
      "tag": "div",
      "text": "6 posted on 12/20/2004 12:33:33 PM PST by Red Badger (If the Red States are JESUSLAND, then the Blue States are SATANLAND......) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Jim, The media continues to miss part of the story. Please look at the posting below, which shows that TankerKC posted suspicions RIGHT DURING THE BROADCAST!! Note the time was 8:19pm EDT, not Pacific Time. TankerKC saw the memo and knew right away it look like BS. Buckhead then did the research and made the case. The fraud was so obvious that Freepers were on it while the broadcast was still running. CBS HAD to know within 48 Hours at the most that the memo was bogus, yet they continued to defend it. THAT is the real story! THE MOTHER OF ALL POSTINGS: To: Howlin WE NEED TO SEE THOSE MEMOS AGAIN! They are not in the style that we used when Icame in to the USAF. They looked like the style and format we started using about 12 years ago (1992). Our signature blocks were left justified, now they are rigth of center...like the ones they just showed. Can we get a copy of those memos? 107 posted on 09/08/2004 8:19:00 PM EDT by TankerKC (R.I.P. Spc Trevor A. Win'E American Hero) [ Post Reply | Private Reply | To 1 | View Replies | Report Abuse ]"
    },
    {
      "tag": "div",
      "text": "7 posted on 12/20/2004 12:34:02 PM PST by You Dirty Rats [ Post Reply | Private Reply | To 1 | View Replies ] To: PGalt"
    },
    {
      "tag": "p",
      "text": "Jim Robinson is the Patrick Henry of our time......."
    },
    {
      "tag": "div",
      "text": "8 posted on 12/20/2004 12:39:41 PM PST by Red Badger (If the Red States are JESUSLAND, then the Blue States are SATANLAND......) [ Post Reply | Private Reply | To 5 | View Replies ] To: sauropod"
    },
    {
      "tag": "p",
      "text": "read later"
    },
    {
      "tag": "div",
      "text": "9 posted on 12/20/2004 12:40:31 PM PST by sauropod (Hitlary: \"We're going to take things away from you on behalf of the common good.\") [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Hats off to Jim Robinson, the Ur-Blogger. You got this going years ago and now the conservatives are rapidly communicating with each other and with the world. Thanks, Jim."
    },
    {
      "tag": "div",
      "text": "10 posted on 12/20/2004 1:08:55 PM PST by sine_nomine (Protect the weakest of the weak - the unborn babies.) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson Wow! Someone finally got it right and called FR a forum instead of a blog. Cool. 11 posted on 12/20/2004 2:24:01 PM PST by codyjacksmom (Proud, new 1st time grandma as of 11/07/04....now it's payback time!) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "\"The truth shall make you free.\" Thanks for all you've made possible, Jim! Merry Christmas."
    },
    {
      "tag": "div",
      "text": "12 posted on 12/20/2004 2:55:56 PM PST by headsonpikes (Spirit of '76 bttt!) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Ithink it's about time that they do a report on all these blogs being put out from pro-democracy Iraqis. I've seen a number of good ones like democracyiniraq.blogspot.com, iraqthemodel.com, among others. These are valuable, they contradict all the negativity we get out of the news 24/7"
    },
    {
      "tag": "div",
      "text": "13 posted on 12/20/2004 4:08:18 PM PST by gemadness [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson Actually, the language quoted in the article is from a post of mine , and it's a little sloppy. Iwas refuting the theory that Buckhead expressed his detailed conclusions about the documents during the program. His opinions came a couple of hours after the program, as my post details. (My post also has the first public comments by Buckhead other than on FreeRepublic.com.) But Iwas fully aware that TankerKC (not \"TankerC\" as the article mistakenly calls him) had expressed generalized doubts about the documents during the program. Imade that point clear in another post , in which Iinterviewed TankerKC. That post has a more detailed description of the evolution of the controversy here on FreeRepublic.com. In any event, thanks for posting the article, and once again, my hat is off to the Freepers who first raised doubts about the documents. It was a landmark event in the history of interactions between the internet and Big Media -- and it no doubt brought down Dan Rather's career early. 14 posted on 12/20/2004 11:56:51 PM PST by Patterico [ Post Reply | Private Reply | To 1 | View Replies ] To: gemadness Ithink it's about time that they do a report on all these blogs being put out from pro-democracy Iraqis. Iagree. Ihad the privilege of meeting Omar and Mohammed from Iraq the Model (Idescribed the meeting here ) and it was an experience I'll remember all my life. Someone from the L.A. Times interviewed them that same night -- but the interview never ran. Too positive a story, Iguess. 15 posted on 12/21/2004 12:00:27 AM PST by Patterico [ Post Reply | Private Reply | To 13 | View Replies ] To: Jim Robinson The \"secondary blogs\" just picked up the scoops they found here on the FReep, and passed them along as their own."
    },
    {
      "tag": "p",
      "text": "But that's okay. We don't mind. Goes with the territory."
    },
    {
      "tag": "div",
      "text": "16 posted on 12/21/2004 12:01:44 AM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 1 | View Replies ] To: Travis McGee The \"secondary blogs\" just picked up the scoops they found here on the FReep, and passed them along as their own. You probably didn't mean any offense, but Iresent that if it's directed towards me. Isure did pick up scoops from this forum, but didn't pass them off as my own. The NPR/Media Matters post came from several sources: a reader of mine heard the NPR story, Ifound the Media Matters story, and Itold Buckhead about both. He told me why they had gotten the timing wrong, but was reticent about being quoted. When Ifirst did the post, he had not given me permission to quote him; in the update, he did. Ialways attribute things Iget from other places, unless Ihave an agreement with the source not to disclose their identity. In all my posts where Ipicked things up from Freepers, Isourced them unless they had asked me not to. 17 posted on 12/21/2004 12:32:26 AM PST by Patterico [ Post Reply | Private Reply | To 16 | View Replies ] To: Travis McGee"
    },
    {
      "tag": "p",
      "text": "Idon't mean to sound harsh, but you have to understand that accusing people of ripping off others' observations is considered an attack on our integrity. My integrity is everything and Ican't have people getting the wrong impression."
    },
    {
      "tag": "div",
      "text": "18 posted on 12/21/2004 12:34:05 AM PST by Patterico [ Post Reply | Private Reply | To 16 | View Replies ] To: Patterico"
    },
    {
      "tag": "p",
      "text": "Idon't even know who you are, or what secondary forums you represent. Don't take offense, but most of us don't know you either."
    },
    {
      "tag": "div",
      "text": "19 posted on 12/21/2004 7:38:26 AM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 17 | View Replies ] To: Jim Robinson; Ernest_at_the_Beach; Travis McGee; Squantos; MeekOneGOP; PhilDragoo; Coop; Valin Thanks for posting this Jim. It was not just Blather who ended up as a big loser this past year. Thanks to Free Republic and conservative blogs, ABCNNBCBS took a potentially lethal blow this year."
    },
    {
      "tag": "p",
      "text": "Now we are doing the same thing with the liars/spinners suffering from Rummy Phobia. Merry Christmas Jim."
    },
    {
      "tag": "div",
      "text": "20 posted on 12/21/2004 9:24:30 AM PST by Grampa Dave (Rummy Phobia is the new mental disorder of the left.  It is similiar to Hate GW Syndrome!) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson \"He said ABC News falsely concluded that posters on FreeRepublic.com — the conservative news forum where the hoax idea germinated — were the forgers of the documents\""
    },
    {
      "tag": "p",
      "text": "Well, finally someone has it right, Conservative News Forum. Not a blog!"
    },
    {
      "tag": "div",
      "text": "21 posted on 12/21/2004 9:27:36 AM PST by #1CTYankee [ Post Reply | Private Reply | To 1 | View Replies ] To: Travis McGee Travis - Patterico's been busting the LA Times's chops frequently (and most entertainly) for quite some time and his site just won the 2004 Weblog Award for sites ranked 100 to 250 in the TTLB Ecosysystem. Check it out. (Please note: Iam not affiliated in any way with Patterico, other than as a frequent reader.) 22 posted on 12/21/2004 10:05:07 AM PST by macbee (\"Never interrupt your enemy when he is making a mistake.\" - Napoleon Bonaparte) [ Post Reply | Private Reply | To 19 | View Replies ] To: Jim Robinson Also unmentioned was the microbiologist FReeper who used a computer-graphic program normally used to spot culture growth in Petri-dishes to overlay the fake memo with one produced in Word."
    },
    {
      "tag": "p",
      "text": "They were identical, and he posted the graphic results here on FR. Isure wish Icould remember his screen name..."
    },
    {
      "tag": "div",
      "text": "23 posted on 12/21/2004 10:05:40 AM PST by snopercod (Bigger government means clinton won. Less freedom means Osama won. Get it?) [ Post Reply | Private Reply | To 1 | View Replies ] To: macbee"
    },
    {
      "tag": "p",
      "text": "Never heard of him. It's all here on FR; Idon't need to go off of FR just to read one more guy's opinions."
    },
    {
      "tag": "div",
      "text": "24 posted on 12/21/2004 10:08:34 AM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 22 | View Replies ] To: Travis McGee"
    },
    {
      "tag": "p",
      "text": "Suit yourself. For my money, FR is not the be-all and end-all, just a wonderful gathering place for folks to discuss the news of the day. Ienjoy FR along with a few other sites, such as Instapundit, Hugh Hewitt, NRO, Powerline, Patterico, Tech Central, Tim Blair, and of course Scrappleface (because \"laughter is the bext medicine\"). YMMV."
    },
    {
      "tag": "div",
      "text": "25 posted on 12/21/2004 10:24:41 AM PST by macbee (\"Never interrupt your enemy when he is making a mistake.\" - Napoleon Bonaparte) [ Post Reply | Private Reply | To 24 | View Replies ] To: snopercod"
    },
    {
      "tag": "p",
      "text": "If Iam not mistaken, that was aruanan. It was really cool."
    },
    {
      "tag": "div",
      "text": "26 posted on 12/21/2004 4:14:59 PM PST by Buckhead [ Post Reply | Private Reply | To 23 | View Replies ] To: Travis McGee; Patterico"
    },
    {
      "tag": "p",
      "text": "Patterico is a righteous dude. His clearing up the time stamp thing was helpful in keeping the wolves at bay."
    },
    {
      "tag": "div",
      "text": "27 posted on 12/21/2004 4:17:23 PM PST by Buckhead [ Post Reply | Private Reply | To 24 | View Replies ] To: snopercod"
    },
    {
      "tag": "p",
      "text": "It was aruanan. It's post 181 on this thread. http://www.freerepublic.com/focus/f-news/1211150/posts"
    },
    {
      "tag": "div",
      "text": "28 posted on 12/21/2004 4:25:31 PM PST by Buckhead [ Post Reply | Private Reply | To 23 | View Replies ] To: Buckhead"
    },
    {
      "tag": "p",
      "text": "Ilearn new things every day on FR. Thanks for filling this in for me. Iguess Itend too much to think that the sun rises and sets on FR!"
    },
    {
      "tag": "div",
      "text": "29 posted on 12/21/2004 4:42:29 PM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 27 | View Replies ] To: Patterico"
    },
    {
      "tag": "p",
      "text": "Thanks for being here. Glad to see you posting."
    },
    {
      "tag": "div",
      "text": "30 posted on 12/21/2004 4:51:35 PM PST by Judith Anne (Thank you St. Jude for favors granted.) [ Post Reply | Private Reply | To 18 | View Replies ] To: Howlin; doug from upland; Mia T; jwalsh07; ALOHA RONNIE"
    },
    {
      "tag": "p",
      "text": "ping"
    },
    {
      "tag": "div",
      "text": "31 posted on 12/21/2004 4:52:55 PM PST by nutmeg (\"Let the UN investigate itself.\" - Juan Williams (Fox News) 12/10/04) [ Post Reply | Private Reply | To 1 | View Replies ] To: StarFan; Dutchy; alisasny; BobFromNJ; BUNNY2003; Cacique; Clemenza; Coleus; cyborg; DKNY; ... ping!"
    },
    {
      "tag": "p",
      "text": "Please FReepmail me if you want on or off my ‘miscellaneous’ ping list."
    },
    {
      "tag": "div",
      "text": "32 posted on 12/21/2004 4:53:41 PM PST by nutmeg (\"Let the UN investigate itself.\" - Juan Williams (Fox News) 12/10/04) [ Post Reply | Private Reply | To 1 | View Replies ] To: Travis McGee \"Ilearn new things every day on FR. Thanks for filling this in for me. Iguess Itend too much to think that the sun rises and sets on FR!"
    },
    {
      "tag": "p",
      "text": "It does. I'm here all the time."
    },
    {
      "tag": "div",
      "text": "33 posted on 12/21/2004 5:11:31 PM PST by blam [ Post Reply | Private Reply | To 29 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Your little website may have just saved a presidency, JimRob. :)"
    },
    {
      "tag": "div",
      "text": "34 posted on 12/21/2004 5:27:32 PM PST by doug from upland (Vietnam Vets:  FINALLY -- welcome home, heroes) [ Post Reply | Private Reply | To 1 | View Replies ] To: You Dirty Rats Ijust happened to post right away. I'm willing to bet that others familiar with USAF memo formats recognized the errors immediately. 35 posted on 12/21/2004 5:53:14 PM PST by TankerKC (The Media turn each tactical victory for insurgents into a strategic victory for terrorists.) [ Post Reply | Private Reply | To 7 | View Replies ] To: TankerKC"
    },
    {
      "tag": "p",
      "text": "He who shoots down the enemy gets credit for the kill. Go ahead and paint a CBS Logo on the side of your plane."
    },
    {
      "tag": "div",
      "text": "36 posted on 12/21/2004 6:48:39 PM PST by You Dirty Rats [ Post Reply | Private Reply | To 35 | View Replies ] To: nutmeg"
    },
    {
      "tag": "p",
      "text": ". And yet... LIBERAL Los Angeles Times Media Critic... DAVID SHAW still maintains that: RATHER's work 'Shoddy, Slipshod' not LIBERAL..? http://www.Freerepublic.com/focus/f-news/1227809/posts ."
    },
    {
      "tag": "div",
      "text": "37 posted on 12/21/2004 7:23:18 PM PST by ALOHA RONNIE (\"ALOHA RONNIE\" Guyer/Veteran-\"WE WERE SOLDIERS\" Battle of IA DRANG-1965 http://www.lzxray.comi) [ Post Reply | Private Reply | To 31 | View Replies ] To: Patterico"
    },
    {
      "tag": "p",
      "text": "Ihad the privilege of meeting Omar and Mohammed from Iraq the Model Wow! Iam jealous. Those guys are the BEST!"
    },
    {
      "tag": "div",
      "text": "38 posted on 12/21/2004 8:57:46 PM PST by Valin (Out Of My Mind; Back In Five Minutes) [ Post Reply | Private Reply | To 15 | View Replies ] To: doug from upland"
    },
    {
      "tag": "p",
      "text": "Your little website may have just saved a presidency, JimRob. :)....again."
    },
    {
      "tag": "div",
      "text": "39 posted on 12/21/2004 8:59:55 PM PST by Valin (Out Of My Mind; Back In Five Minutes) [ Post Reply | Private Reply | To 34 | View Replies ] To: blam"
    },
    {
      "tag": "p",
      "text": "(me too)"
    },
    {
      "tag": "div",
      "text": "40 posted on 12/21/2004 9:25:15 PM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 33 | View Replies ] To: TankerKC"
    },
    {
      "tag": "p",
      "text": "He's right. You get the \"kill.\""
    },
    {
      "tag": "div",
      "text": "41 posted on 12/21/2004 9:26:01 PM PST by Travis McGee (----- www.EnemiesForeignAndDomestic.com -----) [ Post Reply | Private Reply | To 35 | View Replies ] To: Buckhead; aruanan Bless you my child. My memory's become about as long as my...well, nevermind."
    },
    {
      "tag": "p",
      "text": "Thanks once again aruanan. Iwas very impressed with what you did."
    },
    {
      "tag": "div",
      "text": "42 posted on 12/22/2004 3:41:00 AM PST by snopercod (Bigger government means clinton won. Less freedom means Osama won. Get it?) [ Post Reply | Private Reply | To 28 | View Replies ] To: Buckhead"
    },
    {
      "tag": "p",
      "text": "Thanks, Buckhead. It was a high point of my scientific career. Ha ha ha."
    },
    {
      "tag": "div",
      "text": "43 posted on 12/22/2004 7:26:16 AM PST by aruanan [ Post Reply | Private Reply | To 28 | View Replies ] To: Buckhead; TankerKC; Judith Anne"
    },
    {
      "tag": "p",
      "text": "Thanks for the kind words, Buckhead and Judith Anne. And nice to see you again, TankerKC."
    },
    {
      "tag": "div",
      "text": "44 posted on 12/22/2004 7:43:18 PM PST by Patterico [ Post Reply | Private Reply | To 27 | View Replies ] To: StarFan; Dutchy; alisasny; BobFromNJ; BUNNY2003; Cacique; Clemenza; Coleus; cyborg; DKNY; ... ping!"
    },
    {
      "tag": "p",
      "text": "Please FReepmail me if you want on or off my ‘miscellaneous’ ping list."
    },
    {
      "tag": "div",
      "text": "45 posted on 01/10/2005 8:18:31 PM PST by nutmeg (\"We're going to take things away from you on behalf of the common good.\" - Hillary Clinton 6/28/04) [ Post Reply | Private Reply | To 1 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "BTTT"
    },
    {
      "tag": "div",
      "text": "46 posted on 01/10/2005 8:20:18 PM PST by Fiddlstix (This Tagline for sale. (Presented by TagLines R US)) [ Post Reply | Private Reply | To 1 | View Replies ] To: nutmeg"
    },
    {
      "tag": "p",
      "text": "Bumpity, bump!"
    },
    {
      "tag": "div",
      "text": "47 posted on 01/10/2005 8:32:59 PM PST by Victoria Delsoul [ Post Reply | Private Reply | To 45 | View Replies ] To: nutmeg"
    },
    {
      "tag": "p",
      "text": "Multi-bumps. Failed to see this and appreciate it fully."
    },
    {
      "tag": "div",
      "text": "48 posted on 01/10/2005 8:54:57 PM PST by Spirited [ Post Reply | Private Reply | To 45 | View Replies ] To: Jim Robinson"
    },
    {
      "tag": "p",
      "text": "Iwant to borrow ABC's Time Machine and go back before the Rathergate episode aired..."
    },
    {
      "tag": "div",
      "text": "49 posted on 01/11/2005 7:12:27 AM PST by Doctor Raoul ( ----- HERTZ: We're #1 ----- AVIS: We're #2 We Try Harder ----- CBS: We're #3 We LIE Harder) [ Post Reply | Private Reply | To 1 | View Replies ] To: Spirited"
    },
    {
      "tag": "p",
      "text": "Here's another BUMP. I'm surprised this thread hasn't grown by many more posts by now..."
    },
    {
      "tag": "div",
      "text": "50 posted on 01/11/2005 7:26:44 AM PST by nutmeg (\"We're going to take things away from you on behalf of the common good.\" - Hillary Clinton 6/28/04) [ Post Reply | Private Reply | To 48 | View Replies ]"
    },
    {
      "tag": "p",
      "text": "Navigation: use the links below to view more comments. first 1-50 , 51 next last Disclaimer : Opinions posted on Free Republic are those of the individual\nposters and do not necessarily represent the opinion of Free Republic or its\nmanagement. All materials posted herein are protected by copyright law and the\nexemption for fair use of copyrighted works."
    },
    {
      "tag": "div",
      "text": "Free Republic Home · Browse · Search News/Activism Topics · Post Article"
    },
    {
      "tag": "div",
      "text": "FreeRepublic , LLC, PO BOX 9771, FRESNO, CA 93794 FreeRepublic.com is powered by software copyright 2000-2003 Robinson-DeFehr Consulting, LLC."
    }
  ]
}