{
  "url": "http://www.frif.com/cat97/a-e/blood_in.html",
  "file_number": "441",
  "content_hash": "29498b8a60a204af9597fa5f37fc37af38c67f2fe9fdc886fa6d5df44fe71499",
  "total_blocks": 252,
  "retained_blocks": 17,
  "ignored_blocks": 235,
  "blocks": [
    {
      "tag": "div",
      "text": "End Preload Script PICOSEARCH_SKIPTEXTSTART shopping cart end shopping cart"
    },
    {
      "tag": "p",
      "text": "Search our catalog: Begin PicoSearch Query Box Help End PicoSearch Query Box"
    },
    {
      "tag": "div",
      "text": "Join our e-mail list! Stay Informed of Special Offers, New Releases, and More! BEGIN: Constant Contact Border Email List Button Sign up for our mailing list END: Constant Contact Border Email List Button View titles by subject: Select a subject Adolescence Africa African- Americans Aging Amer. Studies Anthropology Architecture Art Asia Biographies Business Ethics Civil Rights Communication Criminal Justice Death/Dying Ecology Economics Economic- Sociology Education Environment Ethics Europe (East) Europe (West) Family Film Studies France Gay/Lesbian Globalization Health History (U.S.) History (World) Human Rights Human Sexuality Indigenous- Peoples Islam Jewish Studies Journalism Labor Studies Latin America Law Literature Media Medicine Middle East Music Native People Philosophy Photography Politics Psychology Racism Religion Russia Science Sociology Theater Urban Studies Vietnam & Southeast Asia Women World War II PICOSEARCH_SKIPTEXTEND SERIESTITLE"
    },
    {
      "tag": "p",
      "text": "Blood in the Face SUBTITLE"
    },
    {
      "tag": "div",
      "text": "DIRECTOR PRODUCER OTHER CREDITS DIRECTOR PRODUCER OTHER CREDITS A Film by Anne Bohlen, Kevin Rafferty, and James Ridgeway PULL QUOTE FRIF doesn't use this"
    },
    {
      "tag": "p",
      "text": "Allowed access to national gatherings of U.S. radical right groups including the Ku Klux Klan and the Posse Comitatus, BLOOD IN THE FACE straightforwardly presents the views of people whose avowed goal is to forge a political union which will transform North America into one Aryan nation. Blatantly and without flinching, members of these groups describe their agenda of anti-semitism, racism, and extreme nationalism. Their heroes are Adolf Hitler and George Lincoln Rockwell, founder of the American Nazi Party. Wedding ceremonies are performed at burning crosses. Their message is spread through their own home video network. BLOOD IN THE FACE, whose title refers to the belief that only white people can blush, is a searing record of America's radical right, a social and political force which can no longer be dismissed."
    },
    {
      "tag": "div",
      "text": "REVIEWS"
    },
    {
      "tag": "p",
      "text": "\"The riveting documentary... is neither as uproarious as ROGER AND ME nor as jazzy as THE ATOMIC CAFE, but it is far more insidiously spooky in its picture of the extreme right. BLOOD IN THE FACE is first-rate journalism.\" - Vincent Canby, New York Times \"**** [4 Stars - Highly Recommended] The terror of this program is in the quiet, deadly rationalizations of its fanatical subjects. It is an excellent introduction to the racist, far-right political elements in America and Canada.\" - Video Rating Guide for Libraries"
    },
    {
      "tag": "div",
      "text": "AWARDS Pricing, length, etc"
    },
    {
      "tag": "p",
      "text": "75 minutes\n\t\t\t\t\t\n / color\n\n / 1990 Sale/video: $175 Rental/video: $125"
    },
    {
      "tag": "div",
      "text": "online purchase buttons only show if there is a list-video amount PICOSEARCH_SKIPTEXTSTART STUDY GUIDE GUIDEURL in theaters 2 blank rows, then a row for the in theaters link end in theaters Subjects"
    },
    {
      "tag": "p",
      "text": "Subject areas : African-Americans , Civil Rights , North America, Philosophy , Psychology , Racism , Sociology"
    },
    {
      "tag": "div",
      "text": "Related links a blank row, then a row for the related links Related Titles a blank row, then a row for the related titles"
    },
    {
      "tag": "p",
      "text": "Related Titles: Brotherhood of Hate : An investigation of a seemingly isolated murder in rural Arkansas, revealing the virulent, dangerous mentality of white supremacy in America, handed down from one generation to the next. South : The heart of this journey is the brutal murder of James Byrd, Jr in Jasper, Texas.  But this is not an anatomy of his murder, rather, it is an evocation of how this event fits in to a landscape and climate as much mental as physical."
    },
    {
      "tag": "div",
      "text": "Start bottom nav + address (blank row, line, blank row, nav, blank row, line, blank row, address) Home | New | Titles | Subjects | Ordering | Resources | PDF's Weblog | Current Concerns | Banner Ads | Video Clips | DVD's | RSS Closed Captions | Study Guides | Postcards | Filmmakers | Screenings"
    },
    {
      "tag": "p",
      "text": "Last updated 09/01/2006"
    },
    {
      "tag": "div",
      "text": "PICOSEARCH_SKIPTEXTEND"
    }
  ]
}