{
  "url": "http://www.fxstreet.com/nou/content/103340/content.asp?menu=knowledge",
  "file_number": "444",
  "content_hash": "1e4bb2dfe3cb80cb1c90d6febfd95fb472b5a6503676d6d28253a41f39a0abf8",
  "total_blocks": 261,
  "retained_blocks": 103,
  "ignored_blocks": 158,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" INICIO ENGINY HEADER EmediateAd 3rd party code for FXstreet"
    },
    {
      "tag": "p",
      "text": "Premium Chat Forum"
    },
    {
      "tag": "div",
      "text": "New York London Barcelona Tokyo Sydney Rates & Charts News Fundamental Technical Futures Live Education Resources Brokers FIN ENGINY HEADER uno menos 825... uno ms 865 INICIO ENGINY FREETEXT"
    },
    {
      "tag": "h2",
      "text": "Forex Community"
    },
    {
      "tag": "div",
      "text": "Forex Forum NEW! Forex Chat FI ENGINY FREETEXT INICI ENGINY BUSCADOR REPORTS"
    },
    {
      "tag": "h2",
      "text": "Search Reports"
    },
    {
      "tag": "p",
      "text": "Keyword Provider All AceTrader ACT Currency Partner ActionForex.com AKforex Anduril, Inc. Asesoria Forex Aspen Trading Group Avantage Financial GMBH BBVA Bancomer BBVA Group BetonCurrencies BHF-Bank Cashmonsterz CMC Markets NY CMS Forex Commerzbank Danske Bank A/S Delta Global Advisors, Inc. Easy Forex E-Forex Erste Bank der oesterreichischen Sparkassen AG Eurusdtrader Finotec Group Inc. Forexnews.com ForexYard Friend-of-Fxtrend FX Chicago FX Engines FX Money Trends FX Solutions FX Trend Trader FX Universal LLC FXA FXAnalytics FxBootcamp FXCM FXDream FxMax FX-Strategy FXstreet.com FXtechtrade FXtoday FXTSP.com GCI Gerard  Bergsma Global Forex Trading Ltd. GoForex Growth Engines Halo Financial HVB Group ICICI Bank iExpertAdvisor, LLC Informa Global Markets Investica Ltd Investors Intelligence Jyske Bank Karoll KBC Bank Kshitij Consultancy Service La Caixa Lloyds TSB Financial Markets Market Speculators Market Technologies, LLC Mellon Foreign Exchange Merk Hard Currency Fund Mihai Nichisoiu Mizuho Corporate Bank MTI North America MVDForex National Bank of Canada Nexum Capital Markets Northern Trust ODL Securities Odom & Frey Futures & Options Online Trading Academy Performance Capital PipsandTips.com Piptopia Rabobank Rizk Investments S.A.F.E. Ltd Saxo Bank Spencer Financial LLC StraightForex Sucden (UK) Limited Sure-Fire Forex Trading Swiss Finance Corporation The Forex Edge The Trading Tutor Trader College Trader House Network TradeSphereFX Trading Educators Inc. TradingEducation.com, LLC Tricom Union Bank of California Wachovia Corporation Economics Group Westpac Institutional Bank Windfall Management Windsor Brokers Ltd Yapi Kredi Bank Z-forecasting Frequency All Daily Weekly Fortnightly Monthly Quarterly Yearly Interim"
    },
    {
      "tag": "div",
      "text": "FI ENGINY BUSCADOR REPORTS INICIO ENGINY FREETEXT"
    },
    {
      "tag": "h2",
      "text": "Managed Accounts Program (MAP)"
    },
    {
      "tag": "div",
      "text": "Performance Start: $100,000 Current: $102,740 [ More info ]"
    },
    {
      "tag": "h2",
      "text": "Signals Tracker"
    },
    {
      "tag": "p",
      "text": "Searching for the perfect FX Signals Provider? Follow the right path using our Signals Tracker"
    },
    {
      "tag": "h2",
      "text": "Trading Tools"
    },
    {
      "tag": "div",
      "text": "Currency Converter Rate History Tool Risk Probability Calculator Forex Pivot Point Calculator Pip USD value Calculator"
    },
    {
      "tag": "h2",
      "text": "FXstreet.com Blogs"
    },
    {
      "tag": "div",
      "text": "The Informer Weblog Tony Juste Ed Ponsi John Putman II Jerry Furst Wayne McDonell"
    },
    {
      "tag": "h2",
      "text": "FXstreet.com Premium Service"
    },
    {
      "tag": "div",
      "text": "Dow Jones News in Real-time Live Webinars with FX Experts Visual Chart Autochartist FX Expert Comments & Reports"
    },
    {
      "tag": "h2",
      "text": "For your website"
    },
    {
      "tag": "p",
      "text": "Add an FXstreet.com ticker to your own site"
    },
    {
      "tag": "div",
      "text": "FI ENGINY FREETEXT INICI ENGINY DIRECTOY SEARCH FORM"
    },
    {
      "tag": "p",
      "text": "Direct and immediate access to the main players operating in foreign exchange. Institution Advisors Brokers Education Market Makers Money Managers Risk Management Technology Providers Region Select All Africa Asia Asia Pacific Central America Europe Middle East North America South America FX Markets Select All Forwards Futures Money Markets Options Spot Structured Products Warrants"
    },
    {
      "tag": "div",
      "text": "FI ENGINY DIRECTOY SEARCH FORM Advertisement"
    },
    {
      "tag": "h2",
      "text": "Dashboard FX"
    },
    {
      "tag": "p",
      "text": "Receive Buy/Sell signals instantly to your desktop, email and SMS. Use Real-Time gauges to identify Trends, Ranges, Volatility and Sentiment. Download Free Software now ."
    },
    {
      "tag": "div",
      "text": "INICIO ENGINY FREETEXT FI ENGINY FREETEXT INICIO ENGINY NEWS"
    },
    {
      "tag": "h2",
      "text": "Latest Forex News"
    },
    {
      "tag": "p",
      "text": "Japan Nov retail sales down 0.1 pct yr-on-yr; 1st drop in 4 mths (AFX News) 00:14 GMT Nikkei hits highest since May, Toyota rises (Reuters) 00:10 GMT"
    },
    {
      "tag": "div",
      "text": "[ View All ] FI ENGINY NEWS XHTML 240x240 Flash INICIO ENGINY CAG EASY Chart"
    },
    {
      "tag": "h2",
      "text": "EUR USD , Hourly"
    },
    {
      "tag": "div",
      "text": "FI ENGINY CAG EASY Chart INICIO ENGINY CAG EASY Chart"
    },
    {
      "tag": "h2",
      "text": "GBP USD, Hourly"
    },
    {
      "tag": "div",
      "text": "FI ENGINY CAG EASY Chart INICI ENGINY CURRENCIES GLANCE"
    },
    {
      "tag": "h2",
      "text": "Currencies at a Glance"
    },
    {
      "tag": "dt",
      "text": "EUR/USD"
    },
    {
      "tag": "dd",
      "text": "Drops below 1.3150 (04:32 GMT)"
    },
    {
      "tag": "dt",
      "text": "GBP/USD"
    },
    {
      "tag": "dd",
      "text": "Trades below 1.9600 (04:34 GMT)"
    },
    {
      "tag": "dt",
      "text": "USD/CHF"
    },
    {
      "tag": "dd",
      "text": "Trades around 1.2200 (04:36 GMT)"
    },
    {
      "tag": "dt",
      "text": "USD/JPY"
    },
    {
      "tag": "dd",
      "text": "Moves up toward 119.00 (04:38 GMT)"
    },
    {
      "tag": "div",
      "text": "FI ENGINY CURRENCIES GLANCE INICIO ENGINY FREETEXT"
    },
    {
      "tag": "p",
      "text": "Follow all currency pairs in real time in the Rates & Charts Section New Chart Patterns Section : Automatically identified pattern recognition; Alerts for emerging and complete patterns. Powered by Autochartist."
    },
    {
      "tag": "div",
      "text": "FI ENGINY FREETEXT Advertisement"
    },
    {
      "tag": "h2",
      "text": "Connect to the World of Forex"
    },
    {
      "tag": "p",
      "text": "Whether you've been trading for years or are just entering the world of Forex trading, Saxo Bank provides the technology , pricing , tools and support to help you trade successfully. Our intuitive, customisable platform caters to your individual needs.\r\nCreate a trading environment as advanced or straight-forward as you need it to be. Download SaxoTrader ."
    },
    {
      "tag": "div",
      "text": "INICIO ENGINY TOP ECONOMIC EVENTS"
    },
    {
      "tag": "h2",
      "text": "Top Economic Events"
    },
    {
      "tag": "div",
      "text": "Date Country Event Previous Consensus Dec 27, 05:00 GMT Japan Housing Starts (YoY) 2.20 % 1.10 % Dec 27, 12:00 GMT United States MBA Mortgage Applications -10.20 % Dec 27, 15:00 GMT United States New Home Sales 1004.00 M 1023.00 M Dec 27, 15:30 GMT United States Crude Oil Inventories -6.30 M Dec 28, 13:30 GMT United States Initial Jobless Claims 315.00 K 326.00 K [ View All ] FI ENGINY TOP ECONOMIC EVENTS INICIO ENGINY FREETXITXA"
    },
    {
      "tag": "h2",
      "text": "Current topics at FXstreet.com"
    },
    {
      "tag": "div",
      "text": "December 26, 17:20 GMT"
    },
    {
      "tag": "p",
      "text": "Quiet trading day expected post Christmas Day by ForexYard The USD is trading in small volumes at the beginning of the post Christmas session; as mostly Japanese traders are in the market, which will probably create little volatility, before the rest of the market join the trading..."
    },
    {
      "tag": "div",
      "text": "[ Full Story ] Get the Technical Point of View for this trading session"
    },
    {
      "tag": "h3",
      "text": "Related Reports"
    },
    {
      "tag": "div",
      "text": "Market Commentary - Aberrations Christmas Day on GBP and AUD by Investors Education Network Daily Technical Briefing - Greenback Sees Red by FXCM"
    },
    {
      "tag": "h3",
      "text": "In-Depth"
    },
    {
      "tag": "div",
      "text": "FOREX FORUM : Post your comments and share your opinions with fellow traders Forex News : Be up to date during the holidays season Brand New FXstreet.com Newsletters: Subscribe now! FX Educator Weblog - Follow up Ed Ponsi's posts from Shanghai FI ENGINY FREETXITXA INICIO ENGINY LLISTAT GRUP REPORTS"
    },
    {
      "tag": "h2",
      "text": "New on FXstreet.com"
    },
    {
      "tag": "p",
      "text": "Market Commentary - Aberrations Christmas Day on GBP and AUD by Investors Education Network Tue, Dec 26 2006, 12:55 GMT Daily Fx Strategy - Further Euro, Aussie Losses Next Week by CMC Markets NY Sat, Dec 23 2006, 06:38 GMT High Probability Trading Setups for the Currency Market by FXstreet.com Thu, Dec 21 2006, 07:11 GMT Monthly Webinar: High Probability Trading Setups in the Currency Market - Part I & Part II Presentation Slides by FXCM Wed, Dec 20 2006, 08:06 GMT"
    },
    {
      "tag": "div",
      "text": "[ View All ] FI ENGINY LLISTAT GRUP REPORTS INICIO ENGINY LLISTAT LAST UPDATE REPORTS"
    },
    {
      "tag": "h2",
      "text": "Last Updated Reports"
    },
    {
      "tag": "p",
      "text": "U.S. Forex Market Commentary - U.S. Forex Market Commentary by GCI Tue, Dec 26 2006, 18:44 GMT FOREX.4.FREE by Gerard  Bergsma Tue, Dec 26 2006, 17:39 GMT Daily Scalping Tip - Daily Scalping Tip by PipsandTips.com Tue, Dec 26 2006, 15:42 GMT Daily Technical Briefing - “Greenback Sees Red” by FXCM Tue, Dec 26 2006, 15:24 GMT"
    },
    {
      "tag": "div",
      "text": "[ View All ] [ Search ] FI ENGINY LLISTAT LAST UPDATE REPORTS INICIO ENGINY FREETEXT"
    },
    {
      "tag": "p",
      "text": "Exclusive Video: Fantastic World of Forex Watch an exclusive lesson from the Online Trading Academy! Find a guide to move properly in the deep jungle of Forex trading, with all the information you may need to succeed \t\t\t\t\t\t\tin trading."
    },
    {
      "tag": "div",
      "text": "FI ENGINY FREETEXT INICIO ENGINY FREETEXT"
    },
    {
      "tag": "h2",
      "text": "New FXstreet.com Newsletters"
    },
    {
      "tag": "p",
      "text": "The first week of January, Asia-Pacific , Europe and U.S. Trading Newsletters will be launched. An improved Forex Informer will also start with even more specific information for the Forex Market. Subscribe to the new Newsletters now ."
    },
    {
      "tag": "div",
      "text": "FI ENGINY FREETEXT INICIO ENGINY HIGHLIGHTED SESSIONS"
    },
    {
      "tag": "h2",
      "text": "NEXT LIVE WEBINAR"
    },
    {
      "tag": "p",
      "text": "What moves currencies? - 2007 Market Outlook Expert: Tony Juste Start: Tue, 2 Jan 2007 11:00 GMT Sponsored by: Type of Session: Webinar"
    },
    {
      "tag": "div",
      "text": "FI ENGINY HIGHLIGHTED SESSIONS INICIO ENGINY FREETEXT [ View All ] FI ENGINY FREETEXT INICIO ENGINY HIGHLIGHTED SESSIONS"
    },
    {
      "tag": "h2",
      "text": "NEXT Q&A"
    },
    {
      "tag": "p",
      "text": "Confessions of a Forex Trader - Part VII: An Illustrative Wrap-up Expert: Mihai Nichisoiu Start: Tue, 9 Jan 2007, 15:00 GMT Type of Session: Questions and Answers"
    },
    {
      "tag": "div",
      "text": "FI ENGINY HIGHLIGHTED SESSIONS INICIO ENGINY FREETEXT [ View All ] FI ENGINY FREETEXT INICIO ENGINY UPCOMING WEBINARS"
    },
    {
      "tag": "h2",
      "text": "Upcoming Live Events"
    },
    {
      "tag": "div",
      "text": "Sponsored by: Tue, Jan 2, 11:00 GMT What moves currencies? - 2007 Market Outlook Tony Juste WBN Tue, Jan 2, 14:00 GMT Technical Analysis Theory and Practice - Premium users only Tony Juste WBN Wed, Jan 3, 11:00 GMT What moves currencies? Tony Juste WBN Thu, Jan 4, 11:00 GMT What moves currencies? Tony Juste WBN [ View All ] FI ENGINY UPCOMING WEBINARS INICIO ENGINY FREETEXT"
    },
    {
      "tag": "h2",
      "text": "Community"
    },
    {
      "tag": "p",
      "text": "Brand new FOREX FORUM : Join and start posting comments Open 24 hours a day. Discuss your trades with the community in the FOREX CHAT Read and participate in our team members and partners weblogs :"
    },
    {
      "tag": "div",
      "text": "Tony Juste's The Advisor weblog Ed Ponsi's The FX Educator weblog John Putman's FX Analytics weblog Jerry Furst's 1st on Forex weblog Wayne McDonell's FxBootcamp Vlog FXstreet.com's company news in The Informer Blog FI ENGINY FREETEXT INICIO ENGINY FREETEXT"
    },
    {
      "tag": "h2",
      "text": "FXstreet.com Services"
    },
    {
      "tag": "p",
      "text": "FXstreet.com\n   Directory : Direct and immediate access to the main\n   players operating in Foreign Exchange Market. Forex\n   DVDs : It's here, the new DVD from Ed Ponsi. Acomplete, comprehensive trading course! Forex\n   Newsletters : The entire Forex Market in your inbox - Pick your\n   subscription! Mislead by signals? Forex\n   Signals Tracker will help you to find the right path. Take a look at Brokers\n   section and choose the appropriate Brokerage firm to\n   trade with. Workshop and Convention guides."
    },
    {
      "tag": "div",
      "text": "FI ENGINY FREETEXT Advertisement"
    },
    {
      "tag": "h2",
      "text": "2 pip euro-No Dealing Desk"
    },
    {
      "tag": "p",
      "text": "Find out why customers prefer IBFX. 2 pip EUR/USD. Micro and Mini Lots. Free charting, news, trailing stops, and much more! Click Here ."
    },
    {
      "tag": "div",
      "text": "Advertisement"
    },
    {
      "tag": "h2",
      "text": "MoneyFOREX.com - Forex Trading"
    },
    {
      "tag": "p",
      "text": "Why trade with MoneyFOREX.com ? Commision Free Online Forex Trading that allows traders in trading the Forex and CFDs market. Click Here ."
    },
    {
      "tag": "h2",
      "text": "Strip of the day"
    },
    {
      "tag": "p",
      "text": "Strip Archive"
    },
    {
      "tag": "div",
      "text": "FI ENGINY FIBO AND PIP About FXstreet.com Terms and Conditions Contact Us RSS Site Map Home"
    },
    {
      "tag": "h4",
      "text": "Rates"
    },
    {
      "tag": "div",
      "text": "Streaming Forex Rates Live Currency Rates World Currencies Exchange Rates Table"
    },
    {
      "tag": "h4",
      "text": "Charts"
    },
    {
      "tag": "div",
      "text": "Streaming Forex Charts Live Charts Window Currency Charts Console Live Charts Panel More in Charts & Rates section"
    },
    {
      "tag": "h4",
      "text": "News"
    },
    {
      "tag": "div",
      "text": "Latest Forex News Editor's Selection Currency Focus Central Banks More ..."
    },
    {
      "tag": "h4",
      "text": "Live"
    },
    {
      "tag": "div",
      "text": "Live Sessions Schedule Forex Showroom Forex \r\n\t\t\t\t\t\t\t\tChat More ..."
    },
    {
      "tag": "h4",
      "text": "Reports"
    },
    {
      "tag": "div",
      "text": "Fundamental Reports Fundamental Market View World Interest Rates Economic Indicators Reports Interest Rates Reports Technical Analysis Reports Technical Market View Forecasts Trading Strategy Signals More in Technical and Fundamental sections"
    },
    {
      "tag": "h4",
      "text": "Other"
    },
    {
      "tag": "div",
      "text": "Looking for \r\n\t\t\t\t\t\t\t\ta Broker? Directory Futures Premium \r\n\t\t\t\t\t\t\t\tsection Workshops \r\n\t\t\t\t\t\t\t\tand Conventions Forex \r\n\t\t\t\t\t\t\t\tBooks Full Site Map Note: All information on this page is subject to change. The use of this website constitutes acceptance of our user agreement. Please read our privacy policy and legal disclaimer. Opinions expressed at FXstreet.com are those of the individual authors and do not necessarily represent the opinion of FXstreet.com or its management. Risk Disclosure: Trading foreign exchange on margin carries a high level of risk, and may not be suitable for all investors. The high degree of leverage can work against you as well as for you. Before deciding to invest in foreign exchange you should carefully consider your investment objectives, level of experience, and risk appetite. The possibility exists that you could sustain a loss of some or all of your initial investment and therefore you should not invest money that you cannot afford to lose. You should be aware of all the risks associated with foreign exchange trading, and seek advice from an independent financial advisor if you have any doubts. ©2006 \"FXstreet.com. The Forex Market\" All Rights Reserved. #include virtual = \"/googleanalytics.inc\""
    }
  ]
}