{
  "url": "http://www.gardenforever.com/pages/artwater.htm",
  "file_number": "446",
  "content_hash": "af95dfbd1f28a49445f2488524202b3f124121332621ff34846068483a909be3",
  "total_blocks": 19,
  "retained_blocks": 3,
  "ignored_blocks": 16,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//SoftQuad//DTD HoTMetaL PRO 4.0::19971010::extensions to HTML 4.0//EN\"\r\n \"hmpro4.dtd\""
    },
    {
      "tag": "div",
      "text": "Watering\r\n        Tricks by Lisa Erickson Watering can be one of the biggest challenges to the gardener with\r\n        limited strength or mobility. While it is easier physically to plant in\r\n        pots, baskets and raised beds and boxes, these containers will dry out\r\n        faster and require more frequent watering than will flower beds or\r\n        gardens. Knowing how often to water is not always easy to\r\n        figure out. If your plants are drooping they're almost certainly\r\n        thirsty. Sticking your finger up to the second joint into the soil will\r\n        quickly tell you if the plant needs water. If you can't reach hanging\r\n        baskets, assume they need watering every day as it is difficult to\r\n        overwater a plant that has adequate drainage and is exposed to the wind\r\n        and sun. (This is quite different from the all-too-common problem of \r\n        overwatering indoor plants). Many gardeners insist that the only time to water is\r\n        in the morning because the hot sun of midday will burn the moist leaves.\r\n        If you can't water in the morning, water when it is convenient. Try not\r\n        to water at night as moisture and darkness set up a perfect environment\r\n        for pests like slugs and mosquitoes as well as diseases like mildew and\r\n        black spot. When you do water, do it thoroughly. If you just sprinkle a\r\n        little on top each day, your plants will develop shallow root systems\r\n        that create weak plants. Be sure to have holes in your pots for drainage\r\n        so that water doesn't pool in the bottom causing root rot. If you live in an apartment, it is especially helpful to have an\r\n        outside hose bib attached on the balcony. Some builders make this a\r\n        standard feature but many don't even consider it necessary. If you are\r\n        fortunate enough to have a hose outlet, buy the shortest hose that will\r\n        allow to reach everywhere on your deck. The shorter the hose the lighter\r\n        it is making it easier to to maneuver and hang up afterwards. Usually 25\r\n        feet with a 1/2\" diameter is plenty of hose for a balcony or patio. Ahose attachment called a watering wand, a long, usually aluminum tube\r\n        with a sprinkler-like nozzle, is a good investment. Wands are about 30\"\r\n        long, allowing you to reach further, even from a sitting position, into\r\n        the back of a flower bed or up high into a hanging basket or window box.\r\n        There are even wands available with a 90 degree curve so that you water\r\n        straight into hanging baskets. There are shorter wands\r\n          around 16\" that are actually made for children but are quite\r\n        light weight with soft foam grips and are extremely practical for those\r\n        with little strength for lifting. Any watering wand attachment will\r\n        allow you to water all of your plants without refilling a can, a great\r\n        advantage when you have a lot of pots to maintain. If you don't have a water outlet on the balcony or deck you will need\r\n        to haul water. Watering cans come in many styles and sizes. The metal\r\n        ones are traditional but add water to them and they can be pretty heavy.\r\n        Try a lighter weight plastic one in sizes from about 1 pint to 1 1/2\r\n        gallons. If you keep a rain barrel on the deck you can fill from the top\r\n        or use a hose from the bottom for filling. There are some quite\r\n        sophisticated models on\r\n        the market now with a spigot already in place. Of course, the best way to ease watering tasks is to plant wisely.\r\n        Using a mulch in beds, raised or flat, helps preserve water. Plant drought resistant plants , like portulaca (Portulaca grandiflorum), Sedum (Sedum spp.),\r\n        Cleome (Cleome hasslerana), Dusty miller (Artemisia stellariana), Thyme\r\n        (Thymus spp.), Shasta daisy (Chrysanthermum sperbum) that cope well with\r\n        minimal watering. If you mostly work with pots, however, an extra step taken in the\r\n        initial soil preparation can save many hours all summer long. Adding\r\n        moisture retention granules helps reduce watering in any kind of\r\n        contained planting. These polymers granules soak up the water and then\r\n        slowly release it back into the soil as it dries out. Some potting\r\n        mixtures come with granules already mixed in but these tend to be pretty\r\n        expensive. Abetter alternative is to buy the granules in small packages\r\n        and mix them in as you plant. That way you can place them in the bottom\r\n        half of the pot where the roots of the plant will get the most benefit.\r\n        Hanging moss baskets which often require daily watering in the middle of\r\n        summer, can go from 2-3 days between watering. Some Plants With Minimal Watering Needs Portulaca (Portulaca grandiflorum) Sedum (Sedum spp.) Cleome (Cleome hasslerana) Dusty miller (Artemisia stellariana) Thyme (Thymus spp.) Shasta daisy (Chrysanthermum sperbum) Lisa\r\n        Erickson gardens in a small city garden. Resources Drought Tolerant Garden\r\n          Plants Watering\r\n          tools from Gardenscape Watering Cans by Haws UK Spruce Creek Rain Barrel"
    },
    {
      "tag": "p",
      "text": "All articles are the\r\n      property of Garden Forever. All rights\r\n      reserved. The use of any part of this publication reproduced, transmitted\r\n      in any form or by any means, electronic, mechanical, photocopying,\r\n      recording, or otherwise, or stored in a retrieval system, without the\r\n      prior written consent of Garden Forever is strictly forbidden."
    }
  ]
}