{
  "url": "http://www.gdi-solutions.com/",
  "file_number": "448",
  "content_hash": "0ccdf605924dd296f54ea230b15b11784fdf79f7d36b86df00a72cf7ae1baf68",
  "total_blocks": 273,
  "retained_blocks": 35,
  "ignored_blocks": 238,
  "blocks": [
    {
      "tag": "p",
      "text": "Global Direct Investment Solutions Corporate Development for a Networked World On The Short List The Global Direct Investment Forum The Global \r\n    Direct Investment Foundation Invest From Anywhere, To Anywhere"
    },
    {
      "tag": "div",
      "text": "Contact : TEL   847-304-4655"
    },
    {
      "tag": "p",
      "text": "Bruce Donnelly bruce@gdi-solutions.com ( Biography )"
    },
    {
      "tag": "p",
      "text": "Search or refer to our many directories and other content for 25,000+ resources \r\n    to support business site selection decisions in the USA and worldwide.  \r\n    This website has attracted over 1 \r\n    million visits in the 3 years since it was launched. Just ask us for free help reflecting over 15 years of experience in this niche and \r\n    thousands of contacts. Our independent research and referral work is free for \r\n    executives who are facing business expansion decisions because we are supported by leading professionals who can deliver \r\n    valuable services to more executives than they might reach through their own \r\n    professional networking activities, events, and exclusive marketing efforts. We can also perform custom market research projects.  \r\n    We welcome suggestions, support for our work, and relevant reciprocal links . Our goal is to make it easier for executives and their advisors to plan and \r\n    implement their business expansion projects to achieve \r\n    their strategic and ROI goals faster and better. We \r\n    deliver well-qualified introductions to the professionals and information \r\n    resources they need at the time, reflecting the research and \"lessons \r\n    learned\" from many other projects.."
    },
    {
      "tag": "div",
      "text": "We personally introduce \r\n    executives for free to valuable local market knowledge and professional \r\n    contacts as an independent global referral service (like a concierge in this \r\n    niche) through market research and the development of working relationships with \r\n    : Top executives facing strategic choices and \r\n      capital investment decisions about \r\n      where they will do business : where to establish, acquire, expand, move or \r\n      restructure their operations or alliances as markets and plans change. Economic development professionals representing \r\n      communities and regions whose leaders are highly motivated to attract and retain \r\n      growing companies and develop globally competitive business clusters. Professional service providers who assist \r\n      executives with capital \r\n      investment project plans in North America, Europe, Asia or worldwide.  \r\n      These may be local specialists or global experts in foreign direct \r\n      investment (FDI) projects worldwide."
    },
    {
      "tag": "p",
      "text": "We also perform US \r\n    advertising sales work for fDi - Foreign Direct Investment magazine, \r\n    published by the Financial Times group."
    },
    {
      "tag": "div",
      "text": "A 2007 North \r\n    American Location Guide will be published with the February 2007 issue  and featured \r\n    online throughout 2007 for quick reference.  This supplement will also \r\n    be distributed at MIPIM 2007 .   It will become part of the new fDi Atlas guide to global business \r\n    locations.  Contact us for more information."
    },
    {
      "tag": "p",
      "text": "The North American \"Cities of the Future\" award will be featured in the April 2007 issue, similar to the June / July 2005 issue. Nominations end December 31, 2006. This issue will be distributed at the BIO 2007 conference in \r\n    Boston in May. fDi : Foreign Direct Investment magazine by FT Business (The \r\n    Financial Times group) is the leading global publication focusing on foreign \r\n    direct investment - including investment into North America from other \r\n    regions of the world, and vice versa.  That includes cross-border \r\n    competition among US states and Canadian provinces. fDi \r\n    magazine is a trusted reference tool for executives and their advisors.  Contact \r\n    us about advertising in fDi magazine . TEL 847-304-4655 in Chicago. Editorial calendar and rates It reaches \"C-level\" executives and professionals in North America \r\n    (40%), \r\n    Europe (40%), and Asia (20%) who are responsible for corporate development strategies, \r\n    organizational change, and capital investment project location decisions \r\n    worldwide.  85% of readers are CEO's or CFO's.  80% are at large \r\n    companies (>500 employees). The fDi website attract 30,000+ visits \r\n    per month as a very targeted publication for top executives.  We \r\n    attract 50,000+ visitors per month, so together we should reach over 1 \r\n    million in 2007. Intro : about fDi magazine www.fdimagazine.com Search back issues of \r\n    fDi Foreign Direct Investment Profile and how to advertise . Ad Recall : fDi \r\n    advertisers Examples : Who reads fDi? June / July 2005 feature 2005 US winners and US Regional finalists Canada winners and finalists Mexican winners in 2005 Award presentations We \r\n     \r\n    welcome enquiries from senior executives who would like to subscribe to fDi, and from professional service \r\n    providers who specialize in this market."
    },
    {
      "tag": "div",
      "text": "The December \r\n    issue of fDi magazine will be distributed at the World Economic Forum annual meeting in Davos, Switzerland, January \r\n    24-28, 2007. The February 2007 issue of fDi magazine will be distributed \r\n    at MIPIM in Cannes, including the 2007 North \r\n    American Location Guide supplement."
    },
    {
      "tag": "p",
      "text": "fDi magazine will also be distributed at BIO 2007 in \r\n    Boston and at other major events during the next year. Editorial and event plan, rates fDi magazine was a sponsor and exhibitor at the CoreNet Global Summit in Orlando Florida and at the IEDC 2007 Annual \r\n    Conference in New York. You can also search this  \r\n      website for over 25,000 relevant research sources in this niche market, \r\n      including content which highlights national, regional, state, and \r\n      local economic development organizations and professional service \r\n      providers.  Let us help you to find what you \r\n    are seeking ."
    },
    {
      "tag": "p",
      "text": "Search WWW Search www.gdi-solutions.com This website Search www.ontheshortlist.com On The Short List Search www.partners4technology.com Partners4Technology Search www.fdimagazine.com fDi - Foreign Direct Investment (FT Business) Tip : See Google \" Cheat \r\n    Sheet \" help page for advanced web search features."
    },
    {
      "tag": "p",
      "text": "This Google site search tool is available by the Search button \r\n    at the top of each page.  Other custom search features are \r\n    provided through www.OnTheShortList.com to make it easy \r\n    to selectively search many other relevant sites.  The directory pages on this website keep related \r\n    content together so that it can be browsed quickly and easily (unlike \r\n    repeated database form queries).  GUIDE content such as Service Profiles , Area Profiles and Area Surveys are \r\n    executive summary presentations to highlight the benefits of particular \r\n    business locations or professional services.   They may link \r\n    to other websites about a location or service, and provide direct links to \r\n    information of common interest to our professional contacts."
    },
    {
      "tag": "div",
      "text": "Try the site search feature above, or our Directories of economic development \r\n    agencies and other resources.  This site \r\n    provides executive summary content, website links, and contacts for over 25,000 \r\n    business locations, service providers, and other relevant resources worldwide.  There are \r\n    also \r\n    unique custom search features \r\n    at www.OnTheShortList.com for business location research through the contents of this website and many other \r\n    resources."
    },
    {
      "tag": "p",
      "text": "Our 7 year analysis of \r\n    investment project trends by state and our analysis of economic development lead generation costs per job created may also be of interest. Our April 2006 newsletter (4 pages \r\n    with graphs) summarizes this market research and analysis, including a 12 \r\n    year chart of major project announcements. Our work is analogous to a concierge  service, \r\n    personally assisting executives to invest in the growth of their companies anywhere \r\n    by introducing valuable contacts in confidence. We organize and share valuable market \r\n    knowledge and networks of contacts in a globally consistent way through targeted market research \r\n    and relationship development work. This \r\n    helps company executives, community leaders, and service providers to meet. Contact us (TEL 847-304-4655) to discuss business expansion interests in confidence. Our independent marketing, research,  relationship development, \r\n    and well-qualified referral work can share knowledge of service capabilities \r\n    and benefits to advance the marketing interests of : Economic development professionals Professional services providers We can introduce relevant executives and their advisors to \r\n    the benefits you offer.  See how to request a relevant directory listing (free) , and our suggestions for reciprocal links . State economic development professionals who \r\n    are responsible for attracting business investment and providing site \r\n    selection assistance to executives and their consultants were invited in \r\n    April 2006 to provide an informative article on this simple topic : \"Why \r\n    should a business invest in your state?\" The article content and size \r\n    was entirely discretionary to share their point of view as a free service to \r\n    our 500,000+ visitors in 2006. We publish their \"Point of View\" articles here for convenient reference by executives.  \r\n    Other replies will be published once they are received from the remaining \r\n    state officials."
    },
    {
      "tag": "div",
      "text": "\"Point of View\" articles were contributed by many \r\n    state economic development officials :"
    },
    {
      "tag": "p",
      "text": "Why invest \r\n    in ? Alabama Idaho Iowa Missouri New Hampshire New Jersey North Dakota Oklahoma Oregon Pennsylvania Utah Virginia Wisconsin We have added relevant links to other content we provide \r\n    from these article pages. Many states did not yet \r\n    reply to this free offer, despite reminders and assurances that they \r\n    intended to do so."
    },
    {
      "tag": "div",
      "text": "State directories of US regional, county, city, and \r\n    utility economic development organizations and chambers of commerce which \r\n    promote new business investment"
    },
    {
      "tag": "p",
      "text": "Northeast NY CT MA RI NH VT ME Mid-Atlantic PA NJ MD DE DC WV VA NC Southeast SC GA FL AL MS TN Great Lakes KY OH MI IN IL WI MN North Central MO IA KS NE ND SD South Central TX OK AR LA Mountain AZ NM CO UT WY ID MT West Coast CA NV OR WA HI AK Economic \r\n    development directory - alphabetical list by state for convenience Same links as \r\n    provided by the abbreviations at left (not familiar to all foreign visitors) See how to request a relevant \r\n    directory listing Alabama Alaska Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North \r\n    Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South \r\n    Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming"
    },
    {
      "tag": "div",
      "text": "Were you at the BIO 2006 conference in Chicago, or \r\n    will you be at other events where we could meet?  We attend various trade shows and \r\n    professional events each year for networking purposes."
    },
    {
      "tag": "p",
      "text": "Contact us (TEL 847-304-4655)  if you would like to meet to introduce ourselves."
    },
    {
      "tag": "div",
      "text": "Our Event Recall feature makes it easy to discover which areas are promoting themselves to \r\n    target industries through events such as trade shows.  Our biotech directory is one example."
    },
    {
      "tag": "p",
      "text": "There is also an Ad Recall feature to highlight areas which are known to advertise, such as to easily \r\n    find their ads, websites, and contacts through search tools.  Anew Ad \r\n    Recall feature highlights advertisers in fDi magazine ."
    },
    {
      "tag": "div",
      "text": "Newsletter - October \r\n    2005 (.pdf) Tips on using Google for business location selection searches, with information about 2005 progress and our 2006 marketing plans. Newsletter - November 2005 (pdf) Launching \r\n    our new website www.OnTheShortList.com and \r\n    our \r\n    new custom Google site search features - Area Search , USA Search , CRE Search , \r\n    etc."
    },
    {
      "tag": "p",
      "text": "Anew book in 2006 by a veteran site selection consultant \r\n    may also be of interest. Location \r\n    Location Location : A Plant Location and Site Selection Guide"
    },
    {
      "tag": "div",
      "text": "We expect 550,000+ visitors in 2006 to take advantage of the \r\n    extensive \r\n    information we share about economic development agencies and professional services.  \r\n    That is up 175%+ from 200,000 \r\n    visits in 2004 - the year when we launched this website.  \r\n    See our daily visit or monthly visit graphs and regional analysis .  After only 3 years, our visit levels already \r\n    exceed most of the specialty magazines in this market even though they have \r\n    been in circulation for 20 - 50 years. This is a personal service for executives and advisors - not just website \r\n    content and links.   Tell us what you need to find for your \r\n    project, and we will help you in confidence."
    },
    {
      "tag": "p",
      "text": "Although we make it easy to find thousands of useful \r\n    resources worldwide through this website, we primarily share market \r\n    knowledge personally in response to specific requests from executives about \r\n    their interests, such as well-qualified referrals . Please contact us to discuss how our work could support your interests. We apply our research capabilities and extensive networks of \r\n    contacts and working relationships beyond the extensive published content of \r\n    this website.  We are also experimenting with Google Groups as another way to openly \r\n    share market knowledge. Virus warning : Hackers continue to spoof our published e-mail address or use fictitious \r\n    addresses with our domain name as they send out spam or infected messages.  \r\n    Messages which may appear to be from us do not actually come from any of our \r\n    systems.  Please refer to our latest information about known attacks of \r\n    this nature."
    },
    {
      "tag": "div",
      "text": "Our actual outbound e-mails to our contacts are sent from an \r\n    unpublished address, and are very specific in their subject lines about the \r\n    content.  They rarely have any file attachments unless the recipient \r\n    knows us well and is expecting to receive the file per prior correspondence."
    },
    {
      "tag": "p",
      "text": "The new website includes some unique \r\n    search features, such as those highlighted through links below (Area Search, \r\n    USA Search, CRE Search, etc.).  These make it easy for executives and \r\n    their advisors to selectively \r\n    search relevant websites for additional details beyond the executive summary content \r\n    and links which we provide."
    },
    {
      "tag": "div",
      "text": "Area Search Corporate Real Estate Search Professional Search Media Search USA Search Europe Search Event Search Professional Biographies Invest USA Directory Invest in Europe Directory US Governors Directory Technology clusters and parks Area Profiles Global Contacts Directory US Foreign-Trade Zones BRAC military base closures Area Surveys Selective property listings HR \r\n    contacts and data Ad Recall Event \r\n    Recall Projects by location Consultant Tips Project management Demographic data pointers Projects by industry Corporate Real Estate Firms GIS map tools Market research sources Service Profiles Site \r\n    Selection Consultants Tax or Legal Advisors Credits & Incentives Consultants Regional directories of economic development \r\n    organizations and foreign \r\n    direct investment (FDI) or investment promotion agency contacts, and related sources. US \r\n    : Northeast US : \r\n    Great Lakes Canada Mexico US : Mid Atlantic US : North Central US \r\n    : Mountain South \r\n    America US \r\n    : Southeast US : South Central US : West Coast Central America, Caribbean Europe South \r\n    Asia Australia, New Zealand Middle \r\n    East , and Africa China, \r\n    Taiwan Southeast Asia Korea Japan Congratulations : to Grameen Bank, Bangladesh - and to economist Muhammad \r\n    Yunus"
    },
    {
      "tag": "p",
      "text": "Congratulations to 2006 Nobel Peace \r\n    Prize Laureate Muhammad Yunus and the Grameen Bank he founded to promote \r\n    local economic development and alleviate poverty through microcredit \r\n    programs. These enabled small groups of poor people in Bangladesh to \r\n    access unsecured loans in very small amounts for their own self-help \r\n    business efforts which would not be possible through the traditional bank \r\n    loan processes.  This made it possible for many poor people to find \r\n    their own path out of poverty through their work and savings, rather than \r\n    rely on high-cost sources of capital or continuous government aid, social \r\n    programs, or charity.  This development model has been repeated \r\n    elsewhere as an effective approach to poverty reduction challenges, and \r\n    adopted by various non-profit charitable organizations as a way to leverage \r\n    the economic impact of their limited resources. The Nobel Lecture by the winner, typically in December, \r\n    should be a very interesting presentation, as was the 2004 Lecture when  Prof. Wangari \r\n    Muta Maathai of Kenya won it for her Green Belt Movement's contributions to sustainable development, \r\n    democracy and peace.."
    },
    {
      "tag": "div",
      "text": "http://www.nobelpeaceprize.org"
    },
    {
      "tag": "p",
      "text": "http://nobelprize.org/nobel_prizes/peace/laureates/2006/ One of the interesting concepts promoted by Muhammad Yunus \r\n    and others \r\n    is the idea of \"non-loss\" companies with a clear social purpose as their \r\n    main objective.  In short, they are managed like for-profit business \r\n    ventures, but are not managed for profit maximization, but rather to \r\n    maximize the desired social impact of their work. This differs from the typical nature of \"non profit\" \r\n    organizations, which may similarly focus on trying to achieve good social \r\n    outcomes, but perhaps more from the perspective of raising and distributing \r\n    money or other benefits as charity rather than by managing the process for \r\n    demonstrable results as in a business venture. In other words, a non-profit may measure activity (how \r\n    much it has given away and to how many) rather than results (what has been \r\n    changed to achieve sustainable social or economic progress beyond immediate \r\n    crisis-response).  This concept of business-like social ventures has \r\n    started to catch on with philanthropic business leaders who want to achieve \r\n    lasting results, as reflected in some of the resources listed in our Humanitarian / \r\n    Philanthropy directory ."
    },
    {
      "tag": "div",
      "text": "Tip : See Display if the full width of any page does not appear in your \r\n    browser, or if you are having trouble with a pop-up blocker when you use \r\n    navigational links or buttons.  Many links open new windows to make it easy to explore interests, \r\n    compare content, and then come back to the original page by just \r\n    closing the window.  There are no pop-up ads ."
    },
    {
      "tag": "p",
      "text": "This website was designed for high resolution \r\n    display settings (1280x1024 or higher) as typically used by the executives \r\n    and professionals we serve, instead of older display standards.  More \r\n    scrolling may be required at lower resolution settings.  We regret any \r\n    inconvenience to users of lower resolution display settings who may need to \r\n    scroll more than we anticipated."
    },
    {
      "tag": "p",
      "text": "Send questions, suggestions, or comments about this site to enquiries@gdi-solutions.com . Global Direct Investment Solutions, PO Box 439  Fox River \r\nGrove, IL 60021-0439  TEL 847-304-4655  FAX 847-304-5375 The use of graphics and advertising has been  minimized to \r\nimprove performance. Copyright  2002, 2003, 2004, 2005, 2006  \r\nGlobal Direct Investment Solutions, Inc.     \r\n\r\n\r\nLast modified: \r\n09/02/06"
    }
  ]
}