{
  "url": "http://www.gse.buffalo.edu/programs/tei/undergrad/",
  "file_number": "470",
  "content_hash": "fba3c1c3ddd03b4c986a9bff16d0305bb7a482af616af57825c3b722db59a13a",
  "total_blocks": 111,
  "retained_blocks": 65,
  "ignored_blocks": 46,
  "blocks": [
    {
      "tag": "div",
      "text": "Prospective Students | Current Students | Faculty & Research | Alumni | News & Events | Programs | Apply Online"
    },
    {
      "tag": "h3",
      "text": "Programs"
    },
    {
      "tag": "h4",
      "text": "Departments and Centers"
    },
    {
      "tag": "div",
      "text": "Counseling, School and Educational Psychology (CSEP) Educational Leadership and Policy (ELP) Learning and Instruction (LAI) Teacher Education Institute (TEI) Undergraduate Minor in Education"
    },
    {
      "tag": "h4",
      "text": "Programs Offered"
    },
    {
      "tag": "div",
      "text": "Doctorate Degrees Masters Degrees Teacher Preparation Administrative Certification Advanced Certificates Undergrad Minor in Education"
    },
    {
      "tag": "h4",
      "text": "Continuing Education"
    },
    {
      "tag": "div",
      "text": "Non Matriculated Doctoral Seminars Education Outreach Series"
    },
    {
      "tag": "p",
      "text": "You Are Here: GSE Home > Programs > TEI > Undergraduate Minor in Education"
    },
    {
      "tag": "h3",
      "text": "Undergraduate Minor in Education"
    },
    {
      "tag": "h4",
      "text": "The Program"
    },
    {
      "tag": "p",
      "text": "The Teacher Education Institute does not offer a program leading to an undergraduate degree, however it does offer undergraduate students a minor in education that introduces students to the profession of education and provides students an opportunity to explore education as a career and obtain a head start on their coursework leading to initial teacher certification through the University at Buffalos graduate school program, but this minor cannot in itself lead directly to teacher certification . Although intended for those who will pursue certification in Adolescence education (Grades 7-12), the minor can be adapted for those interested in Early Childhood Education (birth to Grade 2) and/or Childhood Education (Grades 1-6)."
    },
    {
      "tag": "h4",
      "text": "Acceptance Criteria"
    },
    {
      "tag": "p",
      "text": "Registration is open to students who formally apply to the minor and who receive confirmation of acceptance prior to registration.  Applications to the minor must be filed with the Teacher Education Institution (TEI) office in 375 Baldy Hall.  Applications must include UB DARS report and/or official transcripts from all institutions attended other than UB.  Students must have a minimum GPA of 2.5 for admission."
    },
    {
      "tag": "h4",
      "text": "Course Sequence"
    },
    {
      "tag": "p",
      "text": "The minor in education consists of 19 credits as described below."
    },
    {
      "tag": "h5",
      "text": "Required Courses"
    },
    {
      "tag": "p",
      "text": "Educational Foundations (10 credits):"
    },
    {
      "tag": "div",
      "text": "LAI  350         Introduction to Education (4 credit hours) CEP 400          Educational Psychology (3 credit hours) * ELP 405          Sociology of Education (3 credit hours) *, +"
    },
    {
      "tag": "h5",
      "text": "Electives"
    },
    {
      "tag": "p",
      "text": "At least 9 credits (3 courses) chosen from the following electives:"
    },
    {
      "tag": "div",
      "text": "LAI 205 Introduction to Child Development & Learning +, # LAI 414 Language, Cognition, and Writing * LAI 416 Early Childhood Education Theory & Practice LAI 474 Teaching the Exceptional Learner +, # LAI 490 Seminar and Practicum in Early Childhood CEP 401 Introduction to Counseling CEP 404 Introduction to the Rehabilitation of Substance Abuse & Addiction CEP 453 Introduction to Rehabilitation"
    },
    {
      "tag": "p",
      "text": "* May be applicable to Adolescence initial teacher certification program at UB +  May be applicable to Childhood initial/professional teacher certification program at UB #  May be applicable to  Early Childhood initial/professional teacher certification program at UB"
    },
    {
      "tag": "h4",
      "text": "Recommended Sequence of Courses"
    },
    {
      "tag": "h5",
      "text": "First Year (sophomore year)"
    },
    {
      "tag": "p",
      "text": "Spring: LAI 350 (prerequisite for CEP 400 & ELP 405)"
    },
    {
      "tag": "h5",
      "text": "Second Year"
    },
    {
      "tag": "p",
      "text": "Fall: CEP 400, ELP 405 (prerequisite for LAI 414) Spring: LAI 414 or elective"
    },
    {
      "tag": "h5",
      "text": "Third Year"
    },
    {
      "tag": "p",
      "text": "Fall: Two courses from the list of electives The first course (LAI 350) in the minor is an introductory course that is not part of the required coursework for certification.  It does, however, have a field experience component, and early field experiences are required in the latest NYS Education Department regulations. The next two courses, CEP 400 and ELP 405, can be used to meet requirements for initial certification as an Adolescence teacher.  The final three courses in the minor are electives, which may also meet teacher certification course requirements (depending upon which curricular option the student eventually pursues). Students who take CEP 400, ELP 405, and LAI 414, and complete them successfully, and who later pursue a UB program leading to initial teacher certification at the Adolescence level may include these courses in their coursework toward initial certification (but not the masters degree).  This allows students to have a 9-credit head start toward their initial certification."
    },
    {
      "tag": "h4",
      "text": "Provisional Admission into the Teacher Certification Program"
    },
    {
      "tag": "p",
      "text": "Students who have completed 75 undergraduate credits in an approved major with a minimum GPA of 3.0 can apply on-line to an initial certification (i.e., advanced certificate without an Ed.M. degree) or initial/professional certification program (with Ed.M. degree) for provisional admission pending completion of their undergraduate degree.  Students who have been provisionally admitted and who have completed 90 undergraduate credits may take two graduate level education courses (upon advisement) and include them in their graduate program in education."
    },
    {
      "tag": "h4",
      "text": "Graduate Teacher Certification Program"
    },
    {
      "tag": "p",
      "text": "If you are interested in pursuing teacher certification through our graduate adolescence initial or initial/professional teacher certification program curricular options, the following information regarding undergraduate degree and distribution requirements will assist you as you plan your undergraduate coursework."
    },
    {
      "tag": "h5",
      "text": "English"
    },
    {
      "tag": "p",
      "text": "Abaccalaureate degree in English, which includes at least 30 hours of coursework in English."
    },
    {
      "tag": "h5",
      "text": "Languages Other Than English"
    },
    {
      "tag": "p",
      "text": "Abaccalaureate degree in an approved Foreign Language, which includes at least 30 hours of coursework in the Foreign Language."
    },
    {
      "tag": "h5",
      "text": "Mathematics"
    },
    {
      "tag": "p",
      "text": "Abaccalaureate degree in Mathematics, which includes at least 30 hours of coursework in Mathematics. The following mathematics distribution must also be met:"
    },
    {
      "tag": "div",
      "text": "2 courses in linear and/or abstract Algebra 2 courses in Calculus 1 course in Geometry"
    },
    {
      "tag": "h5",
      "text": "Music"
    },
    {
      "tag": "p",
      "text": "A Bachelors degree in Music Performance is required. In addition, the following academic distribution is required. Academics/Performance:"
    },
    {
      "tag": "div",
      "text": "4 courses in Music Theory 2 courses in Music History 2 courses in Conducting 4 courses in a primary instrument (including voice) Semester and year of public recital needed Keyboard Proficiency Exam Secondary Instrument Proficiency: Woodwinds Brasses Percussion Strings"
    },
    {
      "tag": "h5",
      "text": "Social Studies"
    },
    {
      "tag": "p",
      "text": "Abaccalaureate degree in History or one of the Social Sciences (Anthropology, Sociology, Geography, Economics, or Political Science), which includes at least 21 credits in History or Geography and one Economics and one Political Science course. It is necessary to have the following history/civilization distribution:"
    },
    {
      "tag": "div",
      "text": "6 credits in U.S. History 6 credits in U.S. Civilization 6 credits in Western Civilization 12 credits in World Civilization"
    },
    {
      "tag": "p",
      "text": "The following social sciences distribution is required.  Two courses in each of three social sciences:"
    },
    {
      "tag": "div",
      "text": "Political Science Geography Economics Sociology Anthropology Psychology or Philosophy"
    },
    {
      "tag": "p",
      "text": "(There may be up to 12 credits overlapping between the above distribution groupings) Note: Philosophy and Psychology may be used to fulfill the social science distribution requirements, but are not acceptable as majors leading to social studies certification."
    },
    {
      "tag": "h5",
      "text": "Science"
    },
    {
      "tag": "p",
      "text": "Abaccalaureate degree with at least 30 hours of coursework in your intended certificate area (Biology, Chemistry, Earth Science, or Physics). In addition, the following academic distribution is required for every Science specialty certificate."
    },
    {
      "tag": "div",
      "text": "3 credits in Biology 3 credits in Chemistry 3 credits in Earth Science 3 credits in Physics"
    },
    {
      "tag": "p",
      "text": "If you are interested in pursuing teacher certification through our graduate early childhood and/or childhood initial/professional teacher certification program curricular options, the following information regarding undergraduate degree requirements will assist you as you plan your undergraduate coursework. University at Buffalos Approved Undergraduate Majors for Teacher Certification"
    },
    {
      "tag": "div",
      "text": "Anthropology Art Art History Biochemistry Biological Studies Chemistry Classics Dance Economics English French Geography Geological Sciences German History Italian Japanese Linguistics (English to Speakers of Other Languages ONLY) Mathematics Music Physics Political Science Russian Social Sciences Interdisciplinary\r\nHealth & Human Services: Early Childhood Concentration only Spanish Theater"
    },
    {
      "tag": "p",
      "text": "Admission to all graduate initial and initial/professional teacher certification program curricular options requires applicants to complete a baccalaureate degree with a minimum 30 credit hour major appropriate to the certification area.  Additionally, applicants must complete the following general education core in liberal arts and sciences (for course examples, refer to the Undergraduate Catalogue at http://undergrad-catalog.buffalo.edu/index.shtml )."
    },
    {
      "tag": "div",
      "text": "Arts/Artistic Expression (3 credits) Humanities (3 credits) Writing/English Composition (3-6 credits) World Civilization (6 credits) Social and Behavioral Sciences (3 credits) American Pluralism or equivalent (3 credits) Natural Sciences, lab-based biology, chemistry, geology, or physics (6 credits) Mathematical Processes (3 credits) Depth Requirement (3 credits) Language other than English (2nd semester college course) Library Skills/Information Retrieval (online workbook)"
    },
    {
      "tag": "p",
      "text": "Note: Philosophy, psychology, and sociology may be used to fulfill the social science requirements for the general education core in liberal arts and sciences, but are not acceptable as majors for admission to teacher certification programs at the University at Buffalo, except as stated for those interested in pursuing social studies teaching in grades 7-12."
    },
    {
      "tag": "h5",
      "text": "TEI Staff"
    },
    {
      "tag": "p",
      "text": "TEI Staff listing is available here ."
    },
    {
      "tag": "h5",
      "text": "Application Information"
    },
    {
      "tag": "h6",
      "text": "Contact Information"
    },
    {
      "tag": "p",
      "text": "Teacher Education Institute Graduate School of Education University at Buffalo 375 Baldy Hall Buffalo, NY 14260 Telephone: (716) 645-2461 Fax: (716) 645-3631 email: gse-info@buffalo.edu"
    },
    {
      "tag": "h6",
      "text": "Application Download"
    },
    {
      "tag": "p",
      "text": "Download the Undergraduate Minor in education form Graduate School of Education ©2006 Graduate School of Education, University at Buffalo. All rights reserved. Disclaimer | Site Map | Contact Us"
    }
  ]
}