{
  "url": "http://www.gtaforums.com/index.php?showtopic=175345",
  "file_number": "471",
  "content_hash": "28c13f678e3d033862d47ccaa17426622d4b876b5498fd9f77a7423ef04b41d1",
  "total_blocks": 105,
  "retained_blocks": 7,
  "ignored_blocks": 98,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""
    },
    {
      "tag": "div",
      "text": "Network GTA Network GTA Forums GTA4 Vice City Stories Liberty City Stories GTA San Andreas GTA Vice City GTA3 GTA Garage GTA Modding Forum Tools • Search • Members • Calendar • Help Announcements • Announcements GTA Series • GTA4 • Vice City Stories - General Discussion - Gameplay • Liberty City Stories - General Discussion - Gameplay - Cheats and Tricks - Cheat Device Maps • GTA San Andreas - General Discussion - Troubleshooting - General PC Chat - Gameplay - Mission Help - Cheats and Tricks • GTA Vice City - General Discussion - Troubleshooting - General PC Chat - Gameplay - Cheats and Tricks • GTA3 - General PC Chat - Troubleshooting - Gameplay - Cheats and Tricks • GTA Advance • Old Skool - GrandTheftAuto Chat - GTA2 Discussion - Editing Forum GTA Modding • Editing Discussion - Vehicles - Maps - Mission Coding - Textures & Modelling - Tutorial Forum - Recruits & Requests - Troubleshooting - Misc. • Mod Showroom - Mission Mods - Maps - Player Skins - Vehicles - Miscellaneous • Hosted Mods - San Andreas Multiplayer - Vice City Multiplayer - Myriad Islands - GTA: Liberty City Community • The Lounge - General Chat (Off-Topic) - Gaming Chat - PC Chat - WD&P - Movies & TV - Music Talk - Sports Discussion - Vehicle Talk • Expression - GFX Discussion - GFX Requests & Tutorials - Writer's Discussion - Debates & Discussion The Network • GTA Network Team • Suggestions Gangs • Public Gang Chat • Recruitment"
    },
    {
      "tag": "div",
      "text": "This menu has been disabled"
    },
    {
      "tag": "div",
      "text": "GTAForums.com Board Message Sorry, an error occurred. If you are unsure on how to use a feature, or don't know why you got this error message, try looking through the help files for more information. The error returned was: Sorry, the link that brought you to this page seems to be out of date or broken. You are not logged in, you may log in below"
    },
    {
      "tag": "div",
      "text": "Your account username Your account password"
    },
    {
      "tag": "div",
      "text": "Useful Links · Forgotten Password Recovery · Register a new account · Our help documentation · Contact the forums administrator < Go Back"
    },
    {
      "tag": "div",
      "text": ". Powered by Invision Power Board (U) v1.3 Final © 2003 IPS, Inc. Content and Design © 2001-2005 GTA Network.com"
    }
  ]
}