{
  "url": "http://www.gu.edu.au/school/art/text/oct02/letters.htm",
  "file_number": "472",
  "content_hash": "bde6dbc7deac64b8b85c3970cb35d6d70c9e55ab295a754b5a7916acd3e957b6",
  "total_blocks": 103,
  "retained_blocks": 9,
  "ignored_blocks": 94,
  "blocks": [
    {
      "tag": "h1",
      "text": "TEXT The Journal of the Australian Association of Writing Programs"
    },
    {
      "tag": "p",
      "text": "Letters to the Editor The April 2002 issue of Text carried an article by Kevin \r\n        Brophy on the prose poem. This article attracted several responses. \r\n        Tom Shapcott's and Moya Costello's are printed below. from Tom Shapcott"
    },
    {
      "tag": "blockquote",
      "text": "Dear Tess and Nigel"
    },
    {
      "tag": "p",
      "text": "Thanks for the new issue of TEXT. Iwas interested to read Bill Manhire's \r\n        piece and agreed with much it said and especially the concept of opening \r\n        students to the concept of reaching into the dark. This ties in with the \r\n        article on the Prose Poem by Kevin Brophy and Iwould like to offer a \r\n        'response' to Kevin's piece. THE PROSE POEM IN AUSTRALIA - AND ELSEWHERE In his article The Prose Poem: A Short History, a Brief Reflection \r\n          and a Dose of the Real Thing Kevin Brophy gives a quick reading \r\n          of the history of this genre, beginning in France with Baudelaire and \r\n          finding, it would seem, some sort of fringe habitation in America. Brophy \r\n          then goes on to relate difficulties he has had in persuading his students \r\n          to attempt the forrn. Ibelieve his 'difficulties' possibly relate to two things. Firstly, \r\n        from his article he seems not to have taken account of any Australian \r\n        attempts to develop the form, and secondly, the sense of resistance he \r\n        notes might be aligned with attempts to persuade students to write poetry \r\n        at all. This latter statement of mine is, perhaps, overstressing the point, \r\n          but Ithink many teaches of creative writing have found a certain resistance \r\n          among students to attempt poetry outside the old 'mainstream' formal \r\n          structures. This, in my experience, relates back to the general Australian \r\n          resistance to any forms of modernism in the 20th century and a suspicion \r\n          of experimentation as a self conscious literary device. At the basic level, new students often have great difficulty in even \r\n          writing about their local environment. Something far off, fantastic \r\n          (or fantasy-ful) or glamorous is often the instinctive choice. How many \r\n          futuristic or Gothic or Neanderthal epics have we seen from beginners? \r\n          To harness writers down to naming specific streets or suburbs is an \r\n          early but major task. To make the leap beyond habitation and specific \r\n          perception into the subjective dislocations and leaps of association \r\n          implicit in the prose poem is a leap indeed. Perhaps if we had an anthology of the Prose Poem in Australia the task \r\n        os teachers might be considerably lightened. And some very exciting possibilities \r\n        opened up. In 1982 when Iwas writer-in-residence at Deakin University in Geelong \r\n          their magazine Mattoid published an interview with me on the \r\n          prose poem. This was reprinted in 1990 in my collection of essays, Biting \r\n          the Bullet (Simon & Schuster) and in that Igave not only a \r\n          run-down on the development of the form, from 19th century France to \r\n          modern English explorations of the genre, most notably in the U.S. (and \r\n          leaning on Latin American exemplars, which in the 1960s became suddenly \r\n          available in translation in the States). Kevin Brophy does not mention \r\n          the great rise of prose poems in the Latin America, nor Europe, but \r\n          these were pertinent phases. When Mark Strand and Charles Simic published Another Republic in 1976 (Ecco NY) they made a major step in \r\n          introducing 17 contemporary poets in English translation. Of these, \r\n          no less than seven were represented with prose poems, several of them \r\n          entirely in this form: Francis Ponge, Henri Michaux, Zbigniew Herbert, \r\n          Julio Cortazar, Octavio Paz, Miroslav Holub and Italo Calvino. Most \r\n          of these names are now well know, even in Australia. My interview article explored some of the reasons these took hold in \r\n        the creative minds of an important segment of American poets. What Idid \r\n        not mention was that American poetry at that stage had already massively \r\n        broken with old formal traditions, and 'field poetry' offered an even \r\n        greater sense of flexibility and layout experiment than the prose poem. \r\n        Nevertheless, it can be said the prose poem did establish its place and \r\n        there are many more collections of great interest published than is hinted \r\n        at in Kevin Brophy's (admittedly concise) article. The development of the form in Australia was outlined in my piece, \r\n          and it might be useful to re-print it at the end of this small response. \r\n          Ihad been interested - and still am - in the concept of an anthology \r\n          of prose poems from Australia, though to date Ihave not managed to \r\n          interest a publisher. Perhaps it is now time. When Iedited the UQP verse anthology The Moment Made Marvellous in 1998 Iincluded prose poems by Pamela Brown, Joanne Bums, Gary Catalano \r\n          and Judith Rodriguez (her Borges at 73 also invokes one of the \r\n          most influential of the influential Latin American experimenters in \r\n          the form, seen at its most expansive and flexible). Certainly as a technique, the prose poem continues to attract Australian \r\n          poets and there are a considerable number of book-length collections \r\n          that have been published here. Icould list, for instance, Andrew Taylor's Parabolas (which as Imentioned in my Mattoid interview was \r\n          the first book of prose poems to be published in this country), two \r\n          books by Bruce Beaver ( Headlands UQP 1986 and As It Was UQP 1979), two by myself ( Turning Full Circle New Poetry 1979 \r\n          and Stump and Grape and Bopple-nut Bullion 1982), several stunning \r\n          books by Gary Catalano (including Fresh Linen , UQP 1988), Ania \r\n          Walwicz, Laurie Duggan (including the award-winning The Ash Range , \r\n          Picador 1987), Rodney Hall's The Most Beautiful World (UQP \r\n          1981), all of Philip Hammiell's books from 1976 to 1994, Rudi Krausmann's From Another Shore (Wild & Woolley 1975), Gerard Lee's Manual For a Garden Mechanic (1976), Alison Croggon's Nevigato (Black Pepper 1996), and books by Pamela Brown, Joanne Bums and Anna \r\n          Couani. And that is only skimming the surface. In addition, many Australian poets have published occasional prose \r\n          poems which are included in their general collections: Chris Wallace-Crabbe, \r\n          David Malouf and Kevin Hart, on to M.T.C.Cronin, Luke Davies, John Scott, \r\n          John Kinsella and Michael Sarabin, again to name only a few. What these lists do suggest is that as a distinct genre, the prose \r\n          poem in Australia is alive and well. Probably in better health than \r\n          the Sestina, the Sonnet or the Haiku. The advantage of an anthology, now, would be to suggest to teachers of \r\n        creative writing in Australia something of the Australian development \r\n        of the form. And it has taken, Ithink, specifically Australian resonances. \r\n        If it could be said to remain essentially lyrical in its preoccupation \r\n        with language (and even cadence), it is more gently satirical and sometimes \r\n        even rueful than its American counterparts. It has less anger, more stoicism. \r\n        Less extravagance, more essential caution. We are, let us remember, a \r\n        supremely cautious people. The Tampa affair has, most recently, all too \r\n        clearly illustrated that. But the Australian evolution of the prose-poem is no merely pallid \r\n          thing, a sort of pale reflection of the wan English versions (and, as \r\n          with recent English art works which set out to shock, the English prose \r\n          poem has a terrible posing safety-pin-in-the-nostril and stud-in-the-penis \r\n          determination that merely chafes). It also has something of the Australian \r\n          laconic wit and defiance, and it can get under the skin of the more \r\n          conventional verse structures, which bear the ghostly train of the measured \r\n          cadence still. As Kevin Brophy says, the prose poem is subversive. That \r\n          is something Australians have always been good at, even if they are \r\n          outwardly cautious and conformist. If young readers could see something \r\n          of the range and scope that has evolved over the last generation of \r\n          our poets, they might be more able to see for themselves how and where \r\n          the adventure might take them."
    },
    {
      "tag": "blockquote",
      "text": "THE 1982 INTERVIEW WITH MATTOID: ON PROSE POETRY"
    },
    {
      "tag": "p",
      "text": "Mattoid: Could we start, Tom, by discussing the genre of the prose \r\n            poem? There seems perhaps a contradiction of terms here. Poetry and \r\n            prose are separate matters, how can you put them together and expect \r\n            them to be a 'real' form? What do you think a prose poem can do that \r\n            either a poem or prose can't do? Tom Shapcott: Your statement that it seems a contradiction in terms \r\n            is the point at which the prose poem began. Most true prose poems \r\n            operate from a sense of contradiction or I'd prefer to say the tension \r\n            between certain sorts of claims being made upon language. The basic \r\n            claims are the demands of an innate lyricism and the demands of prose \r\n            realism. Ithink the genre as it has evolved in the last 120 or 130 \r\n            years or so has tried to make use of the intrinsically dramatic conflict \r\n            involved. To place it in its historical perspective: the first sustained \r\n            attempts were by Charles Baudelaire - works written as a result of \r\n            heightened states through drug-taking. It was the urgency of getting \r\n            something down, I'm sure, that made him write these as prose. He was \r\n            a superb craftsman, and he discovered that something came through \r\n            which was different from what would have resulted had he attempted \r\n            it in a stanzaic form. There are precursors to that sort of discovery: \r\n            in the English language Walt Whitman used a non-stanzaic loping structure \r\n            at a time when it was a real innovation; this was based on the dynamics \r\n            of the Hebraic psalms, which involve a counterbalance in each sentence. \r\n            But Baudelaire's prose poems opened up further ways - they were celebratory, \r\n            in other words, lyrical, but they used the language of ordinary conversational \r\n            discourse. And it was through the conflict between these two forces \r\n            that something inherently different came out. The French tradition \r\n            ever since has explored this. In English, such experimentation was \r\n            much slower. Eliot's early attempts were quasi-translations of the \r\n            French, and he later abandoned the form. Then, in the 1920s and 1930s, \r\n            other (mainly American) writers made sporadic experiments... M: Your summary of the prose poem's origins and relationships raises \r\n            several interesting points about the form. Just before we pursue those, \r\n            though, could you bring your survey up to date? TS: American, English, even Australian poets had done the odd little \r\n            exercise. from the 1920s onward. But the form in English came to a \r\n            new stage of richness from the late 1950s when American poets started \r\n            using the prose poem in a serious and sustained way. This was through \r\n            their postwar interest in European and especially Spanish-language \r\n            poetry and translations. The Spanish-speaking countries had, as it \r\n            were, spontaneously fallen for the combination of vigour and violence \r\n            implicit in the structure. In Australia, Chris Wallace-Crabbe was \r\n            the first poet to tackle it seriously as a form. He was influenced, \r\n            though, by the French prose poem, which had become a much more elegant \r\n            and almost 'courtly' study in layers of irony. Through the last decade \r\n            the Americans have widely explored the possibilities of the clash \r\n            between the extrovert dynamism and greed and introverted idealism \r\n            and despair, and the prose poem allowed them to hit the raw nerve \r\n            of the subconscious - wham - in a way that had only been tentative \r\n            before - say, in the work of e e cummings... M: To pursue that question of form and expectations: if the line-breaks \r\n            in a poem suggest how we should read it, what means does the prose \r\n            poem have of directing the expectations we bring to it? TS: Very often the 'poetic' part of the prose poem is expressed through \r\n            an appeal to illogic: to states of receptivity which deny what we \r\n            have come to expect prose to offer - that is, rational discourse, \r\n            descriptive clarity, even rhetoric in its conventional sense of persuasion, \r\n            of using language to set certain cogs in motion. The prose poem creates \r\n            its lyrical frisson by pointing the reader's anticipatory glands in \r\n            that direction, and then somehow working a change ... Also, the prose \r\n            poem seems very much a present-tense form. It operates on a sense \r\n            of immediacy: Iam doing this, this is happening to me. And that's \r\n            immediately conducive to a dream state, because a dream has exactly \r\n            that things-are-happening-to-me-now feeling. What's implicit is that \r\n            Iam a passive receiver of certain things. Things flow around the \r\n            \"I\". This has become characteristic of a lot of prose poetry: \r\n            an observer is operated on by all sorts of things, some magical, some \r\n            absolutely mundane. Often the juxtaposition becomes the active force \r\n            - 'Iam sitting in a car there is a blue pram being wheeled past by \r\n            a lady wearing a pink floral eiderdown...' The naming quality becomes \r\n            important. M: So although some of your prose poems suggest a narrative, that's \r\n            not the important thing? TS: No. But there's another interesting quality of the prose poem \r\n            apart from that surreal experience presented with the openness of \r\n            a passive dream state. This is the implicitly dramatic context of \r\n            a you-and-me. The poem becomes a dialogue between writer and reader. \r\n            Many of the more bizarre elements of a lot of prose poems attempt \r\n            to provoke the reader into participating in what the work offers. \r\n            Sometimes shock tactics are used. Sometimes coercive tactics. M: I've noticed that in some of your prose poems there's also a dialogue \r\n            within yourself, or there's an implied interlocutor, and perhaps very \r\n            occasionally a dramatic impersonation. TS: Yes, though that's less characteristic of the form than the use of \r\n        surrealism. This is a way in which surrealism has become legitimate, opening \r\n        up possibilities that seem not just jejune. M: Are there other ways, then, in which voices, or points of view, \r\n            are important in the prose poem? TS: Isuggest that the best prose poems of the twentieth century \r\n            have all tended to be groups of poems which build up into sequences. \r\n            Octavia Paz, in his book-length Eagle of Sun (the first major \r\n            Latin-American essay in the form, by the way), uses the \"I\" \r\n            as an ordinary person full of practicalities, involved with ordinary \r\n            functions, who is also exploring what it is to be a Mexican, and as \r\n            well having a vision of the old Aztec gods in the present-day world. \r\n            All these things cohere because of the surrealism and typical Spanish \r\n            violence of the juxtapositions, the balance between flat prose and \r\n            highly florid colouration. It only works as a sequence: each small \r\n            piece builds upon the next and upon the next, like infinite variation. M: So you get both the advantage of lyricism, which you mentioned \r\n            earlier, and the more extended scope of prose? TS: This is where the prose poem can develop as a major form. It's \r\n            a way of creating a lyrical epic, if you like, without a narrative \r\n            but with an implied dramatic context, so that all those things we've \r\n            been talking about, tensions within even the essence of the word, \r\n            the words as they cling together in a sentence, are expanded and built \r\n            upon in this larger accretion. The most exciting and successful prose \r\n            poems of the last twenty years have taken this form - such as Italo \r\n            Calvino's Invisible Cities , Robert Bly has also done three \r\n            or four books of prose poems; they're small sequences because Bly \r\n            is always a miniaturist, but all explore that capacity for growth \r\n            through accretion. In Australia, Andrew Taylor's Parabolas was \r\n            a pivotal work, the first book-length collection of prose poems here. \r\n            To mention just a couple of other Australian writers: Anna Couani \r\n            attempts a form closer to the non-narrative short-story but with all \r\n            the lyricism of an eternally displaced present-tense Imentioned before. \r\n            Robert Kenny in Etcetera tries to recreate and explore his \r\n            childhood in the early 1950s: he uses short prose forms that list \r\n            just a few non-essential items suddenly isolated to give that strange \r\n            intensity like an unexpected photograph of a familiar scene. The book \r\n            itself might not 'live' more than a few years, but its importance \r\n            is greater than can be objectively measured: it's already given rise \r\n            to other collections of a similar sort ?? by Laurie Duggan and Denis \r\n            Gallagher, for instance. M: Among the titles you mention Parabolas and your own Turning Full Circle both use the image of the curve, of the \r\n            momentum that comes back to itself. Presumably recurrence is important \r\n            in those sequences of prose poems you're talking about? TS: Yes, that hits very much to the centre. Finding what's within \r\n            the circle. The greatest of all French prose poets must be Francis \r\n            Ponge and his Soap is a great circular pattern of finding and \r\n            refinding...Ihadn't previously traced that as an overriding formal \r\n            focus, though I'd been intrigued by the capacity of the prose poem \r\n            to work through extended groupings - and certainly the 'rondo' or \r\n            'variation' musical forms had seemed somehow parallel. M: Yet in your own Turning Full Circle you do use the image \r\n            of music from time to time so you have that sense of development of \r\n            motif, its recurrence and variation. TS: In my collection there were certain recurring motifs and a self-conscious \r\n            preoccupation with 'turning full circle', of ending up where you started \r\n            - but you never come back to where you started with exactly the same \r\n            perspective. M: Yes, there's no sense of any contrived connections and yet they \r\n            obviously do relate to one another. TS: One has preoccupations in any time of one's life. But others \r\n            which are much more basic come through. For the very last group Ilooked back - and then Itried to do different things, partly because \r\n            Ifelt I'd been following a certain thread, seeing where it led, and \r\n            suddenly Ithought: no, there are other things that can be done too \r\n            in this form. That was where Iintroduced the short-loin chops - to \r\n            create a compressed short-story resonance. Iused a third person there \r\n            as a contrast. The temptation was to bust the form open, try something \r\n            wider... Reading that interview again, these decades later, Iam of course struck \r\n          with the extended book-length prose poem sequence that have been achieved \r\n          in Australia in more recent years. Certainly Laurie Duggan's The \r\n          Ash Range stands out, but also John Tranter's recent Different \r\n          Hands (Folio/Fremantle Arts Centre Press 1998), which calls itself \r\n          'seven stories', comes more truly into the genre of prose poem (and, \r\n          for that matter, some of David Brooks' stories similarly lean in that \r\n          direction rather than as straightforward 'prose'). Imyself have always \r\n          considered my novel White Stag of Exile more truly a prose poem. \r\n          The thing is, Imust maintain, we now have an achieved body of work \r\n          in this form. We should know more about it. Knowing it more closely, \r\n          we can teach it more ably. That is my belief. Tom Shapcott Professor of Creative Writing, University of Adelaide from Moya Costello"
    },
    {
      "tag": "blockquote",
      "text": "To the Editors,"
    },
    {
      "tag": "p",
      "text": "Re Kevin Brophy's paper 'The Prose Poem: A Short History, a Brief Reflection \r\n          and a Dose of the Real Thing' in the April 2002 edition of Text: http://www.gu.edu.au/school/art/text/april02/ brophy.htm , \r\n          Iquote from the paper: While the subversive French poetic form of vers libre was taken up \r\n            by English writers in the modernist era to the point where free verse \r\n            now dominates poetry written in English, there has been no comparable \r\n            interest in the prose poem among English-speaking writers. [my \r\n            emphasis] For the Soundings '97 poetry conference in Adelaide, Idelivered a \r\n          paper on the prose poem (unpublished, though similar comments in it \r\n          appear in my articles 'The Fetishized Fragment'? Nah! 'Flow sucks'! Redout 28 1999 and 'An Effort of Non-compliance' online in M/C Reviews at http://moby.curtin.edu.au/~ausstud/mc/reviews/features/women/effort.html ). \r\n          The conference paper was entitled 'the prose poem says find me'. It's \r\n          a quote from joanne burns' manifesto in that now classic text Poetry \r\n          and Gender from Brooks and Walker (UQP 1989). burns talks of herself \r\n          as 'a hybrid, prose poetie sort of poet'. In the same book Pamela Brown \r\n          says of her prose pieces that they are 'snapshots of conditions. Incidents \r\n          of emotion. Episodes from a long running serial. Chronicles of a transition \r\n          which is never completed'. The best exemplary practitioners of the prose poem to be found anywhere \r\n          at any time are among contemporary Australian women writers (often categorised \r\n          as feminist/experimental), including burns and Brown. Anna Couani and \r\n          Susan Hampton are two more. Brophy comments in his paper: One consequence of the relative neglect of the prose poem in English \r\n            is its lasting presence as a subversive and alternative poetic tradition: \r\n            a permanent shadow thrown by the dominance of free verse; a niggling \r\n            outsider; an exotic and possibly decadent third way somewhere between \r\n            prose and poetry. All of the women Imention above have been working in the form since \r\n          at least the early 1980s. All of them at one stage belonged to the Sydney \r\n          Women Writers' Workshop, a workshop characterised as feminist and experimental, \r\n          and one of its aims for being set up was to counter patriarchal practices \r\n          in writing and publishing. The four women mentioned have, between them, \r\n          have published over 20 books. Hampton's first book Costumes (1981) contained some prose poems gems \r\n          such as 'The Kitchen of Aunty Mi and Aunty Pearl', and her latest fantastic \r\n          book, A Latin Primer (Cerberus 1998), could be said to contain \r\n          one long extended (brilliant) prose poem. Brophy asks and answers his question: What does it feel like then to be writing a prose poem? In her statement in Poetry and Gender burns says: the prose poem, the poem in the prose is more humble, or perhaps \r\n            more patient, more subtle. it knows the potential, the freedom of \r\n            not being too obvious. the prose poem says find me. Anna Gibbs noted in her paper on feminism and fictocriticism (Text \r\n          October 1997): http://www.gu.edu.au/school/art/text/oct97/ gibbs.htm , \r\n          that the prose poem is one of the 'indeterminate forms' of 'literary \r\n          detritus' that fictocriticism makes use of. (Heather Kerr and Amanda \r\n          Nettelbeck edited The Space Between: Australian Women Writing Fictocriticism (UWA 1998), and Gail Jones work in The House of Breathing (FACP \r\n          19992) and Fetish Live s (FACP 1997) is regarded as fictoctiticial. \r\n          These might be places to look further for Australian women writing the \r\n          prose poem.) Iwas very concerned to have my collection of short prose pieces Small \r\n          Ecstasies (UQP 1994) not described as a collection of short stories, \r\n          because it contains a variety of short prose forms, including the prose \r\n          poem. Moya Costello moyacostello@iprimus.com.au Return to Contents Page Return to Home Page TEXT Vol 6 No 2 October 2002 http://www.gu.edu.au/school/art/text/ Editors: Nigel Krauth & Tess Brady TEXT@mailbox.gu.edu.au"
    },
    {
      "tag": "p",
      "text": "webhumans | text version | privacy | copyright matters | disclaimer"
    }
  ]
}