{
  "url": "http://www.harpers.org/TheColumnsOfLiberty.html",
  "file_number": "475",
  "content_hash": "f4891b640d4acd5f6f05aeb9649f45a669b375d953e0e3de38d812e834bb0432",
  "total_blocks": 291,
  "retained_blocks": 24,
  "ignored_blocks": 267,
  "blocks": [
    {
      "tag": "h2",
      "text": "The Columns of Liberty"
    },
    {
      "tag": "h3",
      "text": "Reconstructing the fabric of a demolished government"
    },
    {
      "tag": "div",
      "text": "Posted on Wednesday, February 16, 2005.\n                Acommencement address delivered to the graduating class of Eastern Connecticut State University. Originally from\n               Sunday, May 23, 2004. By John R. MacArthur . Sources"
    },
    {
      "tag": "p",
      "text": "May Ifirst congratulate all the 1141 degree recipients of 2004. I'm not so old that Idon't vividly remember the preceding\n               panic, the relief and the quiet satisfaction that came with getting a Bachelor of Arts degree that, believe it or not, was\n               a rare thing in my immediate and extended family. It wasn't so easy for me then; Iknow it wasn't so easy for many of you—and\n               for all sorts of reasons: financial, emotional and social. So please take a moment to savor your achievement; in fact, why\n               don't you give yourselves a round of applause. But now what do you do? Idon't mean what do you do for work or career; Iwouldn't presume to advise you, especially in this\n               job market. No, when Ipose the question, “what do you do?”, I'm talking about your interior life, your intellectual and ethical life;\n               the life that will inform the whole range of decisions and actions that you will be called upon to make when you become a\n               post-graduate worker—especially where those ethical choices effect your future; your actual earning capacity; your job; your\n               family. And to give you an idea of how you might think about steering your interior life, Iwant to tell a story about someone who\n               was called upon to make a difficult intellectual and moral choice, at a level of governmental power that none of us are ever\n               likely to possess. Let me set the scene for you: It's Washington D.C., 1964. Despite the Soviet-American Cold War, despite the construction of\n               the Berlin Wall, despite the Bay of Pigs debacle in Cuba, despite the subsequent Cuban missile crisis, despite the assassination\n               of President Kennedy; despite the modest commitment of U.S. military advisors to a former French colony called Vietnam, the\n               United States is more or less at peace with the world. Askeptic might say that what existed in 1964 was merely the temporary\n               absence of war, but nineteen years after World War II and just eleven after the Korean War, the absence of war isn't such\n               a bad state of affairs. Inside the Administration of President Lyndon Johnson, however, a ferocious but as yet hidden argument is taking place that\n               has everything to do with whether America will remain, more or less, at peace. The problem is that the argument is very one-sided.\n               Indeed, there are dozens of people on one side and essentially just one person on the other side. The dozens of likeminded\n               people favor a greater commitment of U.S. troops to South Vietnam because they've gotten it into their heads that Vietnam\n               is the place to draw the line against communism. This overwhelming majority espouses something called the domino theory, which\n               posits that if South Vietnam falls to communist rebels—those who would unite the country with communist North Vietnam—then\n               all the non-communist nations of southeast Asia will fall to Marxist ideology—like dominos on end, lined up on a table, when\n               one tips over. The minority of one, an undersecretary of state named George W. Ball, does not agree. He's never been to Vietnam, but he's\n               done a lot of reading and thinking on the subject. He's looked at the disastrous French experience and he's drawn some conclusions\n               that don't follow the party line of the cold warriors serving under President Johnson. Ball already has a reputation for independent thinking. Amidwesterner, born in Marshalltown, Iowa and raised there and in\n               Evanston, Illinois, he is a disciple of Bernard DeVoto, the independent essayist and non-academic historian par excellence.\n               To his students at Northwestern University and to the readers of his Easy Chair column in Harper's Magazine, DeVoto preached\n               a serious amateur's approach to book-learning—an unspecialized course of reading meant to train proper citizens—citizens who\n               would resist orthodoxy and conventional wisdom, citizens unafraid of politically powerful bullies. Ball took DeVoto's instruction to heart. For the rest of his life his intellectual self-confidence made him a true democrat\n               with a small D—that is, a true American who felt himself the equal of any other American, whatever their title and background—whatever\n               their political influence or wealth. George Ball felt it was his right to argue with anyone on any subject, so long as he'd\n               studied it. It was Ball's non-deferential nature that led him, from May 1964 to May 1966, to challenge the Johnson Administration's Vietnam\n               policy with a remarkable series of papers—twenty in all—that struck hard at the theories of the orthodox majority. Starting\n               on May 31 of '64, two months before the infamous Gulf of Tonkin incident, Ball fought a private war—an insider's war—to halt\n               the growing folly of Vietnam. Acampaign that began as a simple warning quickly escalated, parallel with the war itself, into\n               a full-scale assault on the arrogant assumptions of LBJ's closest advisors—his yes men—Dean Rusk, McGeorge Bundy, Walt Rostow\n               and Robert McNamara. While troops numbering in the hundreds of thousands shipped out for Southeast Asia, while bomb tonnage\n               numbering in the hundreds of thousands rained down on rice paddies and cities, Ball fired away with the only ammunition at\n               his disposal—articulate language, thoughtful criticism and personal charm. His biographer James Bill summarizes: “Ball argued that the United States had shortsightedly stumbled into a quagmire in Vietnam.\n               He questioned each of the four fundamental assumptions behind the mounting American involvement: 1) Vietnam was a country\n               absolutely essential to U.S. interests; 2) if the South Vietnamese government were to come under the control of the Vietcong,\n               the rest of southeast Asia would fall inexorably to the communists; 3) The South Vietnamese government could rally its population,\n               and with enough U.S. assistance, it would prevail in the struggle; and 4) even if the South Vietnamese could not overcome\n               the Vietcong, the United States could defeat the indigenous communist movement through the application of superior military\n               force.” All of these assumptions were wrong and George Ball said so to President Johnson when there was still time to avert disaster.\n               His own language is worth quoting: October 5, 1964: “Our situation would in the world's eyes approach that of France in the\n               1950s. We would incur the opposition of elements in Viet-Nam otherwise friendly to us. Finally, we would find ourselves in la guerre Sale with consequent heavy loss of American lives in the rice paddies and jungles.” June 18, 1965: Ball opens with a quote\n               from Emerson: “Things are in the saddle, and ride mankind”—and he argues that “before we commit an endless flow of forces\n               to South Vietnam, we must have more evidence than we now have that our troops will not bog down in the jungles and rice paddies—while\n               we slowly blow the country to pieces.” Then, on June 28, 1965, in a memo titled “Cutting our Losses in Vietnam,” Ball wrote:\n               “The position taken in this memorandum does not suggest that the United States should abdicate leadership in the cold war.\n               But any prudent military commander carefully selects the terrain on which to stand and fight, and no great captain has ever\n               been blamed for a successful tactical withdrawal....Politically, South Vietnam is a lost cause....Hanoi has a government and\n               a purpose and a discipline. The government in Saigon is a travesty. In my view, a deep commitment of United States forces\n               in a land war in South Vietnam would be a catastrophic error. If ever there was an occasion for a tactical withdrawal, this\n               is it.” Now George Ball was anything but a radical. Independent yes, but, as James Bill writes, “the protests in the streets of America\n               horrified George Ball. In his view, the masses of anti-war activists trampled upon the canons of civility and destroyed any\n               possibility of rational discourse. Ball could no more work with them than he could go off to his office dressed in a baseball\n               cap, blue jeans and T-shirt.” Indeed, Ball alienated many leading anti-war figures by refusing to resign from the government until late 1966—by insisting\n               on remaining a team player, and by publicly defending LBJ's Vietnam policy. Yet for all his loyalty to the team, with his good manners, with his intelligence, Ball was considered\n               unreliable and unsound by his teammates, by the vainglorious war ministers surrounding Johnson. To Defense Secretary Robert\n               McNamara, Ball “was out of line”—he had failed to “staff out” his research properly—he hadn't done enough to “develop his\n               ideas in committee.” In short, Ball wasn't a good party man; he didn't follow the party line. He wasn't a committee man; he\n               wasn't a company man. He was too much his own man, which in certain quarters of American society is about the worst thing\n               you can be. As it turned out, Ball was right and McNamara was massively wrong. Indeed, Ball was so right, that had Johnson followed his\n               wise counsel, more than 55,000 American lives and perhaps a million Vietnamese would have been spared. Hundreds of thousands\n               of children and spouses would still have had parents and partners, and tens of thousands of unborn children...well, we can\n               only imagine their potential lives. Now you might think that so distinguished and so prescient a man as George Ball would be honored today for having been so\n               right. Perhaps a school of diplomacy named after him, or at least a chaired professorship at the Georgetown school of foreign\n               service or Harvard University's Kennedy School of Government. How about the George Ball annual lecture at, say, the Army War\n               College, or at the schools of international affairs of Johns Hopkins or Columbia? I'm afraid not; I'm afraid there's nothing\n               named for George W. Ball. After his thankless government service, Ball went on to a not-very-successful career in investment banking. He didn't like\n               the business much—it paid the bills—and as a result he didn't really cash in on his government service, the way just about\n               everybody does today. In fact, toward the end of his life, George wasn't doing very well financially. Just weeks before his death in May 1994, he\n               felt obliged to put his lovely home in Princeton—with its magnificent library—up for sale. Now I'll wager that a lot of you have heard of Robert McNamara, and that almost none of you have heard of George Ball. The\n               villain, the fool, whatever you want to call him, is world-famous, or world infamous. He even starred last year in an Oscar-winning\n               documentary. Meanwhile, the clear-sighted man of principle, the guy who got it right and who stuck to his guns, is virtually\n               unknown to the greater public. Afundamentally dishonorable man is the celebrity and an honorable man is the ghost. Well,\n               George Ball wasn't a yes man, was he? Ifigure that by now you know what I'm driving at. There were versions of George Ball who warned against invading Iraq in\n               the fall and winter of 2002-2003; do you know who they were? Are they celebrated today, now that eight hundred Americans,\n               close to 3,000 have been seriously wounded and more than ten thousand Arabs have died; now that your fellow students are risking\n               their lives overseas. You've all heard of Donald Rumsfeld and Paul Wolfowitz and Condoleeza Rice, but have you heard of John\n               Brady Keisling; have you really heard of Senators Robert Byrd and Robert Graham, beyond a passing mention? Does any of this sound familiar? Idon't mean in politics, but in your personal lives. Does George Ball bring to mind moments\n               in your experience where you were called upon to toe the party line, and you asked yourselves: What should Ido? Who should\n               Ibe? Few of us will ever face the sort of choices and responsibilities that George Ball and Robert McNamara faced. But theirs is\n               still an instructive example. Because someday you might have to ask yourself, “would Irather end up a famous team player\n               or a much more obscure individual with my conscience and my intellect intact?” Whether you view yourselves this way or not, all of the graduates of this university are, broadly speaking, intellectuals.\n               Edward Said, the great Columbia English professor and writer said this about the responsibility of intellectuals: “The role\n               of the intellectual is to ask questions, to disturb people, to stir up reflection, to provoke controversy and thought...The\n               role of the intellectual is never to justify power, to always be critical of power, whether it is the power of the weak or\n               the power of the strong...the role of the intellectual is to challenge power by providing alternative models and, also as\n               important, resources of hope.” This role is available to any self-governing citizen of the United States. Of course, ethical choices are not so black and white. Here's what George Ball said when he was asked why he had stayed in\n               government service long after his views on Vietnam had been spurned, rather than resign and speak out publicly. “Ifigured\n               that Icould do better remaining on the inside. Had Iquit, the story would have made the front page of the New York Times\n               next day—and then Iwould have been promptly forgotten.'” Well here he is, forgotten nevertheless, his lessons unlearned by\n               the current administration. It's not always easy to know which choice is the right one. But it is easy to toe the line. And in my experience it's easy for people from all walks of life, from all social classes. If you think\n               that money immunizes you against the fear of reprisal, social or financial, please think again. I've known many wealthy people,\n               and Ican assure you that cowardice, timidity, peer pressure, going along to get along, are as much at home in the splendid\n               country club as they are in the modest social club. “All other swindlers upon earth are nothing to the self swindlers,” writes\n               Dickens in “Great Expectations.” The rich and powerful are as prone to self-swindling as anyone. As American citizens we're supposed to do better than go along to get along. We have a Constitutional duty to participate\n               in our own governance. In theory and in practice we have the right to say no when we are in a minority of one—whether on a\n               jury, in a polling booth, as a member of congress, or simply doing a regular job in a regular place of business. After the World Trade Center and the Pentagon were hit on 9/11, this constitutional duty and right were challenged every bit\n               as much as George Ball was challenged in 1964-65. America was called to national unity; dissent was discouraged; even irony\n               was denounced. Nobody was supposed to think for themselves anymore. We could only see 9/11 one way—America victimized by a\n               senseless act of mass murder without any antecedents, without any political context. Not everybody toed the line; a few people\n               argued that Osama bin Laden was a monster incubated in the American foreign policy of the Cold War, the same Cold War that\n               brought us Vietnam. Launched against the Soviet Union in Afghanistan, he finally blew black in our faces. Ihappen to agree. But whatever my theories about the causes and origins of 9/11, what stayed with me in the aftermath was the dreadful silence\n               in the face of groupthink, of mediathink, of committeethink. Nobody had to tell me how bad the actual event was; my office\n               was close enough to be enveloped in the acrid smoke that finally shifted uptown. Iheard my share of near miss stories, and\n               Idid know someone who was killed. But as hard as Itried, Icouldn't quite articulate what Ifelt about 9/ll, about my objection\n               to the party line narrative. Yes, 9/11 was terrible, more than three thousand killed in a matter of minutes. But the strange\n               thing about it was the focus on the buildings themselves—the image that stayed with most of was not of desperate people jumping\n               out of windows, but that of two great edifices in lower Manhattan completely destroyed and one in Washington badly damaged\n               and set on fire. Eventually, Senator Robert Byrd, who so nobly and courageously dissented on Iraq, clarified things for me. Back in 1993, Byrd\n               had sounded the alarm about what he viewed as a power grab by the president that Byrd thought threatened the Constitution.\n               In one speech, he explained what Ifelt eight years later, but couldn't express about 9/11. Speaking of great buildings in\n               the capital city—and remember that New York City was the first capital of the United States— Byrd said: “Does anyone really\n               imagine that the splendors of our capital city stand or fall with mansions, monuments, buildings, and piles of masonry? These\n               are but bricks and mortar, lifeless things, and their collapse or restoration means little or nothing when measured on the\n               great clock-tower of time.” And then Byrd quoted Daniel Webster, the great Massachusetts politician of the pre-Civil War era:"
    },
    {
      "tag": "blockquote",
      "text": "It were but a trifle even if the wall of yonder Capitol were to crumble, if its lofty pillars should fall, and its gorgeous\n               decorations be all covered by the dust of the valley. All these might be rebuilt. But who shall reconstruct the fabric of\n               demolished government? Who shall rear again the well-proportioned columns of constitutional liberty?"
    },
    {
      "tag": "p",
      "text": "Look around you now and observe and appreciate your fellow columns, every one of you a splendid, well-proportioned testament\n               to American liberty and American conscience. When you leave here today, pay close attention to the masonry of your minds."
    },
    {
      "tag": "div",
      "text": "This is The Columns of Liberty by John R. MacArthur , originally from\n               Sunday, May 23, 2004, published Wednesday, February 16, 2005.\n                It is part of Features , which is part of Harpers.org ."
    },
    {
      "tag": "p",
      "text": "Written By MacArthur, John R. Navigate by Hierarchy Prev: Out of Iraq Next: A Line To Walk On Up: Features Navigate by Time of Publication Prev: Weekly Review Next: Use It In A Sentencing Permanent URL http://harpers.org/TheColumnsOfLiberty.html"
    },
    {
      "tag": "div",
      "text": "Sponsored Links: Kids bedding · LipSense Guaranteed long lasting lipstick · Guaranteed long lasting lipstick · Personalized Gift Ideas · Poker California · Casinos Canadian · Bingo Games · Compare Credit Card Offers · Concert Tickets · Homes for Rent, Apartment Rentals · Play online poker at AbsolutePoker.com\n               \t\t\t· Casino · Casinos · blues festivals · 7Sultans Online Casino · Place Your Link Here! Harpers.org is the website of Harper's Magazine, an American journal of literature, politics, culture, and the arts published\n               continuously from 1850."
    },
    {
      "tag": "div",
      "text": "Looking for the latest issue of Harper's Magazine? Ready to subscribe?"
    },
    {
      "tag": "div",
      "text": "Newsstand Current Issue Subscriber Care Subscriber Fraud Alert Washington Babylon Weekly Review Most Recent Harper's Index Most Recent Readings Features « » The Columns of Liberty Archive Connections Classified Advertising About Harper’s Visit Harper's Bookshelf Contact Harper's Media Kit Merchant Directory Search Harpers.org Subscribe to The Weekly Review Syndicate : RSS1.0 , RSS2.0 © 2006 Harper's Magazine Foundation Harper's Bookshelf What Went Wrong in Ohio by Anita Miller (Ed.) The Conyers Report on the 2004 Presidential Election."
    },
    {
      "tag": "h3",
      "text": "Recently Added"
    },
    {
      "tag": "div",
      "text": "Itemized Abductions .\n                  From a memorandum written in July 2001 by Internal Revenue Service attorney George Baker.\n                  (December 26) Last-minute Holiday Gifts for the Dictators in Your Life! , by Ken Silverstein and Sebastian Sosman .\n                  \n                  (December 22) A Cartoon , by Mr. Fish .\n                  \n                  (December 22) The Joyless Club .\n                  From personal ads posted on Asexual Marriage Net, a marriage broker website in China. More than 7,000 people have joined since\n                  the website was launched last year. Translated from the Chinese by Daniel Mattingly.\n                  (December 20) Weekly Review , by Gemma Sieff .\n                  \n                  (December 19) Summary , by Ken Silverstein .\n                  \n                  (December 15) A Cartoon , by Mr. Fish .\n                  \n                  (December 15) Breakfast for a Champion: John Murtha keeps his hand out , by Ken Silverstein .\n                  \n                  (December 13) Flaws in the BioShield: VaxGen looks for another federal bailout , by Ken Silverstein .\n                  \n                  (December 12) Weekly Review , by Claire Gutierrez .\n                  \n                  (December 12) More... Tables of Contents"
    },
    {
      "tag": "h3",
      "text": "Calendar"
    },
    {
      "tag": "div",
      "text": "Jan 2005"
    },
    {
      "tag": "div",
      "text": "S M T W T F S"
    },
    {
      "tag": "div",
      "text": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31"
    },
    {
      "tag": "div",
      "text": "Feb 2005"
    },
    {
      "tag": "div",
      "text": "S M T W T F S"
    },
    {
      "tag": "div",
      "text": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28"
    },
    {
      "tag": "div",
      "text": "Mar 2005"
    },
    {
      "tag": "div",
      "text": "S M T W T F S"
    },
    {
      "tag": "div",
      "text": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31"
    },
    {
      "tag": "div",
      "text": "SUBSCRIBE TO HARPER'S MAGAZINE for as little as $14.97/year Visit Finland in the Lively Season!"
    }
  ]
}