{
  "url": "http://www.healthinschools.org/focus/2002/no3.htm",
  "file_number": "478",
  "content_hash": "d3f0cdf4b29e303f6afb539262db50eee6bc3def95a62e688f54bf29b57b3893",
  "total_blocks": 53,
  "retained_blocks": 7,
  "ignored_blocks": 46,
  "blocks": [
    {
      "tag": "div",
      "text": "May \r\n                  12, 2002"
    },
    {
      "tag": "h3",
      "text": "Debate Begins on Smallpox Vaccination"
    },
    {
      "tag": "p",
      "text": "The Advisory \r\n                    Committee on Immunization Practices is expected to make recommendations \r\n                    in June on whether Americans should be vaccinated against \r\n                    smallpox, a disease that no longer exists on the planet. The United States and the rest of the world have been comfortable \r\n                    for more than two decades in the knowledge that the last case \r\n                    of smallpox occurred in 1977, and the disease was declared \r\n                    completely eradicated in 1980. After eliminating stocks of \r\n                    the virus in laboratories worldwide, the World Health Organization \r\n                    was able to say in 1984 that the only remaining variola virus \r\n                    isolates are stored at just two sites: the Centers for Disease \r\n                    Control and Prevention in Atlanta and the State Research Center \r\n                    of Virology and Biotechnology in Novosibirsk, Russia. But there are lingering concerns that the virus resides \r\n                    outside those laboratories and could be used as a weapon by \r\n                    terrorists. And the effects of such a terrorist attack would \r\n                    be catastrophic, say public health officials, for two reasons: \r\n                    the virus is highly contagious and spreads readily and rapidly \r\n                    from person to person, and almost no one in the United States \r\n                    is immune to the infection. Smallpox vaccination has not been \r\n                    performed routinely in this country since 1972, so there is \r\n                    now a large population of children and young adults who were \r\n                    never immunized. And even persons born before 1972, who probably \r\n                    received a smallpox vaccination in order to enter school and \r\n                    have the scar to prove it, may no longer be immune, since \r\n                    no one knows exactly how long vaccination-induced immunity \r\n                    lasts. That means almost everyone in the United States would potentially \r\n                    be at risk if terrorists introduced the smallpox virus, either \r\n                    by sending infected persons to mingle with crowds or by disseminating \r\n                    the virus itself in the air or on commonly used objects. That \r\n                    poses questions for the Committee on Immunization Practices, \r\n                    including: Should we act now to make smallpox vaccine available to \r\n                      everyone in the United States, or, alternatively, to young \r\n                      people between the ages of one year and 29 who were never \r\n                      vaccinated; and should vaccination be compulsory or voluntary? Or should we wait until there is an attack, relying on \r\n                      the fact that immunization within two or three days of exposure \r\n                      seems to prevent or lessen the severity of smallpox? Anumber of factors may enter into the committee's decisions. \r\n                    One is whether there is enough smallpox vaccine to carry through \r\n                    whatever recommendation the committee may come up with. There \r\n                    is currently a limited stockpile of vaccine in this country, \r\n                    most of it produced in 1982 or earlier. In studies published \r\n                    in April in the New England Journal of Medicine , researchers \r\n                    reported that they found those vaccines can be diluted 5- \r\n                    to 10-fold \"without substantial loss of efficacy.\" \"When administered \r\n                    by a bifurcated needle to previously unvaccinated adults, \r\n                    the vaccine produced vesicular skin lesions that correlate \r\n                    with the induction of the antibody and T-cell responses that \r\n                    are considered essential for clearing vaccinia virus infections.\""
    },
    {
      "tag": "p",
      "text": "... \"The \r\n                        current stockpile of 15 million doses of smallpox vaccine \r\n                        may safely be diluted to yield at least 75 million doses.\" -- Dr. Anthony \r\n                          Fauci"
    },
    {
      "tag": "p",
      "text": "That means, says Dr. Anthony Fauci of the National Institutes \r\n                    of Allergy and Infectious Diseases, that \"The current stockpile \r\n                    of 15 million doses of smallpox vaccine may safely be diluted \r\n                    to yield at least 75 million doses.\" In addition, he points \r\n                    out, the ongoing production of second-generation smallpox \r\n                    vaccines will increase our supply to approximately 286 million \r\n                    doses by the end of this year, and the Department of Health \r\n                    and Human Services has said it will test for safety and immunogenicity \r\n                    some 75 million doses of vaccine that recently were discovered \r\n                    to have been stored by a pharmaceutical company since 1972. \r\n                    \"Thus, the availability of vaccine will soon become less of \r\n                    a factor in the formulation of a policy,\" Fauci said. Another point the advisory committee may consider is how \r\n                    immunization on a massive scale might be handled, either before \r\n                    or during a terrorist attack. In its successful campaign to \r\n                    eradicate smallpox worldwide 40 years ago, the World Health \r\n                    Organization relied on a technique called \"ring vaccination,\" \r\n                    which is the approach currently recommended in guidelines \r\n                    developed by the Centers for Disease Control and Prevention. \r\n                    In ring vaccination, patients with suspected or confirmed \r\n                    smallpox are isolated; contacts are traced, vaccinated, and \r\n                    kept under close surveillance; and high-risk persons who may \r\n                    have had direct or indirect contact with the patient are identified \r\n                    and vaccinated. \"Despite the fundamental soundness of this approach and \r\n                    its success in previous naturally occurring outbreaks, there \r\n                    is considerable skepticism about the feasibility of this strategy,\" \r\n                    in the event of a terrorist attack, Fauci notes, since multiple \r\n                    exposures and the resulting panic could overwhelm the capacity \r\n                    of CDC and local authorities to carry out the plan. And most \r\n                    importantly, he points out, previous outbreaks that were controlled \r\n                    by ring vaccination were in the context of existing herd immunity, \r\n                    not in an essentially non-immune population. But the factor that seems most likely to affect public opinion \r\n                    about the need to vaccinate in advance of an attack, says \r\n                    Dr. William Bicknell of the Boston University School of Public \r\n                    Health, is that smallpox vaccination often has adverse reactions \r\n                    in otherwise healthy persons. Commonly, researchers reported, \r\n                    the healthy young volunteers who received either full-strength \r\n                    or dilute vaccine to test its efficacy experienced side effects \r\n                    including the formation of satellite lesions, regional lymphadenopathy, \r\n                    fever, headache, nausea, muscle aches, fatigue, and chills, \r\n                    as well as generalized and local rashes."
    },
    {
      "tag": "p",
      "text": "... \"There's no other vaccine that we currently  give that carries with it a risk of death.\" -- Alex Kemper"
    },
    {
      "tag": "p",
      "text": "In studies reported to the Pediatric Academic Societies \r\n                    annual meeting in Baltimore, Maryland, May 7, pediatricians \r\n                    Alex Kemper and Matthew Davis of the University of Michigan \r\n                    predicted that a mass campaign to vaccinate Americans against \r\n                    smallpox could result in 200 to 300 deaths and might make \r\n                    several thousand people severely ill with complications such \r\n                    as viral infection spreading from the vaccination site and \r\n                    severe skin rashes. \"There's no other vaccine that we currently \r\n                    give that carries with it a risk of death,\" Kemper pointed \r\n                    out. \"From a societal viewpoint, we have to decide whether \r\n                    or not we're willing to take this risk.\" But in making its recommendations, the advisory committee \r\n                    is expected to weigh the very serious nature of smallpox itself \r\n                    against the possibility of adverse reactions to immunization \r\n                    in a limited number of people. Most doctors and nurses now \r\n                    in practice have never seen a case of smallpox, but a doctor \r\n                    who treated 22 smallpox patients while stationed with the \r\n                    military in Japan in 1945 described the experience in a New \r\n                    England Journal of Medicine article. \"The disease began \r\n                    with a high fever,\" Dr. Murray Dworetzky recalled, \"with the \r\n                    temperature exceeding 40 degrees Centigrade and then dropping, \r\n                    although never to normal, before it spiked again. Although \r\n                    some patients had pustular lesions, those who died had confluent \r\n                    subcutaneous hemorrhages that rapidly involved the entire \r\n                    body, with a similar enanthema involving the mucous membrances \r\n                    of the oral cavity, respiratory mucosa, and entire gastrointestinal \r\n                    tract. The pain was intense and morphine relieved it only \r\n                    marginally.\" Fourteen of the 22 patients died. Another New England Journal article notes that the \r\n                    incubation period for the disease is 7 to 17 days, after which \r\n                    severe backache, headache, and fever begin abruptly. Lesions \r\n                    occur first on the face and extremities but then cover the \r\n                    entire body. After severe smallpox, pockmarks or pitted lesions \r\n                    are seen in 65 to 80 percent of survivors, most commonly on \r\n                    the face. Death from smallpox is ascribed to toxemia, associated \r\n                    with immune complexes, and to hypotension. In any case, the New England Journal of Medicine editorializes, \"The debate on preemptive vaccination cannot \r\n                    go on indefinitely. We need to make a decision. If we do proceed \r\n                    with large-scale vaccination, we need to consider what operational \r\n                    plans might be workable, who should be immunized, when they \r\n                    should be immunized, and how to reduce unintended sequelae.\" The complete text of the New England Journal of Medicine's \r\n                    discussion of smallpox and bioterrorism is available at http://content.nejm.org/content/vol346/issue17/index.shtml?query=TOC Respond \r\n                    to Topic Back to top"
    }
  ]
}