{
  "url": "http://www.hi-fiworld.co.uk/hfw/featureshtml/turntableroundup.html",
  "file_number": "483",
  "content_hash": "5379f74420fb575eb422b642cd84aa4b030f0b2af2a2f945103e3c0e4e3fc2a2",
  "total_blocks": 144,
  "retained_blocks": 18,
  "ignored_blocks": 126,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "div",
      "text": "Home subscriptions classified\nads buying\n2nd hand guide buying\nguide & reviews current\nissue emails\n& letters contacts suppliers computer\naudio world world\naudio design FEATURE - TURNTABLE ROUNDUP (Prices shown are those at the time of the feature - January 1998) VINYL TO GO!"
    },
    {
      "tag": "p",
      "text": "David Price points the cheapest way to high-quality vinyl replay. People who've grown up with CD could be forgiven for not wanting to\nget into vinyl. After all, isn't it the preserve of snobbish, backward-looking\nold fogeys, with more money than sense? Well, no. There are still plenty\nof affordable, sub-£500 turntables on sale that will eat most CD\nplayers for breakfast. Despite their clicks, pops and dirty styli, they'll give you more passion,\nmore life, more music than any silver-disc spinner. So we thought we'd\ngive you a Get Going In Vinyl guide, a no-nonsense look at the best budget\nvinyl hardware. Go on, get yourself a turntable, you know you want to!"
    },
    {
      "tag": "div",
      "text": "TURNTABLES PRO-JECT .5 £159 Very\nmuch a starter turntable, the Project .5 comes complete with an Ortofon\nOM10 Moving Magnet cartridge (worth £30) and basic automation - the\ndeck starts revolving when you move the tone-arm over the record. Although\na touch rough around the edges, the Pro-ject manages an enjoyably musical\nperformance and represents excellent value for vinyl virgins. PRO-JECT 1 £199 Aproper hi-fi deck, the 1 is completely devoid of facilities, preferring\nto put the emphasis on sound. Features include a precision bearing supporting\na dynamically-balanced alloy platter and a good basic arm with adjustable\nheight - an unusual but highly worthwhile feature. The sound is fast and\npunchy, with more life and sparkle than its more expensive Rega rival.\nFactor in the fitted Ortofon 510 cartridge and it's a tempting proposition. REGA PLANAR 2 £214 Despite\nfierce competition from Pro-ject, this evergreen remains highly competitive.\nCunningly simple, it consists of a black fibreboard plinth into which a\ndecent motor and bearing are set, with a thin glass platter and felt mat\non top. The RB250 arm is a remarkably polished performer for the money\nwith decent bearings and a quality, one-piece cast arm tube."
    },
    {
      "tag": "p",
      "text": "Arefined and musical design, the Planar 2 sounds more mature than the\nPro-ject 1 but lacks a little of its brio. By absolute standards the 2's\nrather limited at frequency extremes and has mediocre speed stability but\nyou'd be surprised at how good it can still sound. The 2 has also appeared\nslightly modified under Akai and NAD 533 guises."
    },
    {
      "tag": "div",
      "text": "REGA PLANAR 3 £274 Agrown-up version of the Planar 2, this classic deck has sold in vast quantities\nsince its inception way back in 1978. Although it gets an improved plinth,\nplatter and bearing, its most distinguishing feature is the RB300 arm -\na budget classic if ever there was one. Given a good cartridge and proper\nsiting on a vibration-free support, the Planar 3 will embarrass many far\nmore expensive CD players. Its civilised yet musical performance is soft\nand subtle yet detailed and engaging."
    },
    {
      "tag": "p",
      "text": "Although bettered by slightly more expensive separate turntable/arm\ncombinations, as a 'plug in and play' solution it's superb. And it's also\nthe only turntable available in purple - an extra £15 buys you a\nchoice of seven pretty colours!"
    },
    {
      "tag": "div",
      "text": "PRO-JECT 2  £299 Asouped-up Pro-ject 1, the 2 has an improved alloy, glass and felt platter\nand a standard record clamp - usually the province of high-end Michells\nand SMEs. The tone-arm also gets a few mods, but it still can't really\nmatch the Rega RB300."
    },
    {
      "tag": "p",
      "text": "The sound gains refinement and poise, sounding faster, cleaner and better\nfocused, making the deck a truly enjoyable listen. The cartridge is improved\ntoo, with either an Ortofon 520 or an MC1 moving coil for those with suitable\nphono stages. Alot of turntable for very little money."
    },
    {
      "tag": "div",
      "text": "MICHELL MYCRO £435 An\nunconventional design, the Mycro is basically a paired-down GyroDec, itself\none of the best sub-£1000 turntables. Hand-built from the best materials,\nit features a sprung sub-chassis on which sits a superb inverted bearing\nand heavy acrylic platter, driven by a long rubber belt from a low-noise\nmotor. The base is also acrylic, chosen for its excellent resonance damping\nproperties as much as its striking looks. Numerous armboards are available\nbut the Mycro usually comes with the ubiquitous Rega for £577."
    },
    {
      "tag": "p",
      "text": "Sound is very solid, detailed and open with particularly strong stereo\nimaging. Bass is deep and controlled, if a little dry. Although more cerebral\nsounding than most, the Mycro is a truly accomplished budget design and\nlooks superb to boot."
    },
    {
      "tag": "div",
      "text": "PRO-JECT 6  £459 This\nis value - a three-point suspended sub-chassis deck with a decent arm and\ngroove-tastic Ortofon MC15 Super 2 moving coil for under £500! It's\nalso hard to argue with its alloy and glass platter, silicon arm damping\nand highly adjustable suspension. Sound is strong and musically confident,\nwith real bass and smooth treble - a major step up from the Rega class."
    },
    {
      "tag": "p",
      "text": "The Project isn't quite up there with the Michell and Systemdek, but\nthen it's far cheaper when you remember you need an arm and cartridge for\nthe latter pair. This is the one to go for if you want a top notch, fuss-free\nturntable package."
    },
    {
      "tag": "div",
      "text": "ROKSAN RADIUS £470 An\nunusual but attractive deck, the Radius brings some exotic features to\nthe budget end of the market. An independently-sprung sub-chassis does\na good job of isolating the deck from its surroundings, while a decent\nbearing, motor and belt drive give a stable ride for the record."
    },
    {
      "tag": "p",
      "text": "The Radius comes without an arm, but when partnered with Roksan's excellent\n£320 Tabriz it gives an impressively fast and dynamic sound. Best\nused with warm ancillaries, this deck is for those who prefer power and\ninvolvement to subtlety and warmth."
    },
    {
      "tag": "div",
      "text": "SYSTEMDEK 2X2 £500 The\n2X2 straddles the gap between budget and high end. Its independently sprung\nsub-chassis offers near immunity to acoustic feedback, while the expensive\nacrylic platter is a superb way to support records. Although usually sold\nwith the Rega RB300 arm, various armboards are available and the 2X2 is\nquite capable of accepting arm designs costing twice its price."
    },
    {
      "tag": "p",
      "text": "Sonically it's one of the best affordable turntables - clean and detailed\nyet highly musical and dynamic. Bass isn't particularly deep but it's fast\nand fluent, and the upper midrange and treble are pin-sharp - for the money\nit's little short of a bargain."
    },
    {
      "tag": "div",
      "text": "CARTRIDGES ORTOFON OM10 £29.95 Aquality budget cartridge with a smooth, refined, if slightly bass-light\nsound. Stylus can be easily upgraded to OM20 status, bringing bags of extra\ndetail and polish. GOLDRING 1042 £120 Beautifully\ndeep, dark, rich analogue sound goes down a treat in Regas and super-decks\nalike. Secure tracking makes for excellent detail and poise. PHONO STAGES QED DISCSAVER £35 Cheap\nand cheerful starter powered by a mains adapter or direct from a PP3 battery\n- the latter brings a smoother, cleaner sound. Either way it's a fast,\nrhythmic performer that will extract plenty of music from inexpensive turntables\nand cartridges. ROTEL RQ-970BX £129 The\ncheapest serious design, this full-width black box offers a fast and musical\nsound with a surprising amount of detail - for not much money. Also has\na good moving coil input. LFD MISTRAL PHONO STAGE £300 The\nMistral is a super device with a rich, detailed and rhythmic sound that\nmakes it the best at the price. It's also an excellent upgrade to virtually\nany integrated amp's internal phono stage, although the switchable Moving\nCoil stage can be a bit on the hissy side. This feature was published in the January 1998 issue\nof Hi-Fi World. No material may be reproduced from this review without\nthe written permission of the publisher. Copyright Audio Publishing Limited Home subscriptions classified\nads buying\n2nd hand guide buying\nguide & reviews current\nissue emails\n& letters contacts suppliers computer\naudio world world\naudio design"
    }
  ]
}