{
  "url": "http://www.hipmama.com/node/view/1461",
  "file_number": "485",
  "content_hash": "54eada9c4c58921f38af13020da8af8585ccb1f0558028b2d1695e396f278ca2",
  "total_blocks": 100,
  "retained_blocks": 32,
  "ignored_blocks": 68,
  "blocks": [
    {
      "tag": "div",
      "text": "TF 468x60 JScript HORIZ code TF 468x60 JScript HORIZ code home | blogs | feature archive | regional organizing | search | chat | recipes"
    },
    {
      "tag": "h2",
      "text": "Mamashops"
    },
    {
      "tag": "p",
      "text": "Subscribe to the zine - order a book - buy a shirt! Click here for Mamashops"
    },
    {
      "tag": "h2",
      "text": "Our Sponsors"
    },
    {
      "tag": "div",
      "text": "Get rid of the ads! Subscribe to the site ! Home » Features » Features by Title"
    },
    {
      "tag": "h2",
      "text": "If You Lie Down with Dogs, You Wake Up with Fleas... or a Baby by Maegan \"la Mala\" Ortiz"
    },
    {
      "tag": "div",
      "text": "begin content google_ad_section_start google_ad_section_start"
    },
    {
      "tag": "p",
      "text": "If You Lie Down with Dogs, You Wake Up with Fleas... or a Baby by Maegan \"la Mala\" Ortiz My mind has been reeling since yesterday. Idon't enjoy being single and being your sometime lover. You and Ihave been at this for over a year, and the novelty of it is wearing thin. Don't get me wrong, amor, my stomach still feels all bubbly when Isee your screen name pop up on my computer screen, or when \"Beautiful\" by Snoop plays on my phone reminding me of a night last summer when you and Idanced to that song in one of many Williamsburg hipster bars we've been to together. Like today when you called. Iwas sitting at my computer sending out a Spanish-language flyer for the upcoming parent's association meeting at my daughter's school when my cell phone rang and Ismiled. Iknew you were calling to schedule a booty call, or maybe even to give me work translating for you at a closing. We exchange polite greetings and engage in worthless banter for a bit. Iask if you’re over your jetlag since you’d instant messaged me earlier that you’d been in Los Angeles meeting with a client. Itell you again how sorry Iam you had a horrible time while you were there. You said Los Angeles was soulless and Imade a joke about how Ithought you liked your cities like your women-- soulless. I'll be honest with you: I’m glad you had a bad trip, not because Iwish you harm, but because California has already seduced two of my former lovers. But Iwasn't ready for the real reason your business trip was bad. \"It was what happened before the trip that ruined it,\" you say seriously. Iexpected a story about your alcoholic father back home in Connecticut. \"Do you remember the Argentinean girl?\" How could Inot remember the Argentinean girl? I’ve never met her, Ican't even tell you her name, but Iknow her. Imet her early on in our relationship. Many a morning after, while searching for a carelessly tossed thong, Imet the fuzzy slippers she left underneath your bed. Imet her lotions, body washes, shampoos and even tampons during my after-sex showers. Istill meet her when Idon't see your screen name online, and when your cell phone goes straight to voicemail when Icall. Imeet her in your absence. Once she asked you to stop sleeping with other people so you and Ididn't speak for a few months. But you always come back. \"She's pregnant,\" you say. Istayed silent on the phone for a few seconds digesting the conflicting emotions Iswallowed when those words escaped your mouth. Ipictured you with her and Idon't even know what she looks like. In my head she looks like an Argentinean stripper Iused to work with. She was beautiful and arrogant with her bleached hair and fake breasts, breasts she would shield from certain spotlights lest the scars show. The image of you entering her is enough to make me feel nauseous. Ithen think of the week my period was a few days late and Inursed dreams of carrying your baby. But Ionly seem to get pregnant when men want to leave me. You obviously aren't ready to leave me so Iask a stupid question, \"Is it yours?\" You tell me you're not sure since she slept with one other man that you know of in the same time period. \"So what are you going to do?\" Iask. Iask what you are going to do. Idon't ask what she is going to do. You tell me that you told her it was a good idea to terminate the pregnancy. She told you she wanted to have the baby. Of course you tell her to have an abortion and of course she says she wants the baby. Every man who has gotten me pregnant has recited the same words. It's as if you all work from the same script. We, as women, are compelled to defend ourselves if not the baby, if we even consider it a baby. Even if we want the abortion, chances are we won't tell you that. It's sad, but when a relationship is already tripping on itself a pregnancy becomes a manipulation tool. \"Besides the doctors don't think she should have the baby because of her health problems,\" you continue. Ibegin to feel bad for the Argentinean girl. \"What does she have?\" Iask, concerned now. You tell me about how her father got her pregnant when she was fourteen and how she had a back alley abortion that did serious damage. \"Did you say her father?\" Iask, not believing what I’d heard, or maybe Ididn't want to feel sorry for her. You tell me yes her father and continue, without pausing to take a breath, telling me how she also \"claims\" to have had ovarian cancer, and now only has one ovary. \"But Ihaven't seen any scars or medical records to substantiate that,\" you finish. \"Why would any woman lie about any of that?\" Iask you defensively. Iam feeling sorry for her. \"So what are you going to do?\" Iask again because you haven't answered my question. \"She's mad at me because I'm not happy and didn't ask her to marry me,\" you continue and my stomach starts to churn again at the word marry. \"But Ican't be by her side during this pregnancy not knowing if the baby is mine.\" You pause. \"Mala, can Iask you something?\" Itell you of course you can, as if at this point your asking matters. I’m dazed by the information that is coming at me and Ifeel unable to process it all. I’m confused as to why you would choose to open yourself up to me about such a thing. I’m under no illusion that it’s because you think I’m a wonderful trustworthy woman. \"You did it. It really wasn't that hard going through a pregnancy by yourself, was it?\" Ilaugh at the absurdity of your question. You were asking me to give you permission to turn your back on your pregnant lover. Iwas incapable of being a bitch, of lying and saying it was a breeze, that she could handle it fine. \"It sucked,” Ispew. ”It sucks going to ob-gyn appointments alone and watching nearly everyone else's husband or partner at least pick them up. It sucks being scared and having no one to hold your hand. It sucks having no one to share the joy with. No, it wasn't easy and Ihad the support of family and friends.\" Itell you this angrily. And Idon't have to tell you how it sucked being a single mother. My alternate suddenly won't have a flat stomach. That stomach will bear ocean ripples of stretch marks like my own. Scheduling trysts with her will become just as complicated as scheduling them with me, having to work around bedtimes and babysitting availability. \"So what are you going to do?\" Iask a third time. Iwant to know if this means you don't want to see me anymore. Iwant to know if this is the beginning of another one of your departures. Iwant to know if you’re planning to play house. \"Want to hear something surreal that happened to me today?\" you ask. Ithink you’re going to change the subject, which Iwould be grateful for. This conversation was surreal enough for me. You start, \"Iwas at the diner getting breakfast the other morning--\" \"Kellogg’s?\" Iinterrupt to ask. The diner has a convenience store in the front. Iam trying to imagine you in your suit, ordering your oatmeal as you have a few morning afters with me. \"Yes,\" you continue. \"And this drug addict in rags comes up to me. She doesn't ask me for money, she doesn't even ask me for food. She asks me to buy a package of diapers for her baby. She calls me an angel and Istop her, telling her I’m no angel for buying her as many diapers as she can carry because I’ve decided to turn my back on my own drug-addicted lover who may be carrying my baby.\" Maybe you wanted me to feel sorry for you, and part of me did. Part of me felt sorry for her. Ifelt sorry for myself, but what Ipicked up on was your mention of the Argentinean’s substance abuse problem. \"What is she using again?\" Iask. You've confused me on this topic before. As ugly and immature as Ithink it looks for you, a thirty-two year old attorney, to sit in his living room smoking weed, Itolerate it. Once when we were in bed together you told me that she, the Argentinean, had stopped talking to you over some bad cocaine you had gotten her. You later took it back saying you were just joking. Ihave never seen any evidence of you using anything beyond marijuana. \"This is one of the things that bugs me, the timing of it all,\" you say.\" Afew weeks ago after walking her dog and finding a condom in its ass--\" Iinterrupt you to laugh at what Ithink is another one of your crude jokes that you often interject into serious moments. \"I'm serious,\" you say firmly. \"So after that Ihad a discussion with her and basically gave her an ultimatum telling her that if Isee even one track mark on her arm, it’s over.\" \"So wait a minute. You've been sleeping with her, having unprotected sex while she's shooting up heroin, and at the same time you're having unprotected sex with me?\" Iask. You answer in the affirmative and Ishudder. Ibegin looking for my wallet so Ican pull out my health insurance card and schedule an appointment for a series of blood tests. You must have been reading my mind because you tell me that you got tested for everything just two weeks ago and that everything came out clean. Ithink that was supposed to make me feel better. It didn't. \"But anyway,” you persist, ”It was soon after that ultimatum that she tells me she's pregnant so it makes me wonder if she's doing this so Idon't abandon her.\" Iknow you won't abandon her. You confided in me once that you were in love with this woman. You haven't abandoned me, even though many times I’ve wished you would. It would be easier that way. That way Icould just hate you. \"Sometimes after sex it seemed as if she was trying to purposely grab up some of my juice to get herself pregnant.\" \"You think she did all this on purpose?\" Iask. I’m embarrassed as Ithink about how the very thought has crossed my mind, to climb on top of you after having sex, after you cum on my back or stomach. \"Itold her to get on birth control, but she says it's too expensive,\" you say. \"She can go to Planned Parenthood,\" Isay, surprised at the fact that I’m telling you how to get your other lover inexpensive, maybe even free, birth control. But it seems a little too late anyway. \"Hell, because she's a drug addict people will tie her fucking tubes for free, but she doesn't want to admit she's an addict,\" you say, disgust in your voice. Iwant to tell you about how Iam opposed to such programs, but the hole in my stomach swallows up my good politics. \"So what are you going to do?\" Iask a fourth time because Iam tired of hearing so much background information about her, the other. \"Ihave so much Iwant to say to you now, but I’m holding my tongue,\" Ifinally admit. “It’s barely 11:30 in the morning and I'm drinking.\" You find that funny and laugh before telling me you want to hear what Ihave to say. Idon't remember you ever saying that to me before. \"Ijust don't understand you,\" Ibegin. \"Itry to keep emotional distance from you so that when something like this happens Ican walk away unharmed, but Icare about you and you know it and it frustrates me to see you, an intelligent man, engaging in such risky behavior, acting like an adolescent, and Idon't understand how you could want all this fucking drama with a fucking drug addict and keep me in the dark and on the side. Idon't understand why you always choose her over me!\" Ihold back my tears and wait for your reaction. \"So Iwas thinking that since you need work, if in nine months you’re still in the same situation, maybe you could help the Argentinean out or maybe you guys could do a babysitting exchange.\" Iwant to curse you out. Iwant to tell you, \"Fuck you and your baby!\" but instead Ijust call you an asshole. Ido not, however, end the call. \"Ay, come on! You won't even occasionally pick the kid up from the physical therapy he no doubt will need because he'll be born addicted to drugs?\" You laugh at your own sick joke. Now Iam going to end the conversation, but conveniently your other line rings. You say it's the office and quickly hang up, promising to call me back later. With you off the phone, Icry. Ilaugh at myself. Iscream at myself. Ipour myself another rum and ginger ale and start searching for any hidden cigarettes. Idrink and smoke and of course you never call me back. Afew hours later we meet again the same way we met the first time, online. For some strange reason, Ifeel guilty for not being a better friend to you and Iinstant message you to apologize. \"When you confided in me, Ireacted as your lover, not as your friend, and obviously you needed a friend,\" Ityped. You apologized for opening up your \"stupid mouth.\" Of course Itold you that you had nothing to apologize for, that Iwanted you to confide in me, that Ivalued our friendship as much as Ivalued the incredible sex. \"Nothing has changed between us,\" Iwrote. That statement is truer than we would both care to admit. You then tell me the Argentinean has decided to get a procedure. As Isuspected, the office hadn't been the real reason you'd hung up the phone so quickly earlier. \" The procedure?\" Iask. \"Yes,\" you type. Ithink her decision and your telling me about it was supposed to make both of us feel better. Ican't speak for you, but Istill feel sick to my stomach, and Istill want to see you tomorrow after class. Maegan \"la Mala\" Ortiz is a Nuyorican writer, activist, and single mami."
    },
    {
      "tag": "div",
      "text": "google_ad_section_end previous next up I Was A Teenage Transsexual Super Mom by Katie Kaput Inconsolable: A Conversation with Marrit Ingman by Stacey Greenberg google_ad_section_end adsense: cached By Jennifer at 04/07/2004 - 4:39am | POV | Real Life | printer-friendly version end content © 1994-2006 HipMama"
    },
    {
      "tag": "h2",
      "text": "IPA Support the Site"
    },
    {
      "tag": "p",
      "text": "Interested in helping us support the site? click here for more info"
    },
    {
      "tag": "h2",
      "text": "User login"
    },
    {
      "tag": "div",
      "text": "Username: Password: Create new account Request new password"
    },
    {
      "tag": "h2",
      "text": "Navigation"
    },
    {
      "tag": "div",
      "text": "products recent posts news feeds syndication"
    },
    {
      "tag": "h2",
      "text": "About us & Welcome"
    },
    {
      "tag": "p",
      "text": "Hip Mama is a magazine bursting with political commentary and ribald tales from the front lines of motherhood. More... If you're new here, please take a moment to click around and check out the options. Additional info..."
    },
    {
      "tag": "div",
      "text": "adsense: cached"
    },
    {
      "tag": "h2",
      "text": "Sister Sites"
    },
    {
      "tag": "p",
      "text": "Ariel Gore Bee Lavender Girl-Mom Mamaphonic Whatever Mom"
    },
    {
      "tag": "h2",
      "text": "Yo Mama Says"
    },
    {
      "tag": "p",
      "text": "Check it out: Feature Articles HipMama MamaMail Yo Mama's Bookshelf"
    },
    {
      "tag": "h2",
      "text": "Recent blog posts"
    },
    {
      "tag": "div",
      "text": "Christmas pics \"Bad Santa\" *contains semi-spoiler* Our Christmas this year...(pic heavy) After Xmass Rush.. Santa outdoes himself and the pending resurrection of the kitchen witch... Advice on feeding baby do i stay or do i go? The best gift ever what to wear to work Photo testing more"
    },
    {
      "tag": "h2",
      "text": "Who's new"
    },
    {
      "tag": "div",
      "text": "stellabella mammasaid Daniel Wolfson motherinneedofadvice lilac32"
    },
    {
      "tag": "h2",
      "text": "Who's online"
    },
    {
      "tag": "div",
      "text": "There are currently 15 users and 262 guests online."
    },
    {
      "tag": "h3",
      "text": "Online users:"
    },
    {
      "tag": "div",
      "text": "mother4 kelly hogaboom meeshel bike n burley mama star CordeetMente redmomma larueparker Jenna maplesugar ..."
    },
    {
      "tag": "h2",
      "text": "Syndicate"
    },
    {
      "tag": "div",
      "text": "more"
    }
  ]
}