{
  "url": "http://www.htservices.com/Tools/VBandC/SerialCommunications.htm",
  "file_number": "493",
  "content_hash": "588ccc5b201c9f7c78131fa50552de00cfa43b48a36eafadd7884f412d7c0bc4",
  "total_blocks": 188,
  "retained_blocks": 46,
  "ignored_blocks": 142,
  "blocks": [
    {
      "tag": "h1",
      "text": "Visual Basic, VB, C# Serial Communications Example Tutorials\r\nSource Code Programs"
    },
    {
      "tag": "p",
      "text": "Serial communications has lost a lot of importance over the last five to ten years.  Now there are much higher speed and specialty\r\nnetworks.  However, there are still\r\nplenty of devices in factory and laboratory automation that only have a serial interface.  Hopefully this page\r\nwill help you understand what it takes to read and write devices using RS232,\r\nRS422, and RS485. Other resources include:"
    },
    {
      "tag": "div",
      "text": "ASCII character\r\n    reference chart RS232 pinout Industrial Networking & Communications Computer - PLC \r\n  communications"
    },
    {
      "tag": "h2",
      "text": "Original RS232 standard"
    },
    {
      "tag": "p",
      "text": "The original RS232 standard was developed about 40 years ago and specifies\r\nthat the maximum baud rate is 19,200 and the maximum cable length is 50\r\nfeet.  While that may have been good 20 years ago -- it's too short and\r\nslow today!  Although today's computers are clocked to support much higher\r\nbaud rates -- technically you need to be careful.  You also need to be\r\ncareful about using long cable lengths.  Many people have gotten 100 foot cables to work, the question is\r\nreliability.  If we are using good quality cable and connectors and have\r\nerror detection built into the protocol then we might go over the 19,200 and 50\r\nfoot limits.  Errors will be detected and we'll know how much of a problem\r\nit is.  Otherwise we'll stick to the limits to minimize our risk or use\r\nRS422 or RS485. RS422 and RS485 use a balanced line approach that eliminates many problems\r\nwith RS232.  For example Profibus is based on RS485 and Profibus runs\r\nat speeds up to 12 Mbaud (625 times faster than 19,200 baud).  The problems with RS422 and RS485 is that the set-up is more\r\ndifficult: you have to use more expensive cable (for proper impedance and\r\ncapacitance), properly terminate the ends of\r\nthe cables, set addresses, etc.  But the advantages are longer cable\r\nlengths, higher baud rates, and multiple devices share the same communication\r\nnetwork. If you want to learn more about the RS232, RS422, and RS485 click\r\nhere and click here ."
    },
    {
      "tag": "h2",
      "text": "Resources Required"
    },
    {
      "tag": "p",
      "text": "It does not take much to run and test these examples:"
    },
    {
      "tag": "div",
      "text": "One computer with two serial ports or two computers with one serial\r\n    port each Aserial cable (typically 9 pin female to 9 pin female) and null modem\r\n    adapter (or null modem serial cable) If you want to test RS485 then you will need two or more RS485 converters"
    },
    {
      "tag": "p",
      "text": "B&B Electronics and Black\r\nBox are two favorites for serial communications.  These two websites \r\nalso have tutorials about serial communications.  B&B Electronics products \r\nusually cost less but Black Box usually has higher quality.  So for demos, \r\ntraining, testing purposes we typically use B&Bequipment.  For actual \r\ninstallations we typically use Black Box.  (We want to minimize risk and \r\nthose calls in the middle of the night).  In all fairness to B&B \r\nElectronics, if you buy their products and all the separate options \r\n(isolation, surge protection, etc) that may be built-in to the Black Box \r\nequipment then you are at about the same price and quality \r\nas Black Box.  You can\r\nusually find serial cables, 9 and 25 pin connectors, null modem\r\nadapters, tools, and gender changers at your local Radio Shack, computer store or order on-line."
    },
    {
      "tag": "h2",
      "text": "Connection problems"
    },
    {
      "tag": "p",
      "text": "There are typically three problems that you will experience while trying to\r\nconnect serial devices:"
    },
    {
      "tag": "div",
      "text": "25 pin or 9 pin connectors Male and female connectors and cables DCE and DTE"
    },
    {
      "tag": "p",
      "text": "The RS232 standard started out with a 25 pin connector.  Most RS232\r\nconnectors today are 9 pins.  Try to work\r\nwith 9 pin connectors when ever possible so convert 25 pin connectors to 9 pin\r\nconnectors using 25 pin to 9 pin adapters. The second thing that will mess you up is whether the connectors are\r\nmale or female (pins or sockets).  Therefore it helps to have an assortment\r\nof gender changers (male to male, female to female).  (Please -- no e-mails\r\n-- I'm not making any of this up).  Gender changers come\r\nin both 9 pin and 25 pins.  If you have changed everything from 25 pin to 9\r\npin then you won't need many 25 pin gender changers. The third problem is DCE & DTE.  If two serial ports both\r\ntransmit on pin 2 and receive on pin 3 (i.e. they are both DTE) and you plug in a straight through\r\nserial cable then you will transmit into the transmit pin\r\n(not the receive pin) on the other end and the other device can't receive the \r\ndata.  That is what null modem adapters\r\nare for.  Null modem adapters swap the wire connections on pins 2 and 3\r\n(and also the handshaking lines) so that the transmitter (pin 2) goes into the receiver (pin 3)\r\nof the other device.  During the design phase you could worry yourself about this or you could just carry null modem adapters to the\r\ninstallation site with you.  Plug in the serial cable.  If it does not work then\r\ninsert the null modem adapter and then see if it works.  Note that you can\r\nbuy serial cables either straight through or null modem (crossed). Another trick to is to buy 9 pin RS232 to RJ45 (modular connector) adapters and then\r\nuse regular Ethernet cable to connect the adapters. Most RS422 and RS485 connections are done using screw terminals. \r\nTherefore you don't have to worry about gender changers and\r\nadapters."
    },
    {
      "tag": "h2",
      "text": "Getting Started"
    },
    {
      "tag": "p",
      "text": "The first step is to get connected and test out all the low level stuff:\r\ncables, serial port hardware, serial port drivers, interrupt conflicts,\r\netc.  The best way to do this is to attach the serial cable between two\r\ncomputers and run the HyperTerminal communications program that comes with\r\nMicrosoft Windows (Start, Programs, Accessories, Communications, HyperTerminal). \r\nYou run the HyperTerminal program on both computers and should be able to type\r\nmessages into the main text box and see them appear on the other computer. \r\nYou can also send text files from one computer to the other.  You can create small\r\ntext files to send using Notepad.  Just open Notepad type in some text and\r\nsave the file.  Note that in HyperTerminal\r\nyou will have to specify the connection to be direct to COM1, COM2, ... whatever\r\nserial port you plugged the cable into.  We would initially set the\r\ncommunications parameters (on both computers) to 9600 baud, no parity, 8 data\r\nbits, 1 stop bit. If this does not work then try the following:"
    },
    {
      "tag": "div",
      "text": "Try inserting the null modem adapter Check computer's setup to see that the serial port is enabled and what\r\n    COM port (1, 2, 3, 4, ...) it is configured for (hint: COM1 is address 3F8\r\n    hex and IRQ4, COM2 is address 2F8 hex and IRQ3, COM3 is address 3E8 hex and\r\n    IRQ4, and COM4 is address 2E8 hex and IRQ3). Check to make sure that infrared (IR) communications is not enabled on\r\n    that COM port Check to make sure that other devices are not interfering with that COM\r\n    port and the interrupt is not being used.  For example if you are\r\n    trying to use COM1 and a modem is trying to use COM3 and you are both\r\n    using interrupts then one or both programs will not function\r\n    correctly."
    },
    {
      "tag": "h2",
      "text": "Handshaking"
    },
    {
      "tag": "p",
      "text": "\"Handshaking\", when talking about serial communications, is how one \r\n      device tells another device that it is ready to receive data.  There \r\n      are several layers of handshaking.  There are the Data Terminal Ready \r\n      (DTR) / Data Set Ready (DSR) lines that indicate the other device is \r\n      plugged in, powered up and is present.  Then there is Request To Send \r\n      (RTS) / Clear To Send (CTS) which indicates that the receiver has room in \r\n      it's input buffer and is ready to accept data.  Third, there is XON \r\n      and XOFF.  XON and XOFF are a method that one device can use the \r\n      serial link to tell the other device to stop sending and then when to \r\n      start sending again. Suppose that there are two serial devices, A & B.  Let's say that \r\n      device Ais a Pentium 4, 3 GHz with hyperthreading, lot's of memory and \r\n      doing very little work.  It can transmit and receive very fast.  \r\n      But device Bis a special device with a CPU that is having to do a lot of \r\n      other things and find time for serial communications.  Also, device Bmight have a small receive buffer.  So if device Awere transmitting \r\n      to device Bthen device Acould transfer data much faster than device Bcould receive it.  So device Bwould use handshaking to tell device Awhen to stop sending and then when to restart. RTS/CTS are hardware and require wires to carry these signals between \r\n      devices.  XON/XOFF are special characters sent over the serial link \r\n      and do not require additional wires.  XOFF is the character CTRL-S \r\n      (ASCII code 19) and XON is the character CTRL-Q (ASCII code 17).  For \r\n      example, if you connect two computers with a serial cable and are able to \r\n      type characters on one computer and see the characters appear on the other \r\n      computer -- press CRTL-S (XOFF) on one computer to stop communications.  \r\n      Type on the other computer and you should see that the characters are not \r\n      transmitted.  Once you press CTRL-Q (XON) the characters should show \r\n      up because they were held at the transmitting computer until XON was sent \r\n      by the receiving computer. What if one device requires hardware handshaking and the other device \r\n      can not supply it?  You must \"jumper out\" the hardware handshaking \r\n      lines by wiring the RTS/CTS lines together and the DTR/DSR lines together.  \r\n      Note that some serial ports that use DTR & DSR also use Carrier Detect \r\n      (CD) and will want the CD line tied into the DTR and DSR lines."
    },
    {
      "tag": "h1",
      "text": "NOTE"
    },
    {
      "tag": "p",
      "text": "Visual Studio 2005 will include a new namespace called \r\n      \"Ports\" and a new class called \"SerialPort\".  Read all about it here: http://msdn2.microsoft.com/library/tf8zk72w.aspx VS 2005 is still in beta so you can download the beta \r\n      and play with it or wait till early in 2005 to get the released product."
    },
    {
      "tag": "h2",
      "text": "Writing Code"
    },
    {
      "tag": "p",
      "text": "Visual Basic 6 provides, free of charge, the MSComm control with Visual\r\nBasic.  This allows the programmer to quickly and easily configure the COMM\r\nserial port and then read and write data. The .NET framework does NOT have a control built-in for serial communications!  \r\nIguess us serial programmers just aren't cool enough for the developers of NET.  \r\nWell those guys can take their serial ports and ... Oh wait a minute.  In \r\nthe 101 VB.NET \r\n& C# examples that you download they wrote a serial port class and \r\ngive you the source code to learn from!  Cool.  This class is \r\nessentially a wrapper (we forgot what the \"official term\" for wrapper is in \r\n.NET) \r\nfor operating system API calls -- but very, very educational.  Problem is \r\nthat this example has some bugs in it.  For an updated version, we suggest \r\nyou check: Corrado Cavalli's serial \r\ncommunications source code at www.CodeWorks.it We view Corrado's code as the best \"open source\" .NET serial communications \r\nsource code because Corrado keeps updating it. NOTE that you could use the old MSComm ActiveX control with .NET programs.  \r\nHowever, this defeats the whole purpose of .NET managed code and XCOPY \r\ndeployment since you would have to register the MSComm control on every computer \r\nyou installed the software on (instead of simply copying the code). As of April 2004, Corrado, in our humble opinion, is not done.  So to \r\nfully understand everything, you will need to do a lot more reading: Microsoft Platform SDK on Device I/O Microsoft how to: Access Serial Ports and Parallel Ports by Using Microsoft \r\nVisual Basic .NET Microsoft Example Here is sample code on .NET managed serial control Serial \r\nCommunications in .NET MSDN \r\nMagazine: Use P/Invoke to Develop a .NET Base Class Library for Serial Device \r\nCommunications DBComm: DualBrain Serial Communications by Corey Smith For the smart readers that do not want to support, test, and debug your own \r\nserial port controls -- there are several companies that do for you -- however, \r\nyou have to purchase the software. Many companies sell old DLL and ActiveX controls.  One we have used\r\nfor many years is Greenleaf Software . \r\nThey include in their ActiveX all kinds of terminal emulators and file transfer\r\nprotocols such as ZMODEM.  But again these are not .NET managed code. Agreat source for .NET serial communications is Franson.biz's \r\nSerial Tools for only $30.  These guys sell it for the .NET framework \r\nand the .NET compact framework.  They also have some GPS components that \r\nwould be really cool for us computer geeks to play around with. Other sources of .NET serial communications is: Component \r\nScience Transport. Sax.NET Communications AFTek Software \r\nComControl Charon Software Other  sources of information on serial communications include: Chapter 21 (only on CD-ROM) of Dan \r\nAppleman's Visual Basic Programmer's Guide to the Win32 API Visual Basic Programmer's Guide to Serial Communications 3 by Richard Grier \r\nof www.Mabry.com"
    },
    {
      "tag": "h2",
      "text": "\"Poor Man's Serial Instant Messenger\""
    },
    {
      "tag": "p",
      "text": "Now that you have HyperTerminal running correctly on both computers we will \r\nreplace one of the HyperTerminal programs with our \"Poor Man's Serial Instant \r\nMessenger\" written in VB 6, VB.NET, and C#.  Run this program on one of the\r\ntwo computers with HyperTerminal running on the other computer.  When this\r\nworks then run \"Poor Man's Serial Instant Messenger\" on both\r\ncomputers.  You should be able to enter a text message (string), click on the\r\n\"Send\" button and the text is sent to, and displayed on the other computer. To download the VB6 source code for the \"Poor Man's Serial Instant Messenger\" click here . To download the VB.NET source code for the \"Poor Man's Serial Instant Messenger\" click here \r\n(sorry -- not yet ready). To download the C# source code for the \"Poor Man's Serial Instant Messenger\" click here \r\n(sorry -- not yet ready)."
    },
    {
      "tag": "h2",
      "text": "Serial Analyzers"
    },
    {
      "tag": "p",
      "text": "How many times have you had two serial devices communicating and no one wants to give you\r\nthe protocol?  Okay, maybe it's just us and a few other geeks.  The way to reverse engineer the protocol is to use serial\r\nanalyzers. You can reverse engineer anything from huge old legacy systems to\r\nnew protocols.  Several companies manufacture such devices:"
    },
    {
      "tag": "div",
      "text": "http://www.sinnovations.com/ http://www.angelfire.com/biz5/USDM/index.html http://www.runmode.com/ http://www.bb-elec.com/product.asp?sku=SPY32&dept_id=128 http://www.bb-elec.com/product.asp?sku=SIMPTERM&dept_id=128 http://www.bb-elec.com/product.asp?sku=STAS32&dept_id=128 http://www.bb-elec.com/product.asp?sku=STASPY32&dept_id=128 http://www.greenleafsoftware.com"
    },
    {
      "tag": "p",
      "text": "These programs allow you to \"break-in\" between two devices and\r\nrecord everything that they send back and forth. It takes a little time and\r\ntesting to relate specific communications strings to functions but once that is\r\ncomplete, it is easy to duplicate the commands and messages in VB or C#. Writing your own serial\r\nanalyzer program is good practice and we hope we will write one in the future to\r\nput on this website."
    },
    {
      "tag": "h2",
      "text": "Real-World Applications"
    },
    {
      "tag": "p",
      "text": "Once you have run all the previous tests successfully we are ready to get\r\ninto the real-world applications.  Most serial applications involve talking\r\nto some device with a manufacturer specified protocol.  The first step is\r\nto ask the manufacturer if they have an ActiveX, OCX, DLL, or similar software\r\nthat works with VB / C#.  If they do and the price is reasonable then\r\nwe suggest you buy their communications control. Another consideration is to buy software such as a WinWedge . \r\nYes you can write your own (using the \"Poor Man's Serial Instant Messenger\"\r\nas a starting point) but you\r\nthen have to support it which is a major pain. Assuming the manufacturer does not have anything available (or it costs\r\ntoo much money) then you will need to get\r\nfrom the manufacturer the protocol that the device talks.  If the\r\nmanufacturer does not want to give you the protocol then go back to the section\r\non Analyzers .  There are two\r\ngeneral classes of operation:"
    },
    {
      "tag": "div",
      "text": "The device automatically sends you the data once every time period or\r\n    test.  For example once a second or at the end of every\r\n    test. You have to poll the device to get it to send the data"
    },
    {
      "tag": "p",
      "text": "For the first case, it is very easy to write code to receive the data and put \r\nthe value into a VB / C# variable for use\r\nelsewhere in your program.  In fact the \"Poor Man's Serial Instant\r\nMessenger\" is a great start.  The second option (polling) is more difficult\r\nbut we provide an example later. The two items that determine the difficulty of implementing your own\r\nprotocol are the number of commands you\r\nhave to program and timing issues.  Sending one command that returns one\r\ncommand (set of values) from the device is simple.  Having to program many commands with\r\ndifferent possible responses becomes challenging.  Agood example of this\r\nis the many industrial & factory automation protocols in use today such as\r\nDF1 (Allen-Bradley), Modbus, and Profibus DP.  There are a lot of commands\r\nyou can send to a device using these protocols and there are typically more than\r\none response you need to handle. The other challenging problem can be timing.  Many protocols have\r\ntiming requirements.  For example you have a maximum time between\r\ncharacters and messages.  If you take longer than the maximum time, the\r\nreceiver has \"timed out\" and you have to start all over again. \r\nToday's processors are fast enough that this is not usually a problem.  But\r\nif you are sending a single character, running code to figure out the next\r\ncharacter, then sending another character, etc. and having a communications\r\nproblem -- try building the entire character string in memory first and then\r\nsending the entire string out the serial port at one time.  This reduces\r\nthe time between characters."
    },
    {
      "tag": "h2",
      "text": "Typical Protocols"
    },
    {
      "tag": "p",
      "text": "We will discuss two types of protocols: simple and complete.  Asimple protocol would something like \"value\" and then a carriage return\r\n<CR>.  The carriage return <CR> denotes the end of the message.  For example if you are reading values from a device and you get\r\nthe number 1 then is the actual value that the device is sending you 1, 10,\r\n1000, or any other number that starts with one?  When you receive the <CR> it denotes that all digits of\r\nthe value have been sent.  So now the receiver gets a 1<CR>, 10<CR>, or\r\n1000<CR>\r\nand can tell that they have received all the digits and easily convert the\r\nvalue. Note that the <CR> serves another purpose.  What happens if you look in \r\nyour serial input buffer and it has a lot of data in it?  How do you know \r\nwhere to start reading data?  The trick is to start reading characters \r\nuntil you read a <CR>.  Then throw all those previous characters away \r\n(since you don't know if they are a complete message or not).  So the <CR> \r\nserves as both the start and the end of a message. What if the device is sending multiple values, such as temperature and\r\npressure?  Then the protocol might be 115,128CR.  So now the receiver\r\nstarts reading a 1, then another 1, then a 5, then a comma, then a 1, 2, 8, and\r\nfinally a carriage return.  The logic in the receiver says read the first\r\nvalue until you reach a comma and then start reading the second value until you\r\nreach the carriage return. So far the simple protocol is great -- except what happens when the\r\ntemperature is 115 and the pressure is 128 but data is \"garbled\" in\r\nthe transmission (when a big 200 hp motor starts up) and the receiver receives\r\n115,28<CR> and shuts down the process because the pressure dropped to 28 PSI? \r\nHow is the receiver to know when the data is not correct?  That\r\nis why \"complete\" protocols are used -- they have more error detection\r\nbuilt in. What we call a \"complete\" protocol is one that typically has a\r\nStart Of Text (STX), sender address, receiver address, number of data values,\r\nthe data being sent, End Of Text (ETX), checksum, and then requires some form of\r\nacknowledgement from the receiver.  This \"complete\" protocol\r\nprovides several things:"
    },
    {
      "tag": "div",
      "text": "On a network with more than two devices, it allows a sender to send a\r\n    message to a specific device or broadcast to all devices ( for a broadcast\r\n    message the receiver address = 255 or\r\n    some other predefined value). The number of data values, (bytes or words) tells the receiver how many\r\n    bytes of data should be received.  Knowing the structure of the\r\n    message and the number of bytes allows you to see that all bytes were\r\n    received.  For example if the first byte is STX, the second byte the\r\n    sender, third byte the receiver, the fourth byte equals 10 for ten bytes of\r\n    data, then the receiver knows that bytes five through 14 are data and that byte\r\n    15 had better be the ETX character.  If the fifteenth byte is\r\n    not the ETX character then the receiver knows that it did not receive a\r\n    correct message and returns a negative acknowledgement (NAK) to the\r\n    sender. The receiver runs the checksum algorithm on the data received and\r\n    compares the receiver's calculated checksum to the checksum sent by the\r\n    sender.  If the checksums are equal then the receiver assumes that good\r\n    data was received.  If the checksums are not equal then one or \r\n  more of the characters have been \"garbled\". After all the checks are done on the receiver end, the receiver sends\r\n    an ACK or NAK back to the sender to tell the sender the status.  If the\r\n    receiver returns a NAK then the\r\n    sender usually resends the message.  The other purpose of ACK / NAK is\r\n    to tell if the receiver is still able to receive and respond to messages (the receiver has\r\n    not failed)."
    },
    {
      "tag": "h2",
      "text": "Serial Client & Server Example Programs"
    },
    {
      "tag": "p",
      "text": "We have written client and server examples that implement some protocol\r\nfunctionality.  The protocol is: STX, Number Variables,Variable1, Variable2, Variable3, Variable4, ETX On the transmit (server) side it is simple to create the outgoing string\r\nby simply concatenating the string.  On the receiver (client) side we want\r\nto read in a string of data values and then parse the string of data\r\nvalues.  To do this we create a simple two state machine.  The first\r\nstate is \"Waiting for STX\" and the second state is called either\r\n\"Reading Data Values\" or \"Waiting for ETX\".  So we wait\r\nfor a STX character to be received.  When a STX character is received we\r\nstart \"recording\" the incoming characters.  Then we stop\r\n\"recording\" incoming characters when a ETX character is\r\nreceived.  Once the ETX character is received we send the\r\n\"recorded\" string of data values to a parsing routine that picks out\r\nthe individual values.  Then the receive cycle (state machine) starts over\r\nwaiting for STX. This program is neat to try out using RS485.  You have one server and\r\nmultiple clients all  \"daisy-chained\" together and all the\r\nclients receive the data sent from the server.  However, this is a\r\npain to set-up and even we have better things to do. To download the source code for this example click\r\nhere ."
    },
    {
      "tag": "h2",
      "text": "Famous Automation Protocol Definitions"
    },
    {
      "tag": "div",
      "text": "DF1 - Allen-Bradley \r\n  (Rockwell) Modbus"
    },
    {
      "tag": "p",
      "text": "If you want examples of how to write the A-Bprotocol we recommend that you \r\npurchase the Home Automation \r\nBasics book ."
    },
    {
      "tag": "h2",
      "text": "RS422 & RS485"
    },
    {
      "tag": "p",
      "text": "Most of the changes for RS422 and RS485 are in the hardware and\r\ncabling.  For example, you have to use special purpose, high quality cable\r\nand connectors, terminating resistors, set addresses, etc.  Usually there are not any changes in software.  The only\r\nchange in software being with 2 wire RS485 you sometimes need to toggle one of the handshaking\r\nlines to enable the transmitter.  Some converters automatically do this for\r\nyou.  For more information we would recommend:"
    },
    {
      "tag": "div",
      "text": "B&B\r\n    Electronics RS422 & RS485 Applications Notes B&B\r\n    Electronics \"Basics of the RS485 standard\""
    },
    {
      "tag": "h2",
      "text": "Tips & Tricks"
    },
    {
      "tag": "div",
      "text": "Use high quality cable and connectors in your installed applications. For long distances use repeaters to isolate and reamplify the\r\n    signal. For distances over 50 feet or noisy environments convert RS232 signals\r\n    to RS422, RS485, or fiber optics. When talking to multiple devices over a large distance, instead of\r\n    having one communications cable running everywhere have two or more\r\n    communications modules with separate and shorter cables. Boards, devices, and connectors that include built-in terminating resistors are preferred\r\n    over those that do not provide such provisions.  Trying to insert your\r\n    own resistor across two points usually fails over time. Follow proper grounding methods.  Use heavy gauge wire or special\r\n    purpose grounding straps.  We have been called out to many problems that\r\n    were grounding problems. Use isolation as much as possible.  Use isolation on the\r\n    communications cable, on the incoming power, etc. If things don't seem to work right, slow the baud rate way down (9600\r\n    baud or even slower) and try it again.  If the problems go away then most\r\n    likely you have noise, improper grounding, termination, cheap cable or\r\n    connectors, etc. For cables that run outside the building for lightning protection you\r\n    should use a full complement of surge protection such as fuses, gas\r\n    discharge tubes, and semiconductor Transient Voltage Suppressor\r\n    (TVS). Keep your communication cables away from all sources of noise.  Do\r\n    not run near fluorescent lights, AC power cables, DC power cables over 24\r\n    VDC, large motors, variable frequency drives, etc.  Best installation\r\n    is putting communications cables in their own grounded conduit.  If you\r\n    must cross AC cables then do so at right angles. See B&B\r\n    Electronics article IF you can, when reading and writing to a device, group the data into\r\n    large blocks of data.  For example, if you need to read 20 temperatures\r\n    from a PLC that are spread throughout the PLC memory, use PLC\r\n    \"move\" commands to copy the temperatures to one continuous block\r\n    of memory.  Now your program doing the reading only needs one read\r\n    command of twenty values instead of twenty read commands of one value. \r\n    Overall system performance will be much faster."
    },
    {
      "tag": "p",
      "text": "We try to offer a fair and balanced opinion on every \r\n                    page of our website.  We would appreciate more \r\n      information from other  users to express their opinions which we will \r\n      then incorporate.  If you have questions or comments please post them \r\n      on our message board (see button in left hand column) so that others can \r\n      read and benefit. Click here to find out how High \r\nTech Services can help you implement this technology. Copyright  1984-2005 CompanyLongName HTS, Cary, Raleigh, RTP, North Carolina, NC.  \r\nAll Rights Reserved.  All trademarks are the property of their owners. Prices \r\nand specifications subject to change without notice."
    }
  ]
}