{
  "url": "http://www.humanrights.gov.au/movingforward/speech_ruddock.html",
  "file_number": "494",
  "content_hash": "50e1165ea94a0ebff97ed572e883ce847992d8506df184a328805a304de9aa5c",
  "total_blocks": 91,
  "retained_blocks": 8,
  "ignored_blocks": 83,
  "blocks": [
    {
      "tag": "div",
      "text": "#BeginTemplate \"/Templates/moving_speeches.dwt\" #BeginEditable \"text\""
    },
    {
      "tag": "h2",
      "text": "Reparations for the stolen \r\n          generations - Government responds"
    },
    {
      "tag": "h3",
      "text": "Speech delivered by the \r\n          Honorable Philip Ruddock, MP. Minister for Immigration and Multicultural \r\n          Affairs"
    },
    {
      "tag": "div",
      "text": "Good afternoon Ladies and Gentlemen."
    },
    {
      "tag": "p",
      "text": "May Iacknowledge \r\n          the traditional owners of this land, the Gadigal (Gad -e- gal) people, \r\n          of the Eora (Ee-or-a) nation Iunderstand very \r\n          well that the subject of this Conference raises again the hurt and trauma \r\n          of the past and that this is difficult for all of us. Ido know that \r\n          there are many different views about these issues and Iknow that what \r\n          Iam about to say will not be appealing to all. Having said that, \r\n          Ithank the organisers for the opportunity to put to you an honest explanation \r\n          of the government's position on these important matters. Let me also say \r\n          that Ithink you have set yourselves an exceedingly ambitious task in \r\n          seeking to develop a model for reparations and, in particular, individual \r\n          financial compensation. The past practices \r\n          of child separation represent one of the most comprehensively and roundly \r\n          criticised chapters in Australia's history, regardless of how well intentioned \r\n          our predecessors (our parents and grandparents and their parents) might \r\n          have been. The effects are still felt by a significant number of removed Aboriginal \r\n          children, their families and their communities. The 1999 Parliamentary \r\n          Motion of Reconciliation provided a very genuine expression of deep \r\n          and sincere regret felt by most Australians. The Bringing \r\n          Them Home Report Iknow that we \r\n          are not here today to discuss all of the recommendations of the Bringing \r\n          Them Home report. The question of reparations represents only a \r\n          subset of those recommendations And, as you know, \r\n          the idea of individual monetary compensation is itself only one aspect \r\n          of the reparations agenda proposed in the report. Other forms of \r\n          reparations included acknowledgment and apology, guarantees against \r\n          repetition, measures of restitution and measures of rehabilitation. In its response \r\n          to the report the federal government embraced many of these proposals. The national oral \r\n          history project and the Parliamentary motion of regret are nothing if \r\n          not an acknowledgment of and warning against repetition; the records \r\n          access, parenting, family reunion and tracing services are obvious forms \r\n          of restitution and, together with the network of counsellors, they also \r\n          constitute a program of rehabilitation for those affected. In these and other \r\n          ways the federal government has already accepted the principle of reparation \r\n          as proposed by HREOC, of trying to make good the damage that has been \r\n          done. Some commentators \r\n          are comparing our approach to that of other countries. May Ireplace \r\n          some fallacies with fact. The South African \r\n          government has still not accepted the Truth and Reconciliation Commission's \r\n          recommendations for a scheme of individual financial compensation nor has the Canadian government adopted proposals for such a scheme \r\n          (although like us, it has funded family reunion, counselling and other \r\n          healing programs) and nobody in New Zealand has ever received individual \r\n          financial compensation as a result of the Waitangi Tribunal process. Commonwealth \r\n          Response We have said, clearly \r\n          and consistently, that appropriate and practical steps should be taken \r\n          to address the hurt and trauma experienced by the separated children \r\n          and their families. In doing so we have focused in particular on family \r\n          reunion, the issue identified in Bringing Them Home as \"the most \r\n          significant and urgent needs of separated families\". And just a few \r\n          months ago the Commonwealth reaffirmed this commitment by extending \r\n          funding for the Link Up and related initiatives to bring the Commonwealth's \r\n          total contribution to $117 million. Compensation \r\n          and a Tribunal The Commonwealth (and the States) did not, however, accept the recommendations \r\n          concerning individual monetary compensation and a national compensation \r\n          tribunal: first, monetary compensation to individuals is not seen as \r\n          the most appropriate way of dealing with family separation; second, \r\n          given the varied and largely undocumented circumstances of the individual \r\n          historical events in question, it would be impossible to devise and \r\n          apply any such scheme in a practical and equitable manner; and third, \r\n          an alternative tribunal process does not avoid the trauma of revisiting \r\n          past events, nor does it by keep matters out of the hands of the legal \r\n          profession and the courts. Today Iwant to \r\n          focus on the feasibility of devising a practical and equitable scheme. The first and most \r\n          fundamental question you need to consider is that of who you would and \r\n          who you would not compensate. For example, would \r\n          financial compensation be available to those children and families who \r\n          are subject to contemporary separation practices or only to those separated \r\n          in the past? And if you are \r\n          talking only about the past, what would be your cut-off point? Would you restrict \r\n          financial compensation only to the children themselves or would you \r\n          extend it to their families, descendants and communities (as recommended \r\n          by HREOC)? If you decide that \r\n          the children, families and communities of the separated children would \r\n          not be eligible for compensation from the tribunal, then you are faced \r\n          with the prospect of much of the existing litigation continuing in the \r\n          courts. But even if you \r\n          do decide to grant them eligibility for compensation, that raises another \r\n          set of questions: how do you define which family and community members \r\n          are eligible? Do you take a culturally \r\n          appropriate broad definition of \"family\" and \"community\"? One of the most \r\n          basic questions that a statutory compensation scheme would have to address \r\n          is that of defining and deciding the circumstances that warrant compensation. You would need \r\n          to distinguish those cases where adoption or separation was voluntary \r\n          or involuntary but warranted from those where separation was both involuntary \r\n          and unwarranted the mere fact of childhood separation does not of itself \r\n          justify compensation. It has been said that a statutory scheme would be much simpler and therefore \r\n          less costly than a normal judicial process. However, a large proportion \r\n          of the costs of any such assessment in these cases is the difficulty \r\n          of researching and reliably reconstructing events so long after they \r\n          actually took place. This is very different \r\n          from reconstructing the circumstances of a recent crime as in a Victims \r\n          Compensation Tribunal. It is also very different from the Canadian situation \r\n          where at least everyone knows who was and who was not enrolled in their \r\n          residential schools. As your conference \r\n          papers themselves acknowledge \"…questions about the validity \r\n          of individual acts of removal … are enormously complex and variable..\". Locating relevant \r\n          documents and witnesses so long after the event would confront both \r\n          the claimants and the respondents before a tribunal, just the same as \r\n          if they were before a court. There are another \r\n          series of questions: how would you apportion the onus of proof, and \r\n          what would be the burden of proof, that is, to whom would you give the \r\n          benefit of the doubt? And this would \r\n          also involve making a trade-off between the rigour of the decision-making \r\n          process and the eventual costs of any compensation scheme, the less \r\n          rigorous the process, the greater the ultimate costs of compensation, but the more \r\n          rigorous the process, the closer you get to the equivalent of a full-scale \r\n          judicial hearing. Afurther question \r\n          you need to consider is what avenues and grounds of appeal should be \r\n          allowable from decisions of a compensation tribunal. Then there is the \r\n          question of who would be responsible for paying the compensation, and \r\n          what would be the limits (if any) on the quantum of compensation. The answer to this \r\n          question - combined with the questions of how many children were actually \r\n          removed and how many of their family and community members would be \r\n          compensated - will directly impact on the overall cost of any such scheme. In its submission \r\n          to the Senate Inquiry, for example, the Commonwealth estimated the total \r\n          potential cost of compensation as some $3.9 billion. If people wish \r\n          to argue that pursuit of such claims through the courts is too costly, \r\n          then they must also seriously examine the potential cost of any alternative \r\n          scheme The administrative \r\n          costs alone would be prohibitive if a tribunal were also to have an \r\n          investigative role and \"a full time presence at the local level\" \r\n          [as is being recommended in your conference papers]. Whatever the quantum \r\n          of individual compensation, there is also the related question of who \r\n          would pay? One option being \r\n          proposed is a national compensation fund to which all governments and \r\n          churches would contribute. In the first instance \r\n          the States and churches would have to agree on their relative contributions \r\n          to such a fund; and they would also have to agree, in effect, to a blank \r\n          cheque, in case the initial fund proved inadequate; and, in view of \r\n          that possibility, they would almost certainly require severe strictures \r\n          to be imposed on the design and operation of any compensation tribunal. It would be more \r\n          realistic and more appropriate for the States and the churches to be \r\n          directly liable to compensate the children whom they removed. What Ihave described \r\n          today are the sorts of questions that the Commonwealth encountered when \r\n          it examined the idea. The alternative \r\n          of pursuing compensation through the courts is not without its problem, \r\n          as we all know. But a tribunal \r\n          process would not necessarily do away with the trauma of revisiting, \r\n          recounting and reliving past events And if it were \r\n          to have any credibility, a tribunal mechanism would still entail the \r\n          complex and costly process of reconstructing and verifying distant events. \r\n          Nor would it see an end to the litigation, since no one has proposed \r\n          that common law alternatives (or appeals) would be ruled out. It is the government's \r\n          view that any additional resources that might be used for compensation \r\n          should be channelled towards family reunion and related services. And we are not \r\n          alone in that view. Not one State government has committed itself to \r\n          providing financial compensation. Federal Labor is \r\n          the same. Indeed, the previous Federal Labor Government initiated the \r\n          defence of the Kruger and Bray constitutional challenge to the NT Aboriginals \r\n          Ordinance that was at the centre of the Cubillo and Gunner case. The NSW Labor Government \r\n          defended the Williams case. Premier Carr said, \r\n          \"Ithink we've got to move beyond the idea that we can do it by \r\n          making a cash payment to compensate for things that happened in our \r\n          past\". And most recently \r\n          the Leader of the Opposition and the Shadow Minister have stopped talking \r\n          about a \"compensation tribunal\" (as they did until a few months \r\n          ago) and are now only promising a \"national conference\" to \r\n          discuss \"alternative means of resolving these matters\". The Way Forward The real question \r\n          is how can we best redress the effects of past policies and practices? \r\n          This is a question not just for the Commonwealth, but for State and \r\n          Territory governments, the churches and the community as a whole. Ibelieve that the government's $117 million response to the Bringing \r\n          Them Home report is a substantial demonstration of our commitment \r\n          to assist those that have been affected by past practices. We do need to move \r\n          forward and, as a community, we need to make sure that we do all we \r\n          can to address the severe disadvantage that is faced by so many Indigenous \r\n          Australians today. All of us need \r\n          to work hard to ensure a better life for future generations."
    },
    {
      "tag": "div",
      "text": "#EndEditable"
    },
    {
      "tag": "p",
      "text": "Illustration \r\n        motif based on originial fabric design by Bronwyn Bancroft , courtesy \r\n        of Boomalli Aboriginal Artists Co-operative © Human Rights \r\n        and Equal Opportunity Commission. Last updated 12 February 2002. Your comments and feedback are welcome.Email us at: webfeedback@humanrights.gov.au"
    },
    {
      "tag": "div",
      "text": "#EndTemplate"
    }
  ]
}