{
  "url": "http://members.shaw.ca/save-wild-horses/index1.htm",
  "file_number": "110",
  "content_hash": "9599628e9b652d34066ffda89e09c029fb0524c77d5a71627c2cf7a4a1a1b5aa",
  "total_blocks": 9,
  "retained_blocks": 3,
  "ignored_blocks": 6,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\" View Guestbook by James Martindale Slim\r\nDavis 1908-2002 : \" They\r\ngot a right to live.\" Exciting\r\ndiscovery - bred-in-the-wild Spanish mustang. See Shandi, click\r\nbelow Shandi RIP Shandi  1977-2004 Key\r\nnew research paper concludes \"Horses are indisputably native fauna.\" Click\r\nhere Contact\r\nnumbers below To Links Warning: Gruesome p hoto s HORSE SLAUGHTER STATISTICS Background\r\n& Endangerment of Mustangs in Canada The\r\nSlim Davis Story Mustang\r\nReading List Hummingbird\r\nRanch, near Red Deer Alberta, 1996 Vast, indigo nights like this\r\nhappen only in the Alberta foothills. Underfoot, bunchgrass and sage. Overhead,\r\nendless stars. Slim Davis and Iwander in the twilight toward his back-forty,\r\nin  the direction of the western hills. From Daviss ranch, a few\r\nmiles west of Red Deer,  the bulk of the Rockies rises 100 miles away,\r\nlooking like the shoulders of some ancient sleeping behemoth. Up through\r\nthe shadows sails an apparition. Adark equine shape, pony-size. She seems\r\nsmall by any standard . cont'd Slim\r\nDavis 1908-2002 :\" They\r\ngot a right to live, that's all.\" Rare\r\nphoto of wild ponies near Red Deer, Alta.They're small and scruffy. Quiet,\r\nquiet. The mare steps through the dark. She whinnies her pleasure at Daviss\r\nfamiliar scent,  flinching  for a few seconds, unsure of my presence.\r\nDavis reaches out a reassuring hand, running it lightly up her side, over\r\nher mottled gray spots, up the quivering neck. Combing his fingers through\r\nthe tangled shag on her neck, he whispers to me, in the darkness, These\r\nhere are witches tails, these tangles. Theyre from when the witches ride\r\nem at night. Only the real wild ones have em. Thats how you tell. Daviss wild mare is\r\nlikely the only true mustang (Mustang - from the Spanish, monstrenco -\r\nroving, rough, wild) in captivity. True to her spirit, she escapes regularly,\r\nbut she always comes back to him. The wild instinct is in her. Inever\r\ndid break her, he laughs. The species the mare represents is typically\r\nsmall in stature, with a stocky build, large head and flowing mane and\r\ntail almost reaching the ground. Her kind are  plain rugged, hardly\r\nthe Hollywood movie version of the Western horse. Their rough-cast stoutness\r\nis the very quality that has allowed them  to survive the fierce strenuousness\r\nof the Old West and the less picturesque cruelties of modern times. Certain wildlife officials\r\nand sport hunters have claimed the wild horses of Western Canada are merely\r\nferal -  just  runaway packing horses from old logging and mining\r\ncamps. But Daviss lean, scruffy\r\nponies of the foothills are indeed the true item. His mustangs are the\r\ntough, rough mares and stallions of legendary Indian days, not at all like\r\nthe bovine scrags  commonly called mustangs by some. Unfortunately, Albertas\r\npopulation of feral  runaway horses hogs the public attention \r\nthat ought to go to the real mustangs. Most notably, the runaways roaming\r\nthe fenced-in grasslands of CFB Suffield,  northwest of Calgary, have\r\nbeen made famous by highly publicized protests over a 1988  roundup.\r\nProtestors mistakenly called the heavy Suffield horses mustangs. In fact, \r\nthe feral horses of Suffield, with their mixed Shire,  Suffolk and\r\nClydesdale bloodline, are no more mustangs  than Old Bessie. Their\r\nclaim on Western heritage is dubious. If anyone knows the\r\nmustangs, Davis does. He has been their advocate for decades,  having\r\nbeen instrumental in persuading the Alberta government in 1974 to stop\r\nissuing seasonal licences to hunt them. Still, he says, Its something\r\nterrible what theyve done to them horses. Theres not too many left. Theyve\r\nbeen hunted and chased, and killed. Theyre scattered and gone. Nobody\r\nseems to care about the mustangs, says Davis, including even the Humane\r\nSociety, who, he says, should do something about the condition in which\r\nhorses often arrive at auction houses. Theyre too often delivered to auction\r\nbleeding, crippled, and blinded by  their frantic struggling against\r\nthe leg snares hunters use to trap them, says Davis. Davis, born in 1908 to a horsemans\r\nfamily, grew up  alongside the Blood, Blackfoot, Cree and Stoney Indians\r\nof  Alberta, peoples whose traditional history and culture began and\r\nended  with the tough little mustangs of the wild. In 1920,  Slim first\r\nencountered the wild ponies. In those days wild horses numbered in the\r\ntens of thousands in the Alberta foothills.  This ol Indian said \r\nthe little horses had been there as long as the Indians could remember,\r\nand probably long before, he said. The Indians told him no one\r\nwas certain where the  horses had come from, historically speaking,\r\nbut they knew that the horses figured big in ancient legends. The American West had once\r\nbeen a virtual wild horse dominion. As late as the turn of the 19th century,\r\nenormous herds of mustangs, possibly numbering in the millions,  roamed\r\nthe prairies alongside the immense herds of buffalo. Indian Days were Mustang\r\nDays. The situation a century\r\nlater is startling. Only a few hundred  mustangs have survived the\r\ntwentieth century, roving the  foothills of Alberta and B.C. Today Western Canadas\r\nwild  horses are hunted, scalped, and\r\nskinned like muskrats. Nature and history\r\nhave colluded to make the remaining few mustangs the most aloof of creatures. \r\nTheir continued survival  depends on their need to remain free. They\r\nliterally cant survive in captivity, as they will themselves to die\r\nin  conditions of confinement or duress. * Snares\r\nused by hunters would sometimes break the mustang's legs"
    },
    {
      "tag": "p",
      "text": "Modern archaeology looks to fossil remains\r\nfrom sediments in Wyoming suggesting that Equus Caballus, the horse, was\r\nnative to North America 60 million years ago. The  horse alternately\r\nappears and disappears from the fossil record at about one million year\r\nintervals. All trace of  the horse is lost by about 25,000 years ago.\r\nThe species was unknown to the American continent when  Columbus sailed\r\nfrom Spain on his voyage of discovery. But  historians say that\r\nColumbus , and even the subsequent Spanish explorers, Coronado and DeSoto, \r\ncouldnt themselves have reintroduced the  lost species to North America.\r\nThey argue that, although the earliest Spanish explorers did indeed bring\r\nhorses with them to the New World, they brought only limited  numbers\r\nof the animals, and very few of those were mares.  Coronado, for example, \r\nwrote in his diary that he had brought five  hundred and fifty-eight\r\nhorses, two of them mares. Two mares could hardly have stocked the whole \r\ncontinent,  say historians. More likely sources for the\r\nNorth American population of ponies, say historians, were stock-raising\r\nranches established by the Spanish in the Santa Fe area between the 1550s\r\nand the 1700s. The ranches furnished ideal conditions for the spread of\r\nhorses to the rest of the continent : friendly contact with the Indians\r\nthrough trade, an ample supply of horses, and plenty of opportunities for\r\nthe Indians to study possible uses for the new creature. Logically, the movement of\r\nhorses into the North Americas would have followed established  inter-\r\ntribal trade routes. From Spanish records we know that, beginning around\r\n1600, southwest tribes such as the Utes, Comanches, Apaches and Kiowas\r\nbegan raiding the Spanish ranches and stealing large numbers of horses.\r\nFrom those  tribes, the horses slowly spread across the continent.\r\nLa Verendrye reported that tribes living northeast of the  Black Hills\r\nin Montana had no horses when he visited them in 1738. Yet just 16 years\r\nlater in 1754 Anthony Henday, the Hudsons Bay Company explorer, met Assiniboines\r\nin the same area who had horses, though they used them only for packing,\r\nnot for riding. By 1766 Henday reported numerous Assiniboines now skillfully\r\nriding the horses. Several Indian tribes have\r\noral traditions chronicling their first acquisition of horses : Tetons\r\nsay they got theirs from the Arikaras; Shoshonis from Comanches, and Nez\r\nPerces from Shoshonis. In\r\n1827 an American trader, Robert Meldrum, reported that old Crow people\r\ntold him their generation was the  first generation of Crows to see\r\nhorses. So it was that the hardy Spanish\r\nponies gradually populated the North American continent, as possessions\r\nof the native peoples. Wild herds of escapees were\r\nreported by the late 1800s, though they were mostly ignored by the Indians,\r\nas  domestic ponies were plentiful and easier to handle. Eventually horse- stealing\r\nbecame the foremost means to  acquire more horses, and full blown\r\nhorse culture was in full swing among the Indian tribes by the end of\r\nthe century. The Indian pony - small, squat  and  tough - \r\nbecame the mainstay of Indian life, indispensable in transport, warfare,\r\nleisure, hunting, religion and trade.     So it was\r\npractically inevitable that Indians began to measure wealth by the number\r\nof horses a man owned. The number of horses owned by individual Indians\r\ngrew dramatically. Ute father\r\nand son  riding their ponies ca.1870. Notice the mustang's \"fox\r\nears\" and heavier forequarters,  typical mustang\r\nconformation . Among the Piegan people the horse-to-people\r\nratio grew from about 1-1 in 1860 to 3.5-1 by 1895. But a wealthy individual\r\nmight easily have as many as 500 horses in his personal herd. In the Indian\r\neconomy, if a man had a lot of horses, he had prestige, and could thus\r\nattract more wives, have more children, produce more meat and produce more\r\ntrade goods. Aman with a substantial herd was affluent. The summer of 1886 was\r\na hot one on the prairies, just 22 years before Slim Daviss birth in Carmangay,\r\nAlberta.  That year saw the last major horse-raiding party of the\r\nOld West. Canadian Piegans rode down out of the Calgary area to the Pryor\r\nCreek area of northern Montana. They made off with 60 horses stolen from\r\nthe Crows camped there. To this day a mysterious herd of wild horses is\r\nknown to exist in the Pryor Mountain area. Some Crows say these horses\r\nmust be descendants of  the surviving stock of the Custer battle at\r\nBighorn, which took place just a few miles away. * Wild Horses spotted in the Chilcotin\r\nDistrict of British Columbia, where legal slaughters took place in the\r\n1980s. Maddeningly, it is the argument\r\nover the bloodline of the wild horses that is used today by sport hunters\r\nand commercial hunters to rationalize their slaughter.What are you protecting\r\nanyway? asked Gerry Kemp, senior wildlife management biologist with the\r\nAlberta lands and forests  department in 1974. So-called wild horses\r\nare only the  descendants of work animals from farms, or lumbering\r\nor  mining operations that have been turned into the wild and \r\nsurvived. The best thing\r\nthat could be done with wild  horses would be to shoot em all said\r\nKemp. Mustangs have, accordingly,\r\nbeen shot for target practice, bated with poison for predators, slaughtered\r\nfor dog food, chased and tormented - subjected to every kind of maltreatment\r\nknow to man. Objections have been raised  on the grounds of cruelty,\r\nbut professional wild horse hunters shrug their critics off. Round em\r\nup, and shoot a tranquilizer into them, and those horses dont give a damn\r\nwhether they end up as dog food or rodeo buckers, one big game hunter\r\nremarked to a Calgary reporter. In the 1950s, the slaughter\r\nreached high gear when hunters discovered that the horses could be panicked\r\nby dive-bombing airplanes. Terrified horses were buzzed from above, and\r\nraced  cross-country until, at the point of exhaustion, they could\r\nbe driven into corals. Frantic, the horses were  loaded into waiting\r\ntrucks for transport to auction or slaughterhouses. Many would arrive at\r\nthe slaughterhouse  already dead, trampled to death in transit. It\r\nwas not an  uncommon sight to see the trucks dripping blood on the \r\nhighways. Some of the trampled\r\nhorses had simply dropped dead of fright. Mustangs have this peculiar will to die - so  sensitive and vulnerable\r\nare they to pursuit and capture.  Explorer David Thompson documented\r\nthis  amazing vulnerability of mustangs as early as 1809. He wrote\r\nin his diary  while crossing the West that wild horses froze as if \r\nparalyzed when his men merely shouted a halloa and dashed at them. He\r\nwas only the first of many horse  runners to report the phenomenon.\r\nModern hunters still  observe that stallions, in particular, commonly\r\nseem  unable to survive the ordeal of being captured and will \r\nto die within hours or days of being deprived of their  freedom. Whole\r\nbands have collapsed in paroxysms of fear  when subjected to the experience\r\nof being rounded up and corralled. Chief  forester in 1959\r\n, W.R. Hanson said, They [protesters] talk about inhumane  methods,\r\nor protest emotionally to the government against  the extinction\r\nof one of the features of the old wild  west...[but] there is nothing\r\ncruel about the airplane  roundup. The only part you might have doubt\r\nabout is the  loading of the frightened animals onto trucks. \r\nNevertheless,  the dive-bombing bloodbaths were brought to an end\r\nin 1959. Forest conservation officials felt pressured  by  public\r\ncries for more compassionate treatment of  the mustangs, and, magnanimously,\r\ndecreed that roundup by cattle horse, not by dive-bombers,  was the\r\nonly humane way to go. The\r\nnumbers of  mustangs has been in dispute for more than a century. \r\nA 1895 police census showed 42,257 wild horses on the range in Southern\r\nAlberta. In 1958 a roundup expert said huge tracts of Alberta land carried\r\nvast wild horse herds. The whole place is a wild horse kingdom, said\r\nChester Utter in a report in The Albertan newspaper in August, 1958. Utter\r\nboasted that he alone had rounded up more than 40,000 horses. One year\r\nlater, in 1959, the Calgary Herald carried a front-page story saying the\r\nhorses were facing extinction. The next year, 1960, the Alberta Cattlemens\r\nAssociation said there were some 3,000 still roaming at will. By 1977,\r\nThe Herald thought that about 1,000 head of wild horses roamed the foothills.\r\nIn 1991 Alberta Fish and Wildlife counted 300 mustangs roaming free in\r\nKananaskis Country. In 1974, Calgary Socred MLA\r\nArt Dixon agreed with  the mid-70s figure of about 1,000, but argued\r\nthat if  the annual hunt continued the horses would soon be wiped \r\nout. Spurred on by Slim Davis and the thousands of names he had collected\r\non a petition, Dixon successfully lobbied the Alberta legislature to \r\nstop the regular issuing of hunting permits for wild horses. With this regulatory move\r\nin 1974, horses roaming on  Crown lands in Alberta could no longer\r\nbe legally hunted. But horses straying onto private lands were, and still\r\nare,  treated  as fair game for hunters, in season year- round. Aprivate members bill passed\r\nby the Klein government in 1993 making the capture of horses on public\r\nland more  than just a minor regulatory infraction  merely re-jigs\r\nthe 1974 regulation. Mustangs that make the horrible mistake of straying\r\nonto private property are still legal prey for hunters in Alberta. In B.C., in 1988 the Vancouver Sun\r\nreported three herds of  mustangs ranging the Chilcotin district .\r\nThe largest of the herds, the Red Brush herd, numbered 150. Two smaller\r\nherds, the Bidwell\r\nand Haines Creek herds, were legally massacred in 1988, reducing their\r\ncombined  numbers from well over 100 to 35. Regional wildlife \r\nofficials authorized the 1988 roundup, claiming the horses  were reducing\r\nvaluable grazing land during a severe  drought. Wild horse lovers passionately\r\nchallenge hunters claims that most mustangs are  just feral rejects,\r\nnot living descendants of heritage stock. American\r\nwild horse advocate Hope Ryden attacked the  feral argument in the\r\n1970s.  Ryden, who worked as   features producer for ABC\r\nNews from 1966 to 1968, argued  persuasively in her book Americas\r\nLast Wild Horses  that the very fact that these horses have prevailed\r\nfor so  long against so many odds - hunters, bitter weather, rough \r\nterrain, extensive grazing competition and high infant  mortality \r\n- suggests that they must come from  exceptionally hardy stock, namely,\r\nthe Spanish stock of  the original Indian ponies. Rejects from domestic\r\nherds, she argues, would never have survived over the years under \r\nsuch conditions. It was the animal that\r\nwas originally  the most Western that survived the harsh test of\r\nthe  wild. The big, slow gentle farm horses and the high - strung,\r\ngrain-fed horses were not creatures that could  easily adapt to bleak\r\nhabitats and rugged winters, wrote Ryden. Ryden further warranted the\r\npurity of the mustang pedigree based on the fact that there has been no\r\ngenetic  break in the continuity of the wild horse bloodline from\r\nthe last century to this century. Since  the West was opened, she\r\npointed out, though the total  number of wild horses has dwindled\r\ndrastically the wild  horse population did not at any time vanish.\r\nTherefore, she said, the mustang bloodline  extends perfectly from\r\nthe 16th century to present day. From Columbus to Slim Daviss mare - one\r\nunbroken genetic heritage. * In one corner, romantics and \r\nheritage advocates;  in the other,  ranchers seeking to protect\r\ngrazing  lands and hunters serving the horsemeat markets.  In\r\nthe middle, a sparse population of excruciatingly\r\nshy broomtails roving the hills of Alberta and B.C. Are there only 300?\r\nOne thousand? Thirty-five? Really, Slim Davis sums it\r\nall up : Ispent a lot of time in the mountains in the last 50 years\r\nor so. The wildlife is nearly gone. Its four years since  Iseen\r\na mountain goat. There are some mountain sheep  left, but with all\r\nthe trophy sheep huntin now, theyll  be gone soon, too. Now its\r\nthe horses. They got a right   to live, thats all. * One manager of a\r\nCalgary slaughterhouse that \"processes\" horseflesh confessed to the Calgary Albertan that he liked the little ponies. Still,\r\nhe felt the slaughter was a necessary thing. Nevertheless, he admitted,\r\nSometimes they look you in the eye and you wonder if you should pull the\r\ntrigger. But its over in a second. -to\r\nLinks to Miscellaneous Horse/Wilderness sites Back\r\nTo Top of Page"
    },
    {
      "tag": "blockquote",
      "text": "Gostats.com web hit code. Please do not change this Get a GoStats hit counter End of Gostats.com web hit code"
    }
  ]
}