{
  "url": "http://mutualfunds.about.com/cs/retirement/a/millionaire.htm",
  "file_number": "115",
  "content_hash": "4eb4f5fe0d6c06ea095b6bd85889cce8aa0c18bf6acd8fadc396b00fda63e74b",
  "total_blocks": 115,
  "retained_blocks": 27,
  "ignored_blocks": 88,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" You are here: About > Business & Finance > Mutual Funds Mutual Funds Business & Finance Mutual Funds Essentials Before You Buy Mutual Funds Mutual Fund FAQs Top 10 Funds of 2006 Mutual Funds 101 Email Course Risk Tolerance Quiz Topics Mutual Funds 101 401k Bond Funds ETFs Fund Families Fund Fees Hedge Funds History Index Funds Investment Fraud Mutual Fund Tools No Load Types of Funds Investing Humor & Games Psychology Buyer's Guide Before You Buy Top Picks Top Investment Calculators John Bogle Books Financial Software Product Reviews Tools Find a Job Get a Quote Mortgage Loans Online Degrees Yellow Pages Forums Most Popular Articles Latest Articles Help gc Newsletters & RSS Email to a friend Digg this story"
    },
    {
      "tag": "h5",
      "text": "Ways to Become a Millionaire"
    },
    {
      "tag": "p",
      "text": "Maximize 401k Matching Different Kinds of Mutual Funds Power of Compounding Interest"
    },
    {
      "tag": "h5",
      "text": "Elsewhere on the Web"
    },
    {
      "tag": "p",
      "text": "The Millionaire Next Door The Millionaire Code The One Minute Millionaire"
    },
    {
      "tag": "h5",
      "text": "Most Popular"
    },
    {
      "tag": "p",
      "text": "401k Contribution Limits 2006 401k Contribution Limits 2007 401k Contribution Limits Stock Market Holidays NYSE Holidays"
    },
    {
      "tag": "h5",
      "text": "Related Sites"
    },
    {
      "tag": "p",
      "text": "Stocks Retirement Planning Economics Investing for Beginners Tax Planning: U.S."
    },
    {
      "tag": "h1",
      "text": "What it Takes To Become a Millionaire"
    },
    {
      "tag": "div",
      "text": "From Dustin Woodard , Your Guide to Mutual Funds . FREE Newsletter. Sign Up Now!"
    },
    {
      "tag": "h2",
      "text": "Discover how much you must save in order to become a millionaire."
    },
    {
      "tag": "div",
      "text": "Americans are obsessed with becoming millionaires. Do a search on Amazon.com and you will find over 590 books with \"Millionaire\" in the title. Take a look at some of the most popular television shows over the past few years: Survivor (competing for $1 million), Who Wants to Be a Millionaire and Joe Millionaire. The question is, how hard is it to become a millionaire through saving and investing?"
    },
    {
      "tag": "p",
      "text": "What It Takes To Become a Millionaire It may not be as hard as you think. For example, a 30-year old making $50,000 a year (plus 3% raises each year), saving 10% of their income with a 10% return each year could expect to hit millionaire status at age 59. If they work until the traditional retirement age of 65, they will have over two million dollars saved up. 10% may sound like an aggressive amount of saving, but it could be a combination of employee contributions to a 401k plus company match. What Role Does Income Play? Surprisingly, income is not as big a factor as you might think.  Using the same assumptions as above but making $100k a year, the person would become a millionaire at age 53 instead of 59. How could that be? The main factor here is what Einstein called the \"8th wonder of the world\": the power of compounding interest . Playing Catch-up? Can't Save That Much? If you are unable to save that much a year, or you are getting a late start, there is still hope. If you started at age 30, but could only save 5%, you would still become a millionaire by retirement at age 65. If you are playing catch-up and started investing at age 40, you would need to save about 11% a year to become a millionaire by age 65, but at age 50 you would have to save a nearly impossible 30% a year and your time frame would be so short that market volatility would play a bigger role in determining if you could retire or not. Is One Million Dollars Really That Much These days? Not really. Once you take inflation into account, being a millionaire today isn't as impressive as it used to be. For example, if someone was a millionaire in 1980, they would have to have about $1.9 million dollars in 2003 to match the wealth they had in 1980. Is One Million Dollars Enough to Retire On? It is. If you had one million dollars today and put the money in something safe that earns around 6% a year, you could afford to take out $60,000 a year for the next 49 years. If you wanted to be a bit more aggressive with your withdrawals and live up your retirement years, you could take out $100,000 a year for 14 years. For simplicity, these examples don't includes taxes which would decrease your lasting power, though things like social security and higher returns would increase your lasting power. Do You Have What it Takes to Become a Millionaire? As you have learned the most important factor to becoming a millionaire is to save early and rely on compounding interest. You can easily have control over how much you save, but you can't do much about performance - performance isn't reliable. You could try to make 15% a year, but may end up losing 10% a year doing so. It is better to rely on a properly diversified mutual fund portfolio earning around 10-13% a year, then to gamble and never retire."
    },
    {
      "tag": "div",
      "text": "/gc"
    },
    {
      "tag": "p",
      "text": "Important disclaimer information about this About site."
    },
    {
      "tag": "h5",
      "text": "Ways to Become a Millionaire"
    },
    {
      "tag": "p",
      "text": "Maximize 401k Matching Different Kinds of Mutual Funds Power of Compounding Interest"
    },
    {
      "tag": "h5",
      "text": "Elsewhere on the Web"
    },
    {
      "tag": "p",
      "text": "The Millionaire Next Door The Millionaire Code The One Minute Millionaire"
    },
    {
      "tag": "h5",
      "text": "Related Articles"
    },
    {
      "tag": "p",
      "text": "What it Takes To Become a Millionaire | Become a Millio... Do You Want to be a Millionaire? Save Money on Your Home Expenses Save Money on Your Home Expenses Traditional vs. Roth IRA"
    },
    {
      "tag": "h5",
      "text": "Hot Gadget Videos"
    },
    {
      "tag": "p",
      "text": "Shopping for a Digital Camera Choosing an MP3 Player Portable Video Players Choosing a Cell Phone Choosing a DVR"
    },
    {
      "tag": "h5",
      "text": "What's Hot"
    },
    {
      "tag": "p",
      "text": "Fund Style Definition of Turnover Ratio Load Defined Financial Tight-wad Test Where to Buy Mutual Funds"
    },
    {
      "tag": "div",
      "text": "All Topics | Email Article | | Advertising Info | News & Events | Work at About | SiteMap | Reprints | Help Our Story | Be a Guide User Agreement | Ethics Policy | Patent Info. | Privacy Policy ©2006 About, Inc., A part of The New York Times Company . All rights reserved."
    }
  ]
}