{
  "url": "http://news.bbc.co.uk/2/hi/business/3630986.stm",
  "file_number": "122",
  "content_hash": "8183ae91205b37bd311c4e9b3fcb24cb4332d409ac889db013c1d2dd8f611ad8",
  "total_blocks": 142,
  "retained_blocks": 5,
  "ignored_blocks": 137,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\" START TOOLBAR - start live stats logic - - end live stats logic - Home News Sport Radio TV Weather Languages END TOOLBAR UK version International version | About the versions Low graphics | Accessibility help BBC News in video and audio News services Your news when you want it News Front Page Africa Americas Asia-Pacific Europe Middle East South Asia UK Business Market Data Economy Companies Health Science/Nature Technology Entertainment ----------------- Have Your Say In Pictures Country Profiles Special Reports Programmes RELATED BBC SITES SPORT WEATHER ON THIS DAY EDITORS' BLOG Last Updated: Monday, 6 September, 2004, 14:41 GMT 15:41 UK E-mail this to a friend Printable version Libya outlines oil contract plans S BO S IIMA Under the desert, investors are hoping to strike black gold E IIMA Libya is moving ahead with plans to modernise its oil industry, holding talks with representatives from global companies in Tripoli on Sunday."
    },
    {
      "tag": "p",
      "text": "The country, which has recently mended international ties and has significant untapped oil reserves, is offering exploration rights on 15 sites. Press reports estimate that as many as 20 international firms, including some from the US, took part in the meeting. Further meetings are scheduled for London on 15 September, AFP reported. Among the London attendees will be Anglo-Dutch oil giant Shell, which established an office in Tripoli in 2001 and signed heads of agreement to lay out the principles for doing business in Libya earlier this year. Change of heart On Sunday, Libya laid out the terms of its tender process. Bids for six offshore and nine onshore blocs have to be submitted by 10 January 2005. The winning bidders must enter production-sharing agreements with Libya's National Oil Corporation. The move may mark a change in fortune for Libya as well as providing a new market for the oil companies involved. Libyan leader Muammar Gaddafi has managed to bring his country back into the international fold after years of seclusion and sanctions The North African nation was dramatically rehabilitated late last year after it publicly ditched its weapons of mass destruction programme, and declared a stockpile of chemical weapons to UN inspectors. UK prime minister Tony Blair visited Tripoli in April 2004. Mr Blair has claimed Libya's change of heart as a victory for British diplomacy. Trade hopes The US resumed relations with Libya, and began buying Libyan oil again, in June 2004. For some of the firms, it is thought to be the first time they have officially been invited to the country since the lifting of sanctions. The reports did not specify which firms attended the meeting. BP said it was monitoring the situation. Drilling rig supplier Abbot Group said it would be focusing on Libya as it unveiled its interim results on Monday. The UK-based company already operates rigs in Libya. E BO"
    },
    {
      "tag": "div",
      "text": "E-mail this to a friend Printable version LIBYA COMES IN FROM THE COLD KEY STORIES Libya HIV medics retrial resumes Libyan aviation ready for take-off Libya welcomes new US relations Libya fears for its stolen heritage BACKGROUND AND ANALYSIS Gaddafi's Libya How the veteran leader's rule has shaped a nation Ahistory of Libya's US ties Washington's Libyan fairy tale Colonel gets his reward Country profile: Libya RELATED INTERNET LINKS: Colonel Gaddafi's official website The BBC is not responsible for the content of external internet sites TOP BUSINESS STORIES Georgia in gas deal with Turkey Court halves Exxon spill damages US consumer spending posts rise START of footer for story strip"
    },
    {
      "tag": "h4",
      "text": "PRODUCTS AND SERVICES"
    },
    {
      "tag": "div",
      "text": "E-mail news Mobiles Alerts News feeds Podcasts News Front Page | Africa | Americas | Asia-Pacific | Europe | Middle East | South Asia UK | Business | Entertainment | Science/Nature | Technology | Health Have Your Say | In Pictures | Week at a Glance | Country Profiles | In Depth | Programmes BBC Copyright Notice Back to top ^^ Help Privacy and cookies policy News sources About the BBC Contact us Code for :bbc START NetRatings Measurement V5.1 COPYRIGHT 2003 NetRatings Limited END RedMeasure V5.1"
    }
  ]
}