{
  "url": "http://observer.guardian.co.uk/iraq/story/0,12239,905990,00.html",
  "content_hash": "3ee20d6b2ca52172570ea47cbb49b3be5477f2bf56204cca601cee63d1a730c5",
  "total_blocks": 200,
  "retained_blocks": 11,
  "ignored_blocks": 189,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" artifact_id=905990, built 2006-11-23 17:23"
    },
    {
      "tag": "p",
      "text": "Skip to main content"
    },
    {
      "tag": "div",
      "text": "hbx /hbx Go to: Guardian Unlimited home UK news World news Comment is free blog Newsblog Sport blog arts & entertainment blog Podcasts ---------------------- Archive search Arts and entertainment Books Business EducationGuardian.co.uk Environment Film Football Jobs Life and health MediaGuardian.co.uk Money Music The Observer Politics Science Shopping SocietyGuardian.co.uk Sport Talk Technology Travel Been there ---------------------- Audio Email services Special reports The Guardian The northerner The wrap ---------------------- Advertising guide Crossword Events / offers Feedback Garden centre GNM press office Graduate GuardianFilms Headline service Help / contacts Information Living our values Newsroom Notes & Queries Reader Offers Soulmates dating Style guide Syndication services Travel offers TV listings Weather Web guides Working for us ---------------------- Guardian Abroad Guardian Monthly Guardian Weekly Money Observer Public Learn Guardian back issues Observer back issues Guardian Professional Read today's paper · Jobs Search: Guardian Unlimited Web start genric textual localnav v2 Localnav: 506. Home UK news World news Politics Business & Media Comment & Leaders Focus 7 Days Sport Review Travel Cash Observer Woman The Observer Magazine Food Music end genric textual localnav v2 start grid interp: /Widgets/Image/0,,4461069-,00.txt /interp interp: /Widgets/Toolbox/0,,4616570-110863,00.html Tools text-only (print) version Text-only version send to a friend Send it to a friend save story Save story /interp The Observer Front page Story index Start auto trailblock widget /End auto trailblock The Guardian Front page Story index interp: /Com/Up_Button/0,,,00.html /interp Search executive jobs Search all jobs Navbar: no scribbling Observer Comment Extra"
    },
    {
      "tag": "h1",
      "text": "Could Tony Blair look at the internet now, please?"
    },
    {
      "tag": "div",
      "text": "Why is the British Prime Minister the only person who seems to be unaware of the US hawks' agenda. Terry Jones Sunday    March     2, 2003 Observer.co.uk It's heart-warming to hear Tony Blair's concern for the plight of the Iraqi people and how the only possible way to help them is to bomb them with everything the Americans have."
    },
    {
      "tag": "p",
      "text": "Mr Blair's sudden sympathy for the Iraqis' political aspirations comes as a welcome relief after all these years of US, UK-led sanctions, which have caused the deaths of over half a million Iraqi children, according to the UN. But I'm a bit worried that Tony may be deluding himself that his friends in the White House share his altruistic ideals. I'm sure Tony has been reading all the recent stuff about PNAC - \"The Project For The New American Century\" - but has he looked at their website? ( www.newamericancentury.org )"
    },
    {
      "tag": "div",
      "text": "Article continues"
    },
    {
      "tag": "p",
      "text": "As everybody knows, the PNAC is a think-tank founded in 1997 by the people who are now closest to President Bush - Dick Cheney, Donald Rumsfeld, Paul Wolfowitz, Jeb Bush and so on. It's a pretty safe bet that what PNAC think is what George W. Bush thinks. PNAC represents the thinking of the men now in power in the United States. PNAC's stated aims are to: \"to shape a new century favourable to American principles and interests\", to achieve \"a foreign policy that boldly and purposefully promotes American principles abroad\", \"to increase defence spending significantly\", and to pursue \"America's unique role in preserving and extending an international order friendly to our security, our prosperity, and our principles.\" They don't split hairs at the PNAC. George W. Bush and his advisers' stated aim is to ensure that America and American interests dominate the entire world for the foreseeable future. And what's more they make no bones of the fact that they intend to achieve this without diplomacy - that's old hat. What PNAC intend to do is enforce the Pax Americana through military might. Does Tony Blair know that? Has Tony Blair read the PNAC Report called \"Rebuilding Americas Defenses 2000\"? It refers to the new technologies of warfare and goes  on: \"Potential rivals such as China are anxious to exploit these transformational technologies broadly, while adversaries like Iran, Iraq and North Korea are rushing to develop ballistic missiles and nuclear weapons as a deterrent to American intervention in regions they seek to dominate.\" So when George Bush and his colleagues talk about Saddam Hussein posing a \"threat\" to America - they don't mean he's going to drop bombs on Washington (how on earth could he without committing national suicide?) - what they mean is that he poses a threat to American military dominance in the Middle East. Does Tony Blair know that's what they mean? In fact, does Tony Blair know that President Bush's advisers regard Saddam Hussein as merely an excuse for military action in the area? The PNAC Report of 2000 states: \"the United States has for decades sought to play a more permanent role in Gulf regional security. While the unresolved conflict with Iraq provides the immediate justification, the need for a substantial American force presence in the Gulf transcends the issue of the regime of Saddam Hussein.\" So Iraq is merely \"the immediate justification\" and Saddam's regime is not so important as establishing American military might in the Gulf. Does Tony Blair know that? If he has read PNAC's Report he knows that he is simply aiding US right-wing militarism and extremist Republican plans for world domination. Surely in such a cause he would not be prepared to expose the British people to the nightmare of permanent terrorist threats and attacks. Surely for such a cause he would not be prepared to set fire to the Middle East, to destabilize the entire world for the foreseeable future and - most important perhaps - to risk his own political neck by pursuing an evil and almost universally despised policy. On the other hand, if Tony Blair, has not read \"Rebuilding Americas Defenses 2000\" or gone to the PNAC website to learn exactly what motivates Rumsfeld, Cheney, Perle and Wolfowitz, and so on then why the hell hasn't he? Go to your computer now, Mr. Blair. Look at the reality behind all this sanctimonious wringing of hands over the plight of the Iraqi people. Read what your American Republican friends are really intending. Please."
    },
    {
      "tag": "div",
      "text": "Article is not commented: 0 Start article trailblock widget start arttrail trail module Special reports Iraq crisis: Observer special Special report: Iraq Special report: the anti-war movement Observer Worldview Exclusive: UN dirty tricks 02.03.2003: Revealed: US dirty tricks to win vote on Iraq war 02.03.2003: Bugging plan: read the US memo Talk: US dirty tricks In Iraq 02.03.2003: Iraq destroys missiles in last-ditch bid to avoid war 02.03.2003: Kurds in fear of Turkish motives The UN divided 02.03.2003: Focus: America the arm-twister 02.03.2003: Profile: Jacques the juggler 02.03.2003: The diplomatic gridlock 02.03.2003: Nick Taylor: Guinea's moment of fame 02.03.2003: Weekly briefing High drama at Westminster 02.03.2003: Focus: Blair's high wire act 02.03.2003: Win or bust for Blair Special report: Parliamentary debate in full Guardian Unlimited Politics After the vote 02.03.2003: Andrew Rawnsley: Journey into the unknown 02.03.2003: Michael Portillo: Labour won't forgive 02.03.2003: Roy Hattersley: The days of obedience are over 02.03.2003: Mary Warnock: Any war demands morality Iraq crisis: Observer Comment 02.03.2003: Leader: Blair must win the argument 02.03.2003: Nick Cohen: The only way to peace 02.03.2003: Peter Preston: Balance will be the first casualty 02.03.2003: Terry Jones: Tony Blair and the hawks 02.03.2003: Rosemary Hollis: A diplomatic solution? 02.03.2003: Business focus: Attacking the state 02.03.2003: Bulent Yusuf: Global press week Email your views to debate@observer.co.uk The Business of War 02.03.2003: The first privatised war 02.03.2003: Firms with friends in high places 02.03.2003: OK, who forgot the toilet rolls? 02.02.2003: Vincent Cable: The economic consequences of war Terror threat 02.03.2003: Top 9/11 suspect seized in Pakistan 02.03.2003: Saudi envoy in UK linked to 9/11 War on Terrorism: Observer special Iraq after Saddam 23.02.2003: Val Percival: Lessons from Kosovo 16.02.2003: Iraqi opposition slams plan for military governor 16.02.2003: Kanan Makiya: Our hopes betrayed Talk: Iraq's democrats betrayed? 09.02.2003: Focus: The Iraq Bush will build 09.02.2003: Robert L Barry: The next Yugoslavia? Observer highlights: the broadest debate 19.01.2003: Leader: Why force may be needed Talk: Where do you stand on Iraq? 16.02.2003: Andrew Rawnsley: It's do or die, Prime Minister 16.02.2003: Tony Blair: The price of my conviction 09.02.2003: Mary Riddell: With Bible and bombs 16.02.2003: Nick Cohen: The Left isn't listening 23.02.2003: William Shawcross: Why Saddam will never disarm 16.02.2003: Dan Plesch: Disarm Saddam without war 23.02.2003: Focus: Twilight of a tyrant 16.02.2003: Focus: Worlds apart on war 16.02.2003: Henry Porter: One rule for Israel,  another for Saddam 26.01.2003: Charles Kennedy: We're being bulldozed into war 16.02.2003: Leader: We must not rule out war 09.02.2003: Leader: The dossier that shamed Britain 26.01.2003: Letters: What you say about our stand on Iraq 16.02.2003: Mary Riddell: The great unheard finally speak out 09.02.2003: Jason Burke: Powell doesn't know who he is up against 02.02.2003: David Aaronovitch: Why the Left is wrong on Saddam 16.02.2003: Anthony Sampson: Why Britain's war? 09.02.2003: Jason Burke: The missing link? 19.01.2003: Debate: What prominent Britons think 02.02.2003: Gil Loescher: The refugee crisis 26.01.2003: Mary Riddell: Don't disdain the doves 26.01.2003: Terry Jones: My neighbour trouble 05.01.2003: Nick Cohen: Saddam won't run 14.07.2002: John Pilger: The great charade 29.12.2002: Ken Nichols: Back to Iraq as a human shield 15.09.2002: Jason Burke: Return to Kurdistan 01.09.2002: Dilip Hiro: US blind eye to poison gas 11.08.2002: Nick Cohen: Who will save Iraq? 04.08.2002: Richard Harries: Not a just war 25.08.2002: Christopher Hitchens: With friends like these 22.09.2002: Terry Jones: The audacious courage of Mr Blair 22.09.2002: Rosemary Hollis: Hawks won't stop with Baghdad 11.08.2002: Mark Leonard: Could the left back war? 17.03.2002: John Lloyd: Anti-Americanism betrays the left 17.02.2002: Terry Jones: George's friendly bombs 02.12.2001: David Rose: The doves are wrong - again Special reports Iraq: Observer special Observer Worldview Afghanistan Terrorism crisis Islam and the West More global commentary More from Peter Beaumont More from Jason Burke More from Ed Vulliamy More from Mark Leonard More from Dan Plesch Worldview highlights: debating American power Useful links UNSCOM UN resolutions on Iraq British Foreign Office: Relations with Iraq US State Department Iraq Update Arab.net - Iraq resources Campaign against Sanctions on Iraq Centre for non-proliferation studies end arttrail trail module overture div end overture div End article trailblock widget Observer sections - dropdown menu Observer sections _______________________ Business Cash Comment Focus International Leaders Letters Life Politics Review Screen Sport Travel UK news Music Monthly style guide server contacts 7 days world ethical awards Sport Monthly Food Monthly 2001 election Press freedom campaign"
    },
    {
      "tag": "p",
      "text": "END of dropdown menu interp: /Com/Up_Button/0,,,00.html /interp Overture Widget End Overture Widget"
    },
    {
      "tag": "div",
      "text": "start grid null block null block null block null block Privacy policy | Terms & conditions | Advertising guide | A-Z index | About this site Guardian Unlimited © Guardian News and Media Limited 2006 Revenue Science required functions start Revenue Science required functions end Revenue Science required functions start Revenue Science required functions end Revenue Science call pixel server start Revenue Science call pixel server end Revenue Science build segs array start Revenue Science build segs array end Revenue Science static javascript Revenue Science static javascript end"
    }
  ]
}