{
  "url": "http://radio.weblogs.com/0106327/2005/01/20.html",
  "content_hash": "90cad0c15d9f1b4f73c819499068740d278af73d42e9244015f03bbec00cf512",
  "total_blocks": 176,
  "retained_blocks": 13,
  "ignored_blocks": 163,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" Bob Stepno's Other Journalism Weblog Explorations of personal and community journalism online... Weblog front page About Stepno.com Home UT Home Red Liner blog @Harvard.edu AEJMC Newspaper Division Bob's Emerson College cobwebs Bob's UNC Chapel Hill cobwebs Backgrounder: About_Weblogs Web Tools Overview Weblog writing tips Online news writing Weblog picture tips Political reporting links Journalism ethics links What are RSS and that orange 'XML' thing? RSS news aggregators (for PC World) 5 more aggregators"
    },
    {
      "tag": "p",
      "text": "Thursday, January 20, 2005"
    },
    {
      "tag": "div",
      "text": "Group Calls 2004 Most Deadly Year for Journalists"
    },
    {
      "tag": "p",
      "text": "Last year 129 media employees were killed in the line of duty, according to the International Federation of Journalists , which is calling on governments to do more to investigate news workers' deaths. \"Behind each tragic death is a story of widespread intimidation and\r\nviolence against journalists being carried out on a scale never seen\r\nbefore,\" said Aidan White, IFJ General Secretary. \"We honour each of those who have died, from the\r\ndedicated and courageous correspondents to the support staff who make\r\nup the media team.\" The federation said new international rules are needed to force\r\nindependent investigations of media killings. Its report covers\r\nincidents in 34 countries, including the war in Iraq.  It plans a\r\nworldwide protest April 8, the second anniversary of the killing of two\r\njournalists at the Palestine Hotel in Baghdad."
    },
    {
      "tag": "div",
      "text": "Thanks to J's Scratchpad and the Guardian for pointing out the IFJ story.  For other information about the risks of international journalism, see the News Safety Institute ."
    },
    {
      "tag": "p",
      "text": "8:20:38 PM comment [ ]"
    },
    {
      "tag": "div",
      "text": "Knox Media Gossip"
    },
    {
      "tag": "p",
      "text": "SouthKnoxBubba points to media-business gossip in Betty Bean 's Halls Shopper News column, including rumors of the Metro Pulse being for sale and the Knoxville Journal having its own problems. In response, Metro Pulse owner/publisher Brian Conley (or someone impersonating him) joined the\r\ndiscussion thread at Bubba's site, posting several responses to\r\ncomments on his downtown redevelopment connections and their\r\nrelationship to the paper, as well as the Shopper News item:"
    },
    {
      "tag": "div",
      "text": "I'm not\r\n\"peddling\" MP, which is exactly what I would have told Betty Bean if\r\nshe'd bothered to ask me. And while I may be relatively new at the\r\nnewspaper business, we at MP do at least make an effort to report\r\naccurate information."
    },
    {
      "tag": "p",
      "text": "As of this writing, there's no response from Betty Bean -- but I'm\r\nlearning something about local media history, animosities and attitudes\r\nfrom the conversation... reading some of it in the papers, some of it\r\nin the blog and some of it between the lines. I hadn't visited Halls Shopper News before, but found other pieces in it about the Knoxville Journal and local TV stations, both in Betty's column and elsewhere .\r\n(I do keep a large salt shaker handy when reading opinion columns and\r\nbusiness gossip, regardless of source -- especially when I'm new in\r\ntown, don't have a scorecard and don't know the players.) However, while I was at it, I also found this piece about back when the Journal was a daily paper , in the online edition of the Tennessee Encyclopedia of History & Culture at tennesseeencyclopedia.net /, which looks like a fine resource for a newcomer to browse when there's no breaking news. (The irony is that all of this Web browsing went on while I skipped\r\na Society of Professional Journalists meeting to wait for a UPS\r\ndelivery -- at least I didn't miss out entirely on opportunities to\r\nlearn a little more about the local media.) 7:57:16 PM comment [ ]"
    },
    {
      "tag": "div",
      "text": "Blogger Conference Being Planned in Nashville"
    },
    {
      "tag": "p",
      "text": "The Media Bloggers Association is organizing a conference at Belmont University in Nashville for May 5-7. Unfortunately, the conference dates are exam (and\r\nexam-grading) week for me at UT in Knoxville, but students or faculty who wrap-up early will be able to go. The \"placeholder\" website, BlogNashville , lists Glenn Reynolds, the UT law professor known online as Instapundit , as chairman of the conference committee building the agenda. Blogger, Belmont U public relations guy and journalist Bill Hobbs is on the committee, along with the media bloggers group organizer, Bob Cox, whose blog is The National Debate ,  blogging journalist Ed Cone of Greensboro, N.C.,  and Sybril Bennett of Belmont's journalism program . Cone and Cox, and maybe others from the group, are scheduled to be at Harvard's Blogging, Journalism  & Credibility conference this week, so they should come back full of ideas. The\r\nNashville event plans to borrow the \"unconference\" group-discussion\r\ncentered BloggerCon concept that Dave Winer evolved at Harvard and Stanford events. Speaking of the Harvard conference... a New York Times story has kicked off quite a discussion of the quality of its reporting about Iraqi bloggers. See Cone and Jarvis , and many others in their \"comment\" streams. 12:47:28 PM comment [ ] © Copyright \r\n                  2005\r\n                  Bob Stepno. Last update: \r\n                  2/1/05; 9:59:57 AM."
    },
    {
      "tag": "div",
      "text": "January 2005 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Dec Feb"
    }
  ]
}