{
  "url": "http://science.nasa.gov/headlines/y2004/23apr_biocorr2.htm",
  "file_number": "159",
  "content_hash": "427a901a063dd794539ec775b5969baa451be0eaf4ccdde088eb8275665f3309",
  "total_blocks": 72,
  "retained_blocks": 5,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\""
    },
    {
      "tag": "h1",
      "text": "Keeping an Eye on Central America"
    },
    {
      "tag": "h4",
      "text": "NASA-supported researchers have developed software \r\n            anyone can use to fly, video game-style, over Central America and \r\n            survey its current environmental conditions."
    },
    {
      "tag": "p",
      "text": "Listen to this story via streaming \r\n            audio , a downloadable \r\n            file , or get \r\n            help . April 23, 2004: Flying over the lush, mountainous landscape \r\n            of Central America, a local environmental official points out plumes \r\n            of smoke where \"slash and burn\" agriculture is destroying hundreds \r\n            of acres of rain forest. In the distance, dark-tinted waters of a \r\n            red tide nearing coastal fishing villages are clearly visible from \r\n            this altitude. He points to a silt-filled river snaking through the \r\n            forest below -- a symptom of soil erosion caused by unsustainable \r\n            farming practices upstream, he explains. The \r\n            view evokes a kind of intuitive understanding of these environmental \r\n            concerns that words alone can not provide. Right: A \r\n            computer-generated, 3-dimensional landscape of the Caribbean coastal \r\n            plain of Costa Rica based on satellite data. [ More ] Juan Mario Dary, the environmental minister of Guatemala, plans \r\n          to give such an aerial tour of Central America this weekend. Only he \r\n          won't actually be in a plane. In fact, he won't be anywhere near Central \r\n          America. He'll be in Tokyo, Japan, at the second annual Earth \r\n          Observation Summit . The tour Dary plans to give will be a virtual flight over \r\n            a computer-generated, 3-dimensional landscape -- something like a \r\n            \"flight simulator\" video game. The view through the window, though, \r\n            is reality. It's based on real satellite and geographic data, offering \r\n            a \"big picture\" view of how humans are affecting the rich diversity \r\n            of wildlife in the region. Sign \r\n                          up for EXPRESS SCIENCE NEWS delivery \"In some ways, it's better than the real thing,\" says Daniel Irwin, \r\n            a research scientist at NASA's Marshall Space Flight Center. \"The \r\n            user can choose which 'layers' of the data they want to see, some \r\n            of which aren't obvious from a real plane: conservation park boundaries, \r\n            small village locations, ecosystem types, and endangered species habitats, \r\n            just to name a few.\" This virtual landscape software is one of many new tools \r\n            that Irwin and others are developing as part of an international project \r\n            called SIAM-SERVIR, an acronym in Spanish meaning \"Mesoamerican System \r\n            of Environmental Information -- Regional System of Monitoring and \r\n            Visualization.\" Through a coordinated effort between the seven countries \r\n            of Central America, NASA, the World Bank, the U.S. Agency for International \r\n            Development (USAID), and others, SIAM-SERVIR is creating an easy-to-use \r\n            Web portal to environmental data for the entire region. The portal \r\n            ( http://servir.nsstc.nasa.gov ) is online \r\n            now, though it is still incomplete. The importance of having daily \r\n            wildfire data available during the spring fire season convinced them \r\n            to pre-release the site, Irwin says. It will be finished later this \r\n            year. Above: A scene from the flyby. False colors in this satellite image of Lake \r\n            Nicaragua represent types of land cover: green is forest, while purple, \r\n            red, and pink represent specific combinations of agriculture, bare \r\n            soil, and urban areas. This perspective view was created using software \r\n            from Skyline \r\n            Software Systems . Daily, near real-time updates to the portal are based \r\n          on NASA satellite data, acquired and processed automatically. Web surfers-- \r\n          whether students, scientists, or Central American politicians -- can \r\n          view the information in a variety of ways: interactive 2-dimensional \r\n          maps, \"fly throughs\" of a 3D virtual landscape, or they can download \r\n          a specific slice of the raw data to do their own analysis. \"This \r\n            project will be ending a distinctive feature of Central America, where \r\n            environmental information has always been jealously guarded by institutions \r\n            or people. Now instead we hope that the information will flow freely,\" \r\n            says Rafael Guillen, Irwin's primary technical collaborator in Central \r\n            America and an expert in Geographic Information Systems mapping software \r\n            (GIS). Left: Dan Irwin (light blue shirt) in Central America, flanked by NASA Administrator \r\n            Sean O'Keefe and Ghassem Asrar, NASA's Associate Administrator for \r\n            Earth Science. Irwin is the NASA manager of SIAM-SERVER. [ Larger \r\n            image ] Anything \r\n            that can be plotted on a map can be integrated into the master database: \r\n            historic geographic records, modern road maps, satellite spectral \r\n            data from Landsat and MODIS (MODerate-resolution Imaging Spectroradiometer), \r\n            or wildlife habitat data from traditional fieldwork. Irwin, Guillen \r\n            and colleagues hope that all this information, freely available and \r\n            easy to understand, will help Central Americans make better decisions \r\n            about the region's beleaguered natural resources. In July, construction will begin on a central data storage \r\n            facility in Panama. In addition to being the information warehouse \r\n            for the project, the Panama facility will be a kind of \"situation \r\n            room\" -- a \"mission control\" for monitoring the health and condition \r\n            of rain forests, croplands, rivers, and coastal waters throughout \r\n            Central America. USAID is funding the development of this facility, \r\n            as well as six smaller facilities in each of the other Central American \r\n            countries: Belize, Guatemala, Costa Rica, Nicaragua, Honduras, and \r\n            El Salvador. These smaller national centers will be staffed by experts \r\n            with direct access to the central database for helping address the \r\n            environmental issues in their own countries. Central America is a region with a \r\n            great richness and diversity of tropical wildlife: though it only \r\n            constitutes roughly 1% of the planet's surface, the region is home \r\n            to about 7% of all land-dwelling species. The region is also home \r\n            to a rapidly growing and widely impoverished human population. Serving \r\n            the needs of the people without bankrupting the natural resources \r\n            on which they depend is an enormous challenge to political decision \r\n            makers. Right: Much \r\n            of Central America's rich biodiversity in is being destroyed by \"slash \r\n            and burn\" agriculture. This photo was taken in Petén, Guatemala, \r\n            by Daniel Irwin. It was local decision makers who came \r\n            up with the idea for this Web-portal project, explains Irwin. The \r\n            impetus came from an intergovernmental organization called CCAD (a \r\n            Spanish acronym meaning \"Central American Commission of Environment \r\n            and Development\"), which combines and coordinates the efforts of the \r\n            seven Central American countries' ministries of the environment. Regional \r\n            treaties charge the CCAD with the task of promoting environmental \r\n            protection and sustainable development throughout the region. This \r\n            new Web portal is one tool they sought to help them in their work. \"We're not telling the Central Americans what needs \r\n            to be done,\" says Irwin. \"Rather we're trying to listen and develop \r\n            products and tools based on their needs. It is a demand-driven process.\" Once development of the system is finished and local \r\n            experts have been sufficiently trained, control and operation of the \r\n            system will be turned over to the local environmental authorities, \r\n            though NASA will remain available to them for technical support. Meanwhile, anyone with an Internet connection can visit. \r\n            At the portal you can see plumes from fires and watch rain clouds drift by. Eventually, \r\n            when the site is complete, you can hop aboard a virtual plane and \r\n            fly up and down the long Central American coast--just like a high-level \r\n            environmental minister. As Irwin says, in some ways, it's better than \r\n            the real thing. SEND THIS STORY TO A FRIEND Credits & Contacts Author: Patrick L. Barry Responsible NASA official: John M. Horack Production Editor: Dr. Tony Phillips Curator: Bryan Walls Media Relations: Steve Roy The Science and Technology Directorate\r\nat NASA's Marshall Space Flight Center sponsors the Science@NASA web\r\nsites. The mission of Science@NASA is to help the public understand how\r\nexciting NASA research is and to help NASA scientists fulfill their\r\noutreach responsibilities. Web Links SIAM-SERVIR -- the Web portal of environmental maps and \r\n            data for Central America discussed in this article CCAD -- home page (in Spanish) for the intergovernmental \r\n            Central American environmental organization, which is the principal \r\n            authority in the region for SIAM-SERVIR. USAID -- home page for the U.S. Agency for International \r\n            Development, which is funding part of the SIAM-SERVIR project The World Bank -- home page Landsat 7 -- home page for one of the satellites contributing region-wide \r\n            environmental data to the SIAM-SERVIR database Terra -- home page for the NASA satellite carrying \r\n            the MODIS instrument, which provides daily data updates to the SIAM-SERVIR \r\n            database Mesoamerica \r\n            Burning -- ( Science@NASA ) The rich diversity of wildlife \r\n            in southern Mexico and Central America is in peril. Local governments \r\n            are using satellites to get a grip on a vast \"corridor\" system of \r\n            protected lands. Skyline Software \r\n            Systems -- company providing \r\n            some of the mapping and 3D terrain software used by SIAM-SERVIR Join\r\nour growing list of subscribers - sign up for our\r\nexpress news delivery and you will receive a mail message\r\nevery time we post a new story!!! More Headlines THE END"
    },
    {
      "tag": "div",
      "text": "\u0000\u0000\u0000\u0000\u0000\u0000"
    }
  ]
}