{
  "url": "http://switzerland.isyours.com/e/guide/basics/carrying.html",
  "content_hash": "1ccf88c6aa85636726426369a2b79b115cbdb88ade41998c496e3d8575b2b8a3",
  "total_blocks": 252,
  "retained_blocks": 3,
  "ignored_blocks": 249,
  "blocks": [
    {
      "tag": "div",
      "text": "Contact About Links Gallery Hotels Living and investing in Switzerland Navigation menu Home Swiss Residency Swiss bank accounts Tourist Guide Table of contents Geneva Lake Geneva Lausanne Valais The arc jurassien Basel Mittelland Bern Bernese Oberland Lucerne Zentralschweiz Zurich Northeast Graubuenden Ticino Swiss culture Travel basics Getting there Red tape Insurance Information and maps Money and costs Currency Carrying and changing money Plastic money Cash and cheques Some basic costs Getting around Hotels Swiss food Health Travellers with disabilities The media Sports Business hours Trouble and the police Post, phone and internet Directory Index Photo Gallery Museums Hotels Swiss Maps Links Photo Gallery Business Guide Relocation Guide Celebrities in Switzerland Contact us About us Site map Visit our other sites : Swiss-bank-accounts.com Live-in-switzerland.com www.housesearch.ch <a href=\"/e/include.html\"></a> Carrying and changing money in Switzerland Home > Tourist Guide > Table of contents > Travel basics > Money and costs > Carrying and changing money"
    },
    {
      "tag": "p",
      "text": "Switzerland has a healthy mix of small rural communities where cash is the sole method of payment, and international cities dedicated to the art of high finance, where anything will do nicely as long as its money. Youll never be caught short  either for purchases or for cash withdrawals  if you carry your money in the form of only debit and/or credit cards, although the now rather pedantic travellers cheque still holds good. Switzerland is generally much safer than elsewhere in Europe, but carrying large wads of cash about is still not advisable. Most banks in the West keep Swiss francs on hand for over-the-counter exchange, and its a good idea to bring a small supply with you to cover first-night expenses in case of difficulties."
    },
    {
      "tag": "div",
      "text": "Copyright Rough Guides The information contained in this website is not meant to substitute qualified legal advice given by a specialist knowing your particular situation. We can accept no responsibility for the consequences of decisions made following information found on this website. Mic heloud & Cie is not a bank and neither sollicits nor accepts deposits. Currency conversion and interest rates provided on this website are listed for informational purpose only and may not be up-to-date. More >> Mi ch e el m oud & Cie 2006     No part of this site may be reproduced in any form or by any means without our prior written permission. Printed from http://Switzerland.isyours.com/e/guide/basics/carrying.html"
    }
  ]
}