{
  "url": "http://therapists.psychologytoday.com/medicinenet/6692.html",
  "file_number": "178",
  "content_hash": "9bf8538b30d03e7ec73214a8705eb7600d52babfa86cfe4cb993cce053fd5742",
  "total_blocks": 177,
  "retained_blocks": 11,
  "ignored_blocks": 166,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""
    },
    {
      "tag": "p",
      "text": "About Us | Privacy Policy December 26, 2006"
    },
    {
      "tag": "div",
      "text": "TABLE TO CENTER ALL MEDICINENET CONTENT WILL END IN MEDICINENET FOOTER Find a Therapist powered by Psychology \nToday New Search | Back To Results Previous Profile | Next Profile end table Photo Darlene Lancer Marriage & family therapist , M.A., J.D., M.F.T. Office Santa Monica, California 90402 Contact Information phone: (310) 458-0016 web: www.darlenelancer.com Email me end table Add end table 3 \" Everyone is unique.  Thus, in a safe environment, Itry to understand your particular dilemma and see the world through your eyes. My desire is to empower you to manifest your soul's fullest expression and achieve your goals in work, relationships and health. Itreat marital or career problems, anxiety, depression, trauma, grief, chronic pain and illness. Iwork with those affected by abuse and addiction, and am familiar with 12-step Programs. Formerly a lawyer, Iunderstand work pressures, and aid clients with career stress, goals, and transitions. Imediated divorces and resolved custody disputes in Conciliation Court. Itry to adapt each session to your special needs.  Utilizing dynamic dialogue and cognitive behavioral therapy, clients gain self-acceptance and understanding, catalysts for change.  Sometimes Ialso use dream interpretation, visualization, gestalt, meditation and hypnosis. With chronic pain, Iteach breath, touch and sound techniques to alleviate pain. In addition to my extensive training, Ihave years of experience related to spirituality and healing, and have helped many clients through trauma, spiritual and relationship crises, loss and illness.\n\t\t\" end of table para1 Taking the first step toward getting help is often the most difficult --\nplease don't hesitate to: email the therapist(s) or send these details to a \nfriend now. end of table Para GENERAL Gender: Female Years in Practice: 15+ Years Avg Cost (per session): $120-$129 Sliding Scale: Yes Accepts Insurance: Yes Please ask about your health insurance coverage when you arrange your first visit . CLIENT FOCUS Ethnicity: African-American, Any Gender: All Religious Orientation: Any Gay/Lesbian Expertise: Yes Alternative Languages: — Age: Adolescents, Adults, Children, Elders QUALIFICATIONS Graduate School: Antioch University Year Graduated: 1989 License No. and State: MFC27909 California end of left col, table Prof Detals left SPECIALTIES (Strengths in green) Relationship Issues Depression Addictions or Substance Abuse Anxiety or Fears Chronic Pain or Illness Divorce Domestic Abuse or Violence Eating Disorders Elderly Persons Disorders Gay Lesbian Issues Life Coaching Loss or Grief OCD Parenting Sex Therapy Spirituality Trauma and PTSD Dissociative Disorders Impulse Control Disorders Personality Disorders Career, Stress TREATMENT PREFERENCES Orientation: Family/Marital Therapy Psychoanalytic Modality: Couples Individuals EASY ACCESS Nearby Towns: Culver City, CA , Los Angeles (Brentwood, West L.A. Venice), CA , Santa Monica, CA Nearby Counties: Los Angeles Nearby Zips: 90024 , 90230 , 90402 end of table Prof Details Right end of table Prof Details end of table 1 Health Ato Zlists:"
    },
    {
      "tag": "p",
      "text": "News & Views | Diseases & Conditions | Symptoms & Signs | Procedures & Tests | Medications | Medical Dictionary"
    },
    {
      "tag": "div",
      "text": "Popular health centers:"
    },
    {
      "tag": "p",
      "text": "Allergies | Arthritis | Cancer | Diabetes | Digestion | Healthy Kids | Heart | Men's Health | Mental Health | Women's Health | More..."
    },
    {
      "tag": "div",
      "text": "Publications:"
    },
    {
      "tag": "p",
      "text": "ePublications (PDFs) | XML News via RSS | Audio Newsletters & Podcasts | Email \n    Newsletters"
    },
    {
      "tag": "div",
      "text": "MedicineNet.com:"
    },
    {
      "tag": "p",
      "text": "About Us | Privacy Policy | Help | Search | Site Map | WebMD® | Medscape® | eMedicine® | eMedicineHealth® | onhealth & living® | RxList® 1996-2006 MedicineNet, Inc. All rights reserved. Notices and Legal Disclaimer. Information on this web site is provided for informational purposes only and is not a substitute for professional medical advice. You should not use the information on this web site for diagnosing or treating a medical or health condition. You should carefully read all product packaging. If you have or suspect you have a medical problem, promptly contact your professional healthcare provider. Statements and information regarding dietary supplements have not been evaluated or approved by the Food and Drug Administration. Please consult your healthcare provider before beginning any course of supplementation or treatment."
    },
    {
      "tag": "div",
      "text": "end medicinenet_html/bot_nav.html"
    }
  ]
}