{
  "url": "http://bicycling.about.com/library/weekly/aa030999.htm",
  "file_number": "18",
  "content_hash": "ef3ffcc1624103b57baff4ec075f9cc85e5d7ac718c7f3065dbf26e66e5590ea",
  "total_blocks": 235,
  "retained_blocks": 40,
  "ignored_blocks": 195,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2 Final//EN\" You are here: About > Sports > Bicycling Bicycling Sports Bicycling Essentials Tour de France Ride A Century Fall Riding Beginning Bicycling Bike Club Directory Topics Training Where to Ride Racing Beginning Cycling Weight Loss Famous Cyclists Womens Cycling Equipment MaintenanceRepair Cycling Culture Advocacy Family Bicycling Doping Drug Use Nutrition Safety Buyer's Guide Cycling Gloves Bike Pumps Top Pedals Bike Tools Bike Trailers Tools Buy Tickets Compare Prices Travel Booking Yellow Pages Forums Most Popular Articles Latest Articles Help gc"
    },
    {
      "tag": "h3",
      "text": "The 1999 UCI World Cup"
    },
    {
      "tag": "div",
      "text": "Dateline: 03/09/99"
    },
    {
      "tag": "p",
      "text": "The World Cup consists of 10 races in the spring and fall.  Competition will be amongst racers in the 22 first division\r\nteams, as determined by the Union Cycliste Internationale (UCI), including the U.S. Postal Service team.  Each team may\r\nhave up to eight riders participate per race.  To qualify for a final World Cup standing, a rider must compete in at least six\r\nout of the ten races, and his team must start at least eight of the races.  Points are awarded to the top 25 finishers in each\r\nevent.  First place receives 100 points, down to 1 point for 25 th place. Last year's (1998) winners were: (1 st ) Michele Bartoli, (2 nd ) Leon Van Bon, (3 rd ) Andrea Tafi. Here are this year's (1999) events: Milan-San Remo, Italy Distance: 183 mi (294km) When: Sat, March 20 Course: From Milan to San Remo on the Mediterranean sea. Contains two major climbs - Cipressa (790ft) and Poggio\r\n(530ft) in the latter part of the race. Poggio's descent is followed by a flat 3.3km to the finish. 1998 Winner: Erik Zabel 1997 Winner: Erik Zabel Tour Of Flanders, Belgium"
    },
    {
      "tag": "div",
      "text": "Distance: 172 mi (277km) When: Sun, April 4 Course: From Bruges to Meerbeke, near Brussels. Contains five short climbs, most noticeable are: hill #7 - Old\r\nKwaremont; hill #10 - Taaienberg; and hill #14 - Muur. The race finishes slightly uphill. 1998 Winner: Johan Museeuw 1997 Winner: Rolf Sorenson"
    },
    {
      "tag": "p",
      "text": "Paris-Roubaix, France"
    },
    {
      "tag": "div",
      "text": "Distance: 166 mi (267km) When: Sun, April 11 Course: From Compiégne, an hour northeast of Paris to Roubaix, which is between Lille and the border with\r\nBelgium. This famous race contains 27 sections of cobblestone, totaling about 30 miles of the latter half of the course.\r\nThe section through the Wallers-Arenberd Forest is particularly treacherous. 1998 Winner: Franco Ballerini 1997 Winner: Frédéric Guesdon"
    },
    {
      "tag": "p",
      "text": "Liége-Bastogne-Liége, Belgium"
    },
    {
      "tag": "div",
      "text": "Distance: 165 mi (265.5km) When: Sun, April 18 Course: The hilliest of the spring classics. 13 climbs, 11 of which are in the latter half of the race. Major climbs are both\r\nStockeu and Haute Levée in the town of Stavelot - a mean combination, and a 20% grade climb, La Redoute, just\r\nafter Remouchamps. The race finishes flat in Ans, a suburb of Liége, after a rough 1km climb. 1998 Winner: Michele Bartoli 1997 Winner: Michele Bartoli"
    },
    {
      "tag": "p",
      "text": "Amstel Gold Race, Netherlands"
    },
    {
      "tag": "div",
      "text": "Distance: 160 mi (258km) When: Sun, April 24 Course: Start and finish in Maastricht, near the Belgian border. Major climbs: Valkenburg, 37 miles from the end; and\r\nHalembaye, near the end.  The finish is flat. 1998 Winner: Rolf Jarmann 1997 Winner: Bjarne Riis"
    },
    {
      "tag": "p",
      "text": "Clasica San Sebastian, Spain"
    },
    {
      "tag": "div",
      "text": "Distance: 144 mi (232km) When: Sat, August 7 Course: Starting and finishing in San Sebastian, a coastal resort town, this race makes a counter-clockwise loop through\r\nnorthern Spain and into the mountains to the south. The most crucial climb, about 16 miles from the finish, is Alto de\r\nJaizkibel, which towers above the Bay of Biscay near France. The finish is flat. 1998 Winner: Francesco Casagrande 1997 Winner: Davide Rebellin"
    },
    {
      "tag": "p",
      "text": "Hew-Cyclassics Cup, Germany"
    },
    {
      "tag": "div",
      "text": "Distance: 157 mi (253km) When: Sun, August 15 Course: A relatively new race (started in 1996), consisting of several loops of rolling hills through many streets of\r\nHamburg.  This is only it's second year as a World Cup race. 1998 Winner: Leon Van Bolt 1997 Winner: Jan Ullrich"
    },
    {
      "tag": "p",
      "text": "Grand Prix Suisse, Switzerland"
    },
    {
      "tag": "div",
      "text": "Distance: 140 mi (225km) When: Sun, August 22 Course: Known until 1996 as the Championship of Zurich, this race, first run in 1910, consists of five grueling laps of a\r\n28 mile (45km) circuit, starting and ending on the Zurich lakefront. 1998 Winner: Michele Bartoli 1997 Winner: Davide Rebellin"
    },
    {
      "tag": "p",
      "text": "Paris-Tours, France"
    },
    {
      "tag": "div",
      "text": "Distance: 158 mi (254.5km) When: Sun, October 3 Course: From the southwest suburbs of Paris to Tours on the Loire River.  A rather flat course, this is often a sprinter's\r\nrace, especially if there is a headwind.  However, if the wind is calm, or is there is a tailwind, breakaways are possible. 1998 Winner: Jacky Durand 1997 Winner: Andrei Tchmil"
    },
    {
      "tag": "p",
      "text": "Tour of Lombardy, Italy"
    },
    {
      "tag": "div",
      "text": "Distance: 157 mi (253km) When: Sun, October 16 Course: From Varese to Bergamo, this course is the only classic that has any real mountain climbs.  The crucial climb is\r\nRoncala, northwest of Bergamo.  This race also contains the famous Madonna del Ghisallo climb to 2473 feet. 1998 Winner: Oskar Camenzind 1997 Winner: Laurent Jalabert"
    },
    {
      "tag": "h2",
      "text": "Share your opinions on our Bulletin Board!"
    },
    {
      "tag": "p",
      "text": "Previous\r\nFeatures"
    },
    {
      "tag": "h5",
      "text": "Recent Discussions"
    },
    {
      "tag": "p",
      "text": "Riding in December bicycle jumping is it good or bad Bicycle shopping question Subscribe to the  Newsletter Name Email /gc"
    },
    {
      "tag": "div",
      "text": "From Apply Now , Your Guide to Bicycling . FREE Newsletter. Sign Up Now!"
    },
    {
      "tag": "h5",
      "text": "Related Articles"
    },
    {
      "tag": "p",
      "text": "Africa FIFA World Cup 2006 Chinese News -- Sports News World Cup Soccer News - Scores - Group Standings - FIFA... 2004 Dubai World Cup Final Entries Chinese News -- Sports News"
    },
    {
      "tag": "h5",
      "text": "Top Health Videos"
    },
    {
      "tag": "p",
      "text": "How to Relax in 2 Minutes Bird Flu 101 Cold Medicine & Kids Controlling Food Portions Balancing Family & Self"
    },
    {
      "tag": "h5",
      "text": "What's Hot"
    },
    {
      "tag": "p",
      "text": "5 Tips for Buying a Bike Bicycle Pumps Why wear bike clothes? Heart Rate Monitor Use Chain Maintenance"
    },
    {
      "tag": "div",
      "text": "Newsletters & RSS Email to a friend Digg this story"
    },
    {
      "tag": "h5",
      "text": "Related Blogs"
    },
    {
      "tag": "p",
      "text": "C.I.C.L.E. Go Clipless Bicycle Design Spinopsys The Bolts and Nuts iheartbikes Fat Cyclist"
    },
    {
      "tag": "h5",
      "text": "Most Popular"
    },
    {
      "tag": "p",
      "text": "Pedals Bike Stunts Child Bicycle Seats Beginning Bicycling Top Bike Pumps"
    },
    {
      "tag": "h5",
      "text": "Related Sites"
    },
    {
      "tag": "p",
      "text": "Exercise Mountain Biking Weight Loss Running / Jogging Nutrition"
    },
    {
      "tag": "div",
      "text": "All Topics | Email Article | | Advertising Info | News & Events | Work at About | SiteMap | Reprints | Help Our Story | Be a Guide User Agreement | Ethics Policy | Patent Info. | Privacy Policy ©2006 About, Inc., A part of The New York Times Company . All rights reserved."
    }
  ]
}