{
  "url": "http://uk.geocities.com/stephenbirkett/04.html",
  "file_number": "185",
  "content_hash": "c047d2ecc63795ff591b348a0b11fb984f39ad93d2908353072d72fd450521a5",
  "total_blocks": 72,
  "retained_blocks": 5,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "div",
      "text": "following code added by server. PLEASE REMOVE preceding code added by server. PLEASE REMOVE"
    },
    {
      "tag": "p",
      "text": "F O Y L E F R I E N D S C H O O L S U R V E Y THE COMING OUT PROCESS Identifying oneself as\r\nlesbian or gay and disclosing this to other people is often\r\nreferred to as 'Coming Out'. There are three main issues\r\nassociated with coming out which schools need to be aware of: 'Coming out' is a necessary and ultimately positive experience\r\nfor most young people who grow up lesbian or gay. It can\r\ntake place in the years between starting and leaving secondary\r\nschool. In this period, coming to terms with confusion about\r\nidentity can affect a young person's social relationships, school\r\nwork and self-esteem both negatively and positively. Many young lesbian and gay people experience critical times when\r\nthey have to decide who to tell about their sexuality. In\r\nmaking this disclosure they are often fearful of negative\r\nreactions, rejection and causing upset and distress to the person\r\nthey are telling. Sometimes a young person may try 'coming\r\nout' to a supportive teacher or a school friend as a precursor to\r\ntalking to parents in order to rehearse their own part and to\r\njudge reactions. Receiving a negative reaction can be very\r\ndistressing. Support and guarantees of safety are valuable to young people\r\n'coming out'. The availability of secure and confidential\r\ngroups or contacts can be instrumental in reducing anxiety which\r\nis only magnified by feelings of isolation. The presence of\r\nrole models in the shape of adults who 'come out' and those who\r\noffer non-judgmental support and help young people access these\r\ngroups can be important. Positive treatment by, and contact\r\nwith, role models can also encourage them to feel confident about\r\ntheir future. There\r\nare several theories about the elements of the 'coming out'\r\nprocess. Each has its own emphasis but all of them regard\r\n'coming out' as a series of stages. These stages do not\r\nnecessarily last the same length of time and there is no one age\r\nwhen the whole process begins and ends. These stages can be\r\ndescribed as follows: Stage 1\r\n- Sensitisation G9 said \"I was probably always a loner anyway, afraid to let anyone\r\n‘in’, so I was a bit of an oddity among my\r\ncontemporaries anyway.\" Andrew\r\nsaid \"Only now do I realise the level of\r\nharassment, bullying and mental torture that I endured while at\r\nschool. I was never like all the other boys, always\r\nexcluded from all the social activities that the majority\r\nenjoyed. For years I pondered as to why this was. Why was I\r\nbeing treated differently and castigated by others to such a\r\nlonely life?\" In this stage a person\r\ngenerally begins to feel 'different' to other people of the same\r\nsex. Sometimes they recognise that they are not very\r\ninterested in people of the opposite sex but more often they feel\r\nthey are not really interested in things which are supposed to be\r\nappropriate for their sex. Most people report just feeling\r\nunusual when they compare themselves to other people of their\r\nsex. Commonly this happens before or in early adolescence\r\nwhen friendships and relationships between the sexes begin to\r\nchange. Roughly\r\nhalf the LGB men and women surveyed felt 'different' by the age\r\nof 11. Stage 2\r\n- Confusion about identity /SPAN G28 said \"I tried not to think about it as I felt\r\ndisgusted and repulsed if I dared think of fellow class-mates in\r\na sexual way. I shuddered at the thought of them\r\ndiscovering how I felt and thought so I never really thought of\r\nbeing a gay person at school due to the fact that I pretended to\r\nbe 'straight' . Therefore, being gay at school is a life of\r\npretence, lies and denial. Living in fear of being\r\ndiscovered due to the ensuing consequences.\" There\r\nare usually four elements which contribute to confusion about\r\nidentity: Feeling that perceptions of the self are altering; Feeling and experiencing heterosexual and homosexual sexual\r\narousal; Sensing the stigma surrounding homosexuality; Lacking knowledge about homosexuality. Research indicates that most\r\nyoung gay men first decide they are probably gay between the ages\r\nof 12 and 17, and most young lesbian women first decide they are\r\nprobably lesbian between the ages of 16 and 20. At this time they\r\nhave to deal with feeling that they have changed as have their\r\nrelationships with other people around them. Some also have\r\nto combat the potentially powerful feelings of self-recrimination\r\nand disgust that come from describing themselves as homosexual. There are various strategies for coping with this emotional\r\nupheaval. Some young people who think\r\nthey are lesbian or gay will try to deny it to themselves and\r\neven seek help to eradicate their feelings. Others will try\r\nand avoid thoughts and feelings which remind them that they have\r\nhomosexual inclinations. In these situations young people\r\ncan avoid getting any information about sexuality in order to\r\navoid confirming their suspicions about their orientation. Some young people have great\r\ndifficulty in managing their relationships with peers and family. They may avoid situations in which they may encounter\r\nopportunities for heterosexual pairing so that they are not\r\nforced to deal with their lack of sexual interest in members of\r\nthe opposite sex or have it exposed. They may,\r\nalternatively, persevere with heterosexual relationships to try\r\nand 'convert' themselves and/or conceal their homosexuality from\r\nothers. In some extreme cases young people may try to avoid\r\nconfronting their feelings by expressing strong homophobia or\r\nturning to drink and drugs in order to find temporary relief from\r\nthem. Finally, some young people fall\r\nback on a strategy of redefining their feelings and behaviour in\r\nsuch a way as to convince themselves that it is not really\r\nhomosexual. For example, they may describe their\r\nexperiences as a 'phase' or a 'one-off' or they may put them down\r\nto extreme emotional or physical circumstances such as the\r\nbreak-up of a relationship or drunkenness at a party. In this\r\nstage feelings are becoming more concrete. Young people may\r\nwell have partners of both sexes and may well find their moods\r\nand feelings shifting as they feel more or less certain about\r\ntheir identity. This period often lasts throughout\r\nadolescence. It is important to note that\r\n50% of gay and bisexual boys surveyed knew they were gay by 11\r\nand of lesbian and bisexual girls by 12. By 13, 80% of\r\nlesbian and bisexual girls are aware that they are gay and by 15,\r\n80% of gay and bisexual boys are aware that they are gay. Most\r\nchildren who later self-identify as gay/bisexual are well aware that they are gay by NI school year 11 (14/15) Many\r\nare aware they are gay in NI school year 8 (11/12)! By\r\nsixth form practically all gay people know they are gay Stage 3 - Assuming a lesbian or gay\r\nidentity L10 said \"I never felt so bad about not finding\r\nmen attractive in the true sense of the word and it helped me\r\nunderstand why I felt like I did for women so it was no longer\r\nun-natural.\" G26 said \"I was happy to like other boys and\r\nsensed that the one boy I fancied was gay as I could feel that he\r\nwas interested in me by way of glances and once standing up for\r\nme when I was picked on.\" Clearly,\r\nliving with confusion about identity is emotionally exhausting\r\nand potentially destructive. For some young people this\r\nperiod is followed quite quickly by a stage in which they come to\r\naccept their lesbian or gay identity and are able to express it\r\nin a positive way. For both young men and women growing up\r\nmixing with other young gay people - in social settings or\r\nthrough support groups - can help them feel able accept to who\r\nthey are. For some young people, particularly in larger\r\ntowns and cities, lesbian and gay youth support groups provide a\r\nsafe environment for 'coming out'. Elsewhere local and\r\nnational lesbian and gay telephone helplines provide a safe space\r\nand listening ear for young people who want support."
    },
    {
      "tag": "div",
      "text": "Figure 5 The time delay between boys\r\n        realising that they are gay and them telling someone that\r\n        they are gay"
    },
    {
      "tag": "p",
      "text": "Most\r\nboys live with the 'secret' that they are gay for about three\r\nyears in the middle of their school lives. 90%\r\nof girls and 93.4% boys had not told their parents they were gay by the time they were doing\r\ntheir GCSE or Junior Certs (16) Stage 4\r\n- Commitment < G28 said \" It made me stronger to face future\r\nprejudice. It made me more determined to stand up for\r\nmyself and not let any mindless, ignorant superfluous caveman\r\nprevent me from being what and who I was destined to be. For\r\nthat, I can be a better person, proud of myself and my\r\nkind.\" The next stage in the process\r\nof 'coming out' involves becoming being lesbian or gay openly and\r\nrecognising that it is a central aspect of, 'who I am', and, 'how\r\nI want to live my life'. Young people begin to feel that\r\nhomosexuality is a valid way of life and develop a sense of\r\ncontentment with being lesbian or gay. They often have the\r\nexperience of falling in love at this time and, perhaps as a\r\nresult, feel more confident, fulfilled and able to combat the\r\nsocial stigma that they may suffer. At this time some young lesbian\r\nand gay people begin to feel proud of their sexuality. The\r\nexpression of this pride in being lesbian or gay is a powerful\r\nforce in challenging the stigma attached to homosexuality by\r\npeople with prejudiced attitudes and provides positive role\r\nmodels to others less sure about 'coming out'. Stage 5\r\n- Synthesis /p No respondents wrote anything that\r\nwould illustrate synthesis, The person's sexuality becomes\r\na natural part of their life and ceases to impinge on their\r\nconsciousness. Being gay is no longer an issue. They\r\nget on with their lives as any other well adjusted member of\r\nsociety does. To go back to the index click\r\nhere - index.html"
    },
    {
      "tag": "div",
      "text": "text below generated by server. PLEASE REMOVE"
    }
  ]
}