{
  "url": "http://users.ox.ac.uk/~ougym/constitution.htm",
  "content_hash": "4572ecc4874b1cfde49102c2c6290936319145ae3f6efc107905738cd7bc20c2",
  "total_blocks": 127,
  "retained_blocks": 13,
  "ignored_blocks": 114,
  "blocks": [
    {
      "tag": "p",
      "text": "Oxford University Gymnastics\nClub Constitution 2004-2005 Name & Objects if !supportLists 1.0 endif The\nclub is called the Oxford University Gymnastics Club. This is a federal name\nwhich incorporates a mens team and a womens team. The Clubs objects are the support, development, improvement and\npromotion of gymnastics in the University of Oxford; and the income and the\nproperty shall be applied solely to those objects. Compliance if !supportEmptyParas endif if !supportLists 2.a endif The\nClub shall be administered in accordance with the regulations for University\nclubs which are published from time to time in the Proctors and Assessors\nMemorandum (\"the Proctors Memorandum\"). At the time of the adoption of this Constitution the Club is\ndesignated by the Proctors as a recognized sport. if !supportEmptyParas endif if !supportLists 2.b endif If\nthere is a National Governing Body for the sport which the Club is eligible to\nregister, the Club shall effect and maintain such registration: purchase any\ninsurance cover which the national body makes available (unless the Insurance\nSection of the Universitys Central Administration (\"the Insurance\nSection\") agrees to or prescribes other arrangements); and make every\neffort to comply with all the safety procedures which the National body\nprescribes or recommends as good practice. if !supportEmptyParas endif if !supportLists 2.c endif The\nClub shall ensure that all paid Club administrative and coaching appointments\nare ratified by the Universitys Sports Strategy Committee; that all coaches\nare registered with any relevant national governing body; and that all paid\ncoaches are accredited by such body. if !supportEmptyParas endif if !supportLists 2.d endif The\nClub shall observe the Code of Conduct on Safety matters which is set out in\nthe Schedule to this Constitution, ensure compliance with the Code by the\nmembers of the Club, and follow a procedure for risk assessment which is\nacceptable to the Proctors (through the Director of Sport). if !supportEmptyParas endif Membership if !supportEmptyParas endif if !supportLists 3.0 endif The members of the Club shall\nbe those who are eligible and apply for membership of the Club, who are\nadmitted to and maintained in membership by the Committee, and who have paid\nthe relevant Club Subscription. if !supportEmptyParas endif if !supportLists 4.0 endif All resident junior members\nof the University shall be eligible to become members of the Club. A junior\nmember is a matriculated member of a College or Hall who is reading and\nregistered for a recognized degree, diploma or certificate. A member is\nresident if during term the member satisfies the requirement for residence laid\ndown by the University. All members shall continue to be eligible until he or\nshe is given permission to supplicate for his or her degree, diploma or\ncertificate, regardless of whether or not he or she continues to be liable to pay\nfees to the University. if !supportEmptyParas endif if !supportLists 5.0 endif The Committee may also, at\nits discretion, admit to membership: - if !supportLists a) endif Junior members of the\nUniversitys Permanent Private Halls who are not matriculated into the\nUniversity; if !supportLists b) endif Junior members of Ruskin\nCollege; Plater College; Ripon College, Cuddesdon; St Stephens House; The\nOxford Institute of Legal Practice and The Westminster Institute of Oxford\nBrookes University; and if !supportEmptyParas endif if !supportLists c) endif Other persons not being\nresident junior members of the University, or of one of the institutions listed\nin (b) above, provided that non-university members shall not constitution more\nthan one-fifth of the total membership. if !supportEmptyParas endif if !supportLists 6.0 endif The\nCommittee may remove a person from membership for good cause. The person\nconcerned may appeal against such removal to the Senior Member. if !supportEmptyParas endif"
    },
    {
      "tag": "h1",
      "text": "Meetings of the\nMembers"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif if !supportLists 7.0 endif There shall be an Annual\nGeneral Meeting for all members of the Club in Michaelmas Full Term, convened\nby the secretary on not less than fourteen days notice. if !supportEmptyParas endif if !supportLists 8.0 endif The Annual General Meeting\nwill : if !supportLists a) endif receive the annual reports of\nthe Committee for the previous year and the annual accounts of the Club for the\nprevious year, the report of the accounts having been approved by the\nCommittee; if !supportEmptyParas endif if !supportLists b) endif receive a report from the\nCommittee on the Clubs compliance with paragraph 2 above; if !supportEmptyParas endif if !supportLists c) endif elect Members of the\nCommittee in accordance with paragraph 18 below: the Committees nominations\nfor the Officers and the Senior Member shall be contained in the notice of the\nMeeting: any alternative nominations must be seconded and have the consent of\nthe nominee, and must be received in writing by the Secretary not less than\nseven days before the date of the Meeting: nominations for other Committee\nMembers may be taken from the floor of the meeting; if !supportEmptyParas endif if !supportLists d) endif consider any motions of which\ndue notice has been given, and any other relevant business. if !supportEmptyParas endif if !supportLists 9.0 endif An Extraordinary General\nMeeting may be called in any Full Term; by the President, the Secretary or the\nTreasurer on not less than seven days notice; or on a written requisition by\nfive or more members, stating the reason for which the meeting is to be called,\nand delivered to the Secretary not less than fourteen days before the date of\nthe Meeting. if !supportEmptyParas endif if !supportLists 10.0 endif Prior to all General Meetings notice of the agenda shall be\nsent out with notice of the Meeting. if !supportEmptyParas endif if !supportLists 11.0 endif The quorum for a General Meeting shall be six members\npresent in person or by proxy, of whom three must be members of the Committee.\nWhen any financial business is to be transacted, there must be present the\nTreasurer, or a member of the Committees deputed by the Treasurer to represent\nhis her views to the Meeting (provided that where it is a case of a deputy, the\nonly financial business transacted shall be that which was set out in the\nagenda accompanying the notice of the Meeting). if !supportEmptyParas endif"
    },
    {
      "tag": "h1",
      "text": "The Committee"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif if !supportLists 12.0 endif The affairs of the Club shall be administrated by a\nCommittee consisting of not more than eight persons, which shall determine the\nsubscriptions payable by the members of the club, and have ultimate\nresponsibility for the activities of the club. Members of the University shall\nat all times make up the majority of the members of the Committee. The\nCommittee shall have control of the funds and property of the Club, and of its\nadministration. if !supportEmptyParas endif if !supportLists 13.0 endif The quorum for a Committee meeting shall be three members\npresent in person. When any financial business of the Club is to be transacted\nthere must be present the Treasurer, or a member of the Committees deputed by\nthe Treasurer to represent his her views to the Meeting. if !supportEmptyParas endif if !supportLists 14.0 endif The Committee shall be made up of the President, the\nSecretary, the Treasurer (together, the \"Office Holders\"; and their\noffices are referred to as \"the Offices\"), the Senior Member and 2\nother persons. The President, the Secretary and the Treasurer shall each be\neither a member of the Club whose eligibility stems from paragraphs 4, 5(a) or\n5(b) above, or (with approval from the Proctors) a member of Congregation. If\nhis or her eligibility stems from 5(a) or 5(b) above, on election to office he\nor she must sign an undertaking to abide by the Proctors Memorandum and to\naccept the authority of the Proctors on Club matters. if !supportEmptyParas endif if !supportLists 15.0 endif The President shall have the right to preside at all\nmeetings of the members of the Club and at all meetings of the Committee.\nShould the President be absent, or decline to take the chair, the Committee\nshall elect another member of the Committee to chair the meeting. if !supportEmptyParas endif if !supportLists 16.0 endif The Secretary shall: if !supportLists a) endif maintain a register of the\nmembers of the Club, which shall be available for inspection by the Proctors on\nrequest; if !supportEmptyParas endif if !supportLists b) endif give notice of meetings of\nthe members and the Committee; if !supportEmptyParas endif if !supportLists c) endif draw up minutes of those\nmeetings; if !supportEmptyParas endif if !supportLists d) endif notify the Proctors (through\nthe Director of Sport) promptly following the appointment and resignation or\nremoval of Office Holders and other members of the Committee; if !supportEmptyParas endif if !supportLists e) endif advise the Proctors (through\nthe Director of Sport) promptly of any changes in the Constitution; if !supportEmptyParas endif if !supportLists f) endif notify the Proctors (through\nthe Director of Sport) not later than second week of every Full Term of the\nprogramme of fixtures which has been arranged for that term (e.g. by providing\nthem a copy of the fixture); if !supportEmptyParas endif if !supportLists g) endif provide the Insurance Section\nwith full details of any insurance cover purchased from or through a national\ngoverning body pursuant to paragraph 2(b) above; if !supportEmptyParas endif if !supportLists h) endif inform the Proctors if the\nClub ceases to operate, or is to be dissolved, and in doing so present a final\nstatement of accounts. if !supportEmptyParas endif if !supportLists 17.0 endif The Treasurer shall: if !supportLists a) endif keep proper records of the\nClubs financial transactions in accordance with current accepted accounting\nrules and practices; if !supportEmptyParas endif if !supportLists b) endif develop and implement control\nprocedures to minimize the risk of financial exposure, such as procedures to be\nreviewed regularly with the Universitys Internal Audit Section (\"Internal\nAudit\"); if !supportEmptyParas endif if !supportLists c) endif ensure that bills are paid\nand cash is banked in accordance with the procedures developed under (b); if !supportEmptyParas endif if !supportLists d) endif prepare an annual budget for\nthe Club and regularly inform the Committee of progress against that budget; if !supportEmptyParas endif if !supportLists e) endif ensure that all statutory\nreturns are made including VAT, income tax and corporation tax if appropriate; if !supportEmptyParas endif if !supportLists f) endif seek advice as necessary on\ntax matters from the Universitys Financial Division; if !supportEmptyParas endif if !supportLists g) endif develop and maintain a manual\nfor all written procedures for aspects of the Treasurers responsibility; if !supportEmptyParas endif if !supportLists h) endif make all records, procedures\nand accounts available on request to the Senior Member, the Proctor and\nInternal Audit; if !supportEmptyParas endif if !supportLists i) endif unless the Club is designated\nby the Proctors as a recognised sport, forward to the Proctors (through the\nDirector of Sport) by the end of Second week of each Full Term in the Clubs\nfirst year of operation(1 August to 31 July) a copy of the accounts for the\nproceeding term signed by the Senior Member, for retention on the Proctors\nfiles; and after the first year of operation forward a copy of the signed\nannual accounts to 31 st July as soon as possible after the year end\n(and in any event no later than the 1 October following the year end); and if !supportEmptyParas endif if !supportLists j) endif if the Club has a turnover in\nexcess of 30,000 in the preceding year, or if owing to a change in the nature\nof scale of its activities, it may confidently be expected to have such a\nturnover in the current year, subject its accounts of audit by the Universitys\nauditors (or other auditors approved in advance by the Proctors). Accounts are\nto be ready for audit within 4 months after the year-end and the costs of the\naudit shall be borne by the Club. if !supportEmptyParas endif if !supportLists 18.0 endif The members of the Committee shall be elected by the\nmembers of the Club annually, and shall be eligible for re-election. The\nmembers of the Club shall not appoint several individuals to jointly hold any\nof the Offices, nor allow any individual to hold more than one Office at a time.\nIf the Club is designated by the Proctors as a recognised sport, the Director\nof Sport shall be the Senior Member. If the Club is not so designated, the\nmembers of the Club shall appoint a Member of Congregation as the Senior Member\nwhen electing other members of the Committee each year. The Senior Member shall\nbe a member of the Committee ex officio . if !supportEmptyParas endif if !supportLists 19.0 endif If during the period between the annual elections to\nOffices and vacancies occur amongst the members of the Committee, the Committee\nshall have the power of filling the vacancy or vacancies up to the next Annual\nGeneral Meeting by co-optation. if !supportEmptyParas endif if !supportLists 20.0 endif Each Office Holder must, on relinquishing his or her\nappointment, promptly hand to his or her successor in Office (or to another\nmember of the Club nominated by the Committee) all official documents and\nrecords belonging to the Club, together with (on request from the Committee)\nany other property of the Club which may be in his or her possession; and must\ncomplete any requirements to transfer authority relating to control of the\nClubs bank accounts, building society accounts, or other financial affairs. if !supportEmptyParas endif if !supportLists 21.0 endif Without derogating from its primary responsibility, the\nCommittee may delegate its functions to finance and general purposes to\nsubcommittees; which are made up exclusively of members of the Committee. if !supportEmptyParas endif if !supportLists 22.0 endif The Committee shall have the power to make regulations and\nby-laws, in accordance with this Constitution, and to settle any disputed\npoints not otherwise provided for in this Constitution. Any alteration to this\nConstitution shall require the approving vote of two-thirds of those present in\nperson or by proxy at a General Meeting. if !supportEmptyParas endif if !supportLists 23.0 endif No member of the Committee shall be removed from office\nexcept by the approving votes of two-thirds of those present in person or by\nproxy at a General Meeting. if !supportEmptyParas endif"
    },
    {
      "tag": "h1",
      "text": "Indemnity"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif if !supportLists 24.0 endif So far as may be permitted by law, every member of the\nCommittee and every officer of the Club shall be entitled to be indemnified by\nthe Club against all costs, charges, losses, expenses and liabilities incurred\nby him of her in the execution or discharge of his or her duties or the\nexercise of his or her powers, or otherwise properly in relation to or in\nconnection with his or her duties. This indemnity extends to any liability\nincurred by him or her in defending any proceedings, civil or criminal, which\nrelate to anything done or omitted or alleged to have been done or omitted by\nhim or her as a member of the Committee or officer of the Club and in which\njudgment is given in his or her favor (or otherwise disposed of without any\nfinding or admission of any material breach of duty on his or her part), or in\nwhich he or she is acquitted, or in connection with any application under any\nstatute for relief from liability in respect of any such act or omission in\nwhich relief is granted to him or her by the Court. if !supportEmptyParas endif if !supportLists 25.0 endif So far as may be permitted by law, the Club may purchase\nand maintain for any member of the Committee or Officer of the Club insurance\ncover against liability which by virtue or any rule of law may attach to him or\nher in respect of any negligence, default, breach of duty or breach of trust of\nwhich he or she may be guilty in relation to the Club and against all costs\ncharges, losses and expenses and liabilities incurred by him or her and for\nwhich or she is entitled to be indemnified by the Club by virtue of paragraph\n24. if !supportEmptyParas endif"
    },
    {
      "tag": "h1",
      "text": "Dissolution"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif if !supportLists 26.0 endif The Club may be dissolved at any time by the approving\nvotes of the two-thirds of those present in person or by proxy at a General\nMeeting. The Club may also be dissolved (without need for any resolution of the\nmembers) by means of not less than thirty days notice from the Proctors to the\nSecretary of the Club if at any time the Club ceases to be registered with the\nProctors. if !supportEmptyParas endif if !supportLists 27.0 endif In the event of the Club being dissolved, its assets shall\nnot be distributed amongst the members, but shall be paid to, or at the\ndirection of the University. if !supportEmptyParas endif"
    },
    {
      "tag": "h1",
      "text": "Interpretation"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif if !supportLists 28.0 endif Any question about the interpretation of this Constitution\nshall be settled by the Proctors. if !supportEmptyParas endif if !supportEmptyParas endif"
    },
    {
      "tag": "h2",
      "text": "Schedule: Code of Conduct on Safety Matters & Risk Assessments"
    },
    {
      "tag": "p",
      "text": "if !supportEmptyParas endif"
    }
  ]
}