{
  "url": "http://victorhanson.com/",
  "file_number": "189",
  "content_hash": "9e82e159473f42d2a84464c2add0d04b5c8d4d15965020c342bfc6b3804fc4f1",
  "total_blocks": 376,
  "retained_blocks": 27,
  "ignored_blocks": 349,
  "blocks": [
    {
      "tag": "div",
      "text": "\"With our progress we have destroyed our only weapon against tedium: that rare weakness we call imagination.\" – Oriana Fallaci"
    },
    {
      "tag": "p",
      "text": "December 26, 2006 New Why Radical Islam - And Why Now? by Victor Davis Hanson A Symphony Unheard by Craig Bernthal Whose Fiasco? by Victor Davis Hanson Curiosities Lest We Forget Update: 12/8/06 Angry Reader Update: 12/8/06 Pajama's Media Blog Update: 12/10/06 Calendar Update: 11/12/06 Questions for the Author Commentary What is Annanism? by Victor Davis Hanson High Anxiety by Bruce Thornton Talking to Iran by Victor Davis Hanson War-Making and the Machines of War by Victor Davis Hanson Israel Did It! by Victor Davis Hanson Our Pearl Harbor by Victor Davis Hanson Holy Wisdom by Bruce Thornton Losing the Enlightenment by Victor Davis Hanson Blood and Oil by Victor Davis Hanson Conquest and Concession by Raymond Ibrahim War Stories by Victor Davis Hanson Tough Idealism by Victor Davis Hanson Vanity Care by Dr. Linda Halderman Twisted Proverb by Raymond Ibrahim Will the West Stumble? by Victor Davis Hanson More Bark Than Bite? by Victor Davis Hanson The Fighting over the Fighting by Victor Davis Hanson Rethinking Illegal Immigration by Victor Davis Hanson The Sage and the Sword by Bruce Thornton My Bizarre Libyan Holiday by Victor Davis Hanson James Webb and Lessons in Make-Believe by Victor Davis Hanson Kerryism by Victor Davis Hanson Before Iraq by Victor Davis Hanson Last Month's Commentary Books & Things Who Were We? by Victor Davis Hanson The New Appeasement by Victor Davis Hanson The Wolf Pack by Bruce Thornton Worldly Ambitions by Bruce Thornton History and the Movie \"300\" by Victor Davis Hanson Free at Last by Victor Davis Hanson More Books and Things American Student in Paris Red-Carding America by Sarah Bernthal The Rights of Men? by Sarah Bernthal"
    },
    {
      "tag": "div",
      "text": "New Commentary December 26, 2006 Why Radical Islam — And Why Now? by Victor Davis Hanson Tribune Media Services Advertisement R ead any newspaper or turn on any news broadcast and you're bound to encounter stories of Islamic radicals fighting, killing and threatening each other — and just about everyone else. In Somalia, jihadists, with the support of al Qaeda, have clashed with troops loyal to the country's internationally recognized interim government and now threaten neighboring Ethiopia with all-out war."
    },
    {
      "tag": "p",
      "text": "More \"Why Radical Islam - And Why Now?\" December 24, 2006 A Symphony Unheard Go see The Nativity Story. by Craig Bernthal Private Papers"
    },
    {
      "tag": "div",
      "text": "H ere is the plot and the theme: God creates the universe, not because he needs to, since he is complete in himself, but as an act of gratuitous love."
    },
    {
      "tag": "p",
      "text": "More \"A Symphony Unheard\" December 23, 2006 Whose Fiasco? by Victor Davis Hanson Policy Review A review of Fiasco: The American Adventure in Iraq by Thomas E. Ricks (Penguin Press, 2006, pp. 496)"
    },
    {
      "tag": "div",
      "text": "T homas Ricks, the distinguished Pulitzer-prize-winning former Wall Street Journal and current Washington Post journalist, has published widely on defense issues, winning the respect of many, both inside the Pentagon and while on deployment abroad, for his disinterested narratives."
    },
    {
      "tag": "p",
      "text": "More \"Whose Fiasco?\""
    },
    {
      "tag": "div",
      "text": "Lest We Forget Editor's Note:"
    },
    {
      "tag": "p",
      "text": "Two-and-a-half years ago, in May 2004, VDH warned that all the squabbling over Iraq could be put to rest should the United States take the initiative and defeat the insurrectionists, the premise being that most have no ideology, but most certainly do not want to be associated with a losing enterprise. Then he was worried that the withdrawal from the first attack of Fallujah and the escape of Sadr sent a terrible message that the United States was not winning, and that such magnanimity would be unfortunately considered weakness, leading only to more violence. May 28, 2004 Our Reptilian Brains When “Just Win, Baby” sadly trumps everything else. by Victor Davis Hanson National Review Online After our victory in Afghanistan, the president's approval ratings soared, only to descend during the acrimony leading up to the March invasion of Iraq. But after the three-week war, somewhere between 60 and 70 percent of these same Americans purportedly returned to their earlier support of the president's initiatives. More \"Our Reptilian Brains\""
    },
    {
      "tag": "div",
      "text": "Books & Things"
    },
    {
      "tag": "p",
      "text": "November 23, 2006 Who Were We? by Victor Davis Hanson National Review Magazine A slightly shorter version of this review of Dangerous Nation by Robert Kagan and The American Way of Strategy by Michael Lind appeared in the October 22 issue of the National Review Magazine."
    },
    {
      "tag": "div",
      "text": "P resident Bush and his neoconservative advisers, along with his compliant top brass, are pilloried as hegemonists and imperialists, spending vast amounts of blood and treasure in a vain effort to ram our brand of democracy down the collective throat of the Muslim Middle East."
    },
    {
      "tag": "p",
      "text": "More \"Who Were We?\" November 8, 2006 The New Appeasement by Victor Davis Hanson The New Criterion A review of Mark Steyn’s America Alone: The End of the World as We Know It . (Regnery, 2006, 256 pp.)"
    },
    {
      "tag": "div",
      "text": "T he wider English-reading public discovered the genius of Mark Steyn after September 11, and for two reasons other than the fact that his amazing prolificacy did not come at the expense of quality."
    },
    {
      "tag": "p",
      "text": "More \"The New Appeasement\""
    },
    {
      "tag": "div",
      "text": "Pajama's Media Blog"
    },
    {
      "tag": "p",
      "text": "December 10, 2006 The Autumn of Our Discontent The War at Home. The pundits and politicians on the East Coast have really lost it, declaring the war in Iraq now over and lost—even as 140,000 American soldiers are not only still in the field, but fighting in the belief that they can and will win, and that such a victory leading to a stable government in Iraq will enrich millions in the region and make us safer at home. More \"The Autumn of Our Discontent\" December 7, 2006 Almost Everything Today Day of Infamy Sixty-five years ago today we were attacked at Pearl Harbor. I wrote today in my weekly Tribune Media Services column, why, unlike our forefathers, we haven’t been able to finish the war within four years following that similar preemptory and surprise attack on American soil. More \"Almost Everything Today\" December 2, 2006 War and More Too much about Iraq? Some readers will complain about reading here more on Iraq, and the need to defeat the Islamists in the more general war against terror. But the serial writing about the topic is like yelling “Fire” as flames engulf the house. Do we yell it only once, and then keep mum in fears of boring the scorched inhabitants? More \"War and More\" November 29, 2006 Wars, Then and Now... Selective Morality When George Bush Sr. addressed an audience in Abu Dhabi, he was jeered and blamed for globalization — this from a country that can only exist with foreign expertise in a globalized world that finds, extracts, and sells its accidental petroleum fortune. What exactly have the subjects of the Gulf monarchies achieved without foreign expertise — or the armed forces of the United States that alone guarantee free and safe world commerce in and out of the Persian Gulf? More \"Wars, Then and Now...\" November 27, 2006 So Close, So Far No, no, no…. The problems in Iraq, in the radical Middle East at large — with democratization, with nuclearization, with Islamism — are not, repeat not, a lack of dialogue with Syria and Iran. More \"So Close, So Far\" November 20, 2006 Politics and War, Then and Now Is it a Roar or a Meow? Governance is not the same as easy criticism. Already the Democrats are learning, as is eternally true of our wonderful political system, that loud opposition is not the same as being responsible for governance. More \"Politics and War\" November 17, 2006 They're Back? All too real I have been going through the recent report, “Iran: Time for a New Approach” co-chaired by Zbigniew Brzezinski (in charge at National Security during the Iranian hostage crisis of 1979) and Robert Gates (involved in Iran-Contra). It makes depressing reading in its call for new talks with the dictators in Iran, since we have done that for 20 years, and should have learned that they lip-synch back only when they feel they have more to gain than lose. Churchill understood that when he put an end to Tory backchannel efforts to talk with ascendant Nazis after the fall of France. And surely we should learn something from the recent Hamas step back and apparent willingness to rethink talking to Israel — given its loss of millions in Western handouts and tough Israel retaliation against Gaza. More \"They're Back?\" November 12, 2006 Rumsfeld, Webb—and Being Careful About What You Wish For Vaya Con Dios, Rummy! Here is the record of Donald Rumsfeld. (1) Tried to take a top-heavy Pentagon and prepare it for the wars of the postmodern world, in which on a minute’s notice thousands of American soldiers, with air and sea support, would have to be sent to some god-awful place to fight some savagery — and then be trashed live on CNN for doing it; More \"Rumsfeld, Webb . . .\" November 10, 2006 Euripides, the Reverend Haggard, Nemesis, and John Kerry Our New Pentheus Long before Sigmund Freud wrote about repression and the subconscious, Euripides the fifth-century B.C. Athenian playwright explored the frenzy of the human mind — whether Medea’s homicidal rage, Hippolytus’ smug self-righteousness, or poor Pentheus of his masterpiece Bacchae. More \"Euripides, the Reverend . . .\" November 1, 2006 War and Immigration That Was Then, This is Now… I have been reading various columnists today, going over the weekly angry mail about essays I wrote in support of our efforts in Iraq, and listening to Democratic candidates pontificate on the war. More \"War and Immigration\" October 31, 2006 War, Punditry, and Farming Will the Center Hold? Depression apparently abounds these days. In the latest Time , Robert Galluci, the present Dean of the School of Foreign Service at Georgetown University, pleads with ... More \"War, Punditry, and Farming\" October 25, 2006 Middle East Madness More Rubble, Less Trouble? There is a new narrative — compare the recent essay in the New York Times Magazine on the supposed resurgence of the Taliban in Afghanistan — namely that the United States is failing not only in Iraq to win hearts and minds, but also in Afghanistan. More \"Middle East Madness\" October 21, 2006 Darfur—the Good Iraq Darfur I am as outraged as the next American about the genocide in Darfur. More \"Darfur\" October 16, 2006 \"Honor\"? Why do they hate us? Here it is from the horses’ mouths: Afghanistan, Bosnia, Chechnya, East Timor, Iraq, Kosovo, Lebanon, the Philippines, Somalia, Saudi Arabia, and Spain (Andalusia). More \"'Honor'?\" October 13, 2006 Koreana There are some things to remember about North Korea’s nuclear acquisition in the context of this wider war against Islamism. More \"Koreana\" October 9, 2006 From Foley to Footnotes Holy Foley North Korea may well have let off a 20-kiloton nuke. Last week Iran’s Ahmadinejad ridiculed efforts to corral his own nuclear ambitions. More \"From Foley to Footnotes\" October 4, 2006 The War and Its Critics Pajamas Media Pseudo-footnotes Most genres don’t require footnotes — the memoir, the essay, the journalistic dispatch. More \"The War and Its Critics\" Pajama's Media Link"
    },
    {
      "tag": "div",
      "text": "Angry Reader Editor's Note: In this section we entertain letters from the critics. Some readers are angry, some are not so angry, and others merely frustrated."
    },
    {
      "tag": "p",
      "text": "December 8, 2006 Mr. Hanson, have you ever written anything positive about Muslims or Islam, or is it always going to be Israel and the U.S. right, Islam always wrong? Hanson: How odd to suggest that when the now demonized policy, which I supported, of staying on after the removal of Saddam Hussein to allow elections for the Iraqis was most certainly based on the utopian idea that Muslims themselves were quite capable of consensual government as we see in Turkey or Indonesia. So it is up to Arab Muslims to prove that ideal was also true of the Arab Middle East, and show that Palestine and Iraq can stabilize and conduct democracy under the rule of law. Another piece of advise to you, as a moderate Muslim in the West: the present U.S. policy was about as good as the Middle East was going to get, this engagement that saw billions spent in Afghanistan and Iraq for democracy, and real American pressure exerted on behalf on the people of Lebanon, Egypt, and the Gulf States to have a say in their governments. So we are at a great crossroads: when the world's only superpower puts its money and lives behind the idea of consensual government for Arab Muslims, will they tweak and fidget about the infidel's hubris, or use the opening for their own purposes of reform? And a word of warning as well: if Iraq should fail, and if there should be another 9/11 traced to a terrorist-sponsoring Arab nation, and celebrated once more by the proverbial Arab Street, then for the next half century the United States will write off all notion of reform and liberalization and just deal, as we see with the return of the realists, with the Middle East as it is. And that means tough, obliterating retaliatory strikes to each terrorist provocation, without much concern for illiberal conditions on the ground that so enhance the opportunistic terrorists. It is the Muslim world's call, not ours. Find more \"Angry Readers\""
    },
    {
      "tag": "div",
      "text": "Home Author Archives Commentary Speaking Books About Us"
    },
    {
      "tag": "p",
      "text": "Advertise on blogs"
    },
    {
      "tag": "div",
      "text": "Advertisement"
    },
    {
      "tag": "p",
      "text": "Contributors' Archives Victor Davis Hanson Bruce Thornton New Book See reviews of A War Like No Other Pajamas Media: VDH Blog Click to send questions for the authors at this website. Donations You can donate to the development of Private Papers . For a donation of $30, you will receive 2 DVD set with interviews with VDH on warfare and his works. For a donation of $50, you will receive an autographed copy of A War Like No Other . For a donation of $75, you will receive both an autographed copy of A War Like No Other and the DVD set of interviews with VDH. Patrons who join the \"Voices of our Past\" tour of Classical Greece will also receive an autographed copy of A War Like No Other along with the DVD set of interviews with VDH. Private Papers is a production of Samwise Enterprises"
    },
    {
      "tag": "div",
      "text": "Calendar of Speaking Events"
    },
    {
      "tag": "p",
      "text": "At this time, there are no public events scheduled. We will update the calendar as information becomes available."
    },
    {
      "tag": "div",
      "text": "Carnage and Culture Wars of the Ancient Greeks The Western Way of War"
    }
  ]
}