{
  "url": "http://vision.arc.nasa.gov/personnel/jbm/home/vislab/exps/java/safe_txt.html",
  "content_hash": "3b7b798994f0de8962ffd429c2e01eccae393e6c652eb4f4da1861783e71d116",
  "total_blocks": 31,
  "retained_blocks": 2,
  "ignored_blocks": 29,
  "blocks": [
    {
      "tag": "div",
      "text": "Optical radiation safety considerations"
    },
    {
      "tag": "p",
      "text": "This document outlines the basic principles underlying the proper use\nof the optical radiation safety calculator. It is designed for assessing\nsituations in which the eye is illuminated, either to provide a stimulus\nor to illuminate it for photography, videography or direct observation.\nThe optical radiation safety calculator performs calculations for radiation\nat visible wavelengths (400-700 nm), and near infrared (700-1400 nm). 1. Radiometry basics 2. Types of ocular exposure 3. Using the program 4. Glossary 5. References 1. Radiometry basics The basic principles of radiometry can be found elsewhere (link to W&S\nref), but will be presented here in brief. Measurements can be made either\nin terms of radiometric units, which correspond to raw energy or power,\nor photometric units, which are corrected for visibility. When dealing\nwith safety issues, we are primarily concerned with radiometric measures;\nthe same principles apply to photometric measurements, however, so when\nwe use a radiometric term, the corresponding photometric term will be listed\nin parentheses. The basic radiometric (photometric) measurements are irradiance (illuminance)\nand radiance (luminance). Irradiance describes the total power falling\non a surface (such as the surface of a detector, or a tissue surface in\nthe eye). The units of irradiance are expressed in power per unit area,\ntypically Watts per centimeter squared (W/cm²). When a surface is irradiated with a certain amount of power, the energy\ncomes from a source. Most sources are distributed in space, that is, they\nhave some finite size. (This size approaches zero for a perfectly collimated\nbeam, such as might be emitted by a laser.) The radiance of a source is\nsimply the irradiance it produces, divided by the size of the source, where\nthe size is expressed as the solid angle (in steradians) subtended by the\nsource from the point at which the measurement is made. A little reflection\nshould make it clear that the radiance of a source is independent of the\ndistance at which the measurement is made: if we double the distance from\nthe source, the irradiance will decrease by a factor of 4 (inverse square\nlaw); but the apparent size of the source will also decrease by a factor\nof 4, and the two factors cancel out. 2. Types of ocular exposure For considerations of eye safety, there are two principle areas of concern:\nthe first is corneal irradiance. When optical radiation (particularly infrared)\nstrikes the cornea, it can heat and dry it, causing damage to the tissue.\n(Infrared radiation can also cause damage to soft contact lenses at levels\nthat are considered safe for eye exposure, but to my knowledge there is\nno published data on this!) The second area of concern is retinal irradiation. Damage to the retina\ncan cause areas of local blindness (\"scotomas\"). The calculation of retinal\nirradiance is fairly straightforward: the total amount of power entering\nthe eye can be calculated as the product of the corneal irradiance times\nthe effective pupil area . The illuminated area of\nretina will be an image of the source, subtending the same angle from the\nposterior nodal point as the source does from the anterior nodal point.\nTherefore, the retinal area is simply the product of the solid angle subtended\nby the source (in steradians) and the posterior nodal distance of the eye. To convert retinal irradiance to radiance, we need to divide by the\nsource solid angle; but at the retina, the apparent source is the exit\npupil of the eye, so this is the relevant measure. It can be shown by a\nlittle algebra that this is identically equal to the original source radiance! For the calculations we assume that the source is uniform. This assumption\nmay be violated for real sources; for example, a lamp filament will have\n\"hot spots\" where the local radiance is higher than the average radiance.\nIn these situations, it is best to use a diffuser to homogenize the source\nimage. Diffractive optical elements capable of diffusing a beam within\na narrow angular range (such as those manufactured by Physical Optics Corporation)\nare ideal for this application. 3. Using the program Detector diameter. A circular detector area is assumed. For a circular detector, simply\nenter the diameter in millimeters of the active surface. For a non-circular\ndetector, calculate the area (in mm²), then divide by pi (3.14159), take\nthe square root of the result and multiply by 2 to obtain the equivalent\ndiameter. Wavelength A monochromatic or narrow band source is assumed. For a broadband infrared\nsource, the value here is not too critical, because the calculations are\nnot too wavelength dependent. To be conservative, use a value of xxx nm.\nBroadband visible sources are more problematic, because the \"blue light\nhazard\" function has a sharp peak at 4xx nm. Source dimensions at pupil These parameters are most relevant for setups (such as Maxwellian view\noptical systems) where the source is imaged in the pupil by a system of\none or more lenses. In the case where the source image is smaller than\nthe natural pupil (assumed to be 7 mm), the source area is used for the effective pupil area . For cases where the entire\neye/face is illuminated directly by a source, the values here do not really\nmatter, as long as they are larger than 7mm. Apparent size and distance of the source For free viewing of a source, simply enter the actual size and distance\n(in millimeters). For Maxwellian view, where the final lens appears uniformly\nfilled with light, use the diameter and distance of the lens. Detector power Enter the power measurement in microwatts. 4. Glossary Effective pupil area: The area of the pupil\nthrough which light passes. Under free viewing conditions, this is usually\njust the area of the natural pupil. It can be smaller than the natural\npupil under special conditions, such as viewing through a small artificial\npupil, or when using an instrument with a small exit pupil such as a Maxwellian\nview optical system. 5. References Optical Radiation Safety Calculator Web Curator: Valerie Huemer"
    }
  ]
}