{
  "url": "http://watch.pair.com/roundtable.html",
  "content_hash": "6a72a044217029094339f9f5979e94c45bc36d23133ea12390d037f4da5476b0",
  "total_blocks": 70,
  "retained_blocks": 16,
  "ignored_blocks": 54,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "p",
      "text": "THE RHODES ~ MILNER ROUND TABLE While researching the origins of the Religious\nRight for this series, we came across an obscure but significant passage\nin an obscure but highly significant document titled \"The Belmont Brotherhood\".\nThis report is an expose of the John Birch Society, whose founding members\nwere discovered to be, in the main, high-ranking Freemasons and members\nof other subversive organizations. The authors intended to develop the\nBelmont report into a book, but did not do so for reasons that remain unknown\nbut should become apparent to the reader upon discovery of the various\nconnections of the JBS founders. Since the John Birch Society successfully\nlaid the foundation for the exploitation of Christians through the ultra-conservative\nmovement, the Belmont Brotherhood is must reading for every Christian: http://watch-unto-prayer.org/belmont.html The passage which intrigued us is found under\nsection #5 -- a profile of former JBS National Councilman, J. Nelson Shepherd,\nwho belonged to the very elite Newcomen Society. This mysterious society\nwas to be exposed by authors of The Belmont Brotherhood in their book which\nnever materialized, and there is scant information available elsewhere.\nThe president of the Newcomen Society for some length of time was Charles\nPenrose, Jr. who was also a member of two high-level, subversive and one-world\nsocieties in the U.S. known as the Pilgrim\nSociety and the English-Speaking Union .  We have already posted\ntwo reports by Eric Samuelson about these societies, which have their origins\nin the Cecil Rhodes-Milner Round Table Group of Great Britain, which purpose\nwas to reestablish the British Commonwealth of Nations and, ultimately,\nto bring the world under the domination of a restored British Empire. What Cecil Rhodes and Alfred Milner had in\nmind was the formation of a master/slave society based upon the principles\nof eugenics as derived from Plato's Republic. Malthusian\nEugenics is the philosophy of depopulation through the reduction of\ninferior races --\"human weeds\"-- and the selective breeding of \"a race\nof thoroughbreds\" as described early in this century by Rockefeller-funded,\nPlanned Parenthood founder, Margaret Sanger. When Thomas Malthus' theory\nof population was later coupled with Charles Darwin's evolutionary model,\nthe result was known as Social Darwinism."
    },
    {
      "tag": "blockquote",
      "text": "The combination of Malthusian population\ncontrol, which included the deliberate\nneglect of populations and indirect methods of killing off population ,\nwith Darwinism, produced National Socialism (Germany), International Socialism\n(Marxist Russia) and International Corporate Capitalism (Global Socialism,\nheadquartered in the United States), and these forms of social conduct\nhave constituted the main reason for the unequal distribution of planetary\nresources, famines, planned biological warefare, environmental poisoning,\nsuppression of knowledge, suppression of inventions, dependence on backward\ntechnology for the population, planned wars to kill off populations and\ngeneral planetary disorder. The problem is in the Social Darwin-Malthus\nparadigm, which has now been combined with the pseudo-sciences of behaviorism\nand genetics in the attempt to assert even tighter control over the planetary\npopulation, yielding forms of Neo-Darwinism being perpetrated by a host\nof post-Atlantean re-treads, per a 1947 Princeton consensus."
    },
    {
      "tag": "p",
      "text": "Malthusian eugenics has long captivated the imaginations\nof the very elite who control the world's wealth and power structures.\nNearly two centuries of applied principles of Social Darwinism have positioned\nthe world whereby the empowered elite classes may govern the slave race\nthey create to labor under their monopolist capitalist rule. Since the\nOrders of Freemasonry largely comprise the ruling elite which owns the\ntransnational corporations, a Masonic history of The\nRound Table is instructive:"
    },
    {
      "tag": "blockquote",
      "text": "Throughout most the ninetieth century,\nFrench Freemasonry, and not English Freemasonry, was the dominant revolutionary\nforce in the Old World - offering the lower and middle classes a voice\nin government. Since its beginning in 1717, the British Brotherhood was\naristocratic, capitalist, and monopolistic. When French Grand Orient Freemasonry\nsent a German-born Mason, Karl Marx (1818 - 1883) to England to agitate\nthe lower classes to rebel against the British aristocracy, the British\naristocracy became concerned. To counter the increasingly influential ideology\nof French Freemasonry, in 1870 a select group of English Masonry devised\na plan which would both satisfy the proletariat and keep the Masonic oligarchy\nin power. The scheme was introduced at Oxford, by Freemason John Ruskin. Ruskin's inspiration and devotion\nto the creation of an elite of race patriots derived directly from Plato's\nRepublic. In the Republic, Plato called for \"a ruling class with a powerful\narmy to keep it in power and a society completely subordinate to the monolithic\nauthority of the rulers.\" Ruskin sent out to recoup and extend the influence\nof British Masonry. He wanted to do this by education of the working man.\nHis views on the ruling class as developed from Plato's Republic, sent\nshock waves through Oxford. \"[You, the undergraduates are] the\npossessors of a magnificent tradition of education, beauty, rule of law,\nfreedom, decency and self-discipline but... this tradition [can] not be\nsaved, and does not deserve to be saved, unless it can be extended to the\nlower classes in England itself and to the non-English masses throughout\nthe world. If this precious tradition is not extended to these two great\nmajorities, the minority of upper-class Englishmen will ultimately be submerged\nby these majorities and the tradition lost. To prevent this, the tradition\nmust be extended to the masses and to the empire.\" Ruskin's rationale for proclaiming\nsuch ideas was to plant in the fertile minds of his Oxford students the\ntheory that if they educated the working man and elevated him to the middle\nclass, he would labor in behalf of the aristocracy to perpetuate the tradition\nof the upper-class Englishmen - which tradition was to control the finances\nof nations through ground rent, banking and trade. Ruskin taught that it\nwas the essential duty of the aristocracy to guarantee an education for\nthe so that an expanded middle class would rule the country. This arrangement\nwould be a type of legal slavery whereby both classes would benefit. Through\nthe power of finance, the ruling class would maintain control from behind\nthe scenes, while the working class would have opportunity to share in\nthe common wealth made available through loans. Ruskin successfully transmitted his\nvision\nto his students at Oxford. They in turn became the Masonic movers and shakers\nin the new politics and economics that today govern the seven industrial\nnations of the world - the United States, Canada, England, Germany, France,\nItaly, and Japan. A wealthy young man, Cecil Rhodes,\nlike John Ruskin believed that only the British elite could and should\nrule the world to the benefit and happiness of mankind. Shortly after arriving\nat Oxford, Rhodes was initiated into Freemasonry at the Apollo University\nlodge No. 357. On April 17, 1877, he was raised a Master Mason in the same\nlodge. Rhodes also joined a Scottish Rite Lodge at Oxford called Prince\nRose Croix Lodge No. 30. What sort of character was Cecil\nRhodes? Rhodes was a critic of English Freemasonry - of its impotence and\nincompetence in advancing British race interest. After being raised to\nMaster Mason on April 17, 1877, Rhodes drafted a program for world dominion\nby the British race patriots. To guarantee the funding from his vast wealth\nof his world vision for the British empire, Rhodes wrote in 1877 the first\nof seven wills that he composed over his lifetime. The first will called\nfor the formation of a \"secret society\" whose primary function would be\nfocused on returning England to her former glory. He viewed English Freemasonry\nand its conspiracy as impotent and in effect defunct in this regard. Ironically,\nwhen the society Rhodes had envisioned was finally organized after his\ndeath, its membership consisted only of English Freemasons. \"The Round\nTable,\" as it was known, soon became the most powerful appendage of the\nBritish Brotherhood. In his third will Rhodes left his\nentire estate to Freemason Lord Nathan Rothschild as trustee. Rhodes stipulated\nthat his gigantic fortune be used by his disciples to carry out the program\nhe envisioned. Rothschild appointed Freemason Alfred Milner to head up\nthe Secret society for which Rhodes's first will made provision. Lord Milner\nonce remarked of himself, \"My patriotism knows no geographical but only\nracial limits. I am a British Race patriot.\" Upon his appointment by Rothschild\nto chair Rhodes's secret society, Milner recruited a group of young men\nfrom Oxford and Tonybee Hall to assist him in organizing his administration\nof the new society. All were respected English Freemasons. Among them were\nRudyard Kipling, Arthur Balfour, Lord Rothschild, and some Oxford College\ngraduates known as \"Milner's Kindergarten.\" In 1909, Milner's Kindergarten,\nwith some other English Masons, founded the Round Table. The grandfather\nof all modern British Masonic \"think tanks\" was born. Three powerful think tank offshoots\nof the Round Table are (1) the Royal Institute of International Affairs\n(RIIA), organized in 1919 in London; (2) the Council on Foreign Relations\n(CFR), organized in 1921 in New York City; and (3) the Institute of Pacific\nRelations (IPR), organized in 1925 or the twelve countries holding territory\nin what today we call the Pacific Rim. The initial assignment of the Round\nTable was not necessarily to destroy the political experiments of French\nFreemasonry, such as socialism and communism, but to cooperate with them\nfor the advancement of the English Masonic conspiracy. Some seven years before the organization\nof the Round Table, of which H.G. Wells would be a founding member, Wells\nexplained the strategy by which aristocratic English Freemasonry would\nreach its goal of world dominion. He called it an \"Open Conspiracy\" as\nopposed to French Freemasonry's closed or secret conspiracy. \"The Open Conspiracy will appear\nfirst, I believe, as a conscious organization of intelligent and quite\npossibly in some cases wealthy men, as a movement having distinct social\nand political aims . . .\""
    },
    {
      "tag": "p",
      "text": "H.G. Wells, previously a member of the socialist\nFabian Society of England, was, according to the MacKenzies' history of The\nFabians , \"branching out into speculations\nabout a new social order...\" An elite\ngroup of Twelve Wise Men, which included [Bertrand] Russell and Wells,\nwere selected as the \"Co-Efficients\" who met to discuss and formulate,\n\"Ideas about racial improvement by selecting out the efficient...and [George\nBernard] Shaw was working on these 'eugenic' notions in his new play Man\nand Superman . [Fabian and Co-Efficients co-founder] Beatrice Webb called\nit 'the most important of all questions, the breeding of the right sort\nof man...'"
    },
    {
      "tag": "blockquote",
      "text": "\"Above\nall they were avowed elitists, intolerant of the cumbersome and apparently\nwasteful processes of democracy, who wanted to see England ruled by a superior\ncaste which matched an enlightened sense of duty with a competence to govern\neffectively. All of them, moreover, shared Sidney [Webb]'s belief -- which\nhad led him to spend so much effort on London education and on the School\nof Economics -- that social improvement depended upon the training of the\nsuperior manpower needed to carry out schemes of reform. Shaw was suggesting\nin his latest play that universal suffrage was a disaster, putting power\nin the hands of the 'riff-raff' and... Webb who could not wait until a\nnew race of supermen had been bred up to establish the millennium, felt\nthat improved education and intelligent politics would at least start the\nnecessary process of regeneration.\" (Mackenzie, The\nFabians , pp. 283, 290-1)"
    },
    {
      "tag": "p",
      "text": "The\nAmerican Round Table The existence of an American Round Table was\ndisclosed in The Anglo-American\nEstablishment by Carroll Quigley, a\nprofessor (now deceased) in the School of Foreign Service at Georgetown\nUniversity and the mentor of President Bill Clinton:"
    },
    {
      "tag": "blockquote",
      "text": "In the middle of 1890s Rhodes had\na personal income of at least a million pounds sterling a year (then about\n$5,000,000) which was spent so freely for his mysterious purposes that\nhe was usually overdrawn on his account. ...These purposes centered on\nhis desire to federate the English-speaking peoples and to bring all the\nhabitable portions of the world under their control. For this purpose Rhodes\nleft part of his great fortune to found the Rhodes Scholarships at Oxford...The\npower and influence of the Rhodes-Milner group in British imperial affairs\nand in foreign policy since 1889, although not widely recognized, can hardly\nbe exaggerated...The American branch of this English Establishment extended\nmuch of its influence through five American newspapers ( The\nNew York Times , New York Herald Tribune , Christian Science\nMonitor , The Washington Post ,\nand the lamented Boston Evening\nTranscript )."
    },
    {
      "tag": "p",
      "text": "Early members of the American Round Table resemble\na partial listing of Who's\nWho in the Elite . The\nfollowing names were supplied by Eric Samuelson: \" Those identified\nas American Round Table members by Quigley are just a handful. Road Show\n1 lists Morgan, Rockefeller and Carnegie. Also Col. House, Paul Warburg\nand Benjamin Strong. Princeton's Institute for Advanced Study was research\nand development project center in U.S. Other American Round Table members:\nThomas W. Lamont (J.P. Morgan), George Louis Beer, Walter Lippmann, Frank\nAydelotte, Whitney Shepardson and Jerome D. Greene.\" Ron Chernow describes the Anglophile nature\nof the House of Morgan and the Wall Street establishment: \"From its inception,\nthe House of Morgan had been Anglo-American in spirit and character. The\nGreat War, in particular, fused the London and New York banks in a belief\nin Anglo-American responsibility for peace and prosperity. Morgan partners\nsubscribed to an idea expressed by Walter Lippman in 1915 that U.S. foreign\npolicy would experience a 'crowning disaster' if uninformed by a 'vision\nof the Anglo-American future.' ( The\nHouse of Morgan, p. 430) Putting into practice the principles of Social\nDarwinism, \"for peace and prosperity,\"   the chairman of J.P.\nMorgan and Company, Thomas Lamont, secured a $100 million loan in 1926\nfor Mussolini, whose success as fascist dictator of Italy and aggression\nagainst Ethiopia would inspire Adolf Hitler.  Although American statesmen\ndeplore the genocide of the past, Secetary of Defense, William Cohen, who\nconducts the current war against Yugoslavia with Great Britain, is also\nchair of the George Louis Beer Prize, named for the U.S. point man for the Cecil Rhodes Round Table from\n1915-18. The Beer profile identifies yet another member\nof the American Round Table, who in 1953 subverted a Special Committee\nto Investigate Tax-Exempt Foundations chaired by Congressman Carroll Reece\nof Tennessee. According to a series of articles in the Chicago Tribune\nin 1951, there was a time, prior to the Cold War, when a measure of concern\nwas growing over the shadow cast upon the American government by the British\nRhodes-Milner Round Table. The following several excerpts from the Chicago\nTribune were cited in an anonymously authored book, The\nUnion Jack :"
    },
    {
      "tag": "blockquote",
      "text": "Why is it so easy for Americans to\nbe confused about the source of Communism? And why can Americans not believe\nthat the British Empire is more powerful today than ever in history? Do\nthey think that Rhodes Scholar internationalists who have key positions\nin United States institutions and government are made in Russia? Certainly\nthey come from Oxford, England. In the year 1951 there were some interesting\narticles printed by the Chicago Tribune on Rhodes Scholars. The Tribune\nof course would not do so again nor would any big newspaper. Instead they\nhave all been assigned the job of playing down the importance and strength\nof the British Empire. In the July 15, 1951 article in the\nTribune entitled \"Rhodes Ideals Slant State Dept. Policies,\" subtitled\n\"Key Posts Held by Oxford Scholars,\" by William Fulton, we quote: \"New York, July 15 - Key positions\nin the United States department of state are held by a network of American\nRhodes scholars. Rhodes scholars are men who obtained supplemental education\nand indoctrination at Oxford University in England with the bills paid\nby the estate of Cecil John Rhodes, British empire builder. Rhodes wrote\nabout his ambition to cause 'the ultimate recovery of the United States\nof America as an integral part of the British empire.' The late diamond\nand gold mining tycoon aimed at a world federation dominated by Anglo-Saxons.\nHis intimates have admitted the scholarships were established for the primary\npurpose of instilling 'political Bias' rather than providing education.\"\nEnd quote. Then on July 16, 1951, under the\ntitle \"Rhodes' Ideas Find Fertile Ground in U. N.\" subtitled \" 'Scholars'\nAdvance British Schemes,\" by William Fulton, we quote: \"New York, July 16 - American Rhodes\nscholars, men who have received education and indoctrination at Oxford\nUniversity, England,- are prominent in the affairs of the United Nations.\nThe U.N. is an outgrowth of schemes developed by the scholars' patron,\nCecil Rhodes, the British empire builder. Rhodes dreamed of an Anglo-Saxon\nfederation with the British dominating, an organization powerful enough\nto police the world and preserve the peace. In his writings the diamond\ndespot of South Africa showed he hoped the scholarships would promote his\ngrandiose idea. Thirty-two American collegians go to Oxford each year under\nterms of Rhodes' will.\" End quote. On July 17, 1951, under the title\n\"Scholars Help British Cash In On U.S. Billions,\" subtitled \"Rhodes Men\nHold Key Dole Jobs,\" by William Fulton, we quote: \"New York, July 17-'Diamonds are\na girl's best friend,' the popular song goes, and diamonds also are a Rhodes\nscholar's best friend. Approximately 1,400 Americans have gone to Oxford\nUniversity, England, since 1904 with the way paid from the estate of Cecil\nRhodes, diamond magnate and British empire builder. Today numerous Rhodes\nscholars are in a position to repay their educational benefactor in dollars\nfor the sparklers dug up in their behalf from the diamond lands seized\nby the British in South Africa during the last century. \"Rhodes scholars dominate the United\nStates department of state, which directs the doling out of billions in\nforeign aid, with the United Kingdom getting the major share. The savants\nalso hold down important positions in the economic cooperation administration,\nmutual defense assistance program, and other foreign handout setups. This\nis all in keeping with Rhodes' overweening ambitions for a world federation\ndominated by Anglo-Saxons for the purpose of enforcing peace and the status\nquo. He also aimed at 'the ultimate recovery of the United States of America\nas an integral part of the British Empire.' With the Oxford-indoctrinated\nRhodes scholars holding key positions in the Washington administration,\nBritain obtained 31 billion dollars from Uncle Sam in the form of 'lend\nlease' outlays during the war. That was followed by the 3.75 billion dollar\n'gift loan' to Britain in 1946. During the first three years of the\nMarshall plan ECA largesse, the United Kingdom received 2 billion 706 million\ndollars, by far the largest allotment. A bill providing 8% billion dollars\nfor the military and economic aid program abroad is pending before congress.\"\nEnd quote. On July 19, 1951, in the Tribune\nunder the title \"Rhodes' Wards Hawk Global Scheme In U.S.,\" subtitled \"Peddle\nPropaganda for 'One World,\" by William Fulton, we quote: \"New York, July l9 - Rhodes scholars,\nreturning from schooling and indoctrination at Oxford university, England,\nare the principal hawkers of globalist propaganda in the United States.\nThe American scholars obtain their education abroad through terms of the\nwill left by the late Cecil Rhodes, British empire builder and South African\ndespot. Rhodes aimed at the return of the United States to the British\nempire and a world federation dominated by Anglo-Saxons. He hoped his scholars\nwould be instilled with 'political bias' toward these ends, according to\nhis intimate friends. \"Previous articles in this series\nhave disclosed that many of the 1,185 living American Rhodes scholars have\nobtained key positions in the state department, the United Nations, the\neconomic cooperation administration, the mutual defense assistance program,\nand other government agencies where they have worked toward fulfillment\nof the schemes of their imperial patron.\" End quote. On July 20, 1951, under the title\n\"Rhodes' Wards Head Global Foundations,\" subtitled \"Dole Out Cash for One\nWorlders,\" by William Fulton, we quote: \"New York, July 20 - American Rhodes\nscholars, who are spoon-fed doses of internationalism a la mode British\nimperialism at Oxford University, England, are prominent back home in the\naffairs of the big foundations doling out funds toward globalist schemes\nand one world propaganda. Higher echelon offices in Carnegie, Rockefeller\nand other privately-endowed foundations are held by Rhodes scholars. This\nis in keeping with the aims of the late Cecil Rhodes, British empire builder.\nHe left his fortune for the conversion of scholars who would promote his\ndream of an Anglo-Saxon federation to dominate the world. In this way Rhodes\nhoped to return the United States to the empire. \"So far the Rhodes will has underwritten\nthe education and indoctrination of 1,400 Americans at the English university\nsince 1904. The annual output is 32. They have fastened onto key positions\nin the state department and other governmental agencies, just as Rhodes\nhoped it would happen. Funds Further U.N. \"Both-the Carnegie and Rockefeller\ninstitutions have contributed heavily toward 'international' studies to\nfurther the United Nations and other supra-governmental plans designed\nat chipping away American sovereignty. They have also financed organizations\nand students which according to congressional sources, smack of communism,\nin itself a form of internationalism. \"The foundations have been the big\nmoneybags for globalist propaganda through the Woodrow Wilson Foundation,\nWorld Peace Foundation, Foreign Policy Association, Council on Foreign\nRelations, and Carnegie Endowment for International Peace. Former president\nfor the last-named, it will be recalled, was Alger Hiss, the state department\nadviser for Roosevelt at the Yalta conference. Hiss is now serving sentence\nin a federal prison for perjury involving war time espionage for the Russians. \"Two Carnegie top executives are\nRhodes scholars. They are Whitney H. Shepardson, director of the Carnegie\nCorporation British and Colonies fund, and O. C. Carmichael, president\nof the Carnegie Foundation for the Advancement of Teaching.\" End quote. On July 21, 1951, under the title\n\"Rhodes Grads Influential In Eastern Press,\" subtitled \"Aid British, Global\nPropaganda,\" by William Fulton, we quote: \"New York, July 21 The picture of\nthe American Rhodes scholars network in the United States - a rabid movement\ntoward internationalism - is completed and glued together by their numbers\nin the field of molding public opinion. They are highly influential in\nthe eastern press, magazines and radio chains. \"Rhodes scholars in this country\nrepresent 32 campus leaders carefully selected each year to go to Oxford\nUniversity, England, for supplemental schooling. Their patron, the late\nCecil Rhodes, British empire builder and diamond tycoon, aimed at instilling\nin his protégés 'political bias' rather than education, according\nto his intimates. \"This bias, as revealed by the Rhodes\nseven wills and writings, was to recover the United States for the British\nempire in the form of an Anglo-Saxon federation. The federation would be\npowerful enough to dominate the world and enforce the 'peace.' \"Time Follows Rhodes' Line \"Closely following the Rhodes' line\nof propaganda is the Time, Inc., magazine group headed by Henry Luce. Luce\nwas not a Rhodes scholar but he did spend a year at Oxford where he sponged\nup some of the imperialistic doctrines carried later in his magazines.\nSeveral of his top brass editors have been Rhodes Scholars. \"From the start Luce followed the\nAnglophile trail, whooping it up for American intervention in war when\nthe British were in trouble and damning pro-Americans as 'isolationists.'\nHe is a charter member of the 'Eisenhower-for-President' cult, favors entrapment\nof Republicans by Truman's so-called bipartisan foreign policy, and the\nMarshall plan, which has paid off his magazines. \"In addition to pushing the British\nconcept of policing the world with American soldiers and economic aid,\nthe Luce publications have been infiltrated by another form of globalism.\nWhittaker Chambers, devotee of world communism and confessed courier for\na soviet spy ring, was a senior editor ($30,000 a year) for Time magazine.\nChambers informed on Alger Hiss, Roosevelt adviser at Yalta. Hiss is now\nin a federal penitentiary for perjury in a case involving soviet espionage. \"Rhodes Men on N. Y. Times \"The New York Times, which has been\npro-British since the first World war, also has its share of Rhodes scholars\non the staff. An interesting footnote in journalistic history is that at\nthe time Rhodes' final will was published in 1902, the New York Times condemned\nthe idea of American scholarships. \"'Why should an American youth go\nto Oxford when he can get a better education at home in respect of those\nattainments which chiefly make for national greatness?' inquired the Times\nin 1902.\" End quote."
    },
    {
      "tag": "p",
      "text": "It is characteristic of those who take power\nby conquest rather than honest means, to seek first to contain and control\ntheir opposition. Wordworth called it, \"The simple plan, That they should\ntake who have the power, And they should keep who can.\" Lest Americans\nbegin to suspect the infiltration and gradual takeover of their government\nby the subculture of international Freemasonry, another enemy was created. The Union Jack identifies their technique of diverting suspicion from British Communism,\ncourtesy of the Freemasons, by leading a crusade against Soviet Communism\n-- which, having served its purpose, is now defunct:"
    },
    {
      "tag": "blockquote",
      "text": "Can anyone deny the widespread influence,\nor should we say control, by Rhodes scholars over America? This is in truth\nthe \"iron curtain over America\" that is undermining American sovereignty.\nDo the paid patriots inform us about British Communism via Rhodes Scholars? Do the \"patriots\" tell Americans\nabout Masonic Communism? Do they think that Masonry was made in Moscow?\nCertainly not! It was made in England and every Masonic politician and\nfederal judge in America has given allegiance to Masonry over the United\nStates Constitution. They cannot be Americans and true to the global scheme\nof Masonry at the same time. Why is this so difficult to understand? The\nbig red five pointed star that rules over Russia and China was made in\nEngland and still gives allegiance to the same. Do the \"anti-Communists\" know\nthis, or are they Masons too? Russia is a menace to be sure, but\nthe British Empire originated the Russian system of Communism to exploit\nthe world as a front for British Imperialism while they use religion from\nthe churches to set up their scheme as a divine kingdom. Confusion comes\nfrom everywhere but always the \"poor\" British Empire continues to crumble,\nso says the propaganda... ...Is it not logical and reasonable\nto see that anyone promoting such a gigantic movement as Communism is presumed\nto be, would also be wicked enough to take precautions for controlling\nany opposition that might arise ? They could not hope for success if\nthey did not. So, as Marx and Engels were commissioned to launch social\nand political Communism from London, it was London also where pretended\nanti-communism or Spiritual Communism originated for world consumption .\n[bold added]"
    },
    {
      "tag": "p",
      "text": "Karl Marx, the founder of international Communism,\nwas born in Trier, Germany in 1818. At the University of Bonn and Berlin,\nhe studied law, history, Hegelian philsophy, and Feuerbach's materialism.\nThere he edited a radical newspaper which was suppressed, causing his removal\nto Paris in 1843 and Brussels in 1845. With Frederic Engels as his closest\ncollaborator and disciple, Marx reorganized the Communist League, which\nmet in London in 1847. In 1848 he finalized the Communist\nManifesto and was expelled from Brussels\nsubsequent to the failed revolution in Germany which he helped to foment\nwith the Communist League. In 1849, Marx settled in London, where he studied\neconomics and wrote the first volume of his major work, Das\nKapital (1867), with volumes II and\nIII following in 1884 and 1894. He died in 1888 and was buried in Highgate\nCemetery, London. Karl Marx was the leading figure in the First\n(Communist) International from 1864 until its demise in 1872. Lady Queenborough\nnoted in Occult Theocrasy ,\nChapter LXXXV, that the red flag was that of the First International, a\nMasonic movement:"
    },
    {
      "tag": "blockquote",
      "text": "In 1862, the First International\ncame into being and the part played in it by such Freemasons as Karl Marx,\nTolain, Fribourg, Varlin, Camelinat, Beslay, Malon and Corbon is well known...\nKarl Marx, [was] later to be the moving spirit of the First International...\ndestined ultimately to form the keystone of subversion throughout the world. \"...on the 5th August [1862], all\nthe delegates met at a dinner given to them by their English colleagues\nat Freemason's Hall, where an address was read which formed, as it were,\nthe foundation-stone of the International...\" Mazzini and Marx were entrusted\nwith the task of preparing the address and the constitution... A temple\nworthy of their cult was sought and found... near Geneva, where... a fine\nbuilding, the Masonic Temple -- Temple Unique... was procured. ...the scheme\nof the association having been settled in London in 1864... The International now hid itself\namidst the multitude of working men's societies of all descriptions that\nwere either authorized or at least tolerated, and made enormous progress\nso that its chiefs at last declared themselves able to do without any extraneous\nsupport. 'The International', said one of the speakers at the Bâle\nCongress (1869), 'is and must be a state within states; let these go on\nas suits them until our state is the strongest. Then, on the ruins of these,\nwe shall erect our own fully prepared, such as it exists in every section...The\nCommune installed at Lyons began its work by raising the red flag -\nthat of the International .\""
    },
    {
      "tag": "p",
      "text": "The question was posed in The\nUnion Jack : Do \"anti-Communists\" know\n- that Communism was created in England and not Russia - or are they Masons\ntoo?  The answer is partially found in the scandalous profiles of\nJohn Birch Society founders, as presented in The\nBelmont Brotherhood .  The authors of this report also identify\nfor the reader the very sophisticated dynamic of using the anti-communism\ncrusade as a means of controlling opposition to international communism. \nAnd with extraordinary insight the author of The\nUnion Jack: Political Messianism & the Right Wing explains the\npsycho-political warfare involved in the Religious Right's war against\nthe Christian Church and the United States Government (if the reader can\noverlook the author's amillennial eschatology and bias against Fundamental\nChristianity). Our focus on the Religious Right continues\nin a series of reports on the John\nBirch Society , its extension, the Council\nfor National Policy and the British-Israel\nConspiracy ."
    }
  ]
}