{
  "url": "http://waysandmeans.house.gov/hearings.asp?formmode=view&id=1440",
  "content_hash": "62eba44ce44e80f989c65335e36b56434d424c26341516a2486e20038095d127",
  "total_blocks": 127,
  "retained_blocks": 9,
  "ignored_blocks": 118,
  "blocks": [
    {
      "tag": "p",
      "text": "Statement of Stuart K. Pratt, Consumer Data Industry Association The Consumer Data \r\nIndustry Association (CDIA) is pleased to submit written testimony in connection \r\nwith a hearing on the misuse of Social Security numbers and we thank Chairman \r\nShaw for holding this hearing. CDIA has appeared in person before this \r\nsubcommittee before and we hope our testimony will be helpful to you. [1] Founded in 1906, \r\nthe Consumer Data Industry Association (CDIA), formerly known as Associated \r\nCredit Bureaus, is the international trade association that represents more than \r\n500 consumer data companies. CDIA members represent the nations leading \r\ninstitutions in credit reporting, mortgage reporting, check verification, fraud \r\nprevention, risk management, employment reporting, tenant screening and \r\ncollection services. Consumer reporting \r\nagencies are careful stewards of personal information and they adhere to strict \r\nprocedures outlined in federal and state laws. [2] The information infrastructure of the consumer reporting system is the backbone \r\nof the consumer credit economy. [3] Our members have a \r\nstrong interest in the legitimate and lawful use of all information, including \r\nSocial Security numbers. Used properly, SSNs play a substantial role in \r\nreducing fraud, enhancing workplace security, promoting public safety, \r\nsupporting homeland defense, reducing state and federal entitlement fraud, \r\nenhancing child support enforcement, and facilitating commerce to a diverse, \r\nmobile electronic society. Before I \r\nspecifically address how the SSN is used by our industry and the importance of \r\nthis number, I have found it helpful to provide a short review of what a \r\nconsumer reporting agency is, what is contained in a consumer report, and the \r\nlaw that governs our industry. CONSUMER \r\nREPORTING AGENCIES AND CONSUMER REPORTS Consumer reporting \r\nagencies maintain information on individual consumer payment patterns associated \r\nwith various types of credit obligations on approximately 190 million \r\nAmericans. The data compiled by these agencies is used by creditors and others \r\npermitted under the strict prescriptions of the FCRA. Consumer credit \r\nhistories are derived from, among other sources, the voluntary provision of \r\ninformation about consumer payments on various types of credit accounts or other \r\ndebts from thousands of data furnishers such as credit grantors, student loan \r\nguarantee and child support enforcement agencies. A consumer's file may also \r\ninclude public record items such as a bankruptcy filing, judgment or lien. Note \r\nthat these types of data sources often contain SSNs, as well. For purposes of \r\ndata accuracy and proper identification, generally our members maintain \r\ninformation such as a consumer's full name, current and previous addresses, \r\nSocial Security Number (when voluntarily provided by consumers) and places of \r\nemployment. This data is loaded into the system on a regular basis to ensure the \r\ncompleteness and accuracy of data. [4] It is interesting \r\nto note that the vast majority of data in our members' systems simply confirms \r\nwhat most of you would expect; that consumers pay their bills on time and are \r\nresponsible, good credit risks. This contrasts with the majority of systems \r\nmaintained in other countries, such as Japan or Italy, which store only negative \r\ndata and do not give consumers recognition for the responsible management of \r\ntheir finances. As important as \r\nknowing what we have in our files is also knowing what types of information our \r\nmembers do not maintain in files used to produce consumer reports. Our \r\nmembers do not know what consumers have purchased using credit (e.g., a \r\nrefrigerator, clothing, etc.) or where they used a particular bank card \r\n(e.g., which stores a consumer frequents). They also don't have a record of when consumers have been declined for credit or another benefit based on the \r\nuse of a consumer report. Medical treatment data isn't a part of the databases \r\nand no bank account information is available in a consumer report. THE FAIR CREDIT \r\nREPORTING ACT (FCRA) In addition to our general discussion of the industry, we believe it is \r\nimportant for your Subcommittee to have a baseline understanding of the law \r\nwhich regulates our industry. Enacted in 1970, \r\nthe Fair Credit Reporting Act was significantly amended in the 104th Congress \r\nwith the passage of the Credit Reporting Reform Act. Congress, our \r\nAssociation's members, creditors and consumer groups spent over six years \r\nworking through the modernization of what was the first privacy law enacted in \r\nthis country (1970). This amendatory process resulted in a complete, current and \r\nforwarding-looking statute. The FCRA serves as an example of successfully \r\nbalancing the rights of the individual with the economic benefits of maintaining \r\na competitive consumer reporting system so necessary to a market-oriented \r\neconomy. The FCRA is an \r\neffective privacy statute, which protects the consumer by narrowly limiting the \r\nappropriate uses of a consumer report (often we call this a credit report) under \r\nSection 604 (15 U.S.C. 1681b), entitled Permissible Purposes of Reports. Some of the more \r\ncommon uses of a consumer's file are in the issuance of credit, subsequent \r\naccount review and collection processes. Reports are also, for example, \r\npermitted to be used by child support enforcement agencies when establishing \r\nlevels of support. Beyond protecting \r\nthe privacy of the information contained in consumer reports, the FCRA also \r\nprovides consumers with certain rights such as the right of access; the right to \r\ndispute any inaccurate information and have it corrected or removed; and the \r\nright to prosecute any person who accesses their information for an \r\nimpermissible purpose. The law also includes a shared liability for data \r\naccuracy between consumer reporting agencies and furnishers of information to \r\nthe system. SOCIAL SECURITY \r\nNUMBER USES Let me now turn to \r\nthe question of how our industry uses the SSN. Under the Fair \r\nCredit Reporting Act, our industry has a duty to employ reasonable procedures \r\nto ensure the maximum possible accuracy of the consumer report. Further, we \r\nmust design systems that accurately allow our customers to extract only the data requested on a specific individual. We must accomplish \r\nthis dual mission of accuracy both in terms of building databases, but also \r\nproperly identifying files in our systems in the context of a highly mobile \r\nsociety. Consider the following:"
    },
    {
      "tag": "div",
      "text": "Approximately 16% of the nation's population moves \r\neach year according to the U.S. Census Bureau, which means many addresses change \r\neach year. (This equates to approximately 42 million Americans) Based on National Center for Health Statistics, it \r\nis estimated that there are 2.4 million marriages and 1.2 million divorces \r\nannually. This event frequently triggers changes in addresses as well as last \r\nnames. In 1998 there were 6 million homes in the U.S. that are considered \r\n  vacation or second homes. Consumers often switch billing addresses if \r\n  they stay at such residences for long periods of time and in some cases \r\n  maintain billing addresses for both residences with various creditors. \r\n  (Source: U.S. Census Bureau House Vacancy Survey as extrapolated by the \r\n  National Association of Realtors)"
    },
    {
      "tag": "p",
      "text": "These data clearly \r\nspeak to the challenge our members face where identifying data often changes. In light of the \r\nmobility of our society, the Social Security Number plays a very significant \r\nrole in ensuring data quality. Our members process 2 billion data elements a \r\nmonth. These elements are a combination of credit history data and identifying \r\ninformation. Consider the following very real example. Where a consumer \r\nhas changed a last name due to marriage or divorce and has moved to a new \r\naddress, which is common in either case, the SSN is the most stable identifying \r\nelement in the file. First, it helps us to identify the consumer's file with \r\nprecision during this life transition where he or she is likely applying for new \r\ncredit, seeking approval for utilities, and seeking to rent or purchase a new \r\nresidence. The consumer expects that the consumer report will be available for \r\nall of these necessary transactions and the SSN helps our members to meet this \r\nexpectation. Second, the consumer expect his or her file to be accurate and the \r\nSSN helps us to maintain the file accurately even when the consumer is in the \r\nmidst of updating creditors with changes in name and address. The SSN is also a \r\ncritical element in producing information products, which are commonly called \r\nlocator services. These services are made available, for example, to child \r\nsupport enforcement agencies for purposes of locating non-custodial parents; [5] to pension funds which must locate beneficiaries; to law enforcement for \r\nlocating criminals or witnesses; [6] to healthcare providers that must locate individuals who have chosen not to pay \r\ntheir bills, to state benefits agencies to reduce public assistance fraud, [7] and for other similar uses. Further, the SSN \r\nplays a role in fraud prevention products. Where a consumer makes application \r\nfor a product or service, information products that help the business to ensure \r\nthat they are doing business with the right consumer use information products to \r\nauthenticate or verify the application information. This is true in both for \r\nbricks-and-mortar business and in e-Commerce. If applicant data \r\ndoes not match, then the business can take additional steps to verify the \r\nconsumer's identity and thus prevent fraud. FRAUD \r\nPREVENTION AND IDENTITY THEFT In your press \r\nrelease announcing this hearing, you mention the potential for misuse of the SSN. \r\nOur industry has a history of bringing forward initiatives to address fraud. \r\nThese efforts focus on the use of new technologies, and better procedures and \r\neducation. CDIA and its members have a long history of being leading innovators \r\nof identity fraud solutions. The attachment provides a short thumbnail of our \r\ninvolvement in identity fraud remediation since 1993. [8] CONCLUSION In conclusion, you \r\ncan see by our actions that in large part our uses of the SSN are governed under \r\nthe Fair Credit Reporting Act, one of the most extensive privacy laws in the \r\ncountry. Beyond law, our members have a history of proactively limiting how \r\nSSNs are used outside of the FCRA. No one particular element of information is \r\nthe key to identity theft. The underlying theme in all of this is balance. Laws that \r\noverreach in attempting to limit use of the SSN are likely to merely take fraud \r\nprevention tools out of the hands of legitimate businesses at the expense of \r\nconsumers. Ironically, to prevent fraud you must be able to crosscheck \r\ninformation. To maintain accurate databases, you must be able to maintain a \r\nrange of identifying elements. Absent the availability of the SSN, we will be \r\nless able to build accurate data bases, to accurately identify records and to \r\nhelp prevent the very crime through the development of fraud prevention and \r\nauthentication tools. Thank you for this \r\nopportunity to offer testimony. CDIA is available to assist your and your \r\ncommittee at any time. [1] Preventing Identity Theft \r\n    by Terrorists: Hearing before the House Comm. on Financial Services Subcomm. \r\n    on Oversight and Investigations and the House Comm. on Ways and Means \r\n    Subcomm. on Social Security, 107 th Cong. (Nov. 8, \r\n    2001) (testimony of Stuart K. Pratt, Vice President, Vice President, \r\n    Associated Credit Bureaus) ; Use and Misuse of Social Security Numbers: \r\n    Hearing before the House Comm. on Ways and Means Subcomm. on Social \r\n    Security, 106 th Cong. (May 11, 2000) (testimony of Stuart K. \r\n    Pratt, , Vice President, Vice President, Associated Credit Bureaus). [2] All consumer reporting \r\n    agencies are bound by the Fair Credit Reporting Act (FCRA), 15 U.S.C.  1681 et seq . and numerous state credit reporting laws. Among other \r\n    things, the FCRA requires consumer reporting agencies to maintain reasonable \r\n    procedures to assure maximum possible accuracy, 15 U.S.C.  1681e(b) and \r\n    prohibits data furnishers from furnishing data to consumer reporting \r\n    agencies if they know the information has an error,  1681s-2(a). In \r\n    addition, a consumer reporting agency is prohibited from furnishing a \r\n    consumer report to anyone without a permissible purpose - a narrow and \r\n    statutorily limited list of permitted uses.  1681b. [3] For example, it was recently \r\n    noted that Maintaining a reliable and \r\n    robust national credit reporting system is essential to ensure the continued \r\n    availability of consumer credit at reasonable costs * * * The ready \r\n    availability of accurate, up-to-date credit information from consumer \r\n    reporting agencies benefits both creditors and consumers. Information from \r\n    consumer reports gives creditors the ability to make credit decisions \r\n    quickly and in a fair, safe and sound, and cost-effective manner. Consumers \r\n    benefit from access to credit information from different sources, vigorous \r\n    competition among creditors, quick decisions on credit applications, and \r\n    reasonable costs for credit. Fair Credit Reporting Act: \r\n    How it Functions for Consumers and the Economy: Hearing before the House \r\n    Comm. on Financial Services Subcomm. on Financial Institutions and Consumer \r\n    Credit, 108 th Cong. (June 4, 2003) (statement of \r\n    Dolores S. Smith, Director, Division of Consumer and \r\n    Community Affairs, Board of Governors of the Federal Reserve System). [4] Note that there are in fact a \r\n    number of major credit reporting systems in this country. Within CDIAs \r\n    membership the three most often recognized systems would be Equifax, \r\n    Atlanta, Georgia; Experian, Costa Mesa, California; and TransUnion, Chicago, \r\n    Illinois. These systems not only manage their own data, but provide data \r\n    processing services for the hundreds of local independently-owned automated \r\n    credit bureaus in the Association's membership. [5] The U.S. Department of Health \r\n    and Human Services noted that [r]outine transfer of child support payment \r\n    information to credit bureausis essential because these obligations may \r\n    constitute a superior lean on a creditors income. A Guide About Child \r\n    Support Enforcement for Credit Grantors, U.S. Department of Health and Human \r\n    Services, Family Support Administration. November 1988. In addition \r\n    The Association for Children for Enforcement of Support reports that public \r\n    record information provided through commercial vendors helped locate over 75 \r\n    percent of the deadbeat parents they sought. Information Privacy Act, Hearings before the \r\n    Comm. on Banking and Financial Services, House of Representatives, 105th \r\n    Cong., 2d Sess. (July 28, 1998) (statement of Robert Glass). [6] Then-FBI Director Louis Freeh \r\n    testified before Congress in 1999 and noted that in 1998, his agency made \r\n    more than 53,000 inquiries to commercial on-line databases to obtain public \r\n    source information regarding individuals, businesses, and organizations that \r\n    are subjects of investigations. This information, according to Director \r\n    Freeh, assisted in the arrests of 393 fugitives, the identification of more \r\n    than $37 million in seizable assets, the locating of 1,966 individuals \r\n    wanted by law enforcement, and the locating of 3,209 witnesses wanted for \r\n    questioning. Hearing before the Senate Comm. on \r\n    Appropriations Subcomm. for the Departments of Commerce, Justice, and State, \r\n    and the Judiciary and Related Agencies, March 24, 1999 (Statement of Louis \r\n    J. Freeh, Director of the Federal Bureau of Investigation). [7] Consider the following \r\n    examples: Individuals confined to a correction \r\n    facility for at least 1 full month are ineligible to continue receiving \r\n    federal Supplemental Security Insurance (SSI) program benefits Between \r\n    January and August 1996, the sharing of prisoner data between SSA and state \r\n    and local correction facilities helped SSA identify about $151 million \r\n    overpayments already made and prevented about $173 million in additional \r\n    overpayments to ineligible prisoners. General \r\n    Accounting Office, Social Security Numbers: Government Benefits from SSN Use \r\n    but Could Provide Better Safeguards, GAO-02-352 (May 2002), 15, citing \r\n    General Accounting Office, Supplemental Security Income: Incentive Payments \r\n    Have Reduced Benefit Overpayments to Prisoners, GAO/HEHS-00-02 (Nov. 22, \r\n    1999). Applicants for Temporary Assistance for \r\n    Needy Families (TANF), a program designed to help low-income families, are \r\n    required to provide their SSNs. Some agencies share SSN information to \r\n    verify eligibility and identity. Between January and September 1999, New \r\n    York State estimated that SSN verification saved about $72 million. General Accounting Office, Social Security Numbers, \r\n    Government Benefits from SSN Use but Could Provide Better Safeguards, \r\n    GAO-02-352 (May 2002), 15, citing General Accounting Office, Benefit and \r\n    Loan Programs: Improved Data Sharing Could Enhance Program Integrity, \r\n    GAO-HEHS-00-119 (Sept. 13, 200). The Department of Education uses SSNs \r\n    to match data on defaulted education loans with the National Directory of \r\n    New Hires (NDNH)As a result of this matchingthe department reported \r\n    collecting $130 million from defaulted student loan borrowers in 2001. General Accounting Office, Social Security Numbers, \r\n    Government Benefits from SSN Use but Could Provide Better Safeguards, \r\n    GAO-02-352 (May 2002), 16. Federal agencies that are owned money \r\n    share that information with the Treasury Department which matches the \r\n    debtors SSNs with those taxpayers that are owed tax refunds and reduces the \r\n    refund by the amount owed. In 2001, the Treasury Department offset tax \r\n    refunds by $1 billion. Id. [8] While we agree that identity \r\n    fraud is a significant problem, we also hope the committee will consider any \r\n    legislation in the context of the most accurate and reliable data on the \r\n    scope of the problem. One witness has suggested that the number of identity \r\n    fraud victims could be between 700,000  1.8 million per year. Misuse of \r\n    Social Security Numbers: Hearing before the House Comm. on Ways and Means \r\n    Subcomm. on Social Security, 108 th Cong. (July 10, 2003) \r\n    (statement of Steve Edwards, Special Agent \r\n    in Charge, Financial Investigations Unit, Georgia Bureau of Investigations; \r\n    State Coordinator, U.S. Department of the Treasury, Financial Crimes \r\n    Enforcement Network; and Vice Chairman of the Board of Directors, National \r\n    White Collar Crime Center) . CDIA feels that the best review of the \r\n    level of identity fraud victimization is closer to 60,000 to 92,000 per \r\n    year, General Accounting Office, Identity Theft: Prevalence and \r\n    Cost Appear to be Growing, GAO-02-363 (March 2002), 4 , or 162,000 per \r\n    year. FTC Reports: Figures and Trends on Identity Theft, January 2002  \r\n    December 2002. The GAO figures were developed based on interviews with \r\n    three national consumer reporting agencies. Consumer reporting agencies are \r\n    probably the best source understanding the scope of identity fraud \r\n    victimization as victims are mostly likely to contact consumer reporting \r\n    agencies as a first response. Consumer Reporting Agency Responses to Identity Fraud 1993. Consumer Data Industry \r\nAssociation, then known as Associated Credit Bureaus, formed a Fraud and \r\nSecurity Task Force. 1998. Creation of True Name Fraud \r\nTask Force led by former Vermont Attorney General M. Jerome Diamond. The work \r\nof the task force included meetings with law enforcement, consumer \r\norganizations, privacy advocates, legislators and staff, victims, and others. The capstone of the True Name \r\nFraud Task Force was a series of initiatives announced in March 2000. These \r\ninitiatives meant the consumer reporting industry was the first industry to step \r\nforward and not only educate its members about the problems consumers \r\nexperienced, but to seek specific changes in business practices. The \r\ninitiatives are to: Advocate the use and improve the \r\neffectiveness of security alerts through the use of codes transmitted to \r\ncreditors. These alerts and codes can help creditors avoid opening additional \r\nfraudulent accounts. Implement victim-assistance best \r\npractices to provide a more uniform experience for victims when working with \r\npersonnel from multiple fraud units. Assist identity theft victims by \r\nsending a notice to creditors and other report users when the victim does not \r\nrecognize a recent inquiry on the victim's file. Execute a three-step uniform \r\nresponse for victims who call automated telephone systems: automatically adding \r\nsecurity alerts to files, opting the victim out of prescreened credit offers, \r\nand sending a copy of his or her file within three business days. Launch new software systems that \r\nwill monitor the victim's corrected file for three months, notify the consumer \r\nof any activity, and provide fraud unit contact information. Fund, through CDIA, the \r\ndevelopment of a series of consumer education initiatives through CDIA to help \r\nconsumers understand how to prevent identity theft and also what steps to take \r\nif they are victims. 2001. CDIA announced a \r\n  police report initiative so that when a police report is provided as part of \r\n  the process of disputing fraudulent data, Equifax, Experian and TransUnion \r\n  will block these disputed items from appearing on subsequent consumer reports \r\n  regarding that individual."
    },
    {
      "tag": "blockquote",
      "text": "Another collaborative \r\n    effort with tremendous promise is your new police report initiative...I \r\n    appreciate that certain consumer-based initiatives require you to balance \r\n    accuracy issues - knowing that the consumers report contains all relevant \r\n    credit information, including derogatory reports - against customer \r\n    service. From my perspective, your police report initiative strikes just \r\n    the right balance. J. Howard Beales, III, Director of the FTCs Bureau \r\n    of Consumer Protection, before the Consumer Data Industry Association. Jan. 17, 2002."
    },
    {
      "tag": "p",
      "text": "2002-03. ID Fraud Victim \r\n  Data Exchange. CDIA and its members committed in 2002 to start a pilot test \r\n  in early-2003 so that when an ID fraud victim calls any one of the \r\n  participating credit reporting agencies, the victim will be notified that his \r\n  or her identifying information will be shared by the receiving credit \r\n  reporting agency with the other two participating credit reporting agencies \r\n  and that the following steps will be taken by each recipient of the victims \r\n  information: A temporary security \r\n    alert will be added to the victims file. This security alert will be \r\n    transmitted to all subsequent users (e.g., creditors) which request a copy \r\n    of the file for a permissible purpose under the Fair Credit Reporting Act. The victim will be \r\n    opted out of all non-initiated offers of credit or insurance. The CRA will ensure \r\n    that a copy of the victims file is in the mail within three business days \r\n    of the victims request. Our efforts are paying \r\n  off."
    },
    {
      "tag": "blockquote",
      "text": "Most calls are \r\n    prevention related . CDIA members \r\n    report a majority of consumers who contact fraud units are taking \r\n    preventative steps and are not reporting a crime. Victims are \r\n    learning of the fraud earlier . \r\n    According to an FTC report in June 2001, 42% of victims learn about the \r\n    crime within 30 days or less, a full 10% less than than in the prior \r\n    report. CDIA estimates another 35% lean of the crime within one to six \r\n    months and 7% learn of the crime in six months to a year. Victimization of \r\n    the elderly is dropping . In \r\n    2001, the FTC estimated that 6.3% of identity fraud victims were over 65, a \r\n    5% decrease from 2000."
    },
    {
      "tag": "p",
      "text": "About CDIA Founded in 1906, the Consumer Data Industry Association \r\n(CDIA), formerly known as Associated Credit Bureaus (ACB), is the international \r\ntrade association that represents more than 400 consumer data companies. CDIA \r\nmembers represent the nations leading institutions in credit reporting, \r\nmortgage reporting, check verification, fraud prevention, risk management, \r\nemployment reporting, tenant screening and collection services. For more information about \r\nCDIA, its members, or identity fraud or other issues, please visit us at \r\nwww.cdiaonline.org or contact us at 202-371-0910. President Signs Medicare Rx Bill Into Law President George W. Bush signs H. R. 1, the Medicare Prescription Drug, Improvement and Modernization Act of 2003 on Dec. 8, 2003. Internship Opportunities Committee on Ways and Means Internship Opportunities"
    },
    {
      "tag": "div",
      "text": "Committee on Ways & Means U.S. House of Representatives | 1102 Longworth               House Office Building | Washington D.C. 20515 Phone: (202) 225-3625 | Fax: (202) 225-2610"
    },
    {
      "tag": "p",
      "text": "Privacy Statement Home Adobe Acrobat Reader"
    }
  ]
}