{
  "url": "http://216.31.193.173/ewsoe/english/4_4.htm",
  "content_hash": "df8bca24e0c55a89804292f0cf927508f198f071712167f30e697a2866e7a804",
  "total_blocks": 65,
  "retained_blocks": 12,
  "ignored_blocks": 53,
  "blocks": [
    {
      "tag": "div",
      "text": "grey line banner table grey line start of toolbar component navigation table <a href=\"***WELSH***\">\r\n\t\t\t<img src=\"/common/images/toolbar/banner_index_cymraeg.gif\" width=69 height=24 hspace=0 vspace=0 border=0 name=\"banner_index_cymraeg\" alt=\"Cymraeg\"></a>"
    },
    {
      "tag": "h3",
      "text": "4.4 Health of the environment"
    },
    {
      "tag": "h4",
      "text": "Key Issues"
    },
    {
      "tag": "h3",
      "text": "Eutrophication"
    },
    {
      "tag": "p",
      "text": "Concentrations in Welsh rivers of the main \r\n        plant nutrients (phosphate and nitrate) are generally much lower than \r\n        those found in the midlands and south-east England. There are correspondingly \r\n        fewer perceived problems associated with eutrophication compared with \r\n        lowland England. However, nutrient enrichment arising from sewage inputs \r\n        and agriculture does cause water quality problems in all types of aquatic \r\n        environment, affecting drinking water supplies, conservation interests \r\n        and recreational uses. A number of water-supply reservoirs are regularly affected by blue-green algal blooms \r\n        notably Llandegfedd, Wentwood, Cefni and Nant-y-Frith, with implications \r\n        for water treatment and supply. Conservation interests are being affected \r\n        at a number of important wetland sites on Anglesey, at Bosherston Lakes \r\n        in south Pembrokeshire and at Llangorse Lake near Brecon. Eutrophication \r\n        is affecting the survival of two endangered fish species: the gwyniad \r\n        in Llyn Tegid and the arctic charr in Llyn Padarn. Blooms of blue-green \r\n        algae can interfere with recreational activities at \r\n        a number of waters, including Llysyfran Reservoir and Eglwys Nunydd. Despite \r\n        the environmental safeguards to deal with the consequences of eutrophication \r\n        specified in the Cardiff Bay Barrage Act, algal blooms are likely to affect \r\n        recreational uses and aesthetic enjoyment within the impoundment. The \r\n        Wye below Hereford and the Loughor below Garnswllt STW have been designated \r\n        as sensitive areas under the Urban Waste Water Treatment Directive. In \r\n        both stretches, phosphate inputs from sewage works have been shown to \r\n        promote plant growth which may cause serious de-oxygenation \r\n        during the night under conditions of high \r\n        temperature and low river flow. Resulting low concentrations of dissolved \r\n        oxygen have been implicated in fish mortalities on the lower Loughor in \r\n        1984, 1990 and 1995. Besides these designations, there are many smaller \r\n        watercourses in lowland areas which are affected by growths of algae. \r\n        These effects appear to be chiefly related to inputs of nutrients from \r\n        agricultural sources and may reduce the survival of salmonid eggs and \r\n        fry in heavily affected stretches. In general, scientific understanding of the \r\n        links between nutrient inputs and eutrophication in estuarine and coastal \r\n        waters is much less advanced than for freshwaters. Nevertheless, eutrophication \r\n        appears to be connected with periodic low concentrations of dissolved \r\n        oxygen in the Loughor and Dee estuaries. The impoundment created by \r\n        the Tawe Barrage in Swansea is subject to blooms of marine algae, and \r\n        the impoundment has already been designated as a sensitive area. Historical \r\n        records indicate that algal blooms in coastal waters have been a periodic \r\n        natural occurrence. However, the concentration of blooms of Phaeocystis \r\n        between Liverpool Bay and the Menai Strait in north Wales, around Aberystwyth \r\n        and in Carmarthen Bay suggest an influence of enhanced nutrient inputs \r\n        in these areas arising from sewage, agricultural run-off and industrial \r\n        discharges. Concentrations of nutrients and algae in the Irish Sea have \r\n        risen steadily since the 1960s, so this problem appears to be increasing. \r\n        Foams and scums arising from blooms are aesthetically unpleasant, can \r\n        be mistaken for sewage and give rise to numerous public complaints over \r\n        bathing water quality. Blooms of toxic marine algae are relatively \r\n        rare around the Welsh coast although blooms of the dinoflagellate Gyrodinium \r\n        aureolum have been linked to fish and shellfish mortalities in Swansea \r\n        Bay in 1989 and St. Brides Bay, Pembrokeshire in 1994. Other blooms of \r\n        potentially toxic alga include the dinoflagellate Alexandrium tamarense which has been recorded in the upper part of Milford Haven since 1995, \r\n        and a bloom of Dinophysis was recorded within the Tawe impoundment in \r\n        1995. The former can produce Paralytic Shellfish Poisoning and the latter \r\n        Diarrhetic Shellfish Poisoning, but no effects on human health have been \r\n        observed to date."
    },
    {
      "tag": "h4",
      "text": "Synthetic \r\n        chemicals"
    },
    {
      "tag": "p",
      "text": "The distribution of individual synthetic \r\n        chemicals in the Welsh environment reflects their physical and chemical \r\n        properties, and the way in which they are dispersed. The \r\n        persistent substances are poorly soluble in water but soluble in fat. \r\n        They therefore attach to sediment particles, accumulate in the fatty tissues \r\n        of animals, and pose the greatest risk to animals at the top of food chains. \r\n        In freshwater these are fish-or insect-eating aquatic birds and aquatic \r\n        mammals, such as otters, and in the marine environment seals, porpoises, \r\n        dolphins and seabirds are at greatest risk. Clearly humans are also at \r\n        potential risk from the consumption of contaminated wild animals. The \r\n        techniques for monitoring distribution and measuring the \r\n        effect of these chemicals are difficult and expensive. Consequently only \r\n        the apparent high priority chemicals have received attention so far, and \r\n        techniques are still being developed for many groups of synthetic pollutants. PCBs PCBs have been found to be present in freshwater eel tissue at sites throughout Wales, \r\n        but highest concentrations were found in the lower reaches of industrialised \r\n        catchments in the south-east and north 30 . \r\n        Aerial inputs derived from global sources may also be a \r\n        significant route for PCBs found in dipper eggs (an insectiverous riverine \r\n        bird) at remote rural sites 31 . In the marine environment, contamination \r\n        is related to past industrial production, use, disposal and subsequent \r\n        transport with fine sediment. Marine sediments are heavily \r\n        contaminated close to river mouths and docks in \r\n        the Severn Estuary/Bristol channel, contaminated at offshore sites in \r\n        the Severn Estuary and Swansea Bay, and \r\n        slightly contaminated in the centre of the Bristol Channel 32 . \r\n        Although fish from Cardigan Bay and the Severn \r\n        Estuary do not appear to be seriously contaminated, high \r\n        concentrations have been found in marine mammals from \r\n        these locations. This appears to be evidence of high accumulation in predators \r\n        at a considerable distance from PCB \r\n        sources. Dioxins The greatest risk of contamination by dioxins/furans \r\n        is near potential sources such as waste \r\n        incinerators. The Welsh Office commissioned a study of dioxins/furans \r\n        and PCBs in the environment around the high-temperature incineration plant \r\n        of Rechem at Pontypool in 1991 33 . \r\n        With the exception of a localised area within 500m of the plant, measured \r\n        concentrations of PCBs and dioxins/furans in the \r\n        environment provided little evidence of levels of contamination any different \r\n        from those encountered in similar areas elsewhere in the UK. The effects \r\n        of this plant should not give rise to undue concern, according to accepted \r\n        criteria and guidance on health effects for these \r\n        compounds. Pesticides Organochlorine pesticides were used for a \r\n        wide range of applications in Wales, sheep dipping and wool preparation \r\n        being the main rural use. Use of dieldrin and DDT in the UK was banned \r\n        in the late 1980s, but significant residues of these pesticides remain \r\n        in eels from agriculture-intensive and industrialised catchments. In the \r\n        marine environment they are still found in the fatty tissues of marine \r\n        mammals, and an inshore Cardigan Bay sediment sample contained the highest \r\n        level of dieldrin contamination of all sites in a national survey 35 . \r\n        Pentachlorophenol was synthesised in Wales and is still found in the discharge \r\n        from the manufacturing site, although production ceased many years ago. \r\n        Residues remain in sediments surrounding the discharge, and a slight effect \r\n        on the invertebrate community there is evident. The biological impacts \r\n        of organophosphate and synthetic pyrethroids are covered in Section \r\n        4.2. PAHs Polycyclic aromatic hydrocarbons (PAHs) that \r\n        result from combustion of fossil fuels and waste material are found widely \r\n        in industrialised areas, in road run-off and in marine sediments close \r\n        to shorelines. Many are moderately persistent in the environment, but \r\n        are broken down in fish and higher vertebrate animals. They can cause \r\n        the same sorts of cellular effects as PCBs and dioxins. Organotin Use of tributyltin (TBT) antifouling paint \r\n        on boats less than 25m in length ceased in 1987, and the application and \r\n        removal of such paints on boats of 25m or more became subject to regulation \r\n        in 1996. Evidence of impact on the affected species (dog whelk) is limited \r\n        to parts of Milford Haven and Holyhead harbour, close to current sources \r\n        of TBT on large vessels 35 . \r\n        Organotin compounds have been used in other applications and their well-documented \r\n        endocrine disruptive effect may require further assessment."
    },
    {
      "tag": "h4",
      "text": "Radioactivity"
    },
    {
      "tag": "p",
      "text": "Surveys \r\n        in Wales show that the average radon concentration in Welsh homes is 20 \r\n        becquerels/cubic metre, equivalent to about half of the total radioactive \r\n        dose received by the population 36 . \r\n        Radon levels are higher than this average in parts of Glamorgan, Pembrokeshire, \r\n        Radnorshire, Anglesey and north-east Wales due to the underlying geology. \r\n        More extensive areas with high radon concentrations occur elsewhere in \r\n        the UK such as Cornwall and parts of north-east Scotland. Raised levels \r\n        of radon gas increase the risks of \r\n        lung cancer and the National Radiological Protection Board (NRPB) has \r\n        advised that indoor radon above an Action Level of 200 bequerels/cubic \r\n        metre should be reduced. It has been estimated that Wales has about 10,000 \r\n        homes with radon levels above this level. In June 1998, the Welsh Office announced \r\n        a targeted testing programme for four areas at the highest risk from radon \r\n        gas emitted by natural sources. Householders in these areas can receive \r\n        detectors from the NRPB to monitor radon gas in their properties over \r\n        a three-month period. The need for measures to reduce levels will then be evaluated. Grants to assist in this \r\n        work may be available from local authorities. New homes are protected \r\n        through the building requirements in high-radon areas. The results of extensive monitoring of the \r\n        effects of nuclear facilities on levels of radiation in the environment \r\n        are reported annually by MAFF. This includes an assessment of the maximum \r\n        exposure to radiation to humans from each source. For terrestrial sources, these assessments are generally based \r\n        on concentrations in agricultural produce local to the nuclear facility. \r\n        For aquatic foodstuffs, the assessment is based on concentrations in species \r\n        commonly harvested for human consumption. The \r\n        calculation of the dose received is based on consumers with the highest \r\n        potential intake of the food in question 37 . \r\n        The exposure from each of the nuclear facilities in Wales was a small \r\n        percentage of the maximum limit (1 millisievert) for members of the public \r\n        from artificial sources of radiation ( Figure \r\n        4.20 ). Monitoring in 1998 of the impact of the discharges \r\n        from Amersham in Cardiff established that there were relatively high concentrations \r\n        of tritium in flounders (up to 50,000 bequerels/kilogram) caught near \r\n        the effluent discharge from the plant and also in sediments within the \r\n        Severn Estuary. Previously it had been assumed, in accordance with other \r\n        studies, that concentrations in fish would be similar to that of ambient \r\n        seawater. The finding that tritium could be bioaccumulated required a \r\n        reassessment of the radiation dose to the critical group of fish consumers \r\n        in Cardiff, and the 1997 figure of 3% has been revised to 6%. This is \r\n        still a small proportion of the dose limit but nevertheless the unexpected \r\n        bioaccumulation of tritium was of concern and resulted in a requirement \r\n        for tritium discharges to be reduced significantly (see Section \r\n        5.7) . A survey was undertaken in 1997 to determine \r\n        the concentration of technetium-99 in selected animals and plants around \r\n        the Welsh coast. Highest concentrations (1836 bequerels/kilogram) were \r\n        found in brown seaweed at sites closest to the Sellafield discharge along \r\n        the north Wales coast. Concentrations decreased southwards with lowest \r\n        amounts present at sites in the Bristol Channel. The highest concentration found in periwinkles \r\n        in the same survey was 152 bequerels/kilogram. \r\n        This is not a high concentration in relation to the risk to human health \r\n        since consumption of 12 kilograms would result in a radiation dose of \r\n        1 microsievert, which is only 0.1% of the dose \r\n        limit."
    },
    {
      "tag": "h4",
      "text": "Acid rain"
    },
    {
      "tag": "p",
      "text": "Nitrogen \r\n        now contributes 60% and sulphur 40% of the total acidifying input from \r\n        atmospheric deposition in the UK. Some 40% of nitrogen deposition is oxidised \r\n        nitrogen from the combustion of fossil fuels, while 60% takes the form \r\n        of ammonia, mainly from agricultural sources within the country 38 . \r\n        Impacts by acidification from nitrogen and \r\n        sulphur emissions can be assessed by the critical loads approach, which \r\n        shows where deposition rates of atmospheric pollution are high enough \r\n        to cause environmental harm. This demonstrates that acidity critical loads \r\n        for soils and freshwater systems are widely exceeded by the combination \r\n        of nitrogen and sulphur deposition 39 , 40 ( Figure \r\n        4.21 ). Cuts in sulphur emissions have reduced deposition \r\n        in upland Wales from 3050 kg/ha/year in 1984 to 2030 kg/ha/year in 1995. \r\n        Cuts in emissions of oxidised nitrogen have also contributed to reducing \r\n        the affected area, but substantial further progress is needed 25 . \r\n        The effects of reductions to date are apparent in declining sulphate concentrations \r\n        and slight reductions in the acidity of 77 streams surveyed in 1984 and \r\n        1995. However, these improvements have not yet led to biological recovery \r\n        ( Section 4.2 )."
    },
    {
      "tag": "div",
      "text": "Copyright © 1999 Environment Agency. \r\n        All Rights Reserved. START RedMeasure V4 - Java v1.1  $Revision: 1.9 $ COPYRIGHT 2000 Red Sheriff Limited END RedMeasure V4"
    }
  ]
}