{
  "url": "http://bloodandtreasure.typepad.com/blood_treasure/",
  "file_number": "20",
  "content_hash": "c712089f8b46a7a19cdc3226e164e8ae9885418cc8a335be530e6ccd0b51e9d1",
  "total_blocks": 375,
  "retained_blocks": 183,
  "ignored_blocks": 192,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\"\n\t\"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" banner"
    },
    {
      "tag": "h1",
      "text": "Blood & Treasure"
    },
    {
      "tag": "h2",
      "text": "Welcome to the weblog of Time magazine's person of the year. A man of excellent naturall Parts; but very Sarcastick and the greatest Buffoon in the Nation"
    },
    {
      "tag": "div",
      "text": "sidebar1 user photo powered by Powered by TypePad"
    },
    {
      "tag": "h2",
      "text": "marginalia linkage"
    },
    {
      "tag": "div",
      "text": "England in the Age of Improvement MondoWeiss robot wisdom weblog unspeak Tampon Teabag Rachel from north London Pickled Politics Minitrue Katheder Blog Lawyers, Guns and Money Konichiwa bitches The Head Heeb Dave's Part qwghlm.co.uk Banditry Pigdogfucker Aaronovitch Watch European Tribune Danwei Jews sans frontieres Fair Vote Watch The Yorkshire Ranter Tim Worstall The Sharp Side Mike Power Chicken Yoghurt Actually Existing John Robb's Weblog Free Market Anti-Capitalism Philobiblon Stumbling and Mumbling The Poor Man doctorvee Shuggy's Dead Men Left Europhobia Chris Lightfoot perfect Matt T what bloggerheads chase me ladies virtual stoa shot d-squared len whiskey early undernews anti counter comment DeLong Offerings Washpundit Max Fistful Crooked Back Explananda"
    },
    {
      "tag": "h2",
      "text": "friends blogs"
    },
    {
      "tag": "div",
      "text": "Running Dog Lose the Delusion WhirledView"
    },
    {
      "tag": "h2",
      "text": "group grope"
    },
    {
      "tag": "div",
      "text": "The Sharpener"
    },
    {
      "tag": "h2",
      "text": "China"
    },
    {
      "tag": "div",
      "text": "Beijing or Bust Angry Chinese Blogger EastSouthWestNorth Blog RConversation The Peking Duck Imagethief Elite Chinese Politics Frog in a Well Wangjianshuo's Blog Musing Under The Tenement Palm Bingfeng Teahouse non-violent resistance asiapundit"
    },
    {
      "tag": "h2",
      "text": "we're all going to die"
    },
    {
      "tag": "div",
      "text": "Arms and influence Defense and the National Interest Schneier on Security JustinLogan.com american footprints No quarter Early Warning Defense Tech ArmsControlWonk Sic Semper Tyrannis Power and Interest The Jamestown Foundation: Terrorism analysis GlobalSecurity Global Guerrillas"
    },
    {
      "tag": "h2",
      "text": "affinities and bad habits"
    },
    {
      "tag": "div",
      "text": "Watching America North Korea zone Asian Sex Gazette Global Voices Online NK news Press Interpreter: China AsiaMedia Political Theory Daily Review Cursor Shovelware Matt Taibbi Mark Ames WaiWai Proud of Britain China Digital News eXile Paul Bowles Sobaka Cryptome Tom Frank Ron Rosenbaum Mencken Amis zizek Gore Vidal Ellroy Flashman StrategyTalk Viz oatcake serial killers rotten Will Self J.G. Ballard"
    },
    {
      "tag": "h2",
      "text": "occupational hazards"
    },
    {
      "tag": "div",
      "text": "work blogs central parking attendant call centre manager My Life As A Morrisons Employee retail - Argos policeman ambulance paramedic magistrate entries"
    },
    {
      "tag": "h2",
      "text": "December 26, 2006"
    },
    {
      "tag": "h3",
      "text": "memories of the left handed"
    },
    {
      "tag": "p",
      "text": "Not much to say about Ethiopia’s offensive against the Somali ICU, other than that its early stages seem to replicate the invasion of Iraq, with the Somalis being apparently unable to stand up to superior Ethiopian firepower while in open country. Let’s see what happens if and when the Ethiopians try to enter Mogadishu. The other point is that this conflict isn’t a straightforward Islamist/Christian match up everyone seems to be assuming; or at least that the religious aspect of the fight ties in with traditional Somali irredentism from way, way back."
    },
    {
      "tag": "blockquote",
      "text": "In Ethiopia the damage which [Ahmad] Gragn did has never been forgotten,\" wrote Paul B. Henze. \"Every Christian highlander still hears tales of Gragn in his childhood. Haile Selassie referred to him in his memoirs. I have often had villagers in northern Ethiopia point out sites of towns, forts, churches and monasteries destroyed by Gragn as if these catastrophes had occurred only yesterday.\"[11] While acknowledging that many modern Somali nationalists consider Ahmad a national hero, Henze dismisses their claims, stating that the concept of a Somali nation did not exist during Ahmad's lifetime."
    },
    {
      "tag": "p",
      "text": "More recently, there have been two border conflicts in the last 45 years. I think that Ethiopia’s main interest in this conflict lies in keeping Somalia weak, rather than putting an end to Islamism in the country. Meles Zenawi seems to be saying as much here :"
    },
    {
      "tag": "blockquote",
      "text": "Meles has said he does not intend to keep his forces in Somalia long, perhaps only a few weeks. He has told visiting dignitaries that his goal is to severely damage the Islamic movement's military capabilities and allow both sides to return to peace talks on even footing."
    },
    {
      "tag": "p",
      "text": "It looks like it might be Eritrea's turn to make a move, though they may hold on to see whether more troops are sucked into the conflict."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 04:29 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "universal bereavement, an inspiring achievement"
    },
    {
      "tag": "p",
      "text": "My conscience told me I should get this . But I ended up getting this instead. Goes well with Wray and Nephew overproof I find."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 03:54 PM | Permalink | Comments (1) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 23, 2006"
    },
    {
      "tag": "h3",
      "text": "a bum's christmas"
    },
    {
      "tag": "p",
      "text": "As is traditional round here, we mark the season with H L Mencken’s Christmas story for atheists:"
    },
    {
      "tag": "blockquote",
      "text": "It was an unendurable outrage, he argued, to invite a poor man to a free meal and then make him wait for it while he was battered with criticism of his ways, however well intended. And it was an even greater outrage to call upon him to stand up in public and confess to all the false steps of what may have been a long and much troubled life. Fred was determined, he said, to give a party that would be devoid of all the blemishes of the similar parties staged by the Salvation Army, the mission helpers, and other such nefarious outfits. If it cost him his last cent, he would give the bums of Baltimore massive and unforgettable proof that philanthropy was by no means a monopoly of gospel sharks--that its highest development, in truth, was to be found among freethinkers."
    },
    {
      "tag": "div",
      "text": "Tomorrow, we'll be torturing Santa. Actually, it's probably over and out from me for a bit. Champagne for your real friends and real pain for your sham friends and so on. Back soonish. technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 08:12 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "on getting a life"
    },
    {
      "tag": "p",
      "text": "So you’re one of those Second Lifers and you want to deal in property? Here are your friendly virtual estate agents:"
    },
    {
      "tag": "blockquote",
      "text": "Since 2004 Anshe Chung Studios Ltd., has been the global leader in virtual real estate trading and development. What began as a game with an initial investment of 9,95$ for a Second Life account has grown into a serious business."
    },
    {
      "tag": "p",
      "text": "Today ACS already turns over several million US$ worth of virtual land, goods and services per year, with an average monthly growth rate above 10%. In 2006 the government of Hubei, China has granted Anshe chung Studios special status as priviledged hightech enterprise, recognizing its potential as innovator and creator of highly qualified jobs in Wuhan. Currently Anshe Chung Studios employs about 20 people in China and abroad. With its expert team of virtual world artists, realtors and service representatives ACS has been servicing both end users and organizations. Its customer base is as varied as the population of the virtual world platforms it serves, ranging from the average gamer to educators, real life billionaires and celebrities. Via . The odd thing about this is that you can’t buy and sell real land in China."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 04:00 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 22, 2006"
    },
    {
      "tag": "h3",
      "text": "war on Christmas: the Eastern Front"
    },
    {
      "tag": "p",
      "text": "We seem to be taking our own whiny, pseudo-academic maunderings about cultural imperialism and forcing them on the hapless natives of China:"
    },
    {
      "tag": "blockquote",
      "text": "As Christmas draws near, ten philosophy and education PhD students from China's top universities jointly publicized a petition on the Internet, calling on netizens, especially the young, to be less excited about the exotic holiday, Shanghai-based Xmnext.com reported December 21, 2006."
    },
    {
      "tag": "p",
      "text": "This is the latest instance of public resistance to western culture and lifestyles in China. In the online petition, titled \"Out of Cultural Collective Unconsciousness, Strengthen Chinese Cultural Dominance\" and dated with traditional Chinese Era Calendar, PhD students from China's most authoritative universities including Beida, Tsinghua and People's University hope to \"wake up the Chinese people to resist western cultural invasion\". So what kind of western cultural imperialism are we talking about?"
    },
    {
      "tag": "blockquote",
      "text": "On the same day another report from the Henan Business News in central China's Henan Province said a commercial chamber was planning a nude running event on the evening of December 24, and had received more than 1,700 applications to join in the activity."
    },
    {
      "tag": "p",
      "text": "Granite Studio takes up the theme:"
    },
    {
      "tag": "blockquote",
      "text": "Citing the increasing popularity of the holiday among the younger generation, protest organizer Wang Dashan published an article, \"to awaken the Chinese people and to resist Western cultural expansion.\""
    },
    {
      "tag": "p",
      "text": "He argues that Christmas is a form of \"soft power\" that if left unchecked will dilute traditional Chinese culture. Wang and his associates fear that too many Chinese young people are simply \"rejecting what is old and embracing what is new\" (古非今是) and are adopting an attitude of \"what is Chinese is inferior and what is Western is excellent\" (中劣西优). I’m trying really, really hard not to say that Wang Dashan’s Cantonese name is Ba Hum-bug, but I’m clearly failing in this. I was in China once in mid-January. The Christmas stuff was still up there. A woman who ran a bar I drank at told me that she was going to keep her decorations up till after lunar new year, the aim amongst a lot of retailers in Beijing being to apparently establish a festive season in the, well, seasonal sense, running from mid December till February. This isn’t cultural imperialism. It’s a bunch of sharp, commercially aware people in China taking a hard, cold look at the thing and extracting as much utility from it as possible. Oh, yes: these folks know what Christmas means."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 03:01 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "government petition tomfoolery"
    },
    {
      "tag": "p",
      "text": "Over here ."
    },
    {
      "tag": "blockquote",
      "text": "While we are aware of similar initiatives already in existence, the Government does not currently have any plans to make monkeys available to people with disabilities."
    },
    {
      "tag": "p",
      "text": "Damn them. via ."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 10:24 AM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 21, 2006"
    },
    {
      "tag": "h3",
      "text": "prezzies off the reaper"
    },
    {
      "tag": "p",
      "text": "We’ve been having a few of them lately, what with Pinochet going, and now the Turkmenbashi. Here’s part of the official announcement, reproduced for lovers of sycophantese:"
    },
    {
      "tag": "blockquote",
      "text": "\"The glorious years during which the Great Serdar ruled the Turkmen people confirmed his heavenly faculty to foresee and his ability to determine priorities. His unique abilities in the art of leading the nation revealed his talent as a diplomat and a wise and humane person,\" the statement says."
    },
    {
      "tag": "p",
      "text": "\"The objectives he set served the interests of the people, while the large-scale projects that were implemented were in harmony with the national spirit of the Turkmen people and were accepted by every ethnic Turkmen and all other people living in Turkmenistan,\" it says. Via Nosemonkey, who has more to say. It’s customary at this point to offer some pious hopes on the subject of a transition to democracy, or some such, but maybe the best you can do here is just keep your fingers crossed for the Turkmen and hope the the successor’s not a total fruitcake. Nayazov renamed bread after his mother. Maybe the next one will just mistake his wife for a hat or something."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 06:59 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "awesome understanding"
    },
    {
      "tag": "p",
      "text": "I don’t accept the overall premise of this George Packer article, since it seems to embody a lot of the same hubris we’ve seen in foreign policy over the past few years, except that this time we’re going to outwit them with our awesome understanding rather than destroy them with our awesome firepower. Still, it’s good on the detail:"
    },
    {
      "tag": "blockquote",
      "text": "A war on terror suggests an undifferentiated enemy. Kilcullen speaks of the need to “disaggregate” insurgencies: finding ways to address local grievances in Pakistan’s tribal areas or along the Thai-Malay border so that they aren’t mapped onto the ambitions of the global jihad… as an example of disaggregation, Kilcullen cited the Indonesian province of Aceh, where, after the 2004 tsunami, a radical Islamist organization tried to set up an office and convert a local separatist movement to its ideological agenda. Resentment toward the outsiders, combined with the swift humanitarian action of American and Australian warships, helped to prevent the Acehnese rebellion from becoming part of the global jihad."
    },
    {
      "tag": "p",
      "text": "Relevant to which: Zawahiri attacks Hamas."
    },
    {
      "tag": "blockquote",
      "text": "Zawahiri slammed Hamas for recognizing President Mahmoud Abbas and running in elections last January."
    },
    {
      "tag": "p",
      "text": "\"Accepting the legitimacy of Mahmoud Abbas, the head of the national authority, America's man in Palestine, and mandating the PLO which recognizes Israel to negotiate with Israel is an abyss which will ultimately lead to eliminating the jihad and recognizing  Israel,\" Zawahiri said. So what do you do about this? Exploit the enmity between Hamas and al-Qaeda or just write them off as an undifferentiated arc of extremism? And how do you expect anyone to take you seriously when you include Saudi Arabia and the Gulf States in your list of countries that practice “democracy and moderation?” And back to the Daily Star article:"
    },
    {
      "tag": "blockquote",
      "text": "Participation in the polls in turn led to \"respecting international [UN] resolutions,\" which was followed by accepting to form a government of national unity, and later by attempts to \"get them [Hamas] out of government,\" he said."
    },
    {
      "tag": "p",
      "text": "It seems that the Z-man’s got Blair’s current Palestinian strategy nailed. After it happens, he’ll be there to say “I told you so.”"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 01:43 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "unto a virgin"
    },
    {
      "tag": "p",
      "text": "Topical, not to mention seasonal :"
    },
    {
      "tag": "blockquote",
      "text": "A virgin birth is expected this Christmas, though this particular nativity scene will be set in a zoo instead of a stable."
    },
    {
      "tag": "p",
      "text": "That's because the virgin in question is Flora the Komodo dragon, a giant lizard at Chester Zoo in England that has laid fertile eggs despite never having had a mate. Perhaps Flora was visited by the Holy Lizard. And is that David Icke, bearing gifts?"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 01:03 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "the enemy"
    },
    {
      "tag": "p",
      "text": "Enemies all around I see..."
    },
    {
      "tag": "blockquote",
      "text": "A British soldier has been charged with passing secret information linked to the military campaign in Afghanistan to Iran, The Times has learnt. Corporal Daniel James, 44, appeared at City of Westminster Magistrates’ Court in London yesterday, charged under Section 1 of the Official Secrets Act with communicating information “useful to the enemy”."
    },
    {
      "tag": "p",
      "text": "The case was considered so sensitive that after the charge had been read out, reporters were told to leave and the remainder of the hearing was held in camera…"
    },
    {
      "tag": "blockquote",
      "text": "…However, The Times has learnt that the soldier was charged in relation to the passing of confidential information about British activities in Afghanistan to Iran, which shares a border with western Afghanistan, and has a strategic interest and influence in the region."
    },
    {
      "tag": "p",
      "text": "So far as I’m aware, the OSA has various provisions against revealing any secrets at all, to anyone. And I know that you don’t actually have to be in a shooting war with another country to identify it as belligerent. But what’s the actual legal basis for a prosecution identifying Iran as “the enemy”? Or is this an attempt to establish one?"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 10:34 AM | Permalink | Comments (6) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 20, 2006"
    },
    {
      "tag": "h3",
      "text": "oh, that's the reason"
    },
    {
      "tag": "p",
      "text": "Anthony Selsdon tells us why US diplomacy has been so effective over the past few years:"
    },
    {
      "tag": "blockquote",
      "text": "Insiders insist that only with the release of documents, particularly the extraordinary videotaped conferences that take place weekly between Bush and Blair, will the true nature of this relationship be understood. These documents, they claim, will reveal an intimate partnership, with Bush relying heavily on Blair's evaluation of European and, indeed, world leaders and Blair emerging as a core player in the internal politics of the administration."
    },
    {
      "tag": "p",
      "text": "I take it there’s a large amount of hype in this statement, but it’s hard to believe given America’s recent track record in winning friends and influencing people that this is a credible line of defense. On the other hand:"
    },
    {
      "tag": "blockquote",
      "text": "Blair's advisers believe that further progress on Europe was made almost impossible by his French and German counterparts, Jacques Chirac and Gerhard Schröder. These relationships have not been a success, and so Angela Merkel's defeat of Schröder raised spirits in No 10. Some of Blair's defenders, however, whisper that fate's cruellest blow was for his premiership to have coincided with the presidency of George Bush. Others say the same thing about Gordon Brown."
    },
    {
      "tag": "p",
      "text": "There’s an almost gargantuan sense of thwarted entitlement in this; as if the whole world should be organized around What Tony Wants."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 05:35 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "noted animator's passing noted"
    },
    {
      "tag": "p",
      "text": "I don’t want to sound like some postmodern media tosser, at least not without getting paid for it,  but I can’t let the passing of Joseph Barbera go by without noting that the local nickname for the cops in Manchester is the Dibble. I think of this as an example of the great tradition working itself organically down through the common culture. And while we’re here let's ask a vital question. Who was your favourite wacky racer? UPDATE: UPDATE: Martin Rowson draws the line:"
    },
    {
      "tag": "blockquote",
      "text": "In his Guardian obituary only about seven lines are given over to Barbera's post-Tom and Jerry career, despite the fact that it took up most of his professional life and made him his millions. That strikes me as fitting. Although everyone born in the last 60 years might imagine that they have happy childhood memories of The Flintstones, Yogi Bear, Huckleberry Hound or, God help us, Scooby-Doo, the truth of the matter is that they're crap. Complete and utter crap. Worse, they're shoddily made crap, after Hanna-Barbera devised what they called \"limited animation\", more than halving the number of drawings from 26 per second to 3000 for five minutes, the better to fill the empty moments on TV between the ads. And thus they effectively destroyed animation for at least two generations, before it slowly began to claw its way back to respectability in the mid-90s."
    },
    {
      "tag": "div",
      "text": "Well, yes and no. In terms of Tom and Jerry there’s the post Fred Quimby era, where there was a definite falling off in quality. And the TV cartoons certainly looked pretty shoddy. But they weren’t all crap either. In the plus column there’s Top Cat and Wacky Races, and in the minus…well, all the rest really."
    },
    {
      "tag": "p",
      "text": "Curiously enough, when I came to read Clockwork Orange I was reminded of the lavish ultraviolence of the early Tom and Jerry. And Top Cat is a kind of kiddie version of Gangs of New York.  Top Cat’s gang were called Fancy Fancy, Spook, Benny the Ball, The Brain, and Choo Choo, which is reminiscent of this:"
    },
    {
      "tag": "blockquote",
      "text": "The Whyos were the most powerful downtown gang between the Civil War and the 1890s…whose most pre-eminent figures included such coloufrul names as Hoggy Walsh, Fig McGerald, Bull Hurley, Googy Corcoran, Baboon Doyle, Red Rocks Farrell, Slops Connolly…"
    },
    {
      "tag": "p",
      "text": "…and so on, from Luc Sante’s Low Life."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 10:29 AM | Permalink | Comments (5) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 19, 2006"
    },
    {
      "tag": "h3",
      "text": "some Chinese law enforcement"
    },
    {
      "tag": "p",
      "text": "OK, in reference to the last entry, let's do some newsgathering. Dissident lawyer Gao Zhisheng, probably best known for defending Falun Gong members, was kidnapped in Beijing by Chinese security forces last August. He is now detained on various charges pertaining to “subversion.” Even before that happened his life was somewhat crowded:"
    },
    {
      "tag": "blockquote",
      "text": "I went out this early this morning to exercise in the park.  Several plainclothesmen were around me.  Compared to before, the scale of the surveillance has clearly gone up.  On the way back home, several plainclothesmen shadowed me closely.  After breakfast, my wife took my daughter to the place of the music tutor.  As soon as they stepped out, the plainclothesmen followed them.  While my daughter took lesson for one hour, the plainclothesmen waited idly outside.  Afterwards, they followed them home…"
    },
    {
      "tag": "p",
      "text": "… When we arrived at KFC, we ordered food and we sat down to eat.  A big plainclothesman even came right up and stood across my wife not more than 1.8 meters away.  The others also came up.  From their wooden expressions, it was clear that they have done this sort of thing often enough.  So we ate while they stared.  When we were done, we went home escorted by the cars front and back again. Now he’s out of the way, the cops have started on his daughter."
    },
    {
      "tag": "blockquote",
      "text": "On Saturday, December 16, Little Gege went to the school for remedial lessons.  She rode to school on a bicycle by herself.  As usual, the Ministry of National Security police followed her on four bicycles and seven Buick MPV's.  At noon, Little Gege got out of school.  Her classmates were going to play tennins.  Little Gege knew that she could not go with them, but she walked with them to the bus stop.  Since the classmates have not eaten, Little Gege bought them a bowl of fried noodles.\n \nAt that moment, the Ministry of National Security police told Little Gege that she cannot go with her classmates.  So she kicked the police officer's bicycle.  The police walked up to her and confronted her, whereupon Little Gege threw the bowl of noodles at his face.  Then three male and three female police surrounded the 13-year-old girl and proceeded to pummel her.  A tall police man picked her up and threw her on the ground.  A police woman pulled her hair and cursed her.  Her classmates heard the the police woman cursed her: \"F**k!  This little bitch's hair is long!\" and then she stomped her foot on Little Gege's thigh.  Eventually the police officer hauled Little Gege into the police car.  During the process, Little Gege felt someone pinching her back hard.  All her classmates were stunned, and nobody tried to stop the police.  When the police officers took Little Gege back to her home, they complained to her mother that Little Gege had been uncooperative and refused to come home."
    },
    {
      "tag": "p",
      "text": "Ech. I don’t normally try and get everyone to link to this kind of stuff, but publicity has been known to help in cases like this."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 07:28 PM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "are you gathering news here?"
    },
    {
      "tag": "p",
      "text": "The Beijing cops have produced a guidebook for their members on how to talk to foreign journalists attending the Beijing Olympics, including a number of sample conversations in English: P(oliceman): Excuse me, sir. Stop, please. F(oreign journalist): Why? P: Are you gathering news here? F: Yes. P: About what? F: About Falun Gong. P: Show me your press card and your reporter's permit. F: Here you are. P: What news are you permitted to cover? F: The Olympic Games. P: Falun Gong has nothing to do with the Games.... You should only cover the Games. F: But I'm interested in Falun Gong. P: It's beyond the limit of your coverage and illegal. As a foreign reporter in China you should obey China law and do nothing against your status. F: Oh, I see. May I go now? P: No. Come with us. via ."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 05:30 PM | Permalink | Comments (1) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "the broken country theory of economics"
    },
    {
      "tag": "p",
      "text": "Via Jim Henley, the combat economy:"
    },
    {
      "tag": "blockquote",
      "text": "It may sound unreal, given the daily images of carnage and chaos. But for a certain plucky breed of businessmen, there's good money to be made in Iraq. Consider Iraqna, the leading mobile-phone company. For sure, its quarterly reports seldom make for dull reading. Despite employees kidnapped, cell-phone towers bombed, storefronts shot up and a huge security budget—up to four guards for each employee—the company posted revenues of $333 million in 2005. This year, it's on track to take in $520 million. The U.S. State Department reports that there are now 7.1 million mobile-phone subscribers in Iraq, up from just 1.4 million two years ago. Says Wael Ziada, an analyst in Cairo who tracks Iraqna: \"There will always be pockets of money and wealth, no matter how bad the situation gets.\""
    },
    {
      "tag": "p",
      "text": "Well, yes: people can afford IED triggers, and handy devices to warn the folks next door that the militia/cops/US army has rolled into the neighbourhood and it’s time to rally the locals. And how else will you hear about the ransom demand? The “rebuilding the stuff that’s been blown up” industry is also doing well, as is the demand for new premises for the people who’ve been ethnically cleansed. Thanks to the wisdom of its open borders policy imports are booming as well. Nothing to do with the fact that domestic production is somewhat hampered by endemic civil strife. There’s something very creepy about taking the transaction costs of civil war, separating them from their origins and presenting the result as good news. How about including the per diems of the folks who plant IED’s and the wages paid to militia members?"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 03:31 PM | Permalink | Comments (3) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 18, 2006"
    },
    {
      "tag": "h3",
      "text": "there's no I in menswear"
    },
    {
      "tag": "p",
      "text": "In it's own small way, this is perfect :"
    },
    {
      "tag": "blockquote",
      "text": "England's struggling rugby players are to appear in a World Cup warm-up match against France in August without their famous white shirts."
    },
    {
      "tag": "p",
      "text": "Instead, the team will sport a new \"away\" strip whose colour Twickenham is refusing to reveal. The move, which takes a leaf out of football's book, is part of a drive to lift struggling merchandise sales, depressed by the team's bad results. Here, in the year of our Dawk 2006, is exactly how any British institution responds to failure. Never mind. I bet those la-di-dah Frenchies are already running up the white flag at the thought of our world-beating mauve and taupe combination bearing down on them."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 10:08 AM | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 16, 2006"
    },
    {
      "tag": "h3",
      "text": "amid laughter and merriment"
    },
    {
      "tag": "p",
      "text": "It’s an internetty old world. Explananda Chris in New York finds an article in a Surrey paper about a pigeon cull. It attracts one of the best comment threads I’ve seen in ages:"
    },
    {
      "tag": "blockquote",
      "text": "I think the correct solution would be to hack the wings off as many pigeons as possible before joining them together to create one large wing. This could be wafted at the pigeons by any member of the townsfolk when numbers got too high. Children could also shelter under it at times of heavy rain or possibly loud thunder."
    },
    {
      "tag": "p",
      "text": "It gets better. In fact, it makes me want to sing… So if Sunday you're free, why don't you come with me, And we'll poison the pigeons in the park. And maybe we'll do in a squirrel or two, While we're poisoning pigeons in the park. We'll murder them all amid laughter and merriment, Except for the few we take home to experiment."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 05:58 PM | Permalink | Comments (2) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "all ifs, no busts"
    },
    {
      "tag": "p",
      "text": "In his examination of the recent unpleasantness re the Serious Fraud Office and Saudi Arabia, Martin Kettle finds much to criticize in the response of the public. Quelle fucking surprise."
    },
    {
      "tag": "blockquote",
      "text": "Everybody's ordinary life is littered with compromises, inconsistent behaviour and morally questionable decisions. It's far easier to say what you are against than what you are for. Yet we beat up on politicians as though expecting them to inhabit a different moral universe. It's a pathetic and very British habit. It is worth stopping to ask why we are so unrealistic and so wrong. The real wonder is that politicians manage to remain as honest and sensible as most of them do. It all says at least as much about us as it does about them."
    },
    {
      "tag": "div",
      "text": "No, you crawling twat; we beat them up because we expect them to inhabit the same moral universe as the rest of us; the one where allegations of fraud are not excused on the grounds of political inconvenience. Or “no ifs, no buts” is just for the little people, right? That and the other 3000 ways in which the government have thought it appropriate to improve our collective behaviour by means of legislation."
    },
    {
      "tag": "p",
      "text": "What makes Kettle’s pusillanimity even more galling is that any charges would likely have been brought under legislation that the government introduced itself in 2002. They’re not just given a pass on obeying rules against fraud everyone else is subject to, they’re not liable to full investigation under laws they make themselves."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 05:15 PM | Permalink | Comments (1) | TrackBack (0)"
    },
    {
      "tag": "h2",
      "text": "December 15, 2006"
    },
    {
      "tag": "h3",
      "text": "think of danger"
    },
    {
      "tag": "p",
      "text": "Remember that poll on the BBC a year or so back which found that Marx was the top bloke philosopher of all time or some such? It’s found its way to China, and an instructional DVD for party cadres:"
    },
    {
      "tag": "blockquote",
      "text": "THE 70 million members of the Chinese Communist Party have all been watching a series of eight DVDs - not Yes, Minister, but Think of Danger While Living in Safety: The Lessons From the Collapse of the Soviet Union Communist Party…"
    },
    {
      "tag": "p",
      "text": "…The programs place most of the blame on Mikhail Gorbachev for \"the extinction of the party, which must mean the extinction of the country\" after 74 years in power. By extension, the same equation may thus be applied to China: the end of the party's rule - 57 years so far - will mean the fragmentation and collapse of the country. The party presentation says: \"Collaborating with nationalists, the so-called democrats within the party sped its split and that of the Soviet Union encouraged by concepts advocated by Gorbachev, including democratisation, openness and diversity of public opinion.\" The \"disastrous results\" of the ensuing \"shock therapy prescribed by the Americans\" included a 52 per cent collapse of economic output over a decade, 5000 per cent inflation, and average life expectancy cut by four years."
    },
    {
      "tag": "blockquote",
      "text": "The programs cite a survey by the BBC - whose website is barred in China - that made Karl Marx the leading thinker of the last millennium, followed by Albert Einstein. \"This shows that many people believe we still need Marx, as natural science needs Einstein's theories.\""
    },
    {
      "tag": "p",
      "text": "This was strictly not for consumption by the general public in China. It is, however, compulsory viewing for cadres, who have to turn in a report on what they’ve seen (this is fairly common as a means of enforcing party discipline in China, with the result that there’s quite a thriving market in faked reports). The Chinese public, meanwhile, has been getting an educational TV series of its own: The Rise of the Great Nations."
    },
    {
      "tag": "blockquote",
      "text": "Its stentorian narrator and epic soundtrack present the emergence of the nine countries, from Portugal in the 15th century to the United States in the 20th, and cites numerous achievements worthy of emulation: Spain had a risk-taking queen; Britain’s nimble navy secured vital commodities overseas; the United States regulated markets and fought for national unity."
    },
    {
      "tag": "p",
      "text": "The documentary also emphasizes historical themes that coincide with policies Chinese leaders promote at home. Social stability, industrial investment, peaceful foreign relations and national unity are presented as more vital than, say, military strength, political liberalization or the rule of law. In the 90 minutes devoted to examining the rise of the United States, Lincoln is accorded a prominent part for his efforts to “preserve national unity” during the Civil War. China has made reunification with Taiwan a top national priority. So it’s Marx for the bosses, Lincoln for the masses. The interesting thing is that the world’s last great leviathan state seems to be promoting a remarkably whiggish view of history: peace, trade, development and measured progress towards social, economic and political openness ballasted by the steady, sure, accretion of wealth and power. It could have been something by Braudel. Sun Bin argues here that this is basically the official line of the government, and the aim is partly to curb popular nationalism by picking and choosing bits and pieces from the Western and Japanese experience that make countries strong and sustainable. On the face of it this doesn’t make a good fit with the message the cadres are getting. But then it’s horses for courses really. The TV series is meant to promote acceptance by the public that they’re part of a kind of developmental matrix under the guidance of a wise, open and forward looking leadership, while the cadre DVD is meant to promote discipline within the party. It’s significant here that the Chinese government is relaxed enough about public opinion to permit a favourable discussion of the Glorious Revolution and the framing of the US constitution but nervous enough about the state of the Communist Party to insist on a Leninist model of discipline. It indicates a belief that the main threat to CPC rule comes from within the Party rather than from the public."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 05:41 PM | Permalink | Comments (3) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "interested parties"
    },
    {
      "tag": "p",
      "text": "Says the Attorney General:"
    },
    {
      "tag": "blockquote",
      "text": "\"It has been necessary to balance the need to maintain the rule of law against the wider public interest. No weight has been given to commercial interests or to the national economic interest."
    },
    {
      "tag": "p",
      "text": "And so ends the Serious Fraud Office’s attempt to investigate the al Yamamah deal. People seem inclined to lift an eyebrow at this, especially since the campaign against the investigation was based on apparent Saudi threats to pull out of the Eurofighter deal. But let’s take it seriously for a minute. What “threats to national security” were caused by the SFO being “on the brink of accessing key Swiss bank accounts”?"
    },
    {
      "tag": "blockquote",
      "text": "The prime minister and the foreign and defence secretaries have expressed the clear view that continuation of the investigation would cause serious damage to UK/Saudi security, intelligence and diplomatic cooperation, which is likely to have seriously negative consequences for the UK public interest in terms of both national security and our highest priority foreign policy objectives in the Middle East.\""
    },
    {
      "tag": "p",
      "text": "So, in this ruthless war of ideas against Islamic fundamentalism, we’re more dependent than ever on the goodwill of the Wahhabi state. This seems to tie in to Juan Cole’s contention of an emerging US/UK/Saudi/Israeli front in the Middle East. UPDATE: Ho ho via"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "Posted by jamie k at 10:58 AM | Permalink | Comments (1) | TrackBack (0)"
    },
    {
      "tag": "div",
      "text": "sidebar2"
    },
    {
      "tag": "h2",
      "text": "blobs"
    },
    {
      "tag": "div",
      "text": "Heard the Word of Blog? Start of StatCounter Code End of StatCounter Code WEBBOT bot=\"Script\" startspan PREVIEW=\"Site Meter\" Copyright (c)2005 Site Meter WEBBOT bot=\"Script\" Endspan Who Links Here"
    },
    {
      "tag": "h2",
      "text": "no2id"
    },
    {
      "tag": "div",
      "text": "The 1952 Committee NO2ID \">"
    },
    {
      "tag": "h2",
      "text": "Recent Posts"
    },
    {
      "tag": "div",
      "text": "memories of the left handed universal bereavement, an inspiring achievement a bum's christmas on getting a life war on Christmas: the Eastern Front government petition tomfoolery prezzies off the reaper awesome understanding unto a virgin the enemy"
    },
    {
      "tag": "h2",
      "text": "Recent Comments"
    },
    {
      "tag": "div",
      "text": "Tom Scudder on universal bereavement, an inspiring achievement k&y on the broken country theory of economics Chris Lightfoot on the enemy dan on the enemy Alex on the enemy Jimmy Doyle on noted animator's passing noted jamie on the enemy Alex on the enemy Phil on the enemy McGazz on noted animator's passing noted"
    },
    {
      "tag": "h2",
      "text": "Recently Updated Weblogs December 2006"
    },
    {
      "tag": "div",
      "text": "Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Add me to your TypePad People list Subscribe to this blog's feed"
    },
    {
      "tag": "h2",
      "text": "Archives"
    },
    {
      "tag": "div",
      "text": "December 2006 November 2006 October 2006 September 2006 August 2006 July 2006 June 2006 May 2006 April 2006 March 2006"
    },
    {
      "tag": "h2",
      "text": "my former home"
    },
    {
      "tag": "div",
      "text": "blood & treasure"
    }
  ]
}