{
  "url": "http://www.10ktruth.com/track/preclassic.htm",
  "file_number": "201",
  "content_hash": "1d1704415b03fa1e17d9385077e639d217e1ad60d023cd38460fb62996046779",
  "total_blocks": 125,
  "retained_blocks": 6,
  "ignored_blocks": 119,
  "blocks": [
    {
      "tag": "p",
      "text": "10ktruth Site Map Races April \r\n                Fools Butte to Butte Civil War Relay Coburg \r\n                5 Miler & Half Marathon Eugene All-Comers Jasper-Banff Relay Oregon Marathon Relay Rhody \r\n                Run Shamrock \r\n                Run Steens \r\n                Rim Run Truffle \r\n                Shuffle USATF Cross Country Rage Guest Rage Result Road Runner Speak Q & \r\n                A More Q & A Quotes Links Race Schedule Training Contacts Your Questions for 10ktruth Home"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    },
    {
      "tag": "p",
      "text": "Prefontaine \r\n              Classic"
    },
    {
      "tag": "div",
      "text": "Link \r\n                    to Race Center Calendar for Scheduled Events"
    },
    {
      "tag": "p",
      "text": "Coburg \r\n                      5 Miler and Half-Marathon Jasper-Banff \r\n                      Relay Steens \r\n                      Rim Run Eugene \r\n                      All-Comers Meets Oregon \r\n                      Marathon Relay Butte \r\n                      to Butte USATF \r\n                      Cross Country Championships Truffle \r\n                      Shuffle Run \r\n                      for the Shamrock April \r\n                      Fools Run Rhody \r\n                      Run Rage \r\n                          Event Report: 2001 Prefontaine Classic (Eugene) Historic Hayward Field, Looking at the \r\n                          South Bleachers Oh, \r\n                    track fanswas this ever one for the ages. Alan Webb Acknowledges the East Grandstand \r\n                          Crowd Eighteen \r\n                          year old Alan Webb, a senior at South Lakes High School \r\n                          from Reston, Virginia, ran a 3:53.43 mile to break Jim \r\n                          Ryan's 36 year old national high school record (3:55.3), \r\n                          once thought to be untouchable. How \r\n                          good of race was it? He basically stole the show from \r\n                          the best track athletes in the world. World record holder, \r\n                          Hichem El Guerrouj (pronounced \"Heeshum El Garoosh\") \r\n                          ran the first sub-3:50 mile ever on American soil, which \r\n                          amazingly, played second fiddle to the kid four spots \r\n                          behind him. El Guerrouj even downplayed his own acheivement. \r\n                          Instead, he joined the rest of the appreciative Hayward \r\n                          Field crowd celebrating the high-schooler's accomplishment, \r\n                          raising the young runner's arm and presenting him to \r\n                          the south bleacher fans. In this reporter's opinion, \r\n                          it was one of the most selfless and class gestures I \r\n                          have ever seen in any competitive sport. El Guerrouj \r\n                          said the young runner could very well become his chief \r\n                          rival. Wow. Webb \r\n                    came to the Pre Classic under what otherwise would have been \r\n                    smothering expectations for anyone his age, coming off of \r\n                    a sub-4:00 indoor mileanother national high school record. \r\n                    He smiled his way right through all of the pressure. When \r\n                    asked by El Guerrouj if he wanted to run 3:55 in a hotel lobby \r\n                    meeting a few days before, \"Hell, yeah!\" was his response. Before \r\n                    the race, he looked relaxed and loose as he warmed up, seeming \r\n                    to savor the atmosphere in the House That Pre Built. I yelled \r\n                    to him \"Go, Alan!\" from my third row seat, and he looked over \r\n                    and gave me a smile and a nod. After the race, he shook every \r\n                    hand extended to him, looked everyone straight in the eye \r\n                    and flashed what will undoubtedly soon become a very famous \r\n                    smile on the world stage. For \r\n                    Pre Classic veterens, Race Director, Tom Jordan summed up \r\n                    the race perfectly: \"In terms of thrills for one race, this \r\n                    has to be the greatest in Pre Classic history.\" No one would \r\n                    have predicted that Jim Ryan's record would be broken; not \r\n                    his coach, not Alan Webb. Even \r\n                    the news media was not speculating on the possibility. After \r\n                    a torrid first lap, he was running last. Unlike one television \r\n                    commentator who suggested the possibility of a last place \r\n                    finish, the trained eyes of his coach and the knowledgeable \r\n                    Hayward Field crowd recognized the discipline in Webb's opening \r\n                    lap, resisting the temptation to go out with the leadersand \r\n                    the rabbits who went out way too fast. \"Smart kid,\" his coach \r\n                    and about 10,000 others were thinking at about that time. \r\n                    His split was at 58 seconds. Right where his coach wanted \r\n                    him. He reached the halfway point at 1:57 and looked in control, \r\n                    now having moved up a couple of spots. On the third lap, he \r\n                    continued to run smart, as El Guerrouj, looking like he was \r\n                    not even working, continued to widen his lead. Then, \r\n                    Webb went to work, while this reporter went to sleep (e.g. \r\n                    I confess I was focusing on the guy about to break 3:50 for \r\n                    the first time on American soil). From where I was, I couldn't \r\n                    see history in the making across the track as Webb started \r\n                    his surge. He began his 55 second last lap by immediately \r\n                    moving into lane two on turn seven and passing a couple of \r\n                    runners. On the back stretch, he passed a couple of other \r\n                    surprised runners and one even more surprised 10K Truth photographer, \r\n                    who was busy snapping shots of El Guerrouj. On the last turn, \r\n                    he continued to pick off runners, finishing in an amazing \r\n                    5th place, even wishing he'd held on to fourth. \"I can run \r\n                    with these people. I was passing as many people as I could. \r\n                    I didn't know who I was passing, I just wanted to try to catch \r\n                    as many as I could. Now, I want to beat some of these people.\" \r\n                    Remember that the person talking here is in high school? \"I \r\n                    ran pretty fast. Today was a very good day, and I'm glad to \r\n                    have done it on Hayward Field. This means everything to me. \r\n                    I did it on the track where Pre ran. He was my hero.\" No chest \r\n                    pounding. No strutting around the track high-fiving anyone \r\n                    in sight. In fact, on his way around the track, he had the \r\n                    presence of mind to maintain his respect for the other athletes, \r\n                    yielding to competitors in the pole vault and the start of \r\n                    the women's 200 meters. Is that any good, or what? \"He \r\n                    don't look like no high school dude,\" said Maurice Green. \r\n                    No kidding. While \r\n                    Alan Webb might have stolen the headlines, there was a lot \r\n                    more going on at the Pre Classic: • \r\n                    Suzy Favor Hamilton, pictured below, (US) won the 1,500 meters \r\n                    in 4:06.93 (the second fastest in the world this year), with \r\n                    the 32 year-old calling the win \"the toughest race of my \r\n                    career\" following her collapse in the final 200 meters at \r\n                    the Sydney Olympics. Photo by Jeanie Dunn. Mile World Record Holder, Hichem El \r\n                          Guerrouj of Morroco El Guerrouj on his way to the fastest \r\n                          mile ever on US soil (3:49.92) Favor Hamilton takes the lead with 300 \r\n                          meters to go. Hamilton (right) victory lap. • \r\n                    Maria Mutola (Mozambique) won the 800 meters in 1:58.90 (best \r\n                    in the world this year) for her 10th win in 11 Pre Classic \r\n                    races. Maria Mutola with 300 meters to go. • \r\n                    Marla Runyan (US) won the woman's 3,000 meter race in 8:44.69 \r\n                    (the second fastest outdoor time this year). Runyan pictured above. • \r\n                    Luke Kipkosgei (Kenya), winner of three of the last four Pre \r\n                    Classic races (and holds the Pre Classic record of 13:07.83) \r\n                    beat two of his countrymen and American record holder Bob \r\n                    Kennedy in the men's 5,000 meters. Kennedy, coming off a year \r\n                    of injury resulting from an automobile accident which knocked \r\n                    him out of Sydney, appears to be on his way back, finishing \r\n                    fourth in a time of 13:19.02. A Pre Classic crowd favorite, \r\n                    he gave the crowd a thrill as he took the lead with two laps \r\n                    to go, only to inevitably get out-sprinted by the Kenyan's \r\n                    with 300 meters to go. Kipkosgei won in 13:13.27. Luke Kipkosgei and his two countrymen prepare \r\n                    to make their move on Bob Kennedy (below). • \r\n                    Patrick Jarrett (Jamaica) got an undetected head start resulting \r\n                    in an unexpected win (9.89) over seven other fast dudes, including \r\n                    Maurice Green (US) in the men's 100 meters. Jarrett pictured \r\n                    left. • \r\n                    Patrick Mduwimana (Burundi) won the men's 800 meters with \r\n                    a time of 1:44.93.  Bernard Williams (US) won the men's 200 \r\n                    meters (20.18). • \r\n                    Terrance Trammell (US) won the men's 110 meter high hurdles \r\n                    with a wind aided time of 13.34. (Pictured right, Shawn Logan \r\n                    in blue shirt prepares to slap hands with Terrance Trammell). • \r\n                    Doloreen Ennis-Londo (Jamaica) won the woman's 100 meter hurdles, \r\n                    beating Gail Devers (US) in a time of 12.68 (second fastest \r\n                    in the world this year). • \r\n                    Stacy Dragila (US) won the women's pole vault (15' 1 \") establishing \r\n                    a new Hayward Field record (Stacy in flight, below). Stacy Dragila pausing to acknowledge \r\n                          the fans Doloreen Ennis-Londo, enjoying the \r\n                          Hayward Field hospitality Discus winner Virgilijus Alekna and \r\n                            high jump winner Amy Acuff (above right). • \r\n                            Marion Jones (US, pictured left) won the women's 200 \r\n                            meters in a wind-aided time of 22.26. • Amy Acuff (US) won the women's high jump (6'6\") \r\n                            and established a new Hayward Field record. • \r\n                            Virgilijus Alekna (Lithuania) won the discus with \r\n                            a toss of 220' 5\". Finally, \r\n                            what did not make the sports page was the results \r\n                            of the 200 meter \"joggle.\" (e.g. running while juggling). \r\n                            The winner finished in an impressive 26 seconds and \r\n                            some change, and none of the five competitors dropped \r\n                            any balls! But what did make the sports page of the \r\n                            May 28 issue of Eugene's local newspaper, The Register-Guard, \r\n                            which published the story of Jim Ryan's record being \r\n                            broken, also carried the results of the Rhody Run! \r\n                            Pick up an issue, and when you're done reading all \r\n                            about the above, flip back a few pages and check out \r\n                            T-Bone and The Rage, baby. The \"Jogglers\" Now it doesn't get any better than that. And \r\n                            that's The Truth. Return to Top Site \r\n              Map Races Rage Guest \r\n              Rage Results On The Road RunnerSpeak Schedule Training Recent \r\n              Q&A Q&A \r\n              Archive Sports \r\n              Columnists Sports \r\n              Quotes Links Welcome Home"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    }
  ]
}