{
  "url": "http://www.1335.com/unionjack.html",
  "content_hash": "f962816c11bd9fe4af04dc479ae5ac4a321ce6de8ba227e6f7bf2c6c97bd2950",
  "total_blocks": 76,
  "retained_blocks": 2,
  "ignored_blocks": 74,
  "blocks": [
    {
      "tag": "p",
      "text": "THE\n\nSYMBOLISM OF THE UNION JACK By A.J.\n\nFerris THE\n\nSYMBOLISM OF THE UNION JACK OR THE UNION OF JACOB How the Union Jack was formed. I N A.D.1194, Richard I of England\n\nintroduced the Cross of St. George as the Standard of England, and this remained the\n\nnational flag until the Union with Scotland. In 1603, King James VI of Scotland became\n\nJames I of England, as a result of which the first Union Jack was formed in 1606 by the\n\naddition of the Cross of St. Andrew which formed the background of the new flag. The name \"Union\n\nJack\" came from King James, whose name is \"Jacobus\" in Latin,\n\nand \"Jacob\" in Hebrew. Then in 1801, there was formed the more familiar\n\nUnion Jack by the addition of the Cross of St. Patrick, sandwiched in between the flags of Scotland and England. Thus the formation of the Union Jack came about as the result\n\nof the progressive merging of the inhabitants of the British Isles under one\n\nthrone, the throne of David. The completed Union Jack thus symbolises the RE-UNION OF\n\nJACOB. The three covenants are\n\nsymbolised by the three flags which together form the Union Jack. We have been studying how God\n\nmade three covenants with His people, the fulfilment of which in the Anglo-Saxon race\n\nproves that it is Israel. It is remarkable that if we take the three flags in the order in\n\nwhich they form the Union - Scotland, Ireland, and England - then the three flags\n\nsymbolise the three covenants in the order God made them with Israel. For the sake of\n\nillustrating this, a chart of the three covenants (Chart 2) is shown\n\nafter the flags (Chart 1) and in corresponding order. The first chart shows the\n\nselection of Abraham to be the father of the specially trained race who would teach the rest of humanity how to overcome disease and finally death. The mind of Abraham looked\n\nforward like a searchlight to the \" latter days,\" when the many\n\npromises made to him concerning his seed would be fulfilled. In the corresponding flag of\n\nSt. Andrew which forms the base of the Union Jack, the blue background indicates that the\n\npower behind the destiny of Abraham and his seed was a heavenly or spiritual one, and that\n\nthe chosen race would eventually become such a people. The white cross is the sign\n\nof multiplicity and symbolises Jacob's summing up of the Abrahamic promises as he passed\n\nthem on to Ephraim and Manasseh with his arms crossed, and his hands upon their heads. SCOTLAND-ST.\n\nANDREW THE\n\nABRAHAMIC COVENANT With his hands\n\ncrossed, Jacob passed on the blessings of national greatness to Manasseh and Ephraim. IRELAND-ST. PATRICK THE\n\nMOSAIC OR OLD COVENANT which was\n\nbroken by Israel; the blessings postponed 2,520 years, the need of a Saviour. ENGLAND-ST. GE0RGE THE\n\nNEW COVENANT OF REDEMPTION made it possible\n\nfor Israel to become rulers worthy of God. THE\n\nUNION OF JACOB ISRAEL\n\nRULING WITH GOD I have blotted\n\nout thy transgressions (broken covenant). CHART 2 The second chart shows the first stage in God's education of His servant race by the revelation of the\n\ndetails of His law and righteousness in all phases of life. God promised that if Israel\n\nkept the terms of the Mosaic Law Covenant, she would then be fit to bless the world as He\n\nhad promised her fathers. At that same time, He warned Israel that the BREAKING of the\n\nlaws in the Covenant would lead to the long period of scattering for \" seven times.\" We know that Israel did break the Law\n\nand sinned against God, thus showing their weakness and inability to rise to the high\n\nstandard set. They learnt the bitter lesson of their own sinful nature and of the\n\nimpossibility of becoming God's servant without supernatural aid. When the flag of St. Patrick was\n\nadded in 1801 to form the Union, it was broken in the middle in order to leave a white\n\nborder showing between the red cross and the blue background. The broken cross, of course,\n\nremarkably signified that Israel broke this agreement with God. It showed Israel as a\n\ndefective people, whose sin and transgressions were evidenced by their failure to keep\n\nGod's Law. It taught Israel the need of an outside Divine aid to mend their own broken\n\nlives - the need of a new creation. The Mosaic Covenant reminded Israel all the time of BROKENNESS , lack of perfection, and it developed in\n\nIsrael A NATIONAL CONSCIENCE\n\nOF RIGHT AND WRONG WHICH TO-DAY DISTINGUISHES ANGLO-SAXON PEOPLE FROM ALL OTHER NATIONS. The fact that the cross is RED typifies blood. God allowed certain transgressions of His Law to\n\nbe forgiven, provided that Israel sacrificed various animals in death. The animal thus\n\nsuffered death INSTEAD OF the Israelite. Yet those animal\n\nsacrifices went on from year to year and never overcame human depravity which caused\n\ndeath. But through the sacrifices, God gradually revealed His purpose that some day ONE SACRIFICE would be paid which would release Israel,\n\nnot only from temporary disease, but from death itself. The third stage on the chart\n\nshows the NEW COVENANT being put into operation. When Christ\n\nappeared at the commencement of his ministry, John the Baptist pointed to him, exclaiming, \" Behold,\n\nthe LAMB OF GOD, which taketh away the sin of the world.\" - (JOHN 1: 29.) Lambs had been used in the Old\n\nCovenant for many years as sacrifices to obtain healing and forgiveness. Now the Messiah,\n\nthough perfect, would himself suffer death as the one sacrificial lamb for Israel and the\n\nwhole world, that finally all might be forgiven and restored from death. Through breaking\n\nthe Mosaic law, the nation of Israel died, and their Law showed them why they died as\n\nindividuals. They were a people typified by a broken cross. Their only hope lay in the\n\nmercy of God bringing about a new creation. Then came the next stage in their spiritual\n\neducation, the grace of the New Covenant, but Israel had to learn first the need of a\n\nSaviour before they would accept him and be in a position to teach the other nations to\n\nway of life. The third flag of the Union Jack,\n\nthe Cross of St. George, is the very shape of the cross of Calvary, showing that it does\n\nrepre- sent the New Covenant of total forgiveness to Israel of all her transgressions. It\n\nis a red cross, signifying again a blood covenant. At the last supper, Christ passed\n\naround the cup of wine, saying, \"For\n\nthis is my blood of the NEW TESTAMENT (COVENANT), which is shed for many for the remission\n\nof sins.\" - (MATTHEW\n\n26:28) Christ thus intimated that his\n\nown blood would be shed as evidence that the price of death had been paid to redeem Israel\n\nand save the world ONCE AND FOR ALL. The way was then clear for God's servant to be\n\ncleansed and made perfect for ministry; and He extends the invitation to Israel to come\n\nback to Him \"I have blotted out\n\nas a thick cloud thy transgressions, and as a cloud, thy sins: return unto me; for 1 have\n\nredeemed thee.\" - (ISAIAH 44: 22) \" I, even I, am he that blotteth out thy transgressions for mine own sake, and will not remember thy\n\nsins.\" -\n\n(ISAIAH 43: 25) When the cross of England is\n\nplaced over the broken cross of Ireland to form the Union, the above scriptures are\n\ndramatically symbolised. The broken cross, which, we have seen, represents the broken\n\nMosaic Covenant, IS BLOTTED\n\nOUT . In the Union Jack, the\n\nbroken portion is still there, but covered up by the cross of England. This perfectly\n\nsymbolises the fact that the cross of Calvary covers and blots out the transgressions of\n\nIsrael. In spite of the fact that Israel disobeyed God, and broke His laws, resulting in\n\ndispersion, God has promised to \"remember their sin no more.\" How well the completed Union Jack\n\ndemonstrates that God has blotted out Israel's transgressions through the death of Christ. Thus the British peoples, who own\n\nthe Union Jack, are particularly the nations of the Covenants, or the \" Covenant\n\nPeople,\" now rapidly nearing the consummation of their spiritual education and\n\npreparation as God's servant nation. Soon Israel will be fully UNITED WITH GOD as His sons\n\nto bless all nations. When Jacob of old prevailed with God at Peniel , the Lord\n\nchanged his name to \"ISRAEL\" which means \"a\n\nprince or son of God.\" \"And he said unto him, What\n\nis thy name ? . . . Thy name shall be called no more Jacob, but ISRAEL , FOR AS A\n\nPRINCE HAST THOU POWER WITH GOD AND WITH MEN AND HAST PREVAILED.\" - (GENESIS\n\n32: 24-28) Parallel with the formation of\n\nthe Union Jack, more and more of Jacob's descendants have become experimentally sons of\n\nGod, truly God's ISRAEL . During the days of England under the\n\nCross of St. George, there commenced the abandonment of idolatry, and the start of the\n\nProtestant Reformation. In the days of the Union between England and Scotland, there came\n\nthe deeper spiritual awakening in the Wesleyan revivals. Then, under the completed Union\n\nJack, there commenced the world-wide ministry of the Anglo-Saxon Missionary and Bible\n\nSocieties. This was accompanied by a fuller Gospel including the truth of the second\n\nadvent of Christ, while to-day the Gospel of the Kingdom is being crowned by the\n\nAnglo-Israel awakening, and the outpouring of the Spirit. Parallel with this progressive\n\nreturn of Anglo-Saxon Israel to the God of their fathers, there has taken place the\n\npromised multiplication and expansion of the race over the earth to form the\n\nEphraim-British Commonwealth of Nations, and the Manasseh-American Great Republic. From\n\n1194 to 1606, the period of England under the single cross, the earth was almost\n\nunexplored. Toward the close of this period, the first attempts at colonisation were made\n\nin America. But most important of all, England defeated the Spanish Armada, which gave her\n\ndominion of the sea, the sure foundation of England's future greatness. In the next\n\nperiod, under the elementary Union Jack, 1606 to 1800, the British Empire was born by the\n\nconquest of India and Canada, and by the annexation of eastern Australia; while the United\n\nStates emerged by the Declaration of Independence. Then the third and final period under\n\nthe completed Union Jack, 1801 to 1941+ has witnessed the full development of the British\n\nCommonwealth of Nations and the great Republic of the United States of America. We now\n\nlook forward to the coming re-union of Britain and America, and to the unification of the\n\nwhole house of JACOB-ISRAEL\n\nUNITED WITH GOD , to bless all\n\nnations. Psalm 60: 4"
    },
    {
      "tag": "div",
      "text": "'Tis\n\n    thy flag and my flag, The\n\n    best of flags on earth. So\n\n    cherish it my children It's\n\n    yours by right of birth. Your\n\n    fathers fought, Your\n\n    fathers died, To\n\n    raise it to the skies And\n\n    we like them must never yield But\n\n    keep it flying high."
    }
  ]
}