{
  "url": "http://www.aappb.net/ma_the_defendant.html",
  "content_hash": "0207a848299d0d7c65bd0954ced69acaf5d8eb28fdc9ef93e565eae94fd9c413",
  "total_blocks": 150,
  "retained_blocks": 3,
  "ignored_blocks": 147,
  "blocks": [
    {
      "tag": "div",
      "text": "fwtable fwsrc=\"aapp4.png\" fwbase=\"aappmain.gif\" fwstyle=\"Dreamweaver\" fwdocid = \"742308039\" fwnested=\"0\""
    },
    {
      "tag": "p",
      "text": "Ten Years On The defendant as a deaf mute by Moe Aye The defendant as a deaf mute It was early morning, around 6.30 am, on 14 June 1991, when a warden \n\n              shouted to all the prisoners- \"Keep your cell clean and put \n\n              your prison dress on neat and tidy. Sit in the prison and keep silent.\" \n\n              We all understood that a VIP would visit the prison. Although we sat in our cells for nearly four hours, no one arrived \n\n              at the prison and we were all very hungry. We tried to ask a warder \n\n              when the VIP would arrive, but he knew nothing and said, \"I'm \n\n              also very hungry.\" It was nearly 12.00 when we heard a noisy whistle and the sound \n\n              of warders at the main gate. Many warders ran there shouting to \n\n              us, \"Sit in prison position and shut your mouths.\" We \n\n              knew that the VIP had arrived at the main gate. Fifteen minutes \n\n              later the VIP, escorted by many prison officers and warders, passed \n\n              through our cellblock. Ten minutes later, a number of warders shouted \n\n              to us that we could sit easy this meant the VIP had left the prison. \n\n              We didn't know why he had visited. We knew only that we had had \n\n              to sit in the prison position for long hours and felt happy because \n\n              we would have breakfast. While we were lying on our mats waiting for breakfast a warder \n\n              asked who Moe Aye was. He ordered me to get out of the cell. My \n\n              cellmates looked at me and I gave them a smile. We understood that \n\n              if someone was taken out of his cell at noon or night, it meant \n\n              a trial or re-interrogation. As soon as I stepped out a white hood \n\n              was pulled over my head. Then I had to follow him like a blind man. When I arrived in the main gate, someone asked about my background \n\n              for a few minutes. Then I was handcuffed and forced and get into \n\n              a car. I didn't know what kind of car and who was in there with \n\n              me. After driving for nearly five minutes the car stopped and realized \n\n              that I would be sent to the military court, as it was located in \n\n              front of the Central Prison, inside the same compound as the Central \n\n              Prison and my prison. Insein Special Jail. The hood was removed \n\n              from my head and I could see it was as I had thought - I was in \n\n              front of the notorious military court. One military intelligence \n\n              officer in plain clothes ordered me to get out of the car. Two policemen \n\n              lead me to a small room covered with wire mesh. I saw that there \n\n              were three other small rooms and a big hall nearby. I could see \n\n              the old, dirty wall of Insein Central prison from my room. At this stage I had been in prison for six months, after two months \n\n              at the MIS interrogation centre. It was not unusual for prisoners \n\n              to wait this long before they were tried. Some had to wait for years, \n\n              such as Min Ko Naing, the Chairman of the ABFSU, who was arrested \n\n              in 1989 in but not tried until 1992. During my six months in prison \n\n              before the trial, I was never even sure what I had been charged \n\n              with. Above the cell doors in formation about each prisoner was \n\n              posted by the authorities, stating the prisoner's name, number and \n\n              the section of the Act that the prisoner was charged under. However \n\n              the information about the charges was constantly changed for the \n\n              political prisoners. Sometimes I would leave to take my shower believing \n\n              that I was being charged under section 5(j) of the Emergency Provision \n\n              Act, but when I returned this had been changed to another Act. At \n\n              times these changes happened on a daily basis. For some prisoner \n\n              ever the nature of the allegations changed completely, so that one \n\n              day they would believe they were charged with stealing and the next \n\n              day this had changed to another charge, such as using drugs or even \n\n              just being homeless. I believe that the authorities had two objectives in mind by doing \n\n              this Firstly it was a psychological tactic to make the prisoners \n\n              confused. Secondly it was designed to make the warders lose respect \n\n              for the political prisoners, by suggesting they had committed criminal \n\n              acts. In Burmese culture it would be acceptable for the warders \n\n              to then treat the warders with much less respect. A few minutes after I had been taken to the room a plain-clothes \n\n              MIS officer, a police officer and two armed solders entered the \n\n              room and asked me about my background for a while. The MIS officer \n\n              said. \"Your will be sent to the military court soon. Please \n\n              keep in mind that you have no right to complain or make any reply \n\n              to the military court. If you do, your prison sentence will be doubled. \n\n              Now our commander, from MIS unit 7, has already decided to give \n\n              you five years imprisonment, but if you complain or reply with angry \n\n              words to the court, you will be sentenced to 10 years imprisonment.\" The police officer also said. \"You should keep quiet in the \n\n              court for the sake of your future.\" Then they lead me to the \n\n              court. After walking for two minutes, we arrived at a large room \n\n              and I saw that there were seven soldiers and five policemen, all \n\n              armed, standing near the doors in the hall. I was surprised that \n\n              there were so many people present just for my trial. There was a \n\n              low stage at the top of the hall, above which hung the Burmese flag, \n\n              and on either side of it large photographs of General Aung San and \n\n              the dictator Ne Win. There were many chairs, nearly 30 or 40, on \n\n              which some men in plain clothes were sitting. There were many ceiling \n\n              fans and the hall was silent except for the noise of the fans. Then I was forced to sit on the chair nearest the stage. A police \n\n              officer requested me to stand to pay respect while the members of \n\n              the military court were on the stage. Ten minutes later, three high-ranking \n\n              military officers emerged from a small room near the stage and stepped \n\n              onto the stage. At that time a police officer shouted for all to \n\n              stand and pay respect. After they time a police officer shouted \n\n              for all to be seated. He walked near the stage and passed some papers \n\n              to one of the members of the court. I knew that the court was made \n\n              up of three military officers - an army full colonel, a navy lieutenant \n\n              colonel and an air force lieutenant colonel. The officer form the \n\n              army was presiding, and read aloud, \"This is military court \n\n              number three and it will hear the trial of Moe Aye. The court will \n\n              be in session twice-to hear the case and to give judgment.\" \n\n              Then he looked at the police officer and gave a nod. The police officer stood and loudly read my case. I was accused \n\n              of many things, notably trying to assassinate the military leader \n\n              of the SLORC, trying to kidnap the families of high-ranking military \n\n              officers, trying to smuggle in arms from the borders and trying \n\n              to persuade young students to go to the jungle. I was also said \n\n              to have contacted many groups, most, of which I had never heard \n\n              of and didn't think even existed. The police officer concluded by \n\n              reading, \"Therefore I would like to respectfully request the \n\n              military court to give Moe Aye a heavy punishment for his anti-government \n\n              activities.\" I remember thinking that the crimes I was accused \n\n              of sounded serious enough to deserve the death penalty. After hearing \n\n              from the police officer, the presiding officer of the military court \n\n              said that they would think and decide on my punishment soon. Nobody \n\n              asked me whether any of the charges were true, or if I had anything \n\n              to say. No witnesses were called and no evidence was presented. \n\n              The court members returned to the room they had come from. I looked around the hall. Soldiers and policemen were standing alertly \n\n              and some police officers looked at the ceiling. Some MIS officers \n\n              sitting behind me looked outside. One army officer was walking near \n\n              the entrance. Then I looked at General Aung San and thought about \n\n              him. I wondered what he would say if he knew about this trial. A \n\n              few minutes later I saw a MIS officer in plain clothes entering \n\n              the room where the military court members had gone. Five minutes \n\n              later he came out again and came over to sit behind me. I realized \n\n              then that he was Captain Kyaw Zin Thet who had arrested me in November \n\n              1990. I understood at this point that the military court had adjourned \n\n              to wait for him, as he was the MIS officer in charge of my case. \n\n              Every aspect of the country is controlled by the MIS, including \n\n              the courts. Even though Kyaw Zin Thet was just a captain, it was \n\n              his role to direct the tribunal members, consisting of a full colonel \n\n              and two lieutenant colonels, what to convict me of and how many \n\n              years to sentence me to. No doubt that was what he had just done. \n\n              While I was trying to look back at him, a police officer shouted \n\n              for all to stand to pay respect to the court. The military court \n\n              members took their seats again. The army officer said slowly, \"After hearing these accusations, \n\n              the military court believes that Moe Aye has violated the laws and \n\n              it is clear that he tried to promote the anti-government movement. \n\n              After the 1988 anarchy, the milita4ry had to step in and was only \n\n              just able to save the country from falling into an abyss. Moe Aye \n\n              never thought well of the military and had a negative attitude towards \n\n              it. He tried to incite the people by claiming that the military \n\n              will never transfer power. He is trying to destroy the integrity \n\n              of the military and bring about further anarchy like that in 1988. \n\n              Therefore, according to the Emergency Provision Act, section 5(j), \n\n              the military court sentences him to seven years imprisonment with \n\n              hard labour,\" The court members stood and walked beck into \n\n              the room. I was really surprised about the trial, in which I had not been \n\n              asked anything. I had thought they would at least ask me whether \n\n              I was guilty or not guilty. When I tried to look at Kyaw Zin Thet, \n\n              he went out of the hall. Two police officers came over to me and \n\n              said, \"Thanks for your peaceful cooperation, allowing us to \n\n              finish the trial.\" I was surprised again and didn't reply. Finally I was sent back to Insein Special Jail gate in the car. \n\n              In the car as usual the hood was pulled over my handcuffs, which \n\n              I had worn throughout the trial, removed. When I arrived back in \n\n              my cell my cellmates jokingly asked me how many years I had contracted \n\n              with the junta to hire my room for. I replied \"It's a seven \n\n              year contract.\" I still remember that I had to have my breakfast \n\n              while my cellmates had their dinner on that day. About the Author M oe Aye was born in Mandalay in 1964 \n\n              and was a student at the Rangoon Institute of Technology throughout \n\n              the 1988 pro-democracy uprising. During the uprising he joined the \n\n              All Burma Federation of Student Union (ABFSU). He later joined the \n\n              youth wing of the National League for Democracy (NLD), becoming \n\n              in-charge of information in Botahtaung Township. On the morning \n\n              of August 9, 1988, the army shot at him while he was demonstrating \n\n              nears the Shwe Dagon Pagoda in Rangoon. He was arrested by Military Intelligence on November 7, 1990. Moe \n\n              Aye was charged under Section 5(j) of the 1050 Emergency Provision \n\n              Act and was sentenced to seven years imprisonment with hard labour. \n\n              At the time of his arrest, he was working for the ABFSU and was \n\n              also carrying out duties for the NLD youth. While in Insein Special Prison Moe Aye met Mr.James Leander Nichols \n\n              and learned how the honorary consul to four Scandinavian countries \n\n              was being questioned and beaten by November 22, 1996, and due to \n\n              the harsh condition in prison he had to seek intensive medical treatment. \n\n              Some six months later Moe Aye left for Thailand and is now living \n\n              there. He is a regular correspondent for Democratic Voice of Burma \n\n              (DVB), a radio station based in Oslo, and has articles regularly \n\n              published in The Nation, a daily newspaper in Thailand."
    },
    {
      "tag": "div",
      "text": "About \n      AAPP I Publications I Data I Photo Gallery I Contact AAPP"
    }
  ]
}