{
  "url": "http://www.abqtrib.com/albq/bu_local/article/0,2565,ALBQ_19838_3459266,00.html",
  "content_hash": "bfc504ef2e246718198a7fc025ef5cce660d902680a751d0ac5251152e8fa3a1",
  "total_blocks": 176,
  "retained_blocks": 19,
  "ignored_blocks": 157,
  "blocks": [
    {
      "tag": "div",
      "text": "Login | Contact Us | Site Map | Archives | Subscribe to the paper Homes | Cars | Jobs | Classifieds NEWS SPORTS WEATHER LIVING ENTERTAINMENT BUSINESS OPINIONS PHOTO WEBIFIED search abqtrib.com December 26th, 2006 3:29 p.m. State will get funds from Office of Homeland Security Popular heartburn drugs linked to hip fractures James Brown's partner, mother of his youngest son, locked out of couple's South Carolina home Stranded travelers are gone, but airport left holding their bags Democrats want to redistribute Big Oil money to conservation, renewables <h1>Events for December 2006</h1> December 2006 S M T W T F S 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Submit your Event | More local | election | national/world | columnists | more » Top News Cinema sabbatical High-tech place to play, work, live Egypt slams Iran over 'nuclear' words Albuquerque by the numbers: Playtime lobozone | college | pro | high school | more » Top Sports NFL: Jeff Garcia's Philly revival is a page out of Hollywood Male Athlete of the Year: Tiger Woods NCAA Football: Winning brings more fans, big money to universities BCS Championship: After losing several players to the NFL, Ohio State has reloaded editorial | commentary | columnists | more » Opinions Kent Paterson: Negative stats show Mexico is ripe for revolution Bonnie Erbe: Paid time off to baby baby is bad U.S. public policy Editorial: On New Year's Eve, the sun will shine Editorial: Christmas week brought us gifts after all local | columists | national/world | more » Business Ford auto workers pick sides - whether they stay or go, the future is uncertain Retailers hope for sales boost Amazon posts 'best ever' holiday season Vacationing in Europe means stretching those travel dollars food & dining | columnists | arts | more » Entertainment What's on tonight: Tuesday \"Night at the Museum\" top film of the weekend with $30.8M in ticket sales What's on tonight: Monday Title of final Harry Potter book revealed local | school city | home & garden | more » Living School City: Brande Bernat - La Cueva has taught me about myself School City: La Cueva bucks 'rich, white kids' stereotype, says students Thelma Domenici: This season - To regift or not to regift? Russell Williams: The Master's plan galleries | photo file | multimedia slide shows | more » Photos Viewfinder: While you wait Viewfinder: Biking for a good cause Seeing: True grit Viewfinder: Old Town regulars AP Breaking News Video Daily Comics"
    },
    {
      "tag": "h3",
      "text": "Stu MacAskie Trio open jazz jam"
    },
    {
      "tag": "p",
      "text": "When: Tuesdays from 8 p.m. to 11 p.m. Where: Scalo Northern Italian Grill, 3500 Central Ave. S.E., Albuquerque Cost: Free Age limit: 21+ Full event details » See all of today's events »"
    },
    {
      "tag": "h3",
      "text": "Podcasts"
    },
    {
      "tag": "p",
      "text": "Daily News Roundup"
    },
    {
      "tag": "div",
      "text": "<p><img src=\"http://web.abqtrib.com/static/images/icons/podcastbgltbl.gif\" align=\"absmiddle\" /> <strong>LoboZone:</strong> <a href=\"/podcasts/lobozone/2006/dec/22/basketball-beat/\">On the Basketball Beat</a></p> <p><img src=\"http://web.abqtrib.com/static/images/icons/podcastbgltbl.gif\" align=\"absmiddle\" /> <a href=\"/podcasts/go-do-it/2006/dec/21/go-do-it-dec-21-24/\">Go Do It! Dec. 21-24</a></p>"
    },
    {
      "tag": "h3",
      "text": "Slide Shows"
    },
    {
      "tag": "p",
      "text": "LoboZone: New Mexico Bowl Seeing: True Grit Full story »"
    },
    {
      "tag": "div",
      "text": "Do you think the idea for the New Mexico Bowl trophy to be a piece of pottery is a good one?"
    },
    {
      "tag": "p",
      "text": "Yes No See the results without voting » ."
    },
    {
      "tag": "div",
      "text": "Additional Features"
    },
    {
      "tag": "h6",
      "text": "ONLINE EXCLUSIVES"
    },
    {
      "tag": "div",
      "text": "Account Registration Manage Your Account Alerts All Today's News 2006 Polls Restaurant Guide Events Calendar The Boondocks RSS Feeds"
    },
    {
      "tag": "h6",
      "text": "PODCAST SHOWS"
    },
    {
      "tag": "div",
      "text": "Daily News Roundup LoboZone Trib Sports Track Go Do It! Elections 2006"
    },
    {
      "tag": "h6",
      "text": "LOBOZONE.COM"
    },
    {
      "tag": "div",
      "text": "Complete Lobo Coverage Alerts: Live game scores Podcasts Ask the coach"
    },
    {
      "tag": "h6",
      "text": "SITE TOOLS"
    },
    {
      "tag": "div",
      "text": "Make us your home page Subscriber services About The Tribune Contact us Archives Comparison Shop at Shopzilla! Sunglasses Gucci Sunglasses Oakley Sunglasses Prada Sunglasses Women's Jackets Columbia Jackets L.L. Bean Orvis Coats Men's Jackets Columbia Helly Hansen Marmot powered by Current conditions, 7-day forecast radar and satellite maps. Holiday Giveaway Roundhouse Report Food City ABQ AV Club Be all you can bee Trib Sports Extra Wolf Tracks Split Personality No harm, no Fowler High School Sports The Flip Side All of Today's News Events Calendar Restaurant Guide Podcasts Cell Phone and E-mail Alerts LoboZone.com © 2006 The Albuquerque Tribune Please read our Privacy Policy and User Agreement . Comparison Shop for Engagement Rings and Women's Clothing at Shopzilla &"
    }
  ]
}