{
  "url": "http://www.aidindia.org/publications/proceedings/india_1999/volun2.htm",
  "content_hash": "deb70acb8b87adcb0950eb2e469c9ce7c96dac1a034fda3a73781c84998619f9",
  "total_blocks": 29,
  "retained_blocks": 3,
  "ignored_blocks": 26,
  "blocks": [
    {
      "tag": "div",
      "text": "AID-India Conference 99, Chennai Previous Article Table of Contents Next Article Ask not what America can do for You, Ask\r\nwhat You can do for India Sudhakar\r\nAdivikolanu , Deeptha Thattai , Ravi\r\nRamachandran , Kiran Kumar Vissa Kiran: AID as you all know started in the US.  Shrinaath gave you a good\r\noverview.  For those of you who are AID-India volunteers or from the\r\nother groups and various NGOs, we want to give you an idea of who we are\r\nand how you can tap into the talents and resources available from us in\r\nthe US. Fist Sudhakar will talk about how we review proposals and work with\r\nprojects.  I will talk about volunteers in the US and what kind of\r\nwork we can accomplish.  Deeptha and Ravi will talk about a chapters\r\nactivities. Sudhakar: I just want to quickly go over the different aspects of projects\r\nthat we support.  We try to do projects where the most needy people\r\nwill benefit.  Our approach is holistic.  The projects concentrate\r\non health, education, environment, womens empowerment, human rights, vocational\r\ntraining, peoples movements, and rural development.  Though we take\r\nthese up separately, we also are guided by the AID Plan. We try to learn from things currently going on and also to initiate\r\nefforts ourselves.  These merged well in one significant project we\r\nhave in IIT Kanpur.  AID volunteers were directly involved with the\r\nstarting of a school in Lodhar village. We also work through already existing organisations, which we try to\r\nget to know when volunteers visit the groups.  Logical extension of\r\nall this for AID to be present in India, is for AID volunteers returning\r\nto live in India, working for AID either part time (evenings/weekends)\r\nor full time. Financial support to projects in India: Over the past 7 years we have worked with about 40 organizations in\r\n16 states across India.  We are still trying to reach some of the\r\npoorest states. In 1998 we supported 30 projects, involving expenditure of $65,000\r\nand substantial non-financial support also. How we get projects  mostly through word of mouth.  When volunteers\r\nvisit villages in India they come to know of a good organisation there\r\nand meet the people, keep in touch with them.  Or volunteers might\r\nhear of a group in the news, etc.  Also social workers working with\r\nmany NGOs help us get in touch with organisations. Review Process: all the review is done by volunteers.  We regularly\r\nmeet every week in something called Community Service Hour (CSH). \r\nIn Maryland we meet every Saturday morning for 2 hours.  Similarly\r\nother chapters may meet once a week or every other week. When we get a proposal, 2-3 people read it, visualise the project,\r\nthink about the effectiveness, and how much peoples participation is there. \r\nThey present it to the group, which generates questions to find out what\r\nis the best way we can support this project.  We dont only evaluate\r\nmonetarily.  It is not just to find out if they are honest but also\r\nto establish a relationship and find out how our talents and resources\r\ncan be used to be a part of this project.  We try to visit every project\r\nduring the review and also during the implementation. The CSH is a very broad meeting, many volunteer activities are part\r\nof this meeting.  In Maryland, we also have a projects committee. \r\nProjects Committee meeting concentrates only on projects. Of course it is a very difficult task to discern success of projects,\r\nwe are still learning what is the best way of assessing these things. \r\nWe try to have both short (1day) and long (at least 1 week) visits by our\r\nvolunteers to the projects.  They bring back photos, newspaper clippings\r\nand write about their visit  all of which we keep in our files for other\r\ninterested volunteers to look at. Another important aspect is non-monetary support.  Sometimes volunteers\r\nget directly involved.  One volunteer bought 25 videos on different\r\naspects of health from WHO.  We are requesting some NGOs and movements\r\nto review these videos and we are trying to get them translated into different\r\nlanguages, based on their review.  We also collect educational materials\r\nlike toys.  We definitely need a lot of ideas and procedures for doing\r\nthese more effectively.  Another form of non financial support is\r\nmaking cartoon books, writing articles in a simple form on scientific topics,\r\nletters to newspapers on issues peoples movements are working on. We have started creating web pages about social development work going\r\non in India (whether we are financially supporting the group or not). \r\nA lot of people dont know what are the different works going on in India,\r\nand how they can participate.  So suppose someone is browsing the\r\nweb they may find that yes, this is a group I want to work with. \r\nThere is tremendous potential for this. Since in the US there is access for so much information, we plan to\r\nget relevant information and tune it to the projects we are supporting\r\n translate it, illustrate it, make into flash cards or booklets, etc \r\nwhichever way it is useful for the projects.  We also have been getting\r\ninto providing software support. Not only web pages, we develop many tools for awareness.  Volunteers\r\ncreate posters and brochures, write articles for magazines.  We also\r\nshow videos and documentaries on development and other social issues. \r\nAll these help to get people involved in social development issues in one\r\nway or another.  We also plan to get more organised in terms of internships. Our volunteers have recommended books and videos to be purchased by\r\nthe local public or university libraries, so this makes the alternative\r\nanalysis and perspective available to more people, and presents a different\r\npicture of Indian society than what is generally available in the US, even\r\nfor Indians. We publish a newsletter every month on AID projects and chapter activities,\r\nthis also discusses development issues.  3000 people across US receive\r\nit by mail.  We also distribute in grocery stores where Indian people\r\ncome so that they cannot miss our newsletter.  We also want to get\r\nmore articles in the media, TV etc. Now Deeptha from Cincinnati chapter will tell you more.  Before\r\nI go I want to pass around our project proposal form on which I would like\r\nto get your feedback."
    },
    {
      "tag": "p",
      "text": "Deeptha: I would like to\r\ntalk about how a typical chapter in the US starts.  In this case the\r\nchapter is Cincinnati.  In 1997 Balaji Sampath came and talked to\r\na group of emotionally susceptible students and AID-Cincinnati was born. \r\nWe have an average attendance of about 10 people in each CSH.  We\r\nhave 1000 people on our mailing list in Cincinnati.  We have approved\r\ntwo projects and had two successful fundraisers. We had a booth at the Indian Community of Cincinnatis 50th year of\r\nIndian Independence Day function and sold 100 T shirts.  We hosted\r\na welcome party for the freshies (new students) in Cincinnati.  Our\r\nmajor successful function was a concert by Ustad Zakir Hussein, Fazal Qureshi,\r\nSivamani and Ustad Sultan Khan.  We also had an Indian film-music\r\nnight by a local amateur group called Alaap. What did we achieve?  Through our  involvement in a variety\r\nof activities, we were able to talk to community people, which I was not\r\nable to do before this.  We discovered the importance and advantages\r\nof teamwork.  Our presence was felt in Cincinnati, and more people\r\ncame to know about AID.  Ravi will now tell you about our projects. Ravi: Being in the US, doing some of these projects gives great satisfaction\r\nto all of us.  Well doing mistakes is the best experience, and this\r\nwas very evident in our first project, which was a failure due to coordination\r\ndifficulties.  So I will tell you about our second project. \r\nSEWA (Self Employed Womens Association) wanted to provide infrastructure\r\nfor craftswomen of Gujarat.  We funded about 5% of the venture. \r\nAIDs contribution is quite small but we are learning a lot by collaborating\r\nwith an NGO. The next is another small project we took up in Madras (Crompet) for\r\na group called Mukti.  We are providing low cost artificial limbs\r\nfor disabled persons. This Mukti project also came in Time magazine, advertising low\r\ncost artificial limbs. Cincinnati has taken up the task of developing a database of the government\r\nschemes, and making them available for other NGOs and other chapters. Jagriti is our newsletter, which AID Cincinnati uses to reach out to\r\nthe local community.  We have learned that people are always willing\r\nto help, we just have to knock on their doors.  Jagriti is the main\r\ninstrument for letting people know who we are and what we are doing in\r\nCincinnati.  Our circulation is 1000 and within a month of mailing\r\nour first issue we got $1000 in the mail.  We were just too excited\r\nabout that!  It is equal to having a fundraising concert, and directly\r\nconveys our message. We got a lot of help from AID-Maryland when we started and we would\r\nalso like to help other chapters who are starting. Kiran: My name is Kiran.  I have been a volunteer of AID for about 3.5\r\nyears.  I will talk mainly about volunteers in AID-US and what kind\r\nof backgrounds they are from, what kind of work we can accomplish using\r\nthese talents.  AID-Cincinnati is one of the chapters which started\r\nabout a year ago, we have other chapters in other parts of the US, and\r\nthe chapter in Maryland, of which I am a part, has been around for 7 years. \r\nIt was started by some of the people in this room. The flow of talent is always from village to town, from towns people\r\ngo to cities, and from cities, abroad.  So one of our ideas is to\r\nreverse the flow of this talent.  So how can we bring some of the\r\nresources and talents among those who are well placed to the Indian villages? We have a pretty diverse set of people.  For example Ramani is\r\nsitting here.  He worked in an office about 1 hour away from College\r\nPark, where AID was born.  In the US one priority for people is living\r\nclose to their work so that they dont have to commute.  But when\r\nit was clear that AID had the potential to grow, Ramani did the reverse. \r\nHe actually moved closer to College Park and commuted 1 hour to work every\r\nday.  Others who come to the CSH on Saturday mornings are likely to\r\nstay all day and help enter names into the database, attend functions,\r\netc.  The trend to reverse the flow germinates from such small but\r\ncommitted actions. The representative species of the AID volunteer is the graduate student. \r\nDifferent volunteers with different talents can find their niche and be\r\npart\r\nof AID activities. What can we in AID-US do to help in development activities in India? \r\nWhen I say what we can do, it is not a totally futuristic dream, but some\r\nof these we have done and are confident in developing further. First, inspiring people to return to India.  Many AID volunteers\r\nhave returned to India.  And many others are here not physically but\r\nin spirit, reading and thinking about all the issues and activities. \r\nAnd when they visit India this spirit will motivate them in different directions. \r\nWhen AID started it was completely unthinkable that a graduate student\r\nwould want to spend 5 days during his or her India trip in visiting villages. \r\nBut now we find that all volunteers have this on their agenda.  Today\r\nyou see that 30-40 people have come to be part of this conference. AID volunteers interact with the groups in India through letters,\r\nvisits, and project proposals.  We can help the various groups make\r\nconnections.  For example, when Ravi and Aravinda visited the villages\r\nof the Narmada Valley they found that they had to carry a diesel generator\r\nin order to power the slide projector.  We were able to find a group\r\nthat makes an inexpensive solar powered slide projector, and brought it\r\nhere with us.  We have just begun to collect educational materials\r\nand are still getting feedback on what is useful. We host activists and social workers who are visiting the US. \r\nA wide spectrum of people have found this useful.  We can help you\r\nform contacts with the Indian community in the US.  We have a direct\r\nreach to 3000 people and indirectly we reach many more. We can produce awareness and publicity materials for you.  We\r\nhave produced a monthly newsletter for 4 years now (it started as a quarterly\r\nin 1993 then became monthly in 1995).  Our daily e-mail AID News not\r\nonly publicizes our activities but can also be used to collect useful information. \r\nShripad of NBA had asked for statistics on dams in different countries. \r\nWe sent this on AID news, a number of people worked on it and we passed\r\nthe results on to Shripad. We would like to be able to provide support by writing letters on various\r\nissues.  Sometimes as an organisation and in many cases as individuals\r\nmany of are pursuing this direction of sending petitions for important\r\ncauses.  Several groups might find this useful. Ramanujam:  Enabling people like Ravi, Balaji and Aravinda to\r\ncome and work full time in India, providing organisational support and\r\ndeveloping new links through them I think this is one of the achievements\r\nof AID USA which I would like to highlight.  I think that in terms\r\nof fundraising you should look at this as worth a million dollar project. Question: how many volunteers are there? Kiran: People who participate for one-time events like\r\nconcerts may be up to 500, but regular volunteers who come every week would\r\nbe about 100. Prasanna: what is the ratio of funding to non funding\r\nsupport? Kiran: The non financial aspect has been growing in the past\r\n2 years.  In the past our non funding contribution might just be ideas\r\nthat we had.  Lately we have done more creative things like collecting\r\ninformation or educational materials, or Sandeep designing cartoons for\r\nthe health book.  Maybe we are up to 10% now. Prakash: What portion of your time and money goes into education? Ravi: Into educating ourselves? Prakash: I mean formal education. Kiran: In terms of money I would say 25-30% of our funds may\r\ngo into formal education.  This is the easier area to support, even\r\nin terms of collecting materials. Ramani: and in our projects we interact with the community as\r\na whole.  For example in the Lodhar school which appears to be a regular\r\neducation project a number of community issues are involved together."
    },
    {
      "tag": "div",
      "text": "Never let success hide its emptiness from you, achievement its nothingness,\r\ntoil its desolation... Your duty, your reward - your destiny -are here and now. Dag Hammarskjold"
    }
  ]
}