{
  "url": "http://www.angelfire.com/empire/qbrute/puzzles.htm",
  "content_hash": "30327c5468faf868a4bdfd1884297ae1b9b269f51c36401914fdde4004f30cf3",
  "total_blocks": 129,
  "retained_blocks": 5,
  "ignored_blocks": 124,
  "blocks": [
    {
      "tag": "div",
      "text": "S ILLY C OW. Sidney and his wife Flora were sitting in a \r\n            restaurant eating. Suddenly, Flora noticed a handbag on the floor. \r\n            Just as Sidney was slicing his fresh cabbage, on all fours, the cow \r\n            stole money. Why? S EQUENCE I N T HE S AND . As the pirates rowed Tainted Angel, their \r\n            ship, away from the Greek island where they had rested, left behind \r\n            in the sand was a message (shown below) that a shipmate had written \r\n            about their captain, Short John Sliver. What did it say? A LIEN M UTATIONS. Shown right are 12 mutation chambers labelled \r\n      A-L. Each of the four aliens on the left passes through the three chambers \r\n      directly to the right to finish as the alien on the right (e.g. the alien \r\n      to the left of A passes through A, B, C to finish as the one to the right \r\n      of C). Also, each of the three aliens at the top passes through the four \r\n      chambers directly below to finish as the alien at the bottom. Every chamber \r\n      performs a mutation and does so on one part of the body (e.g. makes head \r\n      square). What does each of the 12 chambers do? L OGICAL L IGHT-UP. As Miss Earwig \r\n      entered the interview room, her four inquisitors sat behind the oak table \r\n      watching her. Earwig mentally numbered them from 1-4 left to right and noted \r\n      the following facts. The pipe smoker sat immediately to the right of Mr \r\n      Blowtorch. Mr Crumpet did not smoke cigarettes. Neither Mr Crumpet nor Mr \r\n      Drivel were third. The cigarette smoket sat immediately to the left of Mr \r\n      Amoeba. Mr Crumpet was not the cigar smoker. The cigar smoker sat immediately \r\n      to the left of the cigarette smoker. The cigar smoker was neither second \r\n      nor third. Assuming no interrogator smoked two different items, can you \r\n      find the name and smoking habit for each position?"
    },
    {
      "tag": "p",
      "text": "W ORD P LAY . Seven \r\n        members of the Hollywood Theatre Company were being cast in a post-Chaucer \r\n        staging (4,6,2,7). The payment for playing the characters followed a ranking \r\n        system as follows. Hanks was playing a character ranked 3 places below \r\n        Cage's and 10 places above Foster's. Kidman's character was 3 positions \r\n        below Everett's and 11 places below Stone's. Olivier's character was 9 \r\n        places above Foster's and 5 places above Stone's. What was the play (5,2) \r\n        and who was Cage playing (4,6,2,7)?"
    },
    {
      "tag": "div",
      "text": "T HE S LUG A ND T HE S NAIL . A slug and a snail \r\n      decided to settle a long-standing argument as to who was the best sprinter. \r\n      So they planned a race between two stones set a distance D cm apart. \r\n      Said the slug to the snail \"Since I'm slimier than you, I intend to \r\n      start T seconds before you\". \"In that case,\" said \r\n      the snail, who was rather slow, \"I'm going to give you X cm \r\n      start\". It didn't matter. The slug, who could move at speed V cm/sec, was only half as fast as the snail. The result was a dead heat, t seconds after the slug set off. Now, D , t , T , V and X were all whole numbers from 1 to 10 inclusive, no two numbers \r\n      being the same. How long did it take the snail to reach the finish? F ISH F EAST . A shoal of fish (shown \r\n      right) were enjoying a swim when the fish at X decided to eat the five fish \r\n      A-E. This he did by moving only along the blue lines, visiting each position \r\n      once only and finally returning to X to swim with the shoal. Now C was eaten \r\n      some time before D who was not the last eaten, B was devoured some time \r\n      before A and the route that was taken did not cross over itself at O. Can \r\n      you draw the route that X took? C ONNECT F OUR . Which one of the following \r\n      words is the odd one out and why? aviary cagey detain devious opium A RMLESS A LIENS . On planet ?*!@, \r\n      the inhabitants are robots with various numbers of arms. The robots are \r\n      grouped into tribes according to the numbers of arms they have so that in \r\n      any tribe, no member has a different number of arms to the other members. \r\n      Each tribe follows the same fertility ritual before bed each night, a ritual \r\n      that also reveals the number of members in a tribe. In the ritual, each \r\n      arm of a male links with an arm of a female, no male-female pair of robots \r\n      linking more than once. The minimum number of robots required to link all \r\n      arms once only is the number belonging to that tribe. Now one night, the \r\n      Creaky tribe cornered half of the Rusty tribe and despite being outnumbered \r\n      two to one, unscrewed one arm from each, there being an equal number of \r\n      male and female victims. However, the Creaky tribe were extremely poor at \r\n      arithmetic and had failed to realise that they needed 24 times their actual \r\n      haul of spare arms in order that the number of links their members could \r\n      then make, each with the same number of extra arms, was half the maximum \r\n      number of links the Rusty tribe could then make. How many Creakies and Rusties \r\n      were there? T HE G REATEST H UMAN B EING . In a survey to find the greatest human being, the top four people and their \r\n      occupation were listed in Clock magazine. However, only one entry in each \r\n      column was correctly positioned. The following facts were true. (1) Albert \r\n      was two places above the bricklayer, (2) Darling was one place below Charles, \r\n      (3) Curious was two places below the welder. Can you find the 1st name, \r\n      surname and occupation for each position? 1st \r\n            Name Surname Occupation 1 Isaac Newtune Welder 2 Albert Eyeline Gardener 3 Marie Curious Cleaner 4 Charles Darling Bricklayer The following line of code must be on one line, it can not wrap // Book \r\n        News SOLUTIONS"
    },
    {
      "tag": "p",
      "text": "To \r\n        find the solutions page, the following puzzle must be solved. There is \r\n        a five-digit number having digits 1-9, no two digits being identical. \r\n        Two are prime numbers, two are square numbers, and one is neither. The \r\n        third digit is twice the fifth, the fourth is six greater than the second \r\n        and the last is three less than the first. This five-digit number forms \r\n        part of the URL for the solutions page. For example, if you think the \r\n        solution is 48291, type the following in the address bar and press \r\n        return : http://www.angelfire.com/empire/qbrute/48291.htm"
    },
    {
      "tag": "div",
      "text": "Challenging \r\n        Logic Puzzles by my hero Barry \r\n        R. Clarke is published by Sterling. Innovative and definitely challenging!"
    }
  ]
}