{
  "url": "http://bostonteachnet.org/chaffee/chaffee.htm",
  "file_number": "23",
  "content_hash": "508c617b94a74d815dc00d8f942754cb59096a6e50d847e669eaae8e9f6c84e3",
  "total_blocks": 186,
  "retained_blocks": 9,
  "ignored_blocks": 177,
  "blocks": [
    {
      "tag": "div",
      "text": "Successful Deaf Leaders"
    },
    {
      "tag": "p",
      "text": "Overview Students have the opportunity to learn \r\n        about, meet, and pay tribute to local Deaf Leaders who exemplify the belief \r\n        that deaf people can do anything except hear. Selecting leaders, they \r\n        conduct videotaped interviews, transcribe tapes from American Sign Language \r\n        to English, and use this information to write biographical sketches of \r\n        each leader. Creating a computer slide show that includes their own photography, \r\n        they add the information to a link on the school's web site. The entire \r\n        school community honors the successful Deaf Leaders at a formal presentation \r\n        where framed photos/biographical sketches are installed on the school's Wall of Fame ."
    },
    {
      "tag": "div",
      "text": "Classroom \r\n              Activities Community \r\n              Activities Career \r\n              Activities Brainstorm \r\n                  successful Deaf Leaders from various careers. E-mail project description & invite selected \r\n                  leaders to participate. Prepare \r\n                  for Interview . Translate \r\n                  interview videotapes from ASL to English. Use graphic organizer for bio sketches. Design computer slide presentation (or download , \r\n                  9.78 MB) . Enlarge \r\n                  leaders' photos & mount next to bio sketches. Decide \r\n                  on centrally located Wall of Fame site. Plan \r\n                  celebration honoring Successful Deaf Leaders. Schedule \r\n                  & conduct interviews at leaders' job sites. Videotape \r\n                  interviews & photograph leaders with 35mm & digital \r\n                  cameras. Design invitation for leaders & school \r\n                  communit. Present \r\n                  awards & present slide show to leaders at celebration. Install \r\n                  framed photos & bio sketches on Wall of Fame. Describe \r\n                  Wall of Fame in newspaper article & include it on school web \r\n                  site . Conduct \r\n                  Wall of Fame tours Read \r\n                  Living Legends series on successful deaf people's career choices \r\n                  & leadership qualities. Observe \r\n                  leaders' work sites & ask career-related questions. Feature \r\n                  leadership qualities in bulletin board display. Discuss \r\n                  leaders' careers as well as careers in photography, videography \r\n                  & technology. Use \r\n                  celebration planning sessions to highlight responsibilities \r\n                  of event organizers in the real world ."
    },
    {
      "tag": "p",
      "text": "L earning \r\n              Standards English Language Arts"
    },
    {
      "tag": "div",
      "text": "Connect \r\n            reading with own and others' experiences. Engage \r\n            in group discussions. Use \r\n            proper technologies to present information effectively. Word \r\n            process, desktop publish, and incorporate multimedia in published \r\n            reports. Make \r\n            effective presentations."
    },
    {
      "tag": "p",
      "text": "School to Career Competencies"
    },
    {
      "tag": "div",
      "text": "Develop \r\n            Communication & Literacy Skills. Organize \r\n            & Analyze Information. Interact \r\n            with Others. Use Technology. Complete \r\n            Entire Activities. Act Professionally. Take \r\n            Responsibility for Career & Life Choices."
    },
    {
      "tag": "p",
      "text": "Assessment Students \r\n        meet regularly to make and modify plans, discuss and review progress, \r\n        assign duties, and provide peer feedback. Student authors use Did \r\n        I? Sheets to check writing with peers with teacher evaluating final \r\n        drafts. Rubrics are used to evaluate computer \r\n        slide show. Software or Materials Used For bio sketches, photos, and computer slide shows: \r\n        Microsoft Word, PowerPoint, Excel, Photo Editor, digital camera, 35 mm \r\n        camera, mounting & framing supplies; for literature on Deaf Leaders: Living \r\n        Legends: Six Stories about Successful Deaf People by Darlene Toole, \r\n        1996: Butte Publications; Signs \r\n        in Success: Profiles of Deaf Americans by Ron Podmore, 1995: Butte \r\n        Publications; Great \r\n        Deaf Americans: The Second Edition by Matthew S. Moore and Robert \r\n        F. Panara, 1996: Deaf Life Press. Web Sites Visits \r\n        with Deaf Americans: The Eugene and Inez Petersen Collection ; Your \r\n        Gateway to the Deaf Community . Keywords Service \r\n        Learning, Deaf Students, Deaf Community, Hard of Hearing, Careers, Leadership, \r\n        Leaders, Role Models. Final Words This \r\n        project is wonderful for empowering students to select and highlight role \r\n        models representing their common deaf culture. Students take pride in \r\n        their work as they deal with organization, teamwork, and deadlines. Wall \r\n        of Fame can easily be adapted to highlight successful leaders of any culture. Teacher Tip Try \r\n        to conduct interviews at the leaders' work sites so students can explore \r\n        a variety of work settings and get answers to pertinent career questions. E-mail contact : Claudia Chaffee cchaffee@iname.com Teacher Bio Claudia Chaffee has been a teacher \r\n        at the Horace Mann School for the Deaf and Hard of Hearing since 1981. \r\n        She is currently Team Leader of the School's Technical and Transitional \r\n        Services Department, and is an active member of the Instructional Leadership \r\n        Team and Technology Committee. A Lead Teacher, she has served as Mentor, \r\n        Technology Curriculum Designer, and Career in Teaching Program Assistant. \r\n        In addition, she regularly presents workshops and teaches adult-level \r\n        courses on how to use and apply computer technology to enhance teaching \r\n        and learning. Subject Areas Instructional \r\n        Technology, English Language Arts Grade Levels 9 - 12 Students Special Education, Deaf"
    },
    {
      "tag": "div",
      "text": "Return To Index \r\n        Page"
    }
  ]
}