{
  "url": "http://www.appliedimprov.net/articles/parachute.htm",
  "file_number": "233",
  "content_hash": "600fb953024723502692e47a6a6be84ffc5016a414e7cf317421e45ed1ffa885",
  "total_blocks": 133,
  "retained_blocks": 7,
  "ignored_blocks": 126,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" InstanceBegin template=\"/Templates/Articles.dwt\" codeOutsideHTMLIsLocked=\"false\" DWLayoutTable We've opened a new website which is taking over from this one! Please click here to go to it. fwtable fwsrc=\"menu1.png\" fwbase=\"menu1.gif\" fwstyle=\"Dreamweaver\" fwdocid = \"742308039\" fwnested=\"0\" Articles Improvisation \n                  lab Workplace \n                  trends Hear Hear \n                  and Listen In Teamwork \n                  through team play"
    },
    {
      "tag": "p",
      "text": "Structure \n                    and freedom"
    },
    {
      "tag": "div",
      "text": "Why \n                  are you wearing that parachute? My \n                  Improv Odyssey I \n                  love us Ping \n                  Pong Improvise \n                  to Innovate E-Improvisation Creating \n                  a vision for the ImprovInBiz community Responding \n                  to reluctant participants Sobering \n                  statistics on stress Improv \n                  Culture Lev \n                  Vygotsky and the New Performative Psychology Mutualism \n                  begins at home InstanceBeginEditable name=\"EditRegion2\" InstanceEndEditable InstanceBeginEditable name=\"main\""
    },
    {
      "tag": "p",
      "text": "Why Are You Wearing That \n                    Parachute? By Robin McCulloch I remember the gesture very clearly. It was done with a care \n                    for detail that informed all the work we did as improvisational \n                    performers. It was like seeing one of those international \n                    symbols inside the red circle, “no smoking,” “no \n                    left turn” or “no dogs allowed.” I would \n                    be on stage in front of a couple of hundred people, improvising \n                    a scene I had pitched to one of my improv collaborators. Suddenly \n                    you see the fear in their eyes; the hand would go to the chest \n                    as if clasping something and then the distinct pull away from \n                    the chest followed by the smile, half mocking, half seeking \n                    forgiveness. Your improv partner had “hit the chutes”. \n                    The gesture was that of pulling the ripcord on a parachute \n                    and meant that they were bailing out. They sensed the scene \n                    was going down in flames and as it hadn’t been there \n                    idea in the first place, why stick around for the crash. Does this have a familiar ring? Have you felt the clarion \n                    call of the washroom sirens just as the meeting took a turn \n                    for the worse? Or watched a colleague bail out on you when \n                    things started to get tough? Maybe one of your kids broke \n                    a rule, needs to be “spoken to” so knowing your \n                    spouse is better at “that sort of thing” you head \n                    out to “clean” the garage. And we had no real excuse. We were supposed to be, arguably, \n                    some of the best professional improvisers in the world. We \n                    were on stage at the Toronto wing of The Second City, the \n                    Mecca of improvisational comedy. A stage that had been, or \n                    would be, graced by John Candy, Catherine O’Hara, and \n                    the rest of their SCTV comrades, Mike Myers, Gilda Radner \n                    and Dan Aykroyd…a very long list of accomplished improvisers \n                    and actors. Also, the concept of “hitting the chutes”, \n                    as we referred to it, was against the very principles of improvisation. \n                    Support, agreement, acceptance and saying “yes” \n                    to each new offer, these were the foundation of good improvisation. So why would such accomplished improvisational performers \n                    abandon each other to certain theatrical death? Maybe to understand \n                    the fear you need to be aware of exactly what was being attempted \n                    in the first place. There is a cyclical nature to the creative \n                    process that exists at The Second City so it’s always \n                    hard to know where to break into that cycle to start the explanation. \n                    But let’s assume that a show has already been created \n                    by you and your fellow cast members. Each night you would \n                    do that set show, two acts, ninety minutes total, on average, \n                    of memorized material. Then after taking a curtain call you \n                    would get suggestions from the audience in various categories: \n                    current events, occupations, pet peeves, etc. You would take \n                    the suggestions back stage while the audience, you hoped, \n                    would seek out that perfect mix of alcohol intoxication that \n                    makes the jokes seem funnier but doesn’t make the audience \n                    think they’re funnier than the people on stage. The Pitch Once you have the suggestions backstage, posted on the bulletin \n                    board, you would immediately start pitching ideas to each \n                    other based on a combination of suggestions or a single suggestion \n                    or, to be honest, on something you had thought of that afternoon \n                    while gazing at a waitress in a bar. You would have fifteen \n                    minutes to pitch a couple of ideas, get someone to buy into \n                    one or more of them, rope someone into the thankless roll \n                    doing the grunt work to introduce your brilliant concept, \n                    exchange some quick ideas about characters, grab a drink and \n                    smoke before the lights start coming back up for the post-show \n                    improv set. Sound like some work meetings you’ve been in lately? \n                    No time to solve too many problems while the folks that pay \n                    your salary wait to see what kind of brilliant concepts you \n                    discover. While some of the other performers are out on stage taking \n                    their chances you’re backstage, going over, in your \n                    head, how you imagine the scene playing out. Then your turn \n                    arrives. The lights come up to find you on stage and immediately \n                    things start to change from the course you had imagined. The \n                    performer you had enlisted to do the compulsory role of the \n                    hotel Doorman has decided that the scene really revolves around \n                    him. It is no longer a scene about two lovers sneaking into \n                    a hotel for an afternoon tryst, but one about a Doorman who \n                    secretly suffers from leprosy. Some initial shtick about a \n                    one-handed Doorman suddenly makes your original partner decide \n                    that the scene is no longer what they had agreed to and they \n                    are refusing to enter. It doesn’t take long for the \n                    Doorman to realize the leprosy joke is just that, a joke, \n                    and will not carry a scene very far. He uses his good hand \n                    to clasp the imaginary ripcord on his chest, hits the chute \n                    and exits, leaving you alone, looking at your watch as the \n                    lights fade to a smattering of confused applause. I’m betting you can see the parallels with trying \n                    to pitch your concept, which you thought your partner was \n                    fully behind, for the new project. Suddenly he has a second \n                    possibility that he has “just thought of” and \n                    the other members of the team have come down with laryngitis. The Post Mortem What went wrong is that a group of highly competitive individuals \n                    were attempting create something new in front of two hundred \n                    people who had just seen ninety minutes of one laugh after \n                    another. The audience didn’t know that the set show \n                    they had just laughed through had started out as first time \n                    improvisations in an improv set like the one they were now \n                    watching. That it had been worked, re-worked, re-written and \n                    rehearsed for months. No one told the audience that the performers \n                    were abandoning the principles that made them successful. \n                    How could they know that the very laughs that the performer \n                    got as they backed off stage, at the expense of the scene \n                    and fellow performers, were dooming the scene to failure? I am sure you have all witnessed a fellow colleague getting \n                    some laughs as they threw someone to the wolves to save their \n                    own hide. You watch all that work go down the drain because \n                    someone started feel the pressure and decided to hit the chute. So what is the difference, then, between success and failure \n                    in improvisation? Pretty much the same as it is in other aspects \n                    of work and life. You can usually trace it back to commitment. \n                    How much do you buy-in to the concept in the first place? \n                    How committed are you to the team? If saying “yes” \n                    is really just a subtly disguised “no” in the \n                    form of “okay I’ll go out there with you but I \n                    don’t think this is going to work”, then you can \n                    almost hear the ripcord being pulled as the lights come up. \n                    That gentle fluttering you hear is the room emptying even \n                    though the bodies may still be there. The Solution To improvise well, you commit yourself on two levels, first, \n                    to the principles of improvisation, acceptance, support, justification, \n                    saying “yes”, and second, to the specifics of \n                    the scene you are improvising. And your commitment can’t \n                    be dependent on things staying the same because change is \n                    inevitable. The audiences at The Second City are usually very forgiving \n                    because they understand that making it up on the spot is difficult \n                    but is also rewarding when it all comes together in a magical \n                    experience that seems too good to believe. But it is one thing \n                    to be in the audience when it doesn’t come together \n                    and quite another to be one of those poor souls on stage, \n                    descending into comedy hell. Nothing quite focuses the survival \n                    instincts like that first smell of failure; the first realization \n                    that, Martian surgeons discovering why we have an appendix, \n                    may only be funny to you. And once the not-funny veil starts \n                    to descend over a scene most uncommitted improvisers start \n                    to hear their mothers calling them home for dinner or if not \n                    for dinner at the very least, OFF STAGE! But when you see improvisation that is committed from the \n                    start, ideas that seemed doomed at birth suddenly take the \n                    most unexpected turns and become these amazing products of \n                    positive cooperation. The desperate search for the “Big \n                    Idea” seems unnecessary. “Big Ideas” go \n                    nowhere without support and commitment. “Bad ideas” \n                    can develop into great concepts with a supportive, committed \n                    process. The Second City was my office. Improvisation was the work \n                    I did there. And the one thing above all others that made \n                    the difference between failure and success was the level of \n                    commitment. Understanding the value of real commitment, to the team \n                    and to the concept, can improve a team’s success rate \n                    and innovative potential dramatically. Think about this the next time you join a new project or \n                    things seem to be going off the tracks or you realize your \n                    Doorman only has one hand. When you feel yourself reaching \n                    for that imaginary ripcord, ask yourself if you’re really \n                    committed or you’re just “hitting the chute”? \n                    Throw your parachute in the garbage because nothing is more \n                    exciting or rewarding than using your support and imagination \n                    to turn defeat into victory. And improvisation embodies \n                    the principles that allow you to create solutions in a parachute \n                    free workplace."
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable"
    },
    {
      "tag": "p",
      "text": "Home People Conference Improv \n        in the news Research Articles Books Links Events Contact \n        us"
    },
    {
      "tag": "div",
      "text": "InstanceEnd"
    }
  ]
}