{
  "url": "http://www.armscontrol.org/act/2003_12/Bunn.asp",
  "file_number": "238",
  "content_hash": "7fe23036d98280f9e1634489673a664ed4a893ceec73a98dc3a49a473097aa32",
  "total_blocks": 202,
  "retained_blocks": 5,
  "ignored_blocks": 197,
  "blocks": [
    {
      "tag": "div",
      "text": "MAIN CONTAINER TABLE begin TOP NAV begin Home About ACA Become A Member Subscribe To ACT Employment (6) Internships Contact Us TOP NAV end ACA LOGOS/IMAGES begin ACA LOGOS/IMAGES end MIDDLE begin SEARCH begin <input type=\"hidden\" name=\"index\" value=\"101347\"> http://www.picosearch.com/cgi-bin/ts.pl Search <FORM method=GET action=http://www.google.com/custom>\r\n\t\t\t<INPUT TYPE=text name=q size=31 maxlength=255 value=\"\">\r\n\t\t\t<INPUT type=submit name=sa VALUE=\"Google Search\">\r\n\t\t\t<INPUT type=hidden name=cof VALUE=\"S:http://www.armscontrol.org;AH:center;L:http://www.armscontrol.org/images/hd01.gif;AWFID:417b00634810283b;\">\r\n\t\t\t<input type=hidden name=domains value=\"armscontrol.org\"><br /><input type=radio name=sitesearch value=\"\"> %(domain)s <input type=radio name=sitesearch value=\"armscontrol.org\" checked> %(domain)s\r\n\t\t\t</form> SEARCH end SIDE NAV begin Arms Control Today Current Issue Archived Issues Subscribe Submissions & Letters Advertising Permission/Reprint Requests Subject Resources Country Resources Fact Sheets Treaties ACA Events Press Room Interviews Projects \r\n              & Reports BEGIN ACPRINT SECTION Arms Control in Print END ACPRINT SECTION Links SIDE NAV end JOIN LIST begin Register for Arms Control Association e-mail \r\n        updates JOIN LIST end CONTENT begin Arms Control Today December 2003 Printer Friendly"
    },
    {
      "tag": "h1",
      "text": "The Nuclear Nonproliferation Treaty: History \r\n              and Current Problems"
    },
    {
      "tag": "h3",
      "text": "George Bunn"
    },
    {
      "tag": "p",
      "text": "Fifty years ago this month, President Dwight D. Eisenhower gave \r\n              his “Atoms for Peace” address to the UN General Assembly. \r\n              He proposed to share nuclear materials and information for peaceful \r\n              purposes with other countries through a new international agency. \r\n              That speech led to negotiations which, several years later, created \r\n              the International Atomic Energy Agency (IAEA). The IAEA today has \r\n              the dual responsibility of helping countries that do not have nuclear \r\n              weapons to engage in peaceful nuclear programs while ensuring that \r\n              they do not make nuclear weapons. In the nuclear \r\n              Nonproliferation Treaty (NPT) of 1968, the IAEA gained authority \r\n              for policing the nuclear activities of member countries to ensure \r\n              that those without nuclear weapons did not acquire them. Today, the NPT is a worldwide treaty that bans all members except \r\n              the United Kingdom, China, France, Russia, and the United States \r\n              from having nuclear weapons and commits those five states to eventually \r\n              eliminating their atomic arsenals. The treaty provides the norm \r\n              and the foundation for an international regime to prevent the spread \r\n              of nuclear weapons around the world. The 187 states that subscribe \r\n              to the NPT include all significant states of concern with the exception \r\n              of India, Israel, Pakistan, and—arguably—North Korea. [ 1 ] According to Ambassador Robert T. Grey, a former U.S. arms control \r\n              negotiator, the NPT is “in many ways an agreement as important \r\n              as the UN Charter itself.” [ 2 ] Yet, many believe that the NPT regime is battered and in need of \r\n              strengthening. [ 3 ] The NPT has in fact suffered major blows. Since 1991, uranium enrichment, \r\n              plutonium separation, and other possibly weapons-related activities \r\n              that Iraq, North Korea, and Iran hid from IAEA inspectors have been \r\n              discovered. Iraq’s weapons program was found after the 1991 \r\n              Persian Gulf War thanks to UN Security Council orders demanding \r\n              more intrusive inspections than were then required by IAEA inspection \r\n              standards. North Korea’s weapons program later became known \r\n              through intelligence, IAEA inspections, and North Korea’s own \r\n              admissions. The IAEA’s discovery of Iran’s failure to \r\n              disclose experiments with plutonium separation and uranium enrichment \r\n              to inspectors has recently led to a standoff with Tehran. Historically, the IAEA has rarely demanded inspections beyond the \r\n              perimeter of reactors or related nuclear sites that had been declared \r\n              open for inspection by the countries where they were located. Further, \r\n              uranium enrichment and plutonium separation does not violate the \r\n              NPT if done for peaceful purposes under IAEA inspection. In fact, \r\n              a number of more developed countries (e.g., Japan) conduct such \r\n              activities. In the three countries where uranium enrichment or plutonium \r\n              separation was thought to have been conducted for weapons purposes—Iran, \r\n              Iraq, and North Korea—the activities had taken place largely \r\n              at locations not declared open for inspection to the IAEA. Moreover, that North Korea and Iran both obtained enrichment technology \r\n              from Pakistan suggests dangers to the NPT regime from nonparties \r\n              that are not bound by the treaty’s prohibition against assisting \r\n              non-nuclear-weapon states in acquiring nuclear weapons. The back-to-back \r\n              nuclear tests by New Delhi and Islamabad in 1998 illustrate the \r\n              dangers that an arms race in South Asia can have and suggest the \r\n              temptation that such tests could encourage current non-nuclear-weapon \r\n              parties to withdraw from the treaty in order to follow suit. At the same time, the United States has not complied with some of \r\n              its own NPT-created obligations. For example, in 1995 the United \r\n              States won the agreement of the non-nuclear-weapon NPT states-parties \r\n              to extend the NPT indefinitely by promising to negotiate a Comprehensive \r\n              Test Ban Treaty (CTBT) . The treaty was duly negotiated and signed \r\n              by President Bill Clinton in 1996, but the Senate failed to ratify \r\n              it in 1999. The Bush administration now opposes the CTBT, and the \r\n              Senate is unlikely to consider it again, at least before the next \r\n              election. That reflects a broader tendency by this Bush administration \r\n              to downgrade treaties and regimes and to upgrade unilateral efforts, \r\n              such as the pre-emptive use of force against Iraq, to enforce compliance \r\n              with nonproliferation. In addition, the Bush administration has undertaken efforts to create \r\n              new types of nuclear weapons that might well require new testing. [ 4 ] Thus, while pushing other countries to reject the acquisition of \r\n              nuclear weapons for their defense, the United States seems to be \r\n              relying ever more heavily on nuclear weapons for its own defense. \r\n              This double standard constitutes another threat to the NPT regime. These points are all relevant to the status of the NPT today and \r\n              will be explained in more detail below or in other articles in this \r\n              issue. Early Nonproliferation Efforts Eisenhower’s 1953 “Atoms for Peace” speech came after \r\n              the failure of earlier U.S. nonproliferation efforts. At the end \r\n              of World War II, when the United States had the only nuclear weapons \r\n              in the world, President Harry Truman proposed to destroy the U.S. \r\n              nuclear arsenal if other countries would agree not to acquire nuclear \r\n              weapons and would permit inspections to verify that agreement. The \r\n              “Baruch Plan” of the Truman administration would have \r\n              given an agency under the jurisdiction of the UN Security Council \r\n              a monopoly over research on how to make nuclear explosives and the \r\n              power, free of veto and backed up by military force if necessary, \r\n              to conduct inspections in other countries to make sure they were \r\n              not making nuclear weapons. The United States, however, would not \r\n              surrender its weapons to the agency until inspectors were on duty \r\n              in the Soviet Union and in other countries with nuclear potential. \r\n              The Soviet Union rejected this approach; it was already seeking \r\n              its own nuclear weapons. Skeptical about the Baruch Plan being debated \r\n              at the United Nations, the U.S. Congress enacted the 1946 Atomic \r\n              Energy Act with provisions designed to keep nuclear technology secret \r\n              from other countries. [ 5 ] By contrast, Eisenhower proposed providing assistance to other countries \r\n              in the peaceful uses of atomic energy. As a result of his proposal, \r\n              the U.S. Atomic Energy Act was amended to authorize nuclear assistance \r\n              to others, and the IAEA was created to provide both assistance and \r\n              inspectors for peaceful nuclear activities. The United States, followed \r\n              by the Soviet Union, France, and others, began providing research \r\n              reactors that used weapons-usable, highly enriched uranium (though \r\n              usually in lesser amounts than needed for a weapon) to non-nuclear-weapon \r\n              states around the world. These transfers and the training that accompanied \r\n              the reactors helped scientists in many countries learn about nuclear \r\n              fission and its potential uses. As these scientists moved up the nuclear learning curve, global \r\n              support increased for controlling the spread of the new technology \r\n              in order to prevent its use for weapons. Soon, debate about nonproliferation \r\n              in the UN General Assembly produced a 1961 consensus Irish resolution \r\n              saying that countries already having nuclear weapons would “undertake \r\n              to refrain from relinquishing control” of them to others and \r\n              would refrain “from transmitting information for their manufacture \r\n              to States not possessing” them. Countries without nuclear weapons \r\n              would agree not to receive or manufacture them. These ideas were \r\n              the basis for the NPT. [ 6 ] The United States submitted a simple draft treaty based on this \r\n              resolution to the Soviet Union when a new 18-nation Disarmament \r\n              Conference opened in Geneva in 1962. The Soviet response was to \r\n              insist on a treaty that would prohibit the arrangements that the \r\n              United States then had with NATO allies such as West Germany for \r\n              deployment, in their countries, of U.S. nuclear weapons under the \r\n              control of U.S. soldiers—weapons to be used to protect these \r\n              countries, if necessary, in the event of an attack on them by the \r\n              Soviet Union and its allies. The Soviet proposal and U.S. plans \r\n              for a “multilateral force” of naval vessels with nuclear \r\n              weapons—vessels manned by sailors from participating NATO countries \r\n              and under NATO command—became major obstacles to agreement. \r\n              By then, the multilateral force plan was strongly supported only \r\n              by West Germany. However, for the United States to agree that an \r\n              NPT should prohibit U.S. allies not having nuclear weapons from \r\n              joining in control of U.S. nuclear weapons in peacetime required \r\n              meetings with President Lyndon Johnson at Camp David, further negotiations \r\n              with Soviet representatives, recommendations to the president from \r\n              an important committee of distinguished advisers, lengthy discussions \r\n              with West Germany and other allies, a congressional resolution urging \r\n              negotiation of a nonproliferation treaty, and bureaucratic maneuvering \r\n              to gain Johnson’s approval for proposed treaty language. In the compromise, the United States gave up on the multilateral \r\n              force; the Soviets gave up on a prohibition against U.S. deployment \r\n              of nuclear weapons in West Germany (and other allied countries), \r\n              provided the weapons remained under sole control of U.S. personnel. \r\n              The non-nuclear-weapon states were asked to accept draft language \r\n              which prohibited them from having nuclear weapons and which called \r\n              for the IAEA to be permitted to carry out inspections to guarantee \r\n              that their nuclear programs were limited to peaceful uses. In addition, \r\n              the United Kingdom, the Soviet Union, and the United States agreed \r\n              to provide assistance to non-nuclear-weapon NPT members in their \r\n              pursuit of peaceful uses of nuclear energy and agreed to conduct \r\n              future negotiations to halt the nuclear arms race and reduce their \r\n              nuclear weapons with the goal of achieving nuclear disarmament. Negotiations then began for gaining acceptance of these provisions \r\n              by important non-nuclear-weapon governments and their parliaments \r\n              and for prescribing the inspections that would be conducted by the \r\n              IAEA pursuant to the NPT. India, which had participated actively \r\n              in the NPT negotiations as a country without nuclear weapons, refused \r\n              to join. It wanted to retain the option to produce its own nuclear \r\n              weapons as its then-adversary, China, already had. Pakistan, another \r\n              adversary of India, refused to join because India would not. Israel, \r\n              which the United States had tried to restrain from acquiring nuclear \r\n              weapons in separate negotiations during the 1960s, also refused \r\n              to join. China and France had not participated in the NPT negotiations \r\n              but had acquired nuclear weapons before its negotiation was completed. \r\n              The NPT draft permitted them to join the treaty with the same rights \r\n              and duties as the other nuclear-weapon states—the United Kingdom, \r\n              the Soviet Union, and the United States. They did so later. States began signing the treaty in 1968, and it went into force \r\n              in 1970. However, the negotiations at the IAEA among parties and \r\n              potential parties on the scope of inspections for non-nuclear-weapon \r\n              parties continued for several years. Many countries, including West \r\n              European allies of the United States, did not ratify the treaty \r\n              until these negotiations were completed to their satisfaction. [ 7 ] There were also further negotiations every five years at NPT review \r\n              conferences. These dealt with implementation of treaty provisions \r\n              such as those promising assistance to non-nuclear-weapon states \r\n              for peaceful uses and calling for reductions of nuclear weapons \r\n              and for nuclear disarmament. At an important conference in 1995, \r\n              the treaty was extended indefinitely from its initial 25-year term. [ 8 ] The 1995 decision and the review conference of 2000 focused particular \r\n              attention on the NPT-related promises of the nuclear-weapon states \r\n              to “cease the nuclear arms race” including stopping nuclear \r\n              testing, negotiating reductions of nuclear weapons, and eventually \r\n              achieving nuclear disarmament. [ 9 ] Current Problems Even as the legal regime was expanded by these agreements, the NPT \r\n              came under strain elsewhere. One of the most significant blows was \r\n              Iraq’s demonstrated ability to hide its nuclear-weapon-making \r\n              efforts from IAEA inspectors before the Gulf War. With inspection \r\n              authority from UN Security Council resolutions adopted after that \r\n              war—authority beyond what the 1970s negotiations on NPT verification \r\n              standards had given the IAEA—inspectors found previously hidden \r\n              Iraqi efforts to enrich uranium to make nuclear weapons and even \r\n              an attempt to use (for a weapon) highly enriched research-reactor \r\n              uranium provided for peaceful purposes by France and the Soviet \r\n              Union. [ 10 ] These findings produced a major effort to strengthen the IAEA’s \r\n              NPT inspection authority through an additional protocol. The IAEA \r\n              parties who negotiated the 1997 model for this protocol did not \r\n              agree, however, that the NPT required its parties to accept the \r\n              model, as had been the case with earlier IAEA safeguards standards. \r\n              It is now up to each NPT party to negotiate with the IAEA a revised \r\n              safeguards agreement pursuant to the model. [ 11 ] As of mid-2003, only 81 of 187 NPT states had negotiated new safeguards \r\n              agreements; only 37, or about 20 percent, had given final approval \r\n              to them through parliamentary or other ratification. [ 12 ] Even the United States has not yet adopted legislation to implement \r\n              its new safeguards agreement. Some non-nuclear-weapon states may \r\n              be holding back, asking why they should take on more nonproliferation \r\n              obligations when, as they perceive it, the United States rejects \r\n              an important one—the CTBT prohibition on nuclear testing—and \r\n              then proposes new types of nuclear weapons for itself. [ 13 ] After the experience with Iraq, IAEA inspectors sought new techniques \r\n              to deal with other problem states such as North Korea. Some evidence \r\n              was produced by IAEA inspectors in the 1990s using a new technique \r\n              called “environmental monitoring”—testing for small \r\n              traces of evidence of nuclear activities in the air, on walls or \r\n              vegetation in areas within or surrounding a nuclear site, or in \r\n              streams or rivers nearby. This is explicitly authorized in the 1997 \r\n              Mode Additional Protocol for use even at sites far from the reactors \r\n              that a country has declared open for inspection. [ 14 ] Results from using these and other techniques at declared sites \r\n              encouraged the IAEA to press North Korea for broader inspections \r\n              in the early 1990s, but Pyongyang refused. A stalemate between North \r\n              Korea and the IAEA eventually led to bilateral negotiations between \r\n              the United States and North Korea and the 1994 Agreed Framework \r\n              between the two countries which called for Pyongyang to dismantle \r\n              a reactor whose spent fuel rods had apparently been used by North \r\n              Korea to produce plutonium. Pyongyang was also asked to provide \r\n              information about its past activities. These steps were to be in \r\n              exchange for the construction of new, more proliferation-resistant \r\n              nuclear reactors from South Korea and Japan, as well as interim \r\n              supplies of heavy-fuel oil from the United States. [ 15 ] However, North Korea appears to have engaged in nuclear-weapon activities \r\n              at other sites after the 1994 agreement was inked. During 2002-2003, \r\n              North Korea and the United States each concluded that the 1994 agreement \r\n              was not to their liking, and North Korea announced its withdrawal \r\n              from the NPT. [ 16 ] Discovery of Iran’s failure to disclose experiments with plutonium \r\n              separation and uranium enrichment to IAEA inspectors has triggered \r\n              concern since last year. Using environmental monitoring and other \r\n              techniques at declared sites and undeclared sites that Iran permitted \r\n              them to check, the IAEA inspectors uncovered many suspicious items, \r\n              including tiny samples of enriched uranium, tubes apparently used \r\n              for enriching uranium in centrifuges, and stocks of unenriched uranium—none \r\n              of which Iran had reported to the IAEA. In negotiations with the \r\n              United Kingdom, France, and Germany, Iran agreed to sign an additional \r\n              protocol authorizing broader inspections in Iran and to put aside \r\n              its uranium-enrichment plans, at least for the time being. Though \r\n              the IAEA director-general’s report shows that Iran had not \r\n              disclosed to earlier inspectors its uranium-enrichment efforts or \r\n              an experiment in plutonium separation, he concluded that the IAEA \r\n              lacked direct proof that these efforts were for the purpose of making \r\n              weapons—to the consternation of officials in the United States. \r\n              The IAEA Board of Governors then adopted, with U.S. support, a decision \r\n              to order continued inspections in Iran for clandestine activities. [ 17 ] The uranium-enrichment and plutonium-separation efforts of Iraq, \r\n              North Korea, and Iran have produced renewed calls for the NPT not \r\n              to permit such efforts even if subject to IAEA inspection. The concern \r\n              is that, once a country gains access to this technology, it might \r\n              then withdraw from the NPT (as North Korea did) and use its stocks \r\n              of weapons-usable uranium or plutonium to make weapons. The Nuclear \r\n              Supplier’s Group (NSG) had earlier recommended that new uranium-enrichment \r\n              and plutonium-separation plants of non-nuclear-weapon states be \r\n              placed under multilateral ownership and control so that the co-owners \r\n              from the different countries could check on each other. [ 18 ] However, Japan; some western European non-nuclear-weapon countries; \r\n              and Argentina, Brazil, South Africa, and a few others, as well as \r\n              all the nuclear-weapon states, have or have experimented with enrichment \r\n              or reprocessing facilities. Should these all now be subject to a \r\n              rule requiring multilateral ownership and oversight? Would limiting \r\n              the requirement to non-nuclear-weapon countries be regarded as adding \r\n              further insult to the NPT’s existing discrimination in favor \r\n              of nuclear-weapon states? IAEA Director-General Mohamed ElBaradei \r\n              has recommended that all enrichment and reprocessing facilities \r\n              used for civilian purposes should be multilaterally owned and controlled \r\n              in the future, with each country involved being urged to check on \r\n              what its partner countries are doing to make sure that the enriched \r\n              uranium or separated plutonium is not used for weapons purposes. [ 19 ] The Bush administration has pressed hard on Iraq, Iran, and North \r\n              Korea to restrain them from acquiring nuclear weapons, but it has \r\n              done so sometimes in unilateral or domineering ways that seem inconsistent \r\n              with a multilateral regime like that of the NPT. The American-led, \r\n              counter-proliferation-justified, preventive-war invasion of Iraq \r\n              in 2003 that the United States waged without UN Security Council \r\n              authorization is a recent example. At the time, the invasion was \r\n              said to be necessary to prevent Iraq from again acquiring nuclear, \r\n              biological, or chemical weapons or long-range missiles. It took \r\n              place even though Security Council-authorized inspections, consistent \r\n              with the NPT, were going on in Iraq to look for these weapons. It \r\n              resulted in UN inspectors being withdrawn from Iraq for their own \r\n              safety. U.S inspectors have subsequently found little evidence of \r\n              ongoing biological, chemical, or nuclear weapons programs but the \r\n              decision reflected Bush’s tendency to downgrade treaties and \r\n              international efforts in favor of more proactive proliferation efforts.” [ 20 ] Likewise, the Senate failed to ratify the CTBT in 1999. The Bush \r\n              administration has not asked the Senate to reconsider that vote \r\n              and instead has said that the United States “will not become \r\n              a party” to that treaty. [ 21 ] At the same time, the administration seeks money from Congress for \r\n              new types of nuclear weapons—ones that may well need testing \r\n              before the United States would rely on them. However, in 1995, when \r\n              the United States negotiated an agreement with all the non-nuclear-weapon \r\n              states to extend the NPT beyond 1995, it agreed to negotiate a CTBT \r\n              by 1996 as part of the price it had to pay to gain agreement to \r\n              renew the NPT. [ 22 ] The CTBT was negotiated by 1996. Then, in the 2000 NPT review conference, \r\n              the Clinton administration agreed on “the importance and urgency” \r\n              of ratification of the CTBT “without delay” to “achieve \r\n              the early entry into force” of the treaty even though the Senate \r\n              then had no plans to vote again on the CTBT. [ 23 ] Is the CTBT such an essential element of the nonproliferation regime \r\n              that U.S. failure to join it could provide persuasive justification \r\n              for withdrawal from the NPT for those who choose to do so? [ 24 ] Other problems of this sort occurred with Article VI of the NPT, \r\n              agreed to in the original treaty negotiations in order to gain the \r\n              support for the treaty of non-nuclear-weapon states. In that provision, \r\n              the United States and the other recognized nuclear-weapon states \r\n              promised to negotiate nuclear-weapon reductions with the goal of \r\n              nuclear disarmament. Then, to gain the votes of these parties for \r\n              extension of the NPT in 1995, the United States agreed to pursue \r\n              “progressive efforts to reduce nuclear weapons globally, with \r\n              the ultimate goal of eliminating those weapons.” [ 25 ] At the 2000 NPT review conference, the Clinton administration made \r\n              similar commitments. It also promised to implement START II (negotiated \r\n              in the prior Bush administration) and to conclude “START III \r\n              [more reductions] as soon as possible while preserving and strengthening \r\n              the [Anti-Ballistic Missile (ABM)] \r\n              Treaty as the cornerstone of strategic stability.” [ 26 ] These promises were shredded when the present Bush administration \r\n              withdrew from the ABM Treaty. The withdrawal nullified START II \r\n              because the Russian Duma had conditioned its approval vote for START \r\n              II on a continuation of the ABM Treaty. The substitute for START \r\n              II negotiated with Russia by President George W. Bush, the Strategic \r\n              Offensive Reductions Treaty of 2002, required withdrawal of warheads \r\n              from many long-range missiles on each side to the end that, by 2012, \r\n              no more than 2,200 warheads would be deployed on either side. [ 27 ] The treaty, however, does not require the warheads to be destroyed, \r\n              calls for no inspections, has a more permissive withdrawal clause \r\n              than in START II, and contains no stated plan for a subsequent treaty \r\n              such as START III that would require further reductions. Does this \r\n              satisfy the NPT commitment to negotiate toward nuclear disarmament? \r\n              ElBaradei has suggested that the United States may be employing \r\n              a double standard by not actually cutting its own arsenal of nuclear \r\n              weapons (as distinct from its missiles) while attempting to restrain \r\n              other countries from acquiring nuclear weapons. [ 28 ] To gain the agreement of the non-nuclear-weapon NPT parties to the \r\n              treaty’s extension in 1995, the United States also made promises \r\n              in connection with a UN Security Council resolution calling for \r\n              what are called negative security assurances, which for the United \r\n              States was a promise not to use nuclear weapons against non-nuclear-weapon \r\n              NPT parties unless they attack the United States while in alliance \r\n              with another nuclear-weapon state. [ 29 ] Yet, in its Nuclear Posture Review of 2001 and its National Strategy \r\n              on Weapons of Mass Destruction of 2002, the Bush administration \r\n              made clear that it was prepared to use nuclear weapons against a \r\n              non-nuclear-weapon NPT party that threatened the use of chemical \r\n              or biological weapons against the United States or its allies whether \r\n              or not this NPT party was allied with a nuclear-weapon state. [ 30 ] Thus, the United States watered down another promise that was important \r\n              to gaining the support of non-nuclear-weapon NPT states-parties \r\n              for renewal of the NPT in 1995. Whether all these problems will \r\n              produce further withdrawals from the NPT is, of course, unknown, \r\n              but they might be used as excuses for withdrawal by any who want \r\n              to do so. What Has the NPT Accomplished? The NPT nonproliferation norm, the long-term efforts of the United \r\n              States and others to gain acceptance of it, and the international \r\n              inspections the NPT produced deserve significant credit for the \r\n              fact that the world does not now have 30 or more countries with \r\n              nuclear weapons. In 1963 the Department of Defense looked at the motivations of the \r\n              “nuclear-capable” countries at the time and estimated \r\n              for Kennedy that perhaps 10 more of them could have nuclear weapons \r\n              and suitable delivery vehicles in less than a decade if nothing \r\n              was done to prevent such a scenario from unfolding; they were the \r\n              remaining major industrialized Group of Seven allies of the United \r\n              States plus China, Czechoslovakia, India, Israel, Poland, and Sweden. [ 31 ] Thus, based on the 1963 list, 14 or more countries could have had \r\n              nuclear weapons by the early 1970s. The Defense Department’s list did not include Switzerland, \r\n              Australia, South Korea, or Taiwan, which all had scientists who \r\n              were then considering or would soon consider how to build nuclear \r\n              weapons. It did not include South Africa, which later built several \r\n              nuclear weapons, then gave them up and, like the others, joined \r\n              the NPT. It did not include any republics of the Soviet Union. Three \r\n              republics—Belarus, Kazakhstan, and Ukraine—had Soviet \r\n              weapons on their territory when the Soviet Union collapsed and gave \r\n              them up to join the NPT after negotiations with Russia and the United \r\n              States supplied them with financial incentives and promises not \r\n              to attack them with nuclear weapons. Without the NPT norm, these \r\n              countries would probably not have given their inherited weapons \r\n              up. The Pentagon list did not include Argentina and Brazil, which \r\n              later began nuclear weapons programs but then negotiated a bilateral \r\n              agreement not to acquire nuclear weapons and joined the NPT—turning \r\n              rivalry into cooperation in response to the norm of the NPT and \r\n              of a Latin American Nuclear-Weapon-Free Zone agreement. [ 32 ] North Korea, Pakistan, Iran, and Iraq began later and were not on \r\n              the Pentagon’s 1963 list either. [ 33 ] If there had been no NPT, if all these countries plus the ones on \r\n              the list acquired nuclear weapons, the total would have been at \r\n              least 28 by now. Some neighbors and rivals would then probably have \r\n              been motivated to acquire nuclear weapons themselves. What would \r\n              the total have become? More than 30 countries with nuclear weapons? \r\n              Today, we have nine counting North Korea but not Iran. The single most important factor in producing this success has been \r\n              the nonproliferation norm established by the NPT and the incentives \r\n              for remaining non-nuclear that the NPT helped initiate. The next \r\n              most important factor has probably been leadership, cooperative \r\n              efforts, and financial assistance in some cases from the United \r\n              States working with many other NPT parties. [ 34 ] Given the more difficult nonproliferation and security challenges \r\n              of today, it is vital that U.S. leadership be used to strengthen, \r\n              not to weaken or abandon, the nuclear nonproliferation regime. NOTES 1. Some believe that North Korea’s withdrawal was invalid and \r\n              count it still as a party to the treaty. 2. See Bipartisan Security Group, Status \r\n              of Nuclear Non-Proliferation Treaty, Interim Report (Global Security \r\n              Institute , June 2003), preface. 3. See Mohamed ElBaradei, “Towards a Safer \r\n              World,” The Economist (October 18, 2003), pp. 47-48; \r\n              Ariel Levite, “Never Say Never Again,” International \r\n              Security (Winter 2002-2003), p. 59; T. Ogilvie-White and John \r\n              Simpson, “The NPT and Its 2003 Prep Com Session: A Regime in \r\n              Need of Intensive Care,” The Nonproliferation Review (Spring 2003), p. 40; Stanley Foundation Conference, “Global \r\n              Disarmament Regimes: A Future or a Failure?” (2003), p. 2; \r\n              “Nuclear Breakout,” The New York Times (July 27, \r\n              2003), p. 12. 4. See Sidney Drell et al., “A Strategic \r\n              Choice: New Bunker Busters vs. Nonproliferation,” Arms Control \r\n              Today (March 2003), p. 3. 5. George Bunn, Arms Control by Committee: \r\n              Managing Negotiations with the Russians (Stanford University \r\n              Press, 1992), pp. 59-72. 6. Leonard Weiss, “Atoms for Peace,” Bulletin of the Atomic Scientists (November-December 2003), \r\n              pp. 34, 37, 41; Bunn, Arms Control by Committee, pp. 64-66. Arms \r\n              Control by Committee provides a more detailed account of the \r\n              history of the NPT’s negotiation. 7. Glenn T. Seaborg with Benjamin S. Loeb, Stemming the Tide: Arms Control in the Johnson Years (Lexington \r\n              Books, 1987), p. 305; Charles N. Van Doren, “Some Perspectives \r\n              on Supplier Control,” in The Nuclear Suppliers and Nonproliferation , \r\n              eds. Rodney Jones et al. (Lexington Books, 1985), p. 17. 8. “Decision: Extension of the Treaty \r\n              on Non-Proliferation of Nuclear Weapons,” May 1, 1995, NPT/CONF.1995/32/DEC.3. 9. Ibid .; “2000 Review Conference \r\n              of the Parties to the Treaty on the Non-Proliferation of Nuclear \r\n              Weapons, Final Document,” 2000 NPT/CONF.2000/28 (May 22, 2000). \r\n              See Bipartisan Security Group, Status of Nuclear Non-Proliferation \r\n              Treaty , pp. 2, 11-16. 10. See Joseph Cirincione, John Wolfsthal, \r\n              and Miriam Rajkumar, Deadly Arsenals : Tracking Weapons \r\n              of Mass Destruction (Carnegie Endowment for International Peace, \r\n              2002), pp. 271, 273-275; George Bunn and Chaim Braun, “Terrorism \r\n              Potential of Research Reactors Compared with Power Reactors,” American Behavioral Sciences (February 2003), pp. 714, 717-718. 11. See “Strengthening the Effectiveness \r\n              and Improving the Efficiency of the Safeguards System,” IAEA \r\n              GC(40)17 (August 23, 1996), Annex I. For a view that authority for \r\n              the requirements of the protocol could have been interpreted to \r\n              be obligatory rather than voluntary, see George Bunn, “Inspection \r\n              for Clandestine Nuclear Activities: Does the Nuclear Non-Proliferation \r\n              Treaty Provide Legal Authority for the IAEA’s Proposals for \r\n              Reform?” Nuclear Law Bulletin (OECD Nuclear Agency, \r\n              June 1996), p. 9. 12. See ElBaradei, “Towards a Safer World,” \r\n              pp. 47-48. 13. See Mohamed ElBaradei, “Nuclear Non-Proliferation: \r\n              Revising the Basics, The Assymmetry Remains,” speech at the \r\n              Carnegie International Non-Proliferation Conference, November 14, \r\n              2002; Mohamed ElBaradei, “Curbing Nuclear Proliferation,” Arms Control Today (November 2003), p. 3. 14. See Bunn, “Inspection for Clandestine \r\n              Nuclear Activities,” pp. 11-12. 15. See Cirincione, Wolstahl and Rajkumar, Deadly Arsenals , pp. 241-250; Michael May et al., Verifying \r\n              the Agreed Framework (Lawrence Livermore National Laboratory, UCRL-ID-142036, \r\n              2001), chap. 1. 16. See “Nuclear Weapons on the Korean \r\n              Peninsula,” Arms Control Today (May 2003), p. 3. 17. See Brenda Shaffer, “Iran at the \r\n              Nuclear Threshold,” Arms Control Today (November 2003), \r\n              p. 7. The text of the agreement of Iran with the foreign ministers \r\n              of the United Kingdom, France, and Germany appears at p. 25. For \r\n              a brief description of the confidential IAEA director-general’s \r\n              report on Iran’s nuclear program to the IAEA Board of Governors, \r\n              see William J. Broad, “Surprise Word on Nuclear Gains by North \r\n              Korea and Iran,” The New York Times, November 12, 2003, \r\n              p. A3. 18. See Carleton Thorne, ed., A Guide to \r\n              Nuclear Export Controls (2001), p. 101 (Nuclear Suppliers’ \r\n              Group Guidelines [Part 1], para. 7); ElBaradei, “Towards a \r\n              Safer World,” pp. 47-48; ElBaradei, “Curbing Nuclear Proliferation.” 19. ElBaradei, “Towards a Safer World.” 20. Jason D. Ellis, “The Best Defense: \r\n              Counterproliferation and U.S. National Security,” The Washington \r\n              Quarterly 26, no. 2 (Spring 2003), pp. 116-117. For the two \r\n              national strategy documents most pertinent to U.S. pre-emptive use \r\n              of force to achieve nonproliferation, see National Strategy of \r\n              the United States (September 17, 2002), sec. 5; White House, National Strategy to Combat Weapons of Mass Destruction (December \r\n              11, 2002), sec. V. 21. Sherwood McGinnis, remarks to the UN General \r\n              Assembly First Committee. 22. See “Principles and Objectives for \r\n              Nuclear Non-Proliferation and Disarmament,” NPT/CONF.1995/32/Dec.2 \r\n              (May 11, 1995), para. 4(a) (hereinafter “Principles and Objectives”). 23. “The 2000 NPT Review Conference, \r\n              Final Document,” NPT/CONF.2000/28, art. VI, para. 5 (hereinafter \r\n              “2000 NPT Final Document”). 24. In the voting on the UN General Assembly \r\n              First Committee’s 2003 resolution supporting the CTBT as important \r\n              to nonproliferation, the United States was the only country to oppose. \r\n              See The First Committee Monitor , October 27-31, 2003. 25. See “Principles and Objectives,” \r\n              para. 4(b). 26. See “2000 NPT Final Document,” \r\n              art. VI, para. 15, practical step 7. 27. See “Letter of Transmittal and Article-by-Article \r\n              Analysis of the Treaty on Strategic Offensive Reductions,” Arms Control Today (July/August 2002). 28. Stephan Pullinger, “U.S. Policy: \r\n              WMD, Good and Bad,” Disarmament Diplomacy (October-November \r\n              2003), p. 55. 29. George Bunn, “The Legal Status of \r\n              U.S. Negative Security Assurances to Non-Nuclear Weapon States,” The Nonproliferation Review (Spring-Summer 1997), p. 1. 30. See National Strategy to Combat Weapons \r\n              of Mass Destruction ; U.S. Department of Defense, Nuclear \r\n              Posture Review , (Global Security Institute, December 2002). 31. See Bunn, Arms Control by Committee , \r\n              p. 68. 32. See Mitchell Reiss, Bridled Ambition: \r\n              Why Countries Constrain Their Nuclear Capabilities (Woodrow \r\n              Wilson Center Press, 1995), chaps. 1-5; Lewis A. Dunn, Controlling \r\n              the Bomb: Nuclear Proliferation in the 1980s (Twentieth Century \r\n              Fund, 1982), pp. 13-14, 17, 100, 110-111; Thomas Jonter, Sweden \r\n              and the Bomb: The Swedish Plans to Acquire Nuclear Weapons, 1945-1972 (Swedish Nuclear Power Inspectorate, 2001), chaps. 4-5. 33. See David Albright and Kevin O’Neill, Solving the North Korean Nuclear Puzzle (Institute for Science \r\n              and International Security), chap. 1; Reiss, Bridled Ambition, chaps. \r\n              1, 5, and 6; Leonard Spector and Jacquiline R. Smith, “North \r\n              Korea: The Next Nuclear Nightmare?” Arms Control Today (March 1991), pp. 8-13. 34. See Levite, ”Never Say Never Again,” \r\n              pp. 75-85. George Bunn, the first general counsel for the \r\n              U.S. Arms Control and Disarmament Agency, helped negotiate the nuclear \r\n              Nonproliferation Treaty, and later became U.S. ambassador to the \r\n              Geneva Disarmament Conference. Top of page"
    },
    {
      "tag": "div",
      "text": "CONTENT end MIDDLE end MAIN CONTAINER end NOSEARCHSTART FOOT begin The Arms Control Association is a non-profit, membership-based organization. If you find our resources useful, please consider joining or making a contribution . Arms Control Today encourages reprint of its articles with permission of the Editor. © 1997-2006 Arms Control Association, 1150 Connecticut Avenue, NW, Suite 620 Washington, DC 20036 Tel: (202) 463-8270 | Fax: (202) 463-8273 FOOT end NOSEARCHEND"
    }
  ]
}