{
  "url": "http://www.army.mil/cmh-pg/books/pd-c-01.htm",
  "file_number": "240",
  "content_hash": "0ef2332ad4eae0c2f4be6a22b6f073257492d5b6f3098e5468c7b08288cc9330",
  "total_blocks": 104,
  "retained_blocks": 17,
  "ignored_blocks": 87,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\" created 08/05/96 6:45 PM by GT_HTML 6.0d for Microsoft Word MS Word environment: Windows"
    },
    {
      "tag": "p",
      "text": "Page xvi"
    },
    {
      "tag": "div",
      "text": "POLICY AND DIRECTION: THE FIRST YEAR"
    },
    {
      "tag": "p",
      "text": "Page xvii [blank] Page 1"
    },
    {
      "tag": "div",
      "text": "CHAPTER I Korea, Case History of a Pawn"
    },
    {
      "tag": "p",
      "text": "The Soviet-sponsored government of North Korea, having failed to conquer its\r\nsouthern neighbor by less violent means, invaded the Republic of Korea on 25\r\nJune 1950. When the United States, with other United Nations, came to the aid of\r\nthe South Koreans, a 3-year war resulted that cost more than 142,000 American\r\nbattle casualties. The campaigns set in motion by the invasion of South Korea later were\r\ncharacterized as a \"limited war.\" The fighting was deliberately\r\nconfined in geographic terms, political decisions placed restrictions upon\r\nmilitary strategy, and none of the belligerents, with the exception of the two\r\nKorean governments, used its full military potential. But there was nothing\r\nlimited about the ferocity of the battles. Erupting from the rivalries of great nations, the Korean War was greatly\r\ninfluenced by domestic conditions rooted deep in the history of Korea, and by\r\nthe topography of the peninsula where it took place."
    },
    {
      "tag": "div",
      "text": "The Land"
    },
    {
      "tag": "p",
      "text": "Korea is a harsh Asian peninsula inhabited by a hardy, harassed people who\r\nrarely if ever had been completely free. War and tragedy form the main theme of\r\nKorea's history. Suppression and ill-use have been the heritage of its\r\nlong-suffering people. Few habitable areas of the earth are more unsuited to\r\nlarge-scale, modern military operations. The rugged landscape, a lack of\r\nadequate roads, rail lines, and military harbors, the narrow peninsula, and, not\r\nleast, climatic extremes restrict and hamper maneuver, severely limit logistic\r\nsupport, and intensify the normal hardships of war. Jutting from the central Asian mainland, the Korean peninsula has an outline\r\nresembling Florida's. In the north, a river-mountain complex separates Korea\r\nfrom Manchuria and the maritime provinces of the USSR. Eastward, across the Sea\r\nof Japan, the Japanese islands flank the peninsula. To the west, the Yellow Sea\r\nstands between Korea and China. The Korean peninsula stretches south for more\r\nthan 500 miles, while east and west, it spans only 220 miles at its widest.\r\nThousands of islets, some scarcely more than large rocks, rim its 5,400-mile\r\ncoastline. Page 2 In area, Korea equals the combined states of Tennessee and Kentucky, covering\r\nabout 85,000 square miles. The facetious claim that Korea, ironed flat, would\r\ncover the whole world has an element of truth, for the terrain throughout the\r\npeninsula is mountainous. Roads and railways wind through tortuous valleys.\r\nIce-free ports exist on Korea's southern and western coasts, but the latter\r\nshore is distinguished by some of the most extreme tidal variations in the\r\nworld. On the eastern shore, there are only a few adequate harbors. Although\r\ngeographers place Korea in a temperate zone, the classification hardly mitigates\r\nthe harsh winters, particularly in the wind-swept northern mountains, or the\r\nsweltering, dusty, and no less harsh summers in the south."
    },
    {
      "tag": "div",
      "text": "Korea's Past"
    },
    {
      "tag": "p",
      "text": "The forces shaping Korea into a nation arose from its unfortunate proximity to\r\nthree powers, China, Japan, and Russia. The periodic surges of ambition in each\r\nof these neighbors turned Korea into a battleground and a spoil. Sometimes\r\ndescribed as a \"dagger pointed at the heart of Japan,\" Korea became\r\ninstead Japan's steppingstone to the Asian mainland. For China and, later,\r\nRussia, Korea was a back gate both to be locked against intruders and to be\r\nopened during any opportunity for expansion. Korea's ice-free ports fronting the\r\nSea of Japan were especially coveted by the Russians. Korea therefore has seldom\r\nbeen completely free of domination by one of its stronger neighbors. [1] China reached the Korean scene first, making its impact felt on northern Korea\r\nseveral centuries before the beginning of the Christian era. By the 7th century,\r\nA.D., the Chinese had forced their thought, customs, and manners into the Korean\r\nculture and had turned Korea into a virtual satellite. Late in that century, a\r\nnative dynasty, Chinese-controlled, unified the peninsula. Before then Japan had\r\noccasionally invaded southern Korea, but with little lasting effect. Badly\r\ndefeated by the Koreans in 663 A.D., Japan retired for nearly a thousand years. Like China, Korea endured the Mongol armies in the 13th century. For nearly a\r\nhundred years the savages from the steppes ruled and ravaged Korea. Kublai Khan\r\nlaunched two abortive invasions of Japan from Korea, ruthlessly squandering\r\nKorean lives and property in his depredations.   With the gradual dissipation of\r\nMongol power by the mid-14th century, Korea again basked in the reflected glory\r\nof a revitalized China. Adapting Chinese culture to their own talents, the\r\nKoreans [1] Unless otherwise cited, material on Korea's history is based on the\r\nfollowing: H. Frederick Nelson, Korea and the Old Orders in Eastern Asia (Baton Rouge: Louisiana State University Press, 1946); Yoshi Kuno, Japanese\r\nExpansion on the Asiatic Continent , 2 vols. (Berkeley: University of\r\nCalifornia Press, 1937), vol. I; Ernest W. Clement, A Short History of Japan (Tokyo: Christian Literature Society, 1926); Andrew Grajdanzev, Modern Korea (New York: The John Day Company, 1944); Cornelius Osgood, The Koreans and\r\nTheir Culture (New York: Ronald Press, 1951); Harold M, Vinacke, A\r\nHistory of the Far East in Modern Times (New York: Appleton-Century-Crofts,\r\n1941), pp. 123-24; A. Whitney Griswold, Far Eastern Policy of the United\r\nStates (New York: Harcourt, Brace, 1938); George M. McCune and John A.\r\nHarrison, Korean-American Relations , 3 vols. (Berkeley: University of\r\nCalifornia Press, 1951), vol. I; Tyler Dennett, Americans in Eastern Asia (New York: The Macmillan Company, 1922). Page 3 flourished. Skilled artisans, craftsmen, and inventors, as well as philosophers\r\nand scholars, brought Korea a level of civilization rivaling that of China. But\r\nthe Japanese violently disrupted this happy era. In a brutal expedition\r\nbeginning in 1592, Japanese samurai under the brilliant Hideyoshi pillaged the\r\npeninsula for seven years. Aided by China, the Koreans eventually expelled the\r\nJapanese, but their home had become a wasteland. Their best artisans and\r\nscholars, along with the greater part of their portable treasure, were taken\r\nhome by the Japanese. In the following centuries, Korea kept loose cultural and political ties with\r\nChina but withdrew from contact with the rest of the world. It never again\r\nreached the level of civilization the Japanese had destroyed. When Western\r\ninfluence spread to Asia in the 19th century, China's peculiar relationship with\r\nKorea baffled the West. Western efforts to trade with Korea were thwarted by\r\nthis misunderstanding. The Koreans received Western overtures coldly. They\r\nimpartially murdered French missionaries and American and Dutch seamen. Several\r\npunitive expeditions by these Western nations against Korea failed to improve\r\nrelations. Unfortunately for Korea's privacy, in 1860 Russia reached Korea's borders and\r\nlater in the century westernization again whetted Japan's appetite for\r\nterritorial expansion. With China, Japan, and Russia fighting for control of\r\nKorea throughout the rest of the 19th century, the Korean people had little\r\nchance to learn self-government. They remained separate from the modern world\r\nemerging around them. Japan won Korea by defeating China and Russia, in turn, in short but decisive\r\nwars. In the Sino-Japanese War of 1894-95 Japan used Western military techniques\r\nto beat its larger but tradition-bound enemy. Ten years later, Japan astounded\r\nthe world by defeating Russia. Having occupied Korea to fight Russia, Japan left\r\nits troops there. Ignoring Korean objections, Japan disbanded the Korean Army\r\nand abolished the Korean Department of Post and Communications. It allowed a\r\nsemblance of self-rule in Korea for several years, but remained the real master.\r\nJapanese seizure of governmental functions, the forced abdication of Korea's\r\nEmperor, and encroachment in all aspects of Korean society culminated in an\r\nagreement in July 1907 placing Korea completely under Japanese control. The\r\nannexation of Korea by Japan in August 1910 was simply a formality. [2]"
    },
    {
      "tag": "div",
      "text": "The United States and Korea"
    },
    {
      "tag": "p",
      "text": "In the quarter century before the Japanese take-over, the United States showed a\r\nmild interest in Korea and made some effort to support Korean independence, at\r\nleast in principle. In 1882, an American naval officer, Commodore Robert W.\r\nShufeldt, negotiated a commercial treaty with the Korean Emperor. The result of\r\nfour years' effort, this treaty was achieved through the reluctant good offices\r\nof the Chinese [2] An account of Korean life under the Japanese can be found in History of the\r\nOccupation of Korea, August 1945-May 1948, 3 vols. (hereafter cited as History\r\nof Occupation of Korea), prepared in 1948 by historians of the XXIV Corps, vol.\r\nI, ch. 2, copy in OCMH. Page 4 Government. It provided for exchange of diplomatic representatives, protection\r\nof navigation and of United States citizens, extraterritoriality, and trade\r\nunder a most-favored nation clause. The treaty could have given the United\r\nStates overriding influence in Korea. But when the Emperor sought an American\r\nforeign affairs adviser and Army military advisers, the United States moved\r\nslowly. The matter dragged on for several years. The American representative in\r\nKorea repeatedly appealed to Washington for action. Although requested in 1884,\r\nmilitary advisers reached Korea only in 1888. The United States treated Korea casually in the late 19th century. Its only\r\nsignificance lay in the effect it had upon relationships with other major powers\r\nin the Far East. According to one authority, \"The Korean Government was in\r\nthe position of an incompetent defective not yet committed to guardianship. The\r\nUnited States was her only disinterested friend-but had no intention of becoming\r\nher guardian.\" [3] When the Japanese took over Korea, the United States made no objection.\r\nPresident Theodore Roosevelt remarked, \"We cannot possibly interfere for\r\nthe Koreans against Japan. ... They could not strike one blow in their own\r\ndefense.\" On 29 July 1905, Secretary of War William H. Taft negotiated a\r\nsecret \"agreed memorandum\" with the Japanese Prime Minister. The\r\nUnited States approved Japan's \"suzerainty over\" Korea in return for\r\nits pledge not to interfere with American interests in the Philippine Islands.\r\nThe Korean Emperor's appeal to the United States for help under the \"good\r\noffices\" clauses of the Shufeldt Treaty fell on deaf ears. [4] Between 1905 and 1910, uprisings and rebellions erupted frequently throughout\r\nKorea. Japan crushed them with efficient savagery. The Koreans had few weapons,\r\nand Japan was a powerful and merciless nation. According to Japanese statistics,\r\n14,566 Korean \"rebels\" were killed between July 1907 and December\r\n1908. By 1910, when Japan formally annexed Korea, little open resistance\r\nremained in the land; and no Western nation spoke out against Japan's seizure of\r\nthe peninsula. Complete suppression marked the ensuing thirty-five years of Japanese rule. The\r\nJapanese exploited the people and the land. But they also modernized Korea,\r\nbuilding highways, railroads, dams, and factories. Much of this development was\r\ndesigned for military use. The port of Pusan, for example, was built for\r\nmilitary, rather than commercial, reasons; and the rail line running from Pusan\r\nnorth to the Manchurian border had much more military than commercial value. The Japanese integrated Korean industry into their own economy. Korea became\r\ncompletely dependent upon Japan for semi-manufactured commodities, for repair\r\nparts, and for markets. Many key Korean plants produced only parts used in the\r\nfinal assembly of products in Japan. As Japan embarked on its program of\r\nconquest in Asia in the 1930's, the Japanese turned Korean in [3] Dennett, Americans in Eastern Asia , p. 495. [4] (1) Griswold, Far Eastern Policy of the United States , p. 125.\r\n(2) Robert T. Oliver, Verdict in Korea (State College, Pa.: Bald Eagle\r\nPress, 1952), p. 37. Page 5 dustry almost exclusively to military use. The heavy, sustained use of machinery\r\nwithout adequate maintenance during World War II ruined Korean factories and\r\nequipment. The use of almost all chemical production, especially of nitrogen, in\r\nbehalf of Japan's war effort caused severe soil depletion in Korea. [5] Banning Koreans from responsible positions and from educational opportunities,\r\nthe Japanese controlled key governmental and economic functions. Comprising only\r\n3 percent of the population of Korea, the 750,000 Japanese residents were\r\nabsolute masters of the country. Nearly 80 percent of the Korean people could\r\nneither read nor write. [6] The Koreans deeply resented Japanese exploitation. Judged in Japanese courts\r\nunder Japanese laws, they received severe sentences for minor offenses, more\r\nsevere than those given Japanese for similar infractions. The\r\nJapanese-controlled Bank of Chosen charged Koreans interest rates 25 percent\r\nhigher than those assessed Japanese competitors. The Korean national debt\r\nincreased thirty-fold between 1910 and 1945, and the taxation of Koreans was\r\noppressive. In most industries, Japanese received twice as much as Koreans doing\r\nthe same work. Large numbers of farms were transferred from Korean to Japanese\r\nowners. [7] Despite iron-handed Japanese rule that sought to crush Korean national\r\naspirations, the flame of patriotism and independence remained alive in Korea.\r\nRevolutionary groups and movements sustained the Korean hope for freedom,\r\ndefying the Japanese whenever possible. One strong group working to free Korea\r\nfrom alien rule called itself the \"Provisional Government of the Republic\r\nof Great Korea.\" It originated on 1 March 1919 when a declaration of\r\nindependence, signed by Korean students, was read before a student gathering in\r\nSeoul. The Japanese ruthlessly hunted down the instigators of this declaration,\r\nand many patriots fled Korea to escape torture and death. On 10 April 19l9 some\r\nof these refugees met in Shanghai and established the Provisional Government.\r\nDr. Syngman Rhee headed the group as Premier. After the Manchurian incident in\r\n1931, the Provisional Government moved to Nanking and, later, to Chungking. This group sought to achieve complete independence for Korea and to establish\r\nitself as the Korean Government. Differences on how these goals should be\r\nreached brought frequent clashes in the leadership of the Korean Provisional\r\nGovernment. Two men, Rhee and Kim Koo, emerged at the top. When Kim Koo became\r\nPremier in the mid-1930's, Rhee served as unofficial representative of the\r\nProvisional Government in the United States. The group acquired a considerable\r\nfollowing among Koreans in the United States and China and attracted widespread\r\npassive support within Korea. Both Rhee and Kim were revered by the Korean\r\npeople. [8] A strong Korean Communist party also [5] Testimony of Hon. Paul G. Hoffman Administrator of the Economic Cooperation\r\nAdministration (ECA) before the House Committee on Foreign Affairs, 81st\r\nCongress, 1st Session, 8 June 1949, in House Report No. 962, Korean Aid ,\r\nH.R. 5330, June 1949, p. 9. [6] Ibid . [7] History of Occupation of Korea , vol. I, ch. 2. [8] Ibid ., pp. 46-48. Page 6 sprang up in Korea. Organized in 1925, it pushed the underground movement\r\nagainst Japan. Communist power in Korea grew under the well-organized leadership\r\nof the anti-Japanese underground. The Korean Communists were in contact with the\r\nRussian Communists through the Far Eastern Division of the Comintern. It is\r\nbelieved, however, that, owing to a secret agreement with Japan, the Russians\r\nabstained from encouraging too greatly the Communists in Korea during Japanese\r\noccupation. Many Communist Koreans took refuge in Manchuria, China, and Russia.\r\n[9] In this setting of turbulent and long-suppressed patriotic emotions, it was\r\ninevitable that the political void caused by the fall of the Japanese Empire at\r\nthe end of World War II should touch off a struggle for power."
    },
    {
      "tag": "div",
      "text": "Korea 1945"
    },
    {
      "tag": "p",
      "text": "When World War II began, Korea was regarded by the Allies as a victim of, not a party to, Japanese aggression. One of the earliest signs that the\r\nAllied Powers were concerned about Korea appeared in a Joint statement by the\r\nUnited States, China, and Great Britain in December 1943, after the Cairo\r\nConference, which said: \"The aforesaid three great powers, mindful of the\r\nenslavement of the people of Korea, are determined that in due course Korea\r\nshall become free and independent.\" [10] Divergencies between American and Russian policies appearing in the latter\r\nstages of World War II affected Korea. The destruction of the Axis in 1945 left [9] Ibid ., vol. II, ch. 2, pp. 7-20. [10] Department of State, Foreign Relations of the United States: The\r\nConferences at Cairo and Tehran, 1943 , Dept., of State Publication 7187\r\n(Washington, 1961), p. 448. Page 7 power vacuums in many areas of the world and brought the differences between the\r\nUnited States and the Soviet Union into sharp focus. Countries newly freed from\r\nGerman or Japanese domination assumed significance as possible targets of\r\nclashing American-Soviet interests. Unlike the Soviet Union, the United States attached little importance to Korea\r\nas a strategic area. Korea supported a relatively small population, and had\r\nneither important industrial facilities nor many natural resources. If at some\r\nfuture date Korea fell into hands unfriendly to the United States, the United\r\nStates recognized that the occupation of Japan might be hampered and American\r\nfreedom of movement might be restricted in the general area. But with China in\r\n1945 under control of a friendly government, such a situation appeared unlikely.\r\n  Russia, on the other hand, maintained its traditional regard for Korea as a\r\nstrategic area. As later events demonstrated, the Soviet Union would not\r\ncountenance control of Korea by another power and sought to control Korea\r\nitself. President Franklin D. Roosevelt and Premier Josef V. Stalin at the Yalta\r\nConference in 1945 touched upon Korea's future. Roosevelt advocated a\r\ntrusteeship for Korea administered by the United States, the Soviet Union, and\r\nChina. Looking at American experience in the Philippines, he surmised that such\r\na trusteeship might last for twenty or thirty years. Stalin said he believed\r\nthat Great Britain should also be a trustee. No actual mention of Korea was made\r\nin the document recording the agreements at Yalta. The secret protocol developed\r\nby Roosevelt and Stalin and agreed to by Prime Minister Winston S. Churchill\r\nonly provided territorial and other concessions to the USSR in the Far East as\r\nconditions for Russian entrance into the war against Japan after the defeat of\r\nGermany. Later, soon after Roosevelt's death, Stalin told Harry Hopkins,\r\nPresident Harry S. Truman's representative in Moscow, that Russia was committed\r\nto the policy of a 4-power trusteeship for Korea. [11] Though American military planners ostensibly paid little attention to Korea,\r\nthey had Korea in mind. On 25 July 1945, the Army Chief of Staff, General of the\r\nArmy George C. Marshall, sent a note to President Truman at Potsdam, advising\r\nhim that some guidance on handling Korea would assist the Joint Chiefs of Staff.\r\nGeneral of the Army Douglas MacArthur, Commander in Chief of the United States\r\nArmy Forces, Pacific, had already received instructions to prepare for occupying\r\nJapan, and shortly before Potsdam these orders were broadened to include Korea.\r\nIn response to the additional directive, General MacArthur suggested that Tokyo\r\nand Seoul have first priority for occupation, Pusan second priority, and the\r\nKunsan area on Korea's west coast, third priority. General Marshall then\r\ninformed the President that MacArthur should be able to land a division at Pusan\r\nwithin a short time of the end of the war. The other strategic areas in Korea,\r\nMar- [11] (1) Department of State, Foreign Relations of the United States: The\r\nConference at Malta and Yalta, 1945 , Dept. of State Publication 6199\r\n(Washington, 1955), pp. 770, 984. (2) Harry S. Truman, Memoirs , 2 vols.,\r\nvol. II, Years of Trial and Hope (New York: Doubleday and Co., Inc.,\r\n1956), PP 316-17. Page 8 shall added, were Seoul, near the west coast, and Ch'ongjin, in the north on the\r\nSea of Japan. Marshall expected that the Russians, if they participated in the\r\noccupation, would occupy Ch'ongjin and would undoubtedly move into Manchuria and\r\nperhaps into north China. He considered it desirable, therefore, to establish\r\nearly control over any areas to be held by the United States. [12] Korea was only briefly considered at the Potsdam conference. Among the questions\r\ndiscussed were the Soviet timetable for entering the war in the Pacific and the\r\nAllied proclamation demanding Japan's unconditional surrender. Looking ahead to\r\nthe surrender of the Japanese on the Asiatic mainland, the Allied military\r\nrepresentatives drew a tentative line across the map of Manchuria, above which\r\nthe Soviet Union was to accept surrender of Japanese forces. No mention was at\r\nfirst made of Korea. But since thousands of Japanese troops were stationed in\r\nKorea, there was a later discussion of Allied operations in that area. [13] At Potsdam, the chief of the Russian General Staff told General Marshall that\r\nRussia would attack Korea after declaring war on Japan. He asked whether the\r\nAmericans could operate against Korean shores in co-ordination with this\r\noffensive. General Marshall told him that the United States planned no\r\namphibious operation against Korea until Japan had been brought under control\r\nand Japanese strength in South Korea was destroyed. Although the Chiefs of Staff\r\ndeveloped ideas concerning the partition of Korea, Manchuria, and the Sea of\r\nJapan into U.S. and USSR zones, these had no connection with the later decisions\r\nthat partitioned Korea into northern and southern areas. [14] Russian entry into the war against Japan on 9 August, and signs of imminent\r\nJapanese collapse on 10 August 1945 changed U.S. Army planning from defeating\r\nJapan to accepting its surrender. Military planners in the War Department\r\nOperations Division began to outline surrender procedures in General Order No.\r\n1, which General MacArthur would transmit to the Japanese Government after its\r\nsurrender. The first paragraph of the order specified the nations and commands\r\nthat were to accept the surrender of Japanese forces throughout the Far East.\r\n[15] The Policy Section of the Strategy and Policy Group in the Operations Division\r\ndrafted the initial version of the order. [12] (1) Lt. Paul C. McGrath, U.S. Army in the Korean Conflict, n.d., pp. 26-27,\r\nOCMH draft MS. (2) Memo, Marshall for President (delivered at Potsdam), 25 Jul.\r\n45, file OPD 370.9, Case 17/8. [13] (1) Interv., 1st Lt. Paul C. McGrath with Vice Adm. M. B. Gardner, 28\r\nJan 53, the Pentagon. (2) Interv., McGrath with Lt. Gen. Charles P. Cabell, Dir.\r\nof the Joint Staff, JCS, OSD, 27 Jan 53. Both in OCMH. [14] (1) McGrath, U.S. Army in the Korean Conflict, pp. 24-25. (2) History\r\nof Occupation of Korea. vol. II, ch. 3, p. 6. (3) Roy E. Appleman, South to\r\nthe Naktong, North to the Yalu , UNITED STATES ARMY IN THE KOREAN WAR\r\n(Washington, 1961), pp. 2-3. (4) See also discussions of 24 and 26 July in\r\nDepartment of State, Foreign Relations of the United States: The Conference\r\nat Berlin (The Potsdam Conference), 1945 , 2 vols., Dept. of State\r\nPublications 7015, 7163 (Washington, 1960), II, 345-52, 408-15. (5) There was\r\nwidespread misconception that the division of Korea had been agreed upon at the\r\nhigh-level conference of the Big Three. In June 1946, the Institute of Pacific\r\nRelations published a categorical statement that this agreement had been made at\r\nYalta. The New York Times in October 1946 named Potsdam as the place where the\r\nagreement had been made. [15] McGrath, U.S. Army in the Korean Conflict, p. 42. Page 9 Under pressure to produce a paper as quickly as possible, members of the Policy\r\nSection began work late at night on 10 August. They discussed possible surrender\r\nzones, the allocation of American, British, Chinese, and Russian occupation\r\ntroops to accept the surrender in the zone most convenient to them, the means of\r\nactually taking the surrender of the widely scattered Japanese military forces,\r\nand the position of Russia in the Far East. They quickly decided to include both\r\nprovisions for splitting up the entire Far East for the surrender and\r\ndefinitions of the geographical limits of those zones. [16] The Chief of the Policy Section, Col. Charles H. Bonesteel, had thirty minutes\r\nin which to dictate Paragraph 1 to a secretary, for the Joint Staff Planners and\r\nthe State-War-Navy Coordinating Committee were impatiently awaiting the result\r\nof his work. Colonel Bonesteel thus somewhat hastily decided who would accept\r\nthe Japanese surrender. His thoughts, with very slight revision, were\r\nincorporated into the final directive. [17] Bonesteel's prime consideration was to establish a surrender line as far north\r\nas he thought the Soviets would accept. He knew that Russian troops could reach\r\nthe southern tip of Korea before American troops could arrive. He knew also that\r\nthe Russians were on the verge of moving into Korea, or were already there. The\r\nnearest American troops to Korea were on Okinawa, 600 miles away. His problem\r\ntherefore was to compose a surrender arrangement which, while acceptable to the\r\nRussians, would at the same time prevent them from seizing all of Korea. If they\r\nrefused to confine their advance to North Korea, the United States would be\r\nunable to stop them. At first Bonesteel had thought of surrender zones conforming to the provincial\r\nboundary lines. But the only map he had in his office was hardly adequate for\r\nthis sort of distinction. The 38th Parallel, he noted, cut Korea approximately\r\nthrough the middle. If this line was agreeable to President Truman and to\r\nGeneralissimo Stalin, it would place Seoul and a nearby prisoner of war camp in\r\nAmerican hands. It would also leave enough land to be apportioned to the Chinese\r\nand British if some sort of quadripartite administration became necessary. Thus\r\nhe decided to use the 38th Parallel as a hypothetical line dividing the zones\r\nwithin which Japanese forces in Korea would surrender to appointed American and\r\nRussian authorities. The determination of the surrender zones for the Pacific involved other\r\ncountries besides Korea. Since the job had to be done in a hurry, Colonel\r\nBonesteel had the paragraphs of the general order rushed through the Chief of\r\nthe Strategy and Policy Group, Brig. Gen. George A. Lincoln, to the Joint Staff\r\nPlanners who were meeting in an all-night session. This channel was the same as\r\nfor all important military policy papers in 1945. Drafts were routed in turn\r\nthrough General Lincoln, the Joint Planners, the State-War-Navy Coordinating\r\nCommittee, the Joint Chiefs of Staff, and the Secretaries of State, War, and\r\nNavy, until they finally reached the President. [16] (1) Ibid . (2) See also Truman, Memoirs , II, 317. [17] The remainder of this subsection is based on McGrath, U.S. Army in the\r\nKorean Conflict, pp. 40-53. Page 10 When Bonesteel's draft paper reached the Joint Planners in the pre-dawn hours of\r\n11 August, Admiral M. B. Gardner suggested moving the surrender line north to\r\nthe 39th Parallel, a recommendation that the planners believed the Navy\r\nSecretary, James C. Forrestal, favored. Gardner pointed out that the 39th\r\nParallel would place Dairen in the military zone to be occupied by the\r\nAmericans. General Lincoln, however, felt that the Russians would hardly accept\r\na surrender line that barred them from Dairen and other parts of the Liaotung\r\nPeninsula; besides, American units would have great difficulty reaching the\r\nManchurian port ahead of the Russians. Calling Assistant Secretary of State\r\nJames Dunn, Lincoln ascertained that his opinion was shared. Mr. Dunn believed\r\nthat Korea was more important politically to the United States than Dairen, and\r\nhe felt this to be the view of Secretary of State James F. Byrnes. As a result,\r\nthe 38th Parallel remained in the draft when the Joint Planners handed the\r\ngeneral order to the State-War-Navy Coordinating Committee. While General Lincoln was shepherding the document through the State-War-Navy\r\nCoordinating Committee on 11 and 12 August, the Russians invaded Korea, landing\r\non the northeast coast near Rashin. Russian troops then poured out of the\r\nmaritime provinces of Siberia, down the Korean peninsula, and into the\r\nKaesong-Ch'unch'on area above Seoul, where they looted much equipment, including\r\nlocomotives and rolling stock. Reports of the Russian troop movements reaching\r\nWashington underscored the need for concurrence in the proposed general order.\r\nOtherwise, the Russian advance would render academic the American acceptance of\r\nthe Japanese surrender in southern Korea. At the same time, swift Russian troop\r\nmovements into key areas of southern Manchuria eliminated the possibility of\r\nincluding Dairen in the American surrender zone. Between 11 and 14 August, the State-War-Navy Coordinating Committee and the\r\nJoint Chiefs of Staff discussed the wording of the surrender instrument.\r\nMeanwhile, General MacArthur informed the Joint Chiefs of Staff that he would\r\nadhere to three priorities for the use of the forces under his command. After\r\nthe Japanese surrender, the occupation of Japan would come first, Korea second,\r\nChina third. In Washington, the War Department Operations Division rephrased General Order\r\nNo. 1 to the satisfaction of the Joint Chiefs of Staff and the heads of the\r\nState, War, and Navy Departments. On 15 August 1945, clean copies of the draft\r\norder were sent to Fleet Admiral William D. Leahy's White House office. Within a\r\nfew hours President Truman gave his approval, directing at the same time that\r\nGeneral Order No. 1 be sent also to the capitals of Great Britain and the USSR\r\nwith requests for concurrence by the heads of those states. The Joint Chiefs of\r\nStaff telegraphed the general order to General MacArthur and directed that he\r\nfurnish an estimated time schedule for the occupation of a port in Korea. Among the items it specified, General Order No. 1 stated that Japanese forces\r\nnorth of the 38th Parallel in Korea would surrender to the Russian commander,\r\nwhile those south of the parallel Page 11 would surrender to the commanding general of the U.S. expeditionary forces. As\r\nWashington waited for the Moscow reaction to President Truman's message, there\r\nwas a short period of suspense. Russian troops had entered Korea three days\r\nbefore the President accepted the draft of General Order No. 1. If the Russians\r\nfailed to accept the proposal, and if Russian troops occupied Seoul, General\r\nLincoln suggested that American occupation forces move into Pusan. Stalin replied to President Truman on 16 August 1945. He said nothing\r\nspecifically about the 38th Parallel but offered no objection to the substance\r\nof the President's message. He asked that the general order be \"corrected\"\r\nto authorize Russian forces to accept the surrender of the Japanese in the\r\nnorthern half of Hokkaido. Stalin also reminded the President that the Liaotung\r\nPeninsula, upon which Dairen and Port Arthur are located, was part of Manchuria\r\nand thus within the USSR military zone. Though President Truman parried Stalin's\r\nproposal to place Russian forces on Hokkaido, Stalin's message settled the\r\nsurrender zones in Korea and canceled American plans to land troops at Dairen."
    },
    {
      "tag": "div",
      "text": "The New Zones"
    },
    {
      "tag": "p",
      "text": "The new dividing line, about 190 miles across the peninsula, sliced across Korea\r\nwithout regard for political boundaries, geographical features, waterways, or\r\npaths of commerce. The 38th Parallel cut more than 75 streams and 12 rivers,\r\nintersected many high ridges at variant angles, severed 181 small cart roads,\r\n104 country roads, 15 provincial all-weather roads, 8 better-class highways, and\r\n6 north-south rail lines. [18] It was, in fact, an arbitrary separation. South of the 38th Parallel, the American zone covered 37,000 square miles and\r\nheld an estimated 21,000,000 persons. North of the line of latitude, the USSR\r\nzone totaled 48,000 square miles and had about 9,000,000 people. [19] Of the 20\r\nprincipal Korean cities, 12 lay within the American zone, including Seoul, the\r\nlargest, with a population of nearly 2,000,000. The American zone included 6 of\r\nKorea's 13 provinces in their entirety, the major part of 2 more, and a small\r\npart of another.   The two areas, North and South Korea, complemented each other\r\nboth agriculturally and industrially. South Korea was mainly a farming area,\r\nwhere fully two-thirds of the inhabitants worked the land. It possessed three\r\ntimes as much irrigated rice land as the northern area, and furnished food for\r\nthe north. But North Korea furnished the fertilizer for the southern rice\r\nfields, and the largest nitrogenous fertilizer plant in the Far East was in\r\nHungnam. Although North Korea also had a high level of agricultural production,\r\nit was deficient in some crops. The barrier imposed serious adverse effects on\r\nboth zones. [20] [18] Shannon C. McCune, \"Physical Basis for Korean Boundaries,\" Far\r\nEastern Quarterly , No. 5 (May 946), pp. 286-87. [19] (1) Andrew Grajdanzev, \"Korean Divided,\" Far Eastern\r\nSurvey , XIV (October 1945), 282. (2) \"History of Occupation of Korea\",\r\nvol. I, ch. 4, p. 16. [20] The closing paragraphs of this chapter are based on information in (1)\r\nTestimony of Hoffman, 8 June 1949, House Report 962, June 1949, and (2) George\r\nA. McCune, Korea Today (Cambridge: Harvard University Press, 1950), pp.\r\n52-56. Page 12 South Korea had in 1940 turned out about 74 percent of Korea's light consumer\r\ngoods and processed products. Its industry consisted of some large and many\r\nsmall plants producing textiles, rubber products, hardware, and ceramics. Many\r\nof these plants had been built to process raw materials from North Korea. North Korea, a largely mountainous region, held valuable mineral deposits,\r\nespecially coal. Excellent hydroelectric plants, constructed during the last ten\r\nyears of Japanese domination, ranked with the largest and best in the world.\r\nBecause of its power resources, North Korea housed almost all of Korea's heavy\r\nindustry, including several rolling mills and a highly developed chemical\r\nindustry. In 1940, North Korea produced 86 percent of Korea's heavy manufactured\r\ngoods. The only petroleum processing plant in the country, a major installation\r\ndesigned to serve all of Korea, was located in the north, as were seven of eight\r\ncement plants. Almost all the electrical power used by South Korea came from the\r\nnorth, as did iron, steel, wood pulp, and industrial chemicals needed by South\r\nKorea's light industry. Sharp differences between north and south had traditionally been part of the\r\nKorean scene. South Koreans considered their northern neighbors crude and\r\nculturally backward. North Koreans viewed southerners as lazy schemers. During\r\nthe Japanese occupation Koreans in the north had been much less tractable than\r\nthose in the south. Differences in farming accounted for some of the social\r\ndifferences in the two zones. A dry-field type of farming in the north opposed a\r\nrice-culture area in the south to produce marked variations in points of view.\r\nIn the south were more small farms and a high tenancy rate, while in the north\r\nlarger farms and more owner-farmers prevailed. Those differences the 38th\r\nParallel promised to exacerbate."
    },
    {
      "tag": "h2",
      "text": "CMH Homepage"
    }
  ]
}