{
  "url": "http://www.aspsys.com/systems/viewspecs.aspx/video/29/14.aspx",
  "content_hash": "dc5ee6781ff705548a508bb2cd4f352cac52652af3c41a21535bc52e022a6a1c",
  "total_blocks": 76,
  "retained_blocks": 9,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "div",
      "text": "xml version=\"1.0\" encoding=\"UTF-8\"? html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" »Beowulf Clusters"
    },
    {
      "tag": "p",
      "text": "Since 1982, Aspen Systems has been a leader in the custom design, manufacture and service of a\r\nwide array of high-performance computing systems.\r\nWe've built our reputation as a leading provider of Beowulf-class clusters by offering custom software configurations, cluster management software ,\r\na choice of processors, and connectivity for your specific performance needs. [ ADVERTISE HERE ]"
    },
    {
      "tag": "div",
      "text": "»Benchmark Testing"
    },
    {
      "tag": "p",
      "text": "Aspen Systems has several systems with different configurations\r\n        available for testing and running your benchmarks."
    },
    {
      "tag": "div",
      "text": "Single Core Opteron 252 2.6 GHz, 4 GB DDR400 RAM, 36 GB U320 SCSI Hard Drive, Fedora Core 4 Dual Core Opteron 275 2.2 GHz, 4 GB DDR400 RAM, 36 GB U320 SCSI Hard Drive, Fedora Core 4 Intel Xeon EM64T (Nocona) 3.4 GHz, 1 MB L2 cache, 2 GB DDR400 RAM, 36 GB U320 SCSI Hard Drive, SuSE 9.3 More . . ."
    },
    {
      "tag": "p",
      "text": "Follow the link below to request benchmark testing on one of our systems."
    },
    {
      "tag": "div",
      "text": "»Cluster Management"
    },
    {
      "tag": "p",
      "text": "The Aspen Beowulf Cluster management system (ABC) software package provides an administrator with the ability to manage, monitor & maintain\r\n        all aspects of a Linux-based Beowulf cluster via an SSL encrypted web browser interface. Follow the link below to learn more about Aspen Beowulf Cluster management software."
    },
    {
      "tag": "div",
      "text": "More Features » . Clusters · Hardware · Software · Support · About Us · Search · Site Map Contact Us · Toll Free: 1-800-992-9242 · PH: 1-303-431-4606 · FAX: 1-303-431-7196 Copyright ©\r\n  2006\r\n  by Aspen Systems, Inc. All Rights Reserved · Terms Of Use You are visitor 2,262,990 WEBBOT bot=\"HTMLMarkup\" startspan ALT=\"Site Meter\" Copyright (c)2000 Site Meter WEBBOT bot=\"HTMLMarkup\" Endspan Start of StatCounter Code End of StatCounter Code"
    }
  ]
}