{
  "url": "http://www.bbc.co.uk/northyorkshire/greedypig/food/reviews/restaurants/plunketts.shtml",
  "content_hash": "823fc6b9b60f27e384a982ecb5522b46e6881edf1dd40d690c52c1cd98a62b59",
  "total_blocks": 370,
  "retained_blocks": 13,
  "ignored_blocks": 357,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" #BeginTemplate \"/Templates/GP_reader_food_review.dwt\" page layout templates v2.66 GLOBAL NAVIGATION toolbar 1.44 header.page  333399 Home TV Radio Talk Where I Live A-Z Index end toolbar 1.42 27 December 2006 Accessibility help Text only BBC Homepage England » North Yorkshire News Sport Junior Football Travel Weather Entertainment Message \r\nBoard In Pictures Webcams I Love NY Faith Students RaW Blast CSV Interaction BBC Radio York Site Map Contact Us Like this page? Send it to a friend! End of GLOBAL NAVIGATION #BeginEditable \"top\" Plunkets Restaurant, York #EndEditable #BeginEditable \"image and lead text\" Reading \r\n                  this? Why don't you write us a review? Plunkets \r\n                    Restaurant Steve Chris Joe Helen Claire #EndEditable #BeginEditable \"story data\" #EndEditable #BeginEditable \"body of story\" Restaurant Plunketts Snouts Reviewer Steve Date 10-May-2006 Where \r\n                  is it? York What's \r\n                  the number? 01904 \r\n                  637722 What's \r\n                  the grub like, then?"
    },
    {
      "tag": "p",
      "text": "Ordered \r\n                    nachos as starters which they forgot to bring until the main \r\n                    course. Fajitas were only average. I was expecting them to \r\n                    arrive sizzling hot but they weren't so the food was only \r\n                    lukewarm."
    },
    {
      "tag": "div",
      "text": "What \r\n                  did you drink? Bottle \r\n                  of house white at about 13 was okay. What's \r\n                  the crowd like? Arrived \r\n                  about 7pm on a Monday night so had a choice of tables. Got quite \r\n                  full later on. And \r\n                  the vibe? Nice \r\n                  building but tables were a bit cramped and the chairs uncomfortable. \r\n                  The couple at the next table started smoking so it was time \r\n                  to skip dessert and coffee and leave. Anything \r\n                  else you'd like to say? Overall \r\n                  disappointing. Seem to be trading on reputation alone. There \r\n                  are plenty of better options in York. Value \r\n                  for money? 53 \r\n                  for 3 mains and wine. They didn't charge for the starters. Restaurant Plunkets Snouts Reviewer Chris Date 03-March-2006 Where \r\n                  is it? York What's \r\n                  the number? No \r\n                  need! They don't take bookings! What's \r\n                  the grub like, then?"
    },
    {
      "tag": "p",
      "text": "If \r\n                    I was being generous I'd say it was fair. However, if I was \r\n                    more honest, I'd say overrated. But my problem wasn't with \r\n                    the food."
    },
    {
      "tag": "div",
      "text": "What \r\n                  did you drink? Bottled \r\n                  beer and house wine. Slightly pricey, but tasted nice. What's \r\n                  the crowd like? Couples \r\n                  of all ages. And \r\n                  the vibe? Crowded \r\n                  and smokey upstairs Anything \r\n                  else you'd like to say? Was \r\n                  told you cant book, so turned up without a reservation and \r\n                  had to wait two hours for a table. When we were finally seated, \r\n                  we noticed many tables were unused. Upstairs the bar was packed \r\n                  full of people waiting for tables and downstairs there were \r\n                  LOTS of tables unused? I got the feeling they were just ushering \r\n                  customers upstairs for an hour or two to get a few extra rounds \r\n                  of drinks out of them. Very annoying! Not in a rush to return! Value \r\n                  for money? I \r\n                  paid 8 for a plate of nachos chips with a couple of dollops \r\n                  of salsa for a starter. Restaurant Plunketts Snouts Reviewer Joe Date 02-January-2006 Where \r\n                  is it? York \r\n                  between the Art Gallery and the Minster What's \r\n                  the number? Don't \r\n                  book, enjoy the bar! (01904 637722) What's \r\n                  the grub like, then?"
    },
    {
      "tag": "p",
      "text": "Plunketts \r\n                    is part of a Christmas tradition with us. We first visited \r\n                    years ago and have returned regularly (always at Christmas \r\n                    time) on our (at least) biennial shopping visit to York. The \r\n                    food is always excellent and the steaks are cooked just how \r\n                    you order them. I can also speak very highly of the 'bowl'o'red'! \r\n                    This time round we tried the Christmas cake and Godminster \r\n                    for dessert, and for a strictly Cheddar-only man like me this \r\n                    was a real treat - Fantastic! However having since purchased \r\n                    some of the aforementioned cheese I have been disappointed \r\n                    not to be able to achieve the same kick."
    },
    {
      "tag": "div",
      "text": "What \r\n                  did you drink? Black \r\n                  Sheep. Its as much a part of the tradition as admiring the view \r\n                  through the bedsit window across the street from upstairs, or \r\n                  banging my head on the low beams. What's \r\n                  the crowd like? Sadly \r\n                  the clientele appear to be getting younger; I say 'appear' because \r\n                  I am a realist and suspect that age wise I now have more in \r\n                  common with the fabric of the building than some of the punters! And \r\n                  the vibe? Soapbox \r\n                  time! Apart from it's everpresent inbuilt charm and ambience, \r\n                  on this occassion I was put off (upstairs at least) by the fug \r\n                  of smoke. The truth is I don't often get out these days and \r\n                  to have an evening as special as this marred (not exactly spoiled) \r\n                  by something as blatantly antisocial (its only social to those \r\n                  who enjoy it) was a tad upsetting. No doubting where I stand \r\n                  on the great debate then! Anything \r\n                  else you'd like to say? If \r\n                  you should visit in the week before Christmas be sure to have \r\n                  a seat next to the roaring fire! Only my wife likes to sit next \r\n                  to the window in the bar to see the Minster - so do I, of course! Value \r\n                  for money? Always! \r\n                  We shared the dessert and still couldn't manage it! Restaurant Plunkets Snouts Reviewer Helen Date 17-May-2005 Where \r\n                  is it? York What's \r\n                  the number? 01904 \r\n                  637722 What's \r\n                  the grub like, then?"
    },
    {
      "tag": "p",
      "text": "Amazing! \r\n                    The fajitas were fantasic and the portion was more than enough \r\n                    for one person."
    },
    {
      "tag": "div",
      "text": "What \r\n                  did you drink? the \r\n                  house white is cheap and fruity What's \r\n                  the crowd like? The \r\n                  service was spot on no faults at all And \r\n                  the vibe? chilled \r\n                  out atmosphere and the pictures of all the famous people really \r\n                  amazing. Anything \r\n                  else you'd like to say? Overall \r\n                  it was great, i will reccomend it to all my friends and will \r\n                  certainly go again! Value \r\n                  for money? It \r\n                  is about 4.50 for a starter and 10.00 ish for a main, well \r\n                  worth it though! Restaurant Plunkets Snouts Reviewer Claire Date 17-May-2005 Where \r\n                  is it? High \r\n                  Petergate, York What's \r\n                  the number? 01904 \r\n                  637722 What's \r\n                  the grub like, then?"
    },
    {
      "tag": "p",
      "text": "Fanastic. \r\n                    Wide choice and variety. Took a long time to decide what to \r\n                    order!"
    },
    {
      "tag": "div",
      "text": "What \r\n                  did you drink? House \r\n                  white, very nice. What's \r\n                  the crowd like? We \r\n                  booked for mid afternoon so quiet. A few couples, work parties. And \r\n                  the vibe? Trendy, \r\n                  I could go with a partner or friends. I think it has the right \r\n                  setting to make the atmosphere what you want. Lots of pictures \r\n                  of famous stars everywhere, great. Anything \r\n                  else you'd like to say? Will \r\n                  definately be going again. Staff were friendly and the food \r\n                  exceptional. Value \r\n                  for money? For \r\n                  7; 3 courses and drinks it came to 180 which was good value \r\n                  for money. Each course was a generous portion only just had \r\n                  enough room for desert. Been \r\n                  inspired? Write a Greedy \r\n                  Pig grub review yourself! #EndEditable Top | Greedy \r\n                  Pig Index | Home"
    },
    {
      "tag": "p",
      "text": "Farewell from the Greedy Pig We're sorry to announce that the Greedy Pig has eaten one wafer thin \r\n        mint too many and looks unlikely to recover so this section of the BBC \r\n        North Yorkshire website is now closed. Many thanks to everyone who submitted \r\n        reviews. Existing reviews will remain on this site for a while as an archive, \r\n        but won't be updated."
    },
    {
      "tag": "div",
      "text": "Greedy Pig All food reviews All pub reviews Write a review Walks York Pen-y-ghent Three Peaks I Love NY Lifestyle History Outdoors Romans Constantine the Great Keeping clean the Roman way What is Eboracum? begin footer if no nav or stretchy but not both About the BBC | Help | Terms of Use | Privacy & Cookies Policy end footer #EndTemplate"
    }
  ]
}