{
  "url": "http://www.bccba.org/Guest_Lounge/dialcontent.asp?id=120",
  "content_hash": "f0818d4a07d819600af4f5d190240c14216f3bc73c463df1c31604eaeb9418b9",
  "total_blocks": 29,
  "retained_blocks": 3,
  "ignored_blocks": 26,
  "blocks": [
    {
      "tag": "div",
      "text": "** START NAVSTUDIO MENU TAGS (302971) ** ****JavaScript based drop down DHTML menu generated by NavStudio. (OpenCube Inc. - http://www.opencube.com)**** ** END NAVSTUDIO MENU TAGS ** ---------------------------------End Menu Tags------------------------------------------ start your stuff here"
    },
    {
      "tag": "p",
      "text": "CBABC is  committed to promoting the interests of the legal profession in BC. more Many articles and resources on this site are available only to CBA members. Join and take advantage of the many member benefits and savings . Join a CBABC Section Register with Lawyer Referral Practice Advisory Panels Student Mentor Program Sections | Upcoming Mtgs Section Enrolment Form Section Papers WLF Enrolment Form Join the Mentoring Project Subscribe to the listserv BarTalk inserts + 16 positions & 5 email ads CBABC Calls for PST Elimination in 2007 Budget Presenting to the Standing Committee on Finance and Government Services on October 6, 2006, President Frits Verhoeven called on government to remove the discriminatory and harmful tax on legal services in preparation for the 2007 Budget. See submission here , and presentation transcript here . CBA Honours Exceptional BC Lawyers Whether they’re improving the status of historically marginalized communities, supporting access to justice for the poor, or tirelessly volunteering for charitable organizations, lawyers are making a difference across BC. The Canadian Bar Association BC Branch recognizes the many unsung heroes in the legal profession who are quietly improving communities, and proudly congratulates the nominated recipients. Read more . Important Notice to Lawyers On August 17 th , the Government of British Columbia  issued additional guidelines to lawyers with respect to collection and remittance of the Social Services Tax on Legal Services. Read the guidelines. Read more about the CBA’s fight to eliminate the tax on legal services. The Registered Plan [Retirement Income] Exemption Act for British Columbia Read the CBABC brief submitted to the Ministry of Finance of British Columbia, as part of an advocacy campaign to extend protection from creditors for registered retirement savings. This is an important issue for many lawyers and others whose retirement savings are self-financed through registered plans rather than pensions (which are creditor protected). CBA Futures “Crystal Clear: Strategic Directions for the CBA,\" the CBA Futures Report , looks ten years into the future. More News > Effective Law Reform, One Meeting at a Time CBA legislation and law reform agenda ensures Bar input From the President The Experience Gap December Issue > More Headlines > LAP: Life Balance for Lawyers, Jan 16 , 23 , 30 Provincial Court of BC Welcoming Ceremony, Jan 19 LCBA Presidents Meeting, Jan 26 CBABC Provincial Council, Jan 27 LAP: Life Balance for Lawyers, Feb 6 , 13 , 20 CBA Mid-Winter Meeting of Council, Feb 18-19 Canadian Bar Association National CLE Aboriginal Law Conference, Mar 9-10 Civil Litigation Law CLE Conference, Apr 12-13 Citizenship & Immigration Law Conference, Apr 13-14 Environmental, Energy & Resources Law Summit, Apr 27-28 CBA/OBA Joint Health Law CLE Conference, May 3-4 CBA/IBA Joint Spring Competition Law Conference, May 3-4 Customs, Sales Tax & Commodity Law Conference, May 17 Click here for additional conferences and events. CBABC News & Jobs BC Lawyers' Directory [free to members] BarTalk | CBA PracticeLink Legal Careers Preferred Suppliers Advertise to Lawyers CBA/CBABC Awards Work Life Balance CBA Members $ave Sun Peaks Whistler/Blackcomb Mt Washington Silver Star & Big White BC Lawyers' Directory Order Form BCSC Practice Direction CBA National Class Action Database BC Ministry of AG, High Security/Profile Trial Advisory Canadian Superior Courts Judges Association launches website ...a member of the public? In Public & Media , find a lawyer through the Lawyer Referral Service or access information about the law in Dial-A-Law. ...a member of the media? In Public & Media , access the Media Contact Guide & CBABC news releases. Many documents on this site are in Adobe Acrobat format. You will need the Adobe Reader software in order to view and print these documents:"
    },
    {
      "tag": "div",
      "text": "End your stuff here-"
    }
  ]
}