{
  "url": "http://www.belairfinishing.com/practical_guide_to_mass_finishing.htm",
  "file_number": "273",
  "content_hash": "091551253839bd14dd0f05bb32fa05d9fd67b12811f4f3bc67269776605c6c5b",
  "total_blocks": 965,
  "retained_blocks": 24,
  "ignored_blocks": 941,
  "blocks": [
    {
      "tag": "div",
      "text": "MASS FINISHING TECHNOLOGY #BeginEditable \"Banner\""
    },
    {
      "tag": "h1",
      "text": "Technical Articles"
    },
    {
      "tag": "div",
      "text": "#EndEditable Process Technology Equipment Media & Compounds Wastewater Treatment Precious Metal Recovery Consulting Technical Articles About Us Contact Us Site Map #BeginEditable \"Main Body\""
    },
    {
      "tag": "h1",
      "text": "THE PRACTICAL GUIDE TO MASS FINISHING OF PRECIOUS AND COSTUME JEWELRY: METHODS AND MYTHS"
    },
    {
      "tag": "p",
      "text": "Steven R. Alviti, Bel Air Finishing Supply Inc ."
    },
    {
      "tag": "div",
      "text": "CONTENTS"
    },
    {
      "tag": "p",
      "text": "I. ABSTRACT II. INTRODUCTION III. \r\nMEDIA AND COMPOUNDS A. DEFINITION B. FUNCTIONS OF MEDIA C. MEDIA TYPES D. MEDIA SIZES AND SHAPES E. FUNCTIONS OF COMPOUNDS F. HOW MEDIA AND COMPOUNDS WORK IV. MACHINES A. TUMBLING FINISHERS B. VIBRATORY BOWL FINISHERS C. VIBRATORY TUB FINISHERS D. HIGH ENERGY BARREL FINISHERS E. HIGH ENERGY DISC FINISHERS F. ROLL BURNISHING FINISHERS G. MAGNETIC PIN FINISHERS V. MACHINE EFFECTIVENESS & COST RELATIONSHIPS A. MACHINE COST EFFECTIVENESS B. COMMON FINISHING MYTHS VI. CONSUMER EXPECTATIONS DICTATE TECHNIQUES VII. NEW DEVELOPMENTS IN WASTE WATER TREATMENT A. RECYCLING METHODS B. NEWEST WATER TREATMENT CHEMISTRY ABSTRACT Amicroscopic and technical view of mass finishing presented in layman's terms. Understanding of mass finishing must start at the very basic level of what happens microscopically to the surface of various materials. All the variables will be discussed, such as the media, compounds and the effect of various types of machinery on the finishing process. Practical techniques and the associated costs will be presented for pre-finishing of precious metal jewelry as well as costume or imitation jewelry INTRODUCTION This article is an explanation of Mass Finishing from a practical standpoint. The views discussed here are a result of 30 years of experience in manufacturing jewelry, job shop processing for many diverse manufacturing industries as well as experience in designing and manufacturing of finishing equipment. Historically, the mass finishing department of many companies have not received the attention or understanding required to serve the best interests of the manufacturer's finished product. Typically, manufacturers migrate to opposite ends of the spectrum with regards to their finishing department. It is either in the remotest location of their facility and the attitude is \"well that's the way we have always done it\" or they have instituted a sophisticated system without the proper understanding of the economics or the reality of everyday jewelry manufacturing. There is no best way of finishing a product. Before any changes are made to a finishing department, the manufacturer must address the importance of several aspects before making a decision. Most Important Semi Important Least Important Processing Time Quality of Finish Cost of Finishing Training Employees Maintenance Cost of Equipment Loss of Material from Product III MEDIA - COMPOUNDS A. DEFINITION The word media is used to describe the material that is used in mass finishing to actually do the work on the surface of the part that is being finished. The compound refers to the different types of chemicals used during wet mass finishing operations. B. FUNCTION OF MEDIA The functions of media are varied and range from rough cutting to polishing. ROUGH CUTTING of the raw product is to remove all possible surface imperfections. Depending upon the manufacturing process, some hand work may be necessary prior to this mass finishing step. Raw gold casting must have the sprue cut off and ground down to the surface. In the case of a white metal rubber molded piece, usually no hand operation is necessary. However, each case depends on the manufacturing process. The rough cut is to remove the surface imperfections of the material due to its fabrication technique. (i.e. casting, rolling, forming, etc.) This is the stage where mass finishing plays its biggest role in labor savings. Typically, mass finishing can save 50 - 75% of the hand labor used to finish a piece of jewelry. FIG. 1-3 The rough cut is almost always done as a wet operation with media, water and compound. The labor savings is most obvious for cast materials due to the inherent roughness of the \"as cast\" surface. PRE-FINISHING is the term used for the operation following the rough cut stage. The pre-finishing step is usually done prior to machine polishing, hand polishing or electroplating. The purpose is to increase the smoothness of the \"rough cut\" surface so as to make the polishing or electroplating procedure more effective. In order for a product to be machine polished or a combination of machine and hand polished, this step is most necessary. If the product is going to be hand polished or electroplated, this step may or may not be necessary. This would depend upon whether the labor saving is worth the time investment. Aquestion quality versus cost must also be taken into consideration. The pre-finishing operation is almost always done as a wet operation with media, water and a compound. MACHINE POLISHING is very economical where applicable. It can save up to 95% of hand finishing labor costs; however, many facto must be considered for this step to be viable. This is usually a dry procedure using a natural carrier and a powdered compound without water. Fig. 4 BURNISHING is used to render the surface of a product bright by Jmeans of rolling over a surface with a non-abrasive media such as steel or porcelain. This method physically peens the surface in order to increase light reflectivity which, in turn, will make the surface appear bright. This media is the heaviest available and is used with water and compound. C. MEDIA TYPES There are a variety of different media for different applications: Normally, there are two components of CUTTING MEDIA: 1) abrasive grains and 2) carrier or bonding agents Abrasive grains for cutting media can be any of the following:"
    },
    {
      "tag": "div",
      "text": "Silicone carbide - most aggressive Aluminum oxide - moderately aggressive Silica- least aggressive"
    },
    {
      "tag": "p",
      "text": "Bonding materials can be (FIG \r\n8 ) :"
    },
    {
      "tag": "div",
      "text": "Ceramic - hard Plastic - soft Natural - range soft to hard"
    },
    {
      "tag": "p",
      "text": "PRE-POLISHING MEDIA is much the same as cutting media with exception of the size of the grain that is bound into the media. Pre-finishing media is also used to perform a cutting operation; however, much more gentle and finer than the rough cut media. BURNISHING MEDIA has no abrasive grain. This media is used simply to roll over or hammer away at the surface with the sole purpose of making it bright. This media is typically made from either very heavy lain or solid steel. POLISHING MEDIA is generally made of a natural base material as wood, shell or corn cob. Polishing compounds, very similar to used in hand polishing bars, are bound to the natural base by means wax or oil based product. D. MEDIA SIZES AND SHAPES. The various types of media are available in many shapes and sizes. When choosing sizes and shapes, one must consider the geometry of the being processed and choose the largest media possible that will fulfill the following criteria: 1. The shape chosen will best be able to touch every part of the surface of the work pieces. 2. The size will facilitate easy separation (i.e. either the media or the piece can be sifted through an existing separating screen). E. FINISHING COMPOUNDS Finishing compounds are either liquid or powder and are as additives to the water being used during any of the mass finishing operations There are three purposes for compounds (1) The compound is form of soap used to suspend the solids being removed from the surface the product (much like dishwashing soap). (2) The prevention of oxidation or discoloration of the metals being processed. (3) The addition lubricity to the process. The proper compounds form a cushion between the media and the work piece, which allows a sliding action which in turn, reduces impingement of the abrasive. Compounds are used both types of processing. The first is called a batch operation where a prescribed amount of media, water and compound are placed in a sealed process chamber. The second is called a flow-thru operation where a prescribed amount of water and compound continuously flow in and out of open processing chamber of media. Theoretically, compounds are most likely to be changed for a particular metal being processed as well as for a particular step (i.e. rough cut, pre-finish etc.) In reality; however, this is less likely to be specifically matched to the purpose. Most manufacturers settle on one \"all purpose compound\" best suited for their needs."
    },
    {
      "tag": "div",
      "text": "Pre-tumbled Resin Bonded Preformed Media"
    },
    {
      "tag": "p",
      "text": "PYRAMIDS SPEC A B C P0 3/8 5/8 5/8 P1 1-5/8 1 1 P2 2 1-1/2 1 TETRAHEDRON SPEC A B C TH1 3/4 3/4 3/4 TH2 1-1/8 1-1/8 1-1/8 TH3 1-1/4 1-1/4 1-1/4 TH4 1-3/8 1-3/8 1-3/8 TRIANGLE SPEC A B C TR0 1/4 1/4 1/4 TR1 5/8 1/2 3/8 TR2 11/16 7/16 5/8 TR3 1 5/8 9/16 TR4 1-1/4 5/8 5/8 TR5 1-3/4 1-1/4 1-1/4 TR6 2-1/2 2-1/2 2-1/2 CONE SPEC A B C1 3/8 3/8 C2 1/2 9/16 C3 3/4 3/4 C4 1 1-1/4 C5 1-1/4 1-1/4 C6 1-1/4 1-1/2 C7 1-1/2 1-1/2 C8 1-3/4 1-3/4 C9 2 2 C10 2 2-1/2 C11 2-1/2 2-1/2 ANGLE CUT TRIANGLE SPEC A B ATR1 1 1-1/8 CYLINDER WEDGE SPEC A B ATR1 1-1/4 1-1/4 ATR2 1-1/2 1-1/2 TRI-STARS SPEC A B TS1 1-3/8 1/2 TS2 1-3/4 3/4 TS3 2 3/4 WEDGES SPEC A B C W1 1-5/8 1 1 W2 2 1-1/4 1-1/8 ANGLE CUT CYLINDERS SPEC A B C AC1 1 9/16 TRIANGLE SPEC A B C TR0 1/4 1/4 1/4 TR1 5/8 1/2 3/8 TR2 11/16 7/16 5/8 TR3 1 5/8 9/16 TR4 1-1/4 5/8 5/8 TR5 1-3/4 1-1/4 1-1/4 TR6 2-1/2 2-1/2 2-1/2 F. HOW MEDIA AND COMPOUNDS WORK Mass finishing media works basically in the \r\nsame manner as the materials used in hand finishing. FIG 10 \r\na-d The main difference is that a machine is used to apply the \r\nforce through the tool to the work piece. The other difference \r\nis that a mass of pieces are being processed rather than one \r\npiece at a time. Hence, the name Mass Finishing. FIG 11 In order to perform the CUTTING OPERATION, we must choose \r\nthe best combination of abrasive grain, bonding material, \r\nsize, shape and the proper compound to use during the process. \r\nThe cutting media works in the same manner as a grinding wheel. \r\nAforce is required to rub the media across the surface of \r\nthe work piece. FIG 12 At the point of contact of media and the work piece, abrasive \r\ngrains are exposed at the surface of the media and rubbed \r\nacross the work piece, microscopically cutting material from \r\nits surface. As material is being cut away from the work piece, \r\nthe abrasive grains are becoming dull as they do their job. \r\nFIG 13a,b Meanwhile, the bonding material is wearing away so as to rid \r\nthe media of these dull abrasive grains and to expose new \r\nsharp grains to continue the cutting process. The water and \r\ncompound are used to cushion this effect as well as to remove \r\nall of the waste (used abrasive grains, bonding material, \r\nwork piece surface material) from the operation. Economics \r\nnow come into play when choosing the proper cutting media. The faster a media cuts, the faster it normally wears which \r\nequates to dollars per finishing operation. If the bonding \r\nagent of the media does not wear fast enough, the abrasive \r\ngrains may not perform as effective as they should. There \r\nis an optimal wear ratio between the bond and the grain. If \r\nthis ratio is not correct, the media is less cost effective. \r\nRegardless of these microscopic costs, the overall economic \r\nscale of labor saving, material loss and overall time savings \r\nmake mass finishing a sure bet. THE PRE-POLISHING OPERATION is practically the same \r\nas the cutting media except the bonding material is usually \r\nharder and the abrasive grain size is smaller. In some cases, \r\nthe abrasive grain is in the form of slender finer shape. \r\nBy rubbing over the surface with a greater low of water and \r\na compound that lubricates more effectively, a gentle honing \r\naction occurs. The purpose is to reduce the surface to a finer/smoother \r\nfinish. Typically, the wear of pre-polishing media is much \r\nless than that of cutting media. We are less interested in \r\nremoving metal, than we are in reducing the surface finish. The POLISHING OPERATION is normally done as a dry process, \r\nthe media in this case is either of several natural products \r\nlike wood round up corn cob or nut shells. In this case, there \r\nis no water flow and, the compound is dry and bonded to the \r\ncarrier. Some typical compounds are alumina and tin oxide, \r\nwhich are the same compounds used for hand polishing In this \r\ncase, the rubbing action of the media is meant to -plicate \r\nthe action of a polishing wheel rubbing polishing compound \r\nover the surface of the work piece. As long as the surface \r\nhas previously been rendered smooth and flat, this process \r\nwill now produce a high luster to the surface. This operation \r\nusually takes a much longer time than the rough cut and pre-polish. \r\nThe finish that is achieved with this method is very good; \r\nhowever, it will never be equal to that of a hand polished \r\nfinish No mass finishing machine has been able to duplicate \r\nthe force and action necessary to compare to hand polishing. \r\nHand polishing actually over the surface of the work piece \r\nby dragging metal whereas machine polishing only glosses the \r\nexisting surface. During this operation, due tog the fact \r\nthat it is a dry process, heat is generated by the friction \r\nof the in moving This heat is beneficial to the process because \r\nit helps activate it polishing compound itself; therefore, \r\nit is helpful to retain as much of the .at generated by covering \r\nthe process. Unlike cutting and pre-polishing' media, the \r\npolishing media has a life span, after which it is no longer \r\neffective This is due to the fact that the polishing compound \r\nis only bonded to the surface of the media as opposed to the \r\nabrasive grain being 81 bound throughout the whole composition. \r\nHowever, once this media has been expended, it can be re-charged \r\nfor several more cycles before being discarded. BURNISHING MEDIA is typified by the lack of abrasives \r\nand a hard and extremely smooth surface. The purpose of burnishing \r\nis to brighten the surface of a material by means of peening \r\nthe surface. The correlation that we use to explain this is \r\nif one took a plain dull piece of brass and a ball peen hammer. \r\nAfter repeatedly hammering the surface, it will then take \r\non brightness imparted by the surface of the ball peen will \r\nhammer. Steel or stainless shot as well as porcelain balls are the \r\ntypical media of choice for burnishing. These are usually \r\nthe heaviest materials available and they are processed to \r\nhave a microscopically smooth and shiny surface finish. IV MACHINES The media is what actually performs the surface \r\nfinishing. The compound allows this work to be done efficiently \r\nbut it is the machine that provides the energy to do all the \r\nwork. There are several different types of mass finishing \r\nmachines, all of which have a different method of transferring \r\nenergy from an electric motor to the media to the work piece. The TUMBLING MACHINE is the oldest form of mass finishing \r\nequipment. Amotor is attached to the gear box by means of \r\na pulley and belt. The gear box rotates an octagonal finishing \r\nchamber which is either submerged in water or contains water \r\nin its chamber. The chamber should be loaded with between \r\n50% and 60% of the total chamber volume. About 15% to 25% \r\nof the total mass should be work pieces In this equipment, \r\nthe pieces are only being worked on as the media and pieces \r\ntumble down the incline of the rotating barrel. Meanwhile, \r\nas the mass rotates up to the top of the incline, there is \r\nno movement of media with respect to workpiece; therefore, \r\nno work is (D 83 being done. This type of operation is still \r\neffective for limited applications with longer time cycles \r\nand a low quality finish. Efficiencies of Tumblers: Good for low cost, low quality finishes Good \r\nfor cutting & de-burring flat stackable work pieces Good for \r\nlow cost, low quality burnishing Deficiencies of Tumblers: \r\nLabor intense for volume processing Not effective for polishing \r\nNot effective to pre-polishing Flow-through compound system \r\nnot available More apt to get part on part impingement Will \r\nnot finish parts with deep recesses THE VIBRATORY TUB MACHINE was the next generation of mass \r\nfinishing equipment. It took the same basic idea of the tumbling \r\nmachine but created a new and more efficient means of transferring \r\nenergy from the motor to the tub. The chamber is \"U\" shaped \r\nand suspended on springs. The shaft with eccentric weights \r\nis attached to the chamber and is rotated by means of a belt \r\nand pulley attached to the motor. There are still some of \r\nthe same inherent problems in this process as in tumbling \r\nbut now we have incorporated a flow-through compound system \r\nand vibratory action for more efficiency. The VIBRATORY BOWL machine was the next generation \r\nof mass finishing and remains the most popular and most effective \r\nto date. The processing chamber is the shape of a hollowed \r\ndoughnut laying on its side. Amotor is attached to a shaft \r\nwith eccentric weights which is fixed to the bowl shaped chamber \r\nwhich is suspended on springs. The ensuing action causes the \r\nmass to travel in a three dimensional toroidal motion. This type of action allows for the most efficient \r\nprocessing of work pieces. The work chamber can almost be \r\nfilled to capacity as well as allowing the high concentration \r\nof work pieces in relationship to the mass. Efficiencies of Vibratory Bowl:"
    },
    {
      "tag": "div",
      "text": "Highest quality finish Low maintenance Allows flow-through operation Low labor cost for operating Minimizes processing load"
    },
    {
      "tag": "p",
      "text": "HIGH ENERGY BARREL MACHINES operate basically the same \r\nas tumbling barrels with one major difference - centrifugal \r\nenergy is added to the process to dramatically reduce the \r\nprocessing time. This is accomplished by mounting several \r\nbarrels in a ferris wheel type arrangement and spinning the \r\ncomplete apparatus as each barrel is rotating. Except for the extra force applied to the media \r\nand work piece, all the draw-backs of tumbling are still inherent. \r\nAn additional drawback is that the equipment now becomes very \r\nexpensive as well. Processing time is one positive feature \r\nof the apparatus. The HIGH ENERGY DISC finishing machines have been developed \r\nto take advantage of the three dimensional action of a vibratory \r\nbowl and the reduced processing time of centrifugal force \r\nmachines. The energy is transferred from a motor to a gear \r\nbox in order to rotate a central disc at the bottom of a round \r\nstationary chamber. Centrifugal force and the rotating action \r\nsends the mass outward towards the stationary wall. The mass \r\nthen slows down and returns to the center to complete the \r\ncycle. This method incorporates the ability to have \r\nflow-through processing and high energy. The major drawback \r\nto this equipment lies in the disc seal. This is the machine \r\npart that lies between the stationary bowl and rotating center. \r\nAprecision opening must be maintained so as to allow the \r\nflow-through water and debris to escape. The inherent problem \r\nis that abrasives are constantly flowing through a moving \r\nseal. This makes for a maintenance nightmare besides the high \r\ninitial expense of the equipment. Process time reduction is \r\nthe benefit derived from this equipment. The latest development \r\nin mass finishing equipment is a machine designed for the \r\nspecific purpose of burnishing. The ROLL BURNISHING machine is a completely new drive \r\nmechanism for the oldest of techniques, burnishing. This new machine is a form of high energy ball \r\nburnishing. It operates by rotating a belt in a tub shape \r\nconfiguration while submerged in a rectangular tub of water \r\nand compound. Not only does this facilitate a much faster \r\ncycle, there is also the point of impingement on all tubs, \r\nwhich has been eliminated because of the roll under effect \r\ncreated by the belt This is also the only tub style burnisher \r\nthat allows the possibility of a flow-through compound system. \r\nBeyond this, the system has a unique unload system that is \r\nincredibly labor saving. Aspecially made sieving basket is \r\nemerged into the mass and removed with just the work pieces. \r\nNo media has to ever be handled by the operator. It takes \r\nless than one minute to completely unload work pieces. The MAGNETIC PIN FINISHER has been developed to burnish \r\nthe nooks and crannies and far reaches of jewelry products. \r\nThe machine uses a motor to spin a magnet beneath a flat table. \r\nThe finishing chamber contains very fine steel needles or \r\npins with the water and compound mix. The work pieces are \r\nplaced in the chamber and covered. The cylindrical chamber \r\nis placed on top of the table. The magnets are rotated in \r\na circular path that matches the bottom of the chamber. This \r\ncauses the steel pins to stand up and rotate. The collision \r\nof the magnet driven pins with the work piece causes the mass \r\nto rotate at the same time as the pins hammer the surface \r\nof the work piece. V. MACHINE EFFECTIVENESS / COST RELATIONSHIP A. MACHINE COST EFFECTIVENESS The main purpose of mass finishing is to economize \r\nthe finishing operation of all jewelry products. Other reasons \r\nvary according to the situation. In Italy and the U.S., hand \r\nfinishing labor is very costly. In China, the labor is cheap. \r\nThe worker training and consistency are the issues . In some \r\nother countries, the main issue is the loss of gold from the \r\nraw casting to the finished product. The type of mass finishing \r\nis determined by these and other parameters:"
    },
    {
      "tag": "div",
      "text": "AVERAGE COSTS PER I CUBIC FOOT (40 LITERS) CHAMBER SIZE"
    },
    {
      "tag": "h5",
      "text": "MACHINE TYPE COST"
    },
    {
      "tag": "p",
      "text": "Tumbler $      1000 Vibratory Bowl $      4000 Vibratory Tub $      3200 High Energy Barrel $    37000 High Energy Disc $    24000 Roll Burnishing $      7000 Magnetic Pin $    17000 B. COMMON FINISHING MYTHS 1. Many customers purchase plastic \r\nmedia based on lowest cost Plastic media is made of two parts, a polyester \r\nresin bonding agent and abrasive grain. The most expensive \r\npart of the media is the resin bonding agent. In order to \r\ndecrease the cost of selling plastic media, an increase percentage \r\nof abrasive can be mixed into the media. The problem is - \r\nthe more grain, the faster the media wears, which actually \r\nmakes it more expensive to operate. Another way to decrease \r\nthe cost of selling plastic media is to use a less expensive \r\nbonding agent. Urea Formaldehyde has been used as a less expensive \r\nbonding agent, which again increases the wear rate and hence \r\nis more expensive to operate with this media. 2. Urea Formaldehyde bonded plastic \r\nmedia is cheaper to use and easier to settle out in your waste \r\nwater system Urea Formaldehyde or UF media was developed \r\nto fight the increased cost of using the standard polyester \r\nbased resin bonding agents. Because it obviously wears out \r\nfaster, some other benefit must have to be touted to over-ride \r\nthis defect. Actually its initial cost is less. It does not \r\nmake waste treatment any easier and it is more expensive to \r\noperate. 3. Ceramic cutting media costs \r\nless and wears longer This is a true statement. We see this approach \r\nquite often in the Far East. The fact is that, because the \r\nmedia is harder and does not wear out, it does not cut the \r\nsurface. If you are dealing with soft metals, as we often \r\ndo for jewelry products, ceramic media for cutting is not \r\npractical because the surface of the media \"loads up\" with \r\nmetal before it can wear to the next level of cutting. Therefore, \r\nthe media only works in a manner of burnishing the surface. 4. High energy disc finishers give \r\na better finish than Vibratory The action of both a disc finisher and a vibratory \r\nfinisher is basically the same with respect of the mass traveling \r\nin a three dimensional motion. Assuming the media and compound \r\nare the same, the only difference is t some added centrifugal \r\nforce is being used in the operation. That alone cannot produce \r\na better finish. Faster - yes, but not better. The simple \r\nfact that a particular grit media is rubbed over a work piece \r\nsurface is what defines the degree of smoothness achieved. \r\nAn example would be rubbing a 200 grit sand paper on a surface. \r\nNo matter how hard or how t it was rubbed, it still remains \r\na fact that you could not get better than 00 grit finish. 5. \"After casting, put your \r\npiece in a pin machine and it is finished\" Iheard this absurd statement from finished \r\ngoods manufacturers coming out a seminar at a trade show. \r\nThe statement may be true for the purpose of cleaning a raw \r\ncasting; however, it actually deteriorates any broad surface \r\nt needs polishing. Apin machine is strictly for pronged and \r\nrecessed as or the lowest quality bright finish. This is used \r\nto finish these hard to reach areas in conjunction with other \r\nmass finishing or hand finishing. 6. The European technique saves \r\ntime This technique is to use a plain media with \r\nno abrasive as a carrier and then to add abrasive grit for \r\n.ting. This is done in a batch operation as a slurry. Once \r\nthe first cycle complete, it is then flushed. The batch is \r\nthen run with a finer grit led and flushed again. This system \r\nsaves an unloading operation; however, it sacrifices results. \r\nFinishing by this method would be as if one took a piece of \r\npaper and a sprinkle of sand and started to rub a piece as \r\nposed to using a piece of sandpaper. Although the unloading \r\nbetween finishing steps has been eliminated, the operation \r\nitself is very inefficient. 7. The machine does not work Many times, after a manufacturer has purchased \r\na machine and has embarked on mass finishing, they call and \r\nsay \"the machine does not work\". My response is to ask several \r\nquestions: a. Did you plug the machine in? b. Did you turn \r\nthe machine on? c. Does the machine shake? or spin? If they \r\nanswer yes to all of these questions, my response is \"the \r\nmachine works\". The problem is that the technique the manufacturer \r\nis using is not producing what the manufacturer expected. \r\nHe may have been misinformed, uninformed or misdirected. It \r\nis important to remember, although mass finishing is relatively \r\nstraightforward once a process has been established, there \r\nare many variables to consider. The technology is the most \r\nimportant thing to consider when making a purchase. Just as \r\nin making a decision to purchase jewelry software, you should \r\nbe dealing with a supplier who concentrates in the industry \r\nand is always updating their technology. 8. Internal separation in a vibratory \r\nmachine saves time Some vibratory finishing machines have a built \r\nin dam that, when closed, allows the mass to rise and pass \r\nover a screen which allows the media to return into the bowl \r\nand the work pieces shake across the screen and out of the \r\nbowl. The idea seems efficient; however, in reality, there \r\nis so much variation in jewelry components that it becomes \r\na laborer's nightmare to change screens and find missing parts \r\nthat never rise over the screen. internal separation is never \r\n100% effective. It reduces the capacity of the machine and \r\nit causes longer down time for the unload cycle. An operator \r\nshould be able to unload and reload a vibratory bowl up to \r\n3 cubic feet in less than 10 minutes using an external separator. VI CONSUMER EXPECTATIONS DICTATE TECHNIQUES Ther is no best way to mass finish. The consumer \r\nwho will eventually purchase the finished jewelry product \r\nis the one who actually dictates the finishing technique to \r\nbe used by the manufacturer. For instance, let's manufacture \r\na pair of gold earrings set with diamonds. The estimated retail \r\nvalue will be $2000 US dollars and it will be sold in an upscale \r\njewelry store. The gold castings would probably be run in \r\nsome type of mass finishing cutting cycle and then hand polished \r\nwith several steps: the settings may be hand burnished and \r\nthen the stones would be hand set and, finally, hand glossed \r\nagain. Now let's use that same wax model and make a $ 100 \r\nUS dollar pair of gold earrings with a cast in CZ that will \r\nbe sold to Wal-Mart Stores. We would probably run that same \r\ngold casting through a three step mass finishing process that \r\nwould give us a \"near\" polished finish. The final operation \r\nmay be a quick hand gloss with a polishing wheel. Next, let's \r\ntake the same wax model and make a pair of gold earrings to \r\nsell one of the world's latest consumers, a Mainland Chinese \r\nlaborer. First, we will move the stone and now have a target \r\nretail of $40.00 US dollars. The manufacturer now may only \r\nhave to do a simple burnishing operation to bring up the shine \r\nand color of the gold. Each one of the above consumer has \r\na different level of expectation with regards to the product \r\nresulting in each product being processed by a different mass \r\nfinishing technique. The end result is that each consumer \r\nis equally pleased with his or her purchase. The same scenario \r\nis true for costume jewelry. There is no best way. ere are \r\nmany techniques developed for varying degrees of quality and \r\neconomy Whether the product has been stamped, cast, machined \r\nor molded be it made from precious metal, base metal, plastic \r\nor wood, there are many machines and media available for mass \r\nfinishing. The most effective to date remains the Vibratory \r\nBowl Finisher. NEW DEVELOPMENTS IN WASTE WATER TREATMENTS New developments in treating effluent have \r\nprogressed nicely from the set of jewelry mass finishing. \r\nIn the early days, environmental restrictions were tremendous \r\nhurdles to overcome for many manufacturers. In most recent \r\nyears, systems have been developed that make it a lot easier \r\nfor manufacturers to efficiently process their vibratory me. \r\nThe following are some methods currently used in many systems. 1. Polymer Flocculation 2. Filter Presses 3. Ultra Filtration 4. Resin Columns Recycling Methods The current technology now allows for the effluent to RECYCLE \r\nthru vibratory system. This eliminated the need to discharge \r\nwater while saving in compound cost at the same time. In some \r\nparts of the world, the laws are not strict enough to make \r\nthis necessary but we would hope that manufacturers will be \r\nenvironmentally responsible. Once the effluent has been treated, \r\ncostume jewelry manufacturers now must deal with the disposal \r\nof sludge waste that has been extracted from the water. This \r\nsludge has typically been defined as hazardous waste and trucked \r\naway at about $200 per drum. The latest development in WATER TREATMENT CHEMISTRY now \r\nencapsulates up to 99% of the soluble and insoluble metals \r\nfrom the effluent. The sludge, after air drying, now transforms \r\ninto cement like material. In most cases, this allows the \r\nwaste to be classified as non hazardous which allows dumping \r\nin land fills. For precious jewelry manufacturers, this simple \r\n15 minute procedure allows them to recover the most gold or \r\nplatinum ever attainable without waiting for days of natural \r\nsettling or messy evaporation techniques."
    },
    {
      "tag": "h5",
      "text": "VIII \r\nFUTURE ARTICLES"
    },
    {
      "tag": "p",
      "text": "Costume Jewelry Finishing Techniques Precious Jewelry Finishing Techniques New Developments in Waste Water Treatment Technology"
    },
    {
      "tag": "div",
      "text": "#EndEditable Lower Nav Table"
    },
    {
      "tag": "h5",
      "text": "Process Technology Equipment Media & Compounds Waste Water Treatment Precious Metal Recovery Consulting Tech Articles About Us Contact"
    },
    {
      "tag": "h1",
      "text": "BELAIR FINISHING WEBSITE CATEGORY DIRECTORY"
    },
    {
      "tag": "div",
      "text": "Home Sitemap Process Technology Finishing Equipment Burnishers Disc Finishers Drag Finishers Parts Dryers Cleaners Parts Dryers  Floor Models Parts Dryer Baskets Ultrasonic Parts Cleaners Parts Separators Multilifts Parts Separator Screens Finishing Tumblers Vibratory Tumblers Barrel Finishers Vibratory Finishers Finishing Media Wastewater Treatment Precious Metal Recovery Mass Finishing Consulting Technical Articles Guide To Mass Finishing About BelAir Finishing Contact BelAir Finishing"
    }
  ]
}