{
  "url": "http://www.bicc.de/publications/survey/2001/introduction.php",
  "content_hash": "fee3c38cb1a0dc62491539010117381c11c27a54863f5c851fc5a194e5d2b958",
  "total_blocks": 102,
  "retained_blocks": 4,
  "ignored_blocks": 98,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" InstanceBegin template=\"/Templates/content.dwt\" codeOutsideHTMLIsLocked=\"false\" Start upper table End upper table Start lower table Start table for left navigation Start table for bordering navigation Start navigation table Index Projects Publications Press Events About Us Contact End navigation table End table for bordering navigation Start table for bordering navigation search Start navigation search table Advanced \n              Search End navigation search table End outer formatting table Start table for bordering navigation Start navigation table What's \n            New? Other BICC Websites Subscribe \n            to our Newsletter Deutsche Informationen End navigation table End table for bordering navigation Start table for bordering navigation Start navigation table Print this Document End navigation table End table for bordering navigation End table for left navigation Start middle column with newsboxes InstanceBeginEditable name=\"content\" BICC \n            Conversion Survey 2001 - Introduction"
    },
    {
      "tag": "h3",
      "text": "Summing \n              up Disarmament and Conversion Events Arms Control in Crisis and Disarmament at a Turning Point?"
    },
    {
      "tag": "p",
      "text": "Today indicators for disarmament and conversion signal stagnation \n              or even a reversal for the first time in over a decade. It seems \n              that disarmament is at a turning point: arms control negotiations \n              are in a crisis; efforts at conflict prevention and conflict resolution \n              are a mixed bag of successes and failures; and conversion has slowed \n              down. Despite this there is still much conversion work ahead, especially \n              in reintegrating demobilized armed forces personnel and redundant \n              defense industry workers in Eastern Europe as well as in military \n              base redevelopment. This introduction will look at the reasons for the crisis in arms \n              control negotiations, will summarize the findings of disarmament \n              and conversion trends, will draw attention to ongoing wars and conflict \n              resolution efforts as well as to the prevailing trend of opting \n              for a military solution to conflicts, and will, finally, draw conclusions, \n              identifying possible future ways of revitalizing the disarmament \n              and conversion process. Crisis in arms control negotiations A number of failed or stagnating negotiations on weapons of mass \n              destruction symbolize the depth of the crisis in international arms \n              control. But paradoxically, up to now, the crisis of institutionalized \n              (negotiated) arms control has not led to the complete end of disarmament. \n              Arms control of the classical type between opposing blocs of military \n              alliances has been in crisis since the mid-nineties. However, in \n              contrast to negotiated arms control, disarmament can be carried \n              out either on the basis of an arms control agreement, or unilaterally. \n              Disarmament reduces military forces numerically (weapons, military \n              personnel, etc.) and/or military power and renders conversion necessary: \n              as long as financial, human and material resources are being freed \n              from the military sector, there is also a need to convert them in \n              order to avoid unnecessary social or economic effects or adverse \n              political reactions. Despite the highly visible gridlock in arms control negotiations, \n              governments have reduced their military forces substantially: weapon \n              systems have been decommissioned, troops demobilized, arms production \n              capacities reduced, military bases redeveloped for non-military \n              purposes, and military expenditures cut. The numerical reduction \n              of military forces has actually been happening until recently and \n              is continuing in a number of countries and in certain sectors, but \n              the year 2000 may prove to be a turning point in numerical, quantitative \n              disarmament. How serious is the decoupling of actual disarmament from institutionalized \n              arms control? Will governments continue to disarm unilaterally and \n              convert military resources to non-military use as they did in the \n              second half of the nineties or will this decoupling process put \n              an end to disarmament and conversion? What can arms control do to \n              curb the currently prevailing intra-state armed conflicts and how \n              effectively can it do this? What priorities are necessary to make \n              arms control a facilitator of future disarmament and conversion? Despite the crisis in arms control there have recently been successful \n              arms control agreements. Arguably, the most important one \n              was the extension of the Non-Proliferation Treaty (NPT) in May 1995 \n              and the NPT Review Conference in April/May 2000. Unfortunately, \n              this success story is called into question by the actual behavior \n              of the nuclear weapon states, who have not come to terms on a comprehensive \n              test ban or a fissile material ban, let alone complete nuclear disarmamenta \n              requirement of the NPT. Another accomplishment was the Ottawa Convention \n              banning anti-personnel mines, which took place outside the classical \n              forums of arms control. Similar efforts stimulated by the landmine \n              convention are now being undertaken to control the proliferation \n              and excessive accumulation of small arms and light weapons. Two aspects underlying the crisis of traditional \n              arms control require particular attention: the increasing military \n              dominance of the United States; and changed perceptions of military \n              threats. Hegemonic superpower Many post-Cold War arms control agreements \n              were made possible because the Soviet Union, and later Russia, were \n              in a weak position. The possible revitalization of Russia was seen \n              in the United States and NATO as a realistic option. Reductions \n              in military postures both in NATO and in Russia were therefore perceived \n              as mutually beneficial. But with the continuing disintegration of \n              the Russian military and the obvious loss of Russias status as \n              a military superpower, the US interest in strategic stability through \n              bilateral arms control diminished; the bilateral superpower relations \n              shifted to a clear and growing US dominance. Increasingly, with \n              the Soviet threat gone, the United States believes it can control \n              smaller states militarily, even if these states aim at nuclear capabilities \n              or other types of weapons of mass destruction. The US concept is \n              increasingly focusing on limiting the weapon systems of other countries \n              without limiting its own room for action as the only global military \n              power. This is most clearly illustrated by its plans for a National \n              Missile Defense system. This policy has long-term consequences. The \n              limits of classical arms control demonstrate the logic of the well-known \n              security dilemma. Wherever a hegemony exists or armaments are asymmetrically \n              distributed, arms control is likely to come to a stand-still. The \n              haves do not see an incentive to give up their superior position, \n              and stimulate arms acquisition among the have-nots just by defending \n              their superiority. Nevertheless, unilateral disarmament or regional \n              confidence-building can create trust and may instill a sense of \n              assurance, spilling over into further rounds of arms control (disarmament \n              spill-over). It is still too early to judge whether the disarmament \n              of the nineties will prove to be self-sustaining or will be reversed, \n              as some indicators tend to suggest. New military threats: new \n              forms of arms control Many countries have started to reassess military \n              threats and, consequently, the structure of their armed forces. \n              The number of long-range military interventions has increased. Multilateral \n              UN peace-keeping missions have moved to center stage in the discussion \n              of new and future military missions. Regional and internal wars \n              have become the focus of attention. This has not only entailed preparation \n              for such missions, but also required that the weapons primarily \n              used in such wars landmines, small arms and light weapons be placed \n              on the international arms control agenda. Classical arms control, as it developed during \n              the Cold War, has proved inadequate for the new situation. Clearly, \n              the central problem in wars of today is not the lack of international \n              stability but the destructiveness of the weapons and their enormous \n              cost. The most prominent example of the emerging reorientation of \n              arms control are the negotiations of the landmine convention: the \n              practice of holding on to certain types or numbers of weapon systems \n              by such countries as the United States, Russia, China and \n              India is typical of classical arms control, but to the majority \n              of countries who became party to the convention, this was unacceptable. \n              Like-minded states successfully negotiated the landmine treaty \n              in a new forum, labeled the Ottawa process. Civil society organizationsNGOs \n              became a new actor in arms control. The new combination of like-minded \n              governments and a diversified network of nationally or internationally \n              operating NGOs who made this treaty possible is the only guarantee \n              for compliance. There is no reason to be overenthusiastic. Many statesmine producers \n              as well as mine users, from the United States to Yugoslavia, from \n              Russia to Pakistan, from China to Burmaare not party to the convention. \n              Even states who are party to the convention have continued \n              to plant anti-personnel mines. Non-compliance is not punished. Certain \n              types of mines which are dangerous to people are not prohibited. \n              Moreover, additional research and development has been stimulated \n              by the landmine treaty in order to circumvent its provisions. Whether \n              similar treaties are attainable, for example in the area of small \n              arms and light weapons, will be demonstrated by the 2001 UN conference \n              on the Illegal Trade in Small Arms and Light Weapons in all its \n              Aspects. At the beginning of the new millennium, small arms control \n              has enormous scope for improvement. Yet the credibility of both \n              exporting as well as importing countries could be improved if the \n              present political declarations are underpinned by stricter regulations \n              concerning the movements of small arms. BICC findings: disarmament at a turning point? Disarmament is easier than arms control. Each government can unilaterally \n              decide to disarm and need not wait for arms control agreements. \n              This is exactly what many states did during the second half of the \n              eighties and particularly during the nineties and is confirmed by \n              BICCs measure of disarmament and the potential for conversion, \n              the BICC Conversion, Disarmament, Demilitarization and Demobilization \n              (BIC3D) Index. This gives a value of 30 for the world in 1999, indicating \n              that military sectors had shrunk by 30 percent worldwide between \n              the transition phase around the end of the Cold War and 1999. Despite this historically unique reduction in arms, military forces \n              are still enormous. Global military expenditures are estimated to \n              have amounted to US $686 billion in 1999 (in prices of 1993); the \n              present stock of major conventional weapons is still over 422,000 \n              pieces; 21.7 million military troops still serve in the worlds \n              armed forces; and almost 8 million employees work in the arms industry. \n              Thus, almost 30 million people still earn their living directly \n              and fully in the military sector. Furthermore, high-risk strategies in the field of weapons of mass \n              destruction are still applied. Military expendituresGrowing again: After several years of decline, global military expenditures \n              were on the rise again in 1999. This new development reverses a \n              trend that has seen a drastic reduction in military expenditures \n              and clearly signals a halt, or even a reversal, of disarmament and \n              conversion. Although the majority of countries are still continuing \n              to reduce their military expenditures, some of the bigger spenders \n              such as the United States, France, Germany, China, Russia, Brazil \n              and Australia increased or announced the growth of their expenditures \n              in 1999/2000. Military research and development Anti-cyclical \n              trends: Global expenditures on military research and \n              development were not as strongly affected by the sharp decreases \n              in the early nineties as other parts of the budget. While military \n              R&D expenditures in Russia were reduced dramatically, those \n              in Western market economies only shrank slightly. During the period \n              of reduced defense production in the nineties, the development of \n              new weapon technologies and weapon systems was prioritized to preserve \n              technological capabilities. R&D seems to have done the job of \n              bridging a period of reduced procurement. With the reversal in military \n              expenditures described above, R&D efforts are slowing down. \n              This could, in turn, mean new demand for conversion at military \n              labs. Industry restructuring and conversion Continued \n              internationalization at a higher level of production: After \n              the rapid worldwide decrease in military production, there is now \n              indication that the decrease has not only slowed down and stopped \n              in recent years but might have already been reversed. At least in \n              some of the major arms-producing countries, such as the United States, \n              France, the United Kingdom, Russia and Japan, production has increased \n              again. Unlike production, however, employment in the arms industry \n              has continued to decrease. After a number of mega-mergers in previous \n              years, particularly among the large arms companies in the United \n              States, attention has now turned to international cooperation agreements \n              and acquisitions. However, in the military sector, this process \n              of globalization is much less advanced than in many other industrial \n              sectors. While conversion and diversification of defense production \n              continues in smaller companies without much public attention, larger \n              companies tend to concentrate on their core defense business activities. Demobilization and reintegration The need for \n              cooperation with other programs: The number of soldiers \n              world-wide has continued to decline for the tenth year running, \n              although the process has also slowed down. From the peak of 28.8 \n              million in 1987, it was down to 21.7 million in 1999. While some \n              countries (Russia, Germany) have plans for further cuts in their \n              armed forces, demobilization programs are still ongoing in others, \n              particularly as a result of post-war rationalization (as in Cambodia, \n              East Timor and Sierra Leone). Similar programs will be required \n              if peace agreements are reached in other countries. Most post-war \n              demobilization programs are conducted simultaneously with, or as \n              an integral part of, a more general reform of the security sector \n              which includes the democratic control of the armed forces. In recent \n              years, actors in development cooperation have recognized the fact \n              that they can no longer exclude security issues, but must address \n              them as part of a strategy for sustainable development. Base closure and redevelopment Long-term redevelopment \n              tasks still ahead: The restructuring processes of \n              armed forces worldwide have greatly reduced the number of military \n              bases. This has been heavily concentrated on Europe as well as on \n              a limited number of countries elsewhere (Australia, Panama, the \n              Philippines, South Africa, the United States and Vietnam). A large \n              array of bases freed by the military still need to be redeveloped, \n              and new civil economic usage needs to be identified. Furthermore, \n              it can be expected that additional rounds of force restructuring, \n              rationalization or demilitarization processes will create new tasks \n              for base redevelopment (for example in Germany, Northern Ireland, \n              Russia, South Africa and the United States). Surplus weaponsPolitical declarations have \n              to be followed by action now: The slowing pace of \n              nuclear disarmament has increased the risk of proliferation of all \n              weapons of mass destruction. While the global market for new conventional \n              arms shrank after the political changes of 1989/90, the arms industry \n              has been sustained by an expanded market for the upgrading of used \n              weapons. From 1990 onwards, the total number of armored vehicles, \n              warships, missiles and military aircraft held by all states in the \n              world fell continuously. By 1999, it was almost 30 percent lower. \n              New initiatives to lessen the impact of contemporary wars, such \n              as the campaigns against landmines and small arms, have had some \n              success in their own terms. The issue has become high on the international \n              policy agenda. Partly in response to the growing pressure from civil \n              society, governments are increasingly addressing the threats to \n              human security posed by small arms, but, in practice, political \n              declarations have not yet been fully implemented. continued"
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable End middle column Start right column Start table for right navigation Start mouseover tables Issue areas End table for right navigation End right column End lower table InstanceEnd"
    }
  ]
}