{
  "url": "http://cas.bellarmine.edu/tietjen/Research/wooly_monkey_behavior_and_vocali.htm",
  "file_number": "28",
  "content_hash": "e0b18a17b39cee807e3941de2f897274f2355154a4a8254299e0c8417992a67e",
  "total_blocks": 383,
  "retained_blocks": 1,
  "ignored_blocks": 382,
  "blocks": [
    {
      "tag": "p",
      "text": "Wooly Monkey Behavior and Vocalizations View the PowerPoint Presentation Vocalizations\r\n& Displays in the Common Woolly Monkey ( Lagothrix\r\nlagothricha ) Lindsey Hughes Abstract Two troops of captive woolly monkeys were\r\nobserved with the aid of an 8 mm video camera and a proprietary Palm Pilot\r\nprogram. My research up to the\r\npresent will be continued, but with modifications in equipment and methods of\r\ndata. The two troops differ since\r\nTroop Iconsists of a family group with four members; the breeding male Corey,\r\nhis son Tomas and daughter Sara, and a non-breeding female named Sissi who is\r\nthe Coreys sister. The mother of\r\nTomas and Sara died while giving birth to Sara. Troop II consists of three unrelated males, with two more unrelated males\r\nwho are currently in isolation to be introduced in the near future. Troop Iis one of only two captive family troops of woolly monkeys in the\r\nworld; the other is located in London, England. The video recordings were analyzed\r\nframe-by-frame using a proprietary video digitization program. The vocalizations were recorded by the video camera as well and analyzed\r\nusing Sound Forge to make sound spectrographs, or sonograms. Aprogrammed Palm Pilot was used to record the movement and behavior of\r\nboth troops in order to make ethograms to display patterns of behavior and\r\nvocalization. The following was anticipated: 1. vocalizations\r\nwould be correlated with visual displays; 2. display function would be\r\nidentified through context; 3 individuals would be identified through harmonics\r\nin the sonograms; 4. the behavior and vocalizations of the two troops would\r\ndiffer; and 5. the behavioral analysis would be useful for maintaining and\r\nbreeding captive troops. Introduction The common woolly monkey ( Lagothrix\r\nlagothricha ), also known as Humboldt's woolly monkey, is found only in South\r\nAmerica in the Amazon River Basin of Brazil, Colombia, Ecuador, Peru, and\r\nVenezuela. They range in all canopy levels of primary rainforest as well\r\nas gallery forests, and have been found in mountainous areas and cloud forests\r\nup to 3,000 meters. The\r\nclassification of the common woolly monkey is as follows: Taxon Classification Kingdom Animalia Phylum Chordata Class Mammalia Order Primates Suborder Haplorrhini Family Cebidae Subfamily Atelinae Genus Lagothrix Species lagothricha The morphology of the common woolly monkey is similar to that of other\r\nmonkeys in the Atelinae subfamily. The\r\nwoolly monkey is the largest monkey in South America, with the female weight\r\naveraging 11 pounds and the male weight averaging 15 pounds. They have a prehensile tail that can support their full\r\nweight and is used for feeding and locomotion. Woolly monkeys can have dark brown, pale brown, dark gray, pale gray,\r\nreddish-brown, or black fur. The\r\nlimbs, tail, and head are usually darker than the back, with the face being\r\nblack and the palms of the hands and feet being pink. Slight sexual dimorphism exists including the canines, body, and head in\r\nthe males being longer than females. However,\r\nthe female's tail is longer than the male's and the female's clitoris is longer\r\nthan the males' penis, which sometimes makes it difficult to determine the sex\r\nin the wild. Humboldt's woolly monkey is primarily frugivorous, but they also feed on\r\nleaves, seeds, flowers, and some invertebrates and small mammals. In captivity they have been known to prey upon birds that fly\r\ninto their cages. The group size\r\nfor woolly monkeys averages 10-12 group members, but much larger groups are\r\nknown to exist. Subgroups sometimes\r\nform and travel independently from the larger group. Woolly monkeys are not territorial and allow group ranges to overlap and\r\nhave been known to forage alongside each other as well as other species in their\r\nfamily. The woolly monkey travels\r\nthrough the forest quadrupedally using its tail as a fifth arm. They rarely come down to the ground and, therefore, are known to be\r\nalmost totally arboreal. They even sleep 150 feet above the ground in the canopy. When on the ground, which is especially rare in the wild, they walk\r\nbipedally, using their arms and tail to balance. The tail is extremely important and is always anchored to something; it\r\nis used to pick up objects and sometimes even allows the monkeys to rest by\r\nhanging from just the tail. The social structure of the common woolly\r\nmonkey is a multi-male-multi-female group in which a hierarchy exists between\r\nthe males in the group. The\r\ndominance hierarchy is determined by play-fighting and age. The species' mating system is polygamous because each receptive female\r\nmates with every male in the group, with the most dominant males receiving the\r\nmost copulations. Because of this,\r\nthe male that succeeds in passing on his genes is the one that releases more and\r\nbetter-fit sperm per session, with multiple sessions increasing the likelihood. Therefore, every male mates with every female, but only one female is\r\ncopulated with at any given time. In\r\naddition to receiving the most copulations, the most dominant males also receive\r\nthe most social grooming and are known to protect mothers and their infants from\r\nothers in the group. In general,\r\nadult and subadult males are dominant over all other members in the group. Male woolly monkeys are philopatric, which means that the males stay in\r\nthe group in which they were born, known as their natal group, while the females\r\nleave their natal group. Female\r\ndispersion usually occurs between the ages of five and a half years to six\r\nyears, the same ages that females begin to mate. Although females begin to mate between those ages, they remain sterile\r\nand do not conceive until one to three years after they leave their natal\r\ngroups. The gestation period\r\naverages seven and a half months, or about 223 days, and the female gives birth\r\nto one young about every two to three years during the birthing season, which\r\noccurs between the months of August and December. After birth, the infants nurse from sixteen to twenty months, traveling\r\nindependently by six months. Little research on woolly monkeys exists, with the majority of the\r\nresearch focused on ecology, morphology, location, social structure, and so on. Research on the behavior and vocalizations of the common woolly monkey is\r\nalmost completely nonexistent. The\r\nresearch on woolly monkey behavior and vocalization that has been done was\r\nperformed by M. Ramirez and published through the World Wildlife Fund in 1988. His research was made into a \"dictionary\" that explained the\r\nbehavior or reason behind each vocalization, which he spelled out using human\r\nphonetics. He also explained some\r\nof the woolly monkeys' visual communication. Although thorough in some respects, his research did not investigate\r\nsequences of behavior and vocalization or analyze each individual separately\r\nwith respect to behavior and vocalization sequences. Methods My research on the common woolly monkey was\r\nconducted at the Louisville Zoo, one of only two places in the world that have a\r\ncaptive family troop. After being\r\nformally introduced to the monkeys by the head veterinarian, Iwas able to begin\r\ncollecting data. Before starting\r\nthe data collection process, Idecided to spend a few weeks observing the two\r\ntroops in order to become acquainted with the individuals. During the three weeks of strict observation, Itook notice of each\r\nbehavior and began compiling a list of the observed behaviors. This list is located in the results and discussion section. Ialso realized that not only could Itell the monkeys apart visually,\r\nbut vocally as well. After becoming familiar with the behaviors (displays) and\r\nvocalizations of the monkeys, Ibegan collecting data. The data collection consisted of a variety of\r\nmethods including the use of an 8 mm video camera to record behaviors, a mini\r\ndisk recorder to record the vocalizations, and a proprietary Palm Pilot program\r\nto record the movement and behavior of each individual in the two troops as well\r\nas the overall behavior of each troop. At\r\nfirst, Ivideotaped the woolly monkeys individually. This method was not effective because the behavior of the other woolly\r\nmonkeys could not be seen and the monkeys move extremely fast and it is\r\ndifficult to follow them around the cage. Ithen tried to videotape sections of the cage, but that did not work well either\r\nbecause Icould not differentiate between the monkeys because of the cameras\r\nbad resolution. After four hours of\r\nrecording over one month, Irealized that Ineeded a much better video camera in\r\norder to continue with the research. For\r\nmy future research Iwill have a video camera with superior resolution. The video recordings that Ihad were used to learn and practice the\r\ndigitization process. The\r\nrecordings were digitized and transferred to compact disk for later analysis. The digitized version of the video recordings could be\r\nanalyzed at 1/10 of a second, with the potential advantages including the\r\nability to record the behavior at set intervals, allowing the viewer to record\r\nthe behavior of all the monkeys in view. The mini disk recorder was used in conjunction\r\nwith the video camera. Iexperienced multiple difficulties and problems with the mini disk recorder that\r\neventually led me to discontinue using it in this project. This will be discussed further in the results and discussion section. Because Idid not have any vocalizations recorded, Idecided to use the\r\nsound from the video recordings for my vocalization analysis. Sound Forge, a computer program used for the sound analysis, enabled me\r\nto make sound spectrographs, or sonograms, on the woolly monkey vocalizations. In order to analyze just the woolly monkey vocalizations and not all of\r\nthe background noise, adjustment was required. With Sound Forge, Iwas able to\r\ndelete all of the outside and background noise that included crickets, birds,\r\ntrains, human voices, and so on. The proprietary Palm Pilot program used for recording the behaviors was\r\ncalled Pen Recorder and the program used to analyze the recordings was called\r\nPen Reviewer. Below are diagrams of\r\nPen Recorder, Pen Reviewer, and View Data. When\r\nusing Pen Recorder, Ihad to designate letters of the alphabet to the observed\r\nbehaviors. Once Istarted Pen\r\nRecorder, Iwrote the letter of every behavior that Iobserved an individual\r\ndoing until they went inside or went to sleep. This method was difficult because it was impossible to keep up with the\r\nbehaviors while having to remember which letter went with which behavior as well\r\nas write the letter and then keep going. The\r\ncollected data was viewed in Pen Reviewer under View Data, displayed above, and\r\nthen analyzed in the form of a graph, time line, and matrix, displayed below. After\r\nusing this technique for a while, Idecided to change my method of recording\r\nbecause of the above stated reason as well as the fact that certain monkeys were\r\nmore active than the others and Ihad to start and stop recording for the\r\ndifferent individuals, which does not heed good results for analysis. For my further research, Iwill be using a new method of recording\r\nbehaviors. Instead of using the\r\nproprietary Palm Pilot program, Iwill be using a tablet PC with a voice\r\nrecognition program so Ican just speak each behavior as it occurs. Results &\r\nDiscussion The individual woolly monkeys of Troop Ieach\r\nhave extremely different personalities, rank, age, relationships, etc. The family troop consists of four related individuals: Name Birth Date Age Corey 11/13/91 11\r\n      years Sissi 09/29/95 7\r\n      years & 2 months Tomas 12/01/98 3\r\n      years & 11 months Sara 12/07/00 1\r\n      year & 11 months Corey Sissi Sara Tomas Corey is the dominant breeding male and is father to both Sara and Tomas. Sissi is Corey's sister and is the dominant non-breeding female. Sissi has never had any offspring and is considered sterile. The position of the second most dominant member of the troop is currently\r\nbeing fought over between Sissi and Tomas. Because Tomas is a subadult male and Sissi is an adult\r\nfemale, he and Sissi fight over everything, from food to where to sleep. Thomas and Sara are siblings and fight and play in ways similar to human\r\nsiblings, but still show affection quite often, grooming each other and resting\r\nnext to each other. Tomas and his father Corey appear to have the closest relationship within\r\nthe group. Tomas follows Corey\r\naround, mimicking certain behaviors. When\r\nTomas and Sara are resting together or grooming each other, Corey generally\r\njoins them. Strange to human\r\nviewers, the family troop members are sexual with each other, especially Corey\r\nand Tomas and Corey and Sara. Sexuality\r\nbetween family members is surprisingly common in the primate world. According to primate research, it is quite normal for a father and son to\r\nfeel on each other's genitals and have erections when around one another. These behaviors are considered greetings and are meant to establish\r\nfriendly contact, usually occurring between adult males and juveniles of both\r\nsexes. During my observations, Inoticed that Corey and Sissi rarely interact, while the same is true for Sara\r\nand Sissi. The monkeys in the family troop have differing personalities, with Corey\r\nas the alpha male. He is the\r\nlargest monkey, with huge canines and constant eye movement that indicates a\r\nneurological disorder, though not apparent in any other way. Corey never plays and is always pacing the cage, eating,\r\ngrooming himself or others, staring at outside disturbances, or resting. Only after about a month of observation Corey appeared not to consider me\r\nan outside threat anymore, showing behaviors indicating a friendly greeting and\r\nthen calming down other group members through appeasement behaviors. This meant that Icould now observe their behavior undisturbed by\r\noutsiders. Tomas is more of a loner\r\nfor the majority of the time; shy toward outsiders, he never makes eye contact\r\nwith me, which is unlike all the others in the group. When not off by himself, Tomas is playing or play fighting with Sara,\r\nfighting with Sissi, or grooming or resting with Corey and/or Sara. Corey\r\nstaring Tomas hiding Sissi & Tomas Sissi\r\nwalking Sara eating fighting Sissi is the most unsocial member of the group, only interacting with the\r\nothers when fighting with Tomas. She\r\nis, however, active toward me, cage shaking, which is a sign that she feels\r\nthreatened, and intense staring sessions at me, most likely indicating that she\r\ndoes not approve of my presence. When\r\nnot interacting with Tomas or me, Sissi rests high up in the top of the cage,\r\nfar away from everything and everyone else. Sara on the other hand is the most active and social member of the group. Sara is always doing something, whether watching me, playing with Tomas,\r\nresting with Corey and/or Tomas, eating, playing by herself with toys, or just\r\nrunning around bipedally on the cage floor. The youngest, most curious and loving of the group, she is the one that\r\nhas tried to make contact with me the most and is the most affectionate toward\r\nothers. Below is a table listing the observed\r\nbehaviors, their description, and the individuals in which the behaviors were\r\nobserved. Behavior Description Individuals\r\n      In Which The Behavior Was Observed Eat Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Play Self\r\n      explanatory; includes biting, running, climbing, rolling around, etc. Sara,\r\n      Tomas Chestrub Rub\r\n      object against chest to scent mark; usually only done by males Corey,\r\n      Tomas, Sara Swing Self\r\n      explanatory; on ropes or around the cage Corey,\r\n      Sissi, Sara, Tomas Walk\r\n      Quadrapedally Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Fight Self\r\n      explanatory Sissi,\r\n      Sara, Tomas Groom Each\r\n      other or themselves Corey,\r\n      Sara, Tomas Walk\r\n      Bipedally Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Teeth\r\n      Chatter Dominant\r\n      male moves jaws up and down rapidly, chattering his teeth; threat display\r\n      or sexual arousal display Corey Jump Self\r\n      explanatory; on floor, up to cage or rope, etc. Corey,\r\n      Sissi, Sara, Tomas Climb\r\n      cage Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Climb\r\n      Rope Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Cage\r\n      Shake Use\r\n      all four limbs to shake the cage; threat display Corey,\r\n      Sissi, Sara Rub Use\r\n      hands to rub on each others bodies; brings appeasement and strengthens\r\n      close relationships Corey,\r\n      Sara, Tomas Bite Self\r\n      explanatory Sissi,\r\n      Sara, Tomas Grasp\r\n      With Tail Use\r\n      5 th limb to hold on to objects or pick up objects Corey,\r\n      Sissi, Sara, Tomas Stare Self\r\n      explanatory Corey,\r\n      Sissi, Sara Hump Self\r\n      explanatory Corey,\r\n      Tomas Copulation\r\n      Attempt Attempt\r\n      to copulate with another individual; practice for actual copulation;\r\n      occurs between males and females and between males Corey,\r\n      Tomas, Sara Run Self\r\n      explanatory Sissi,\r\n      Sara, Tomas Yawn Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Lick Themselves,\r\n      each other, or various objects including the floor and the cage Corey,\r\n      Sissi, Sara, Tomas Masturbate Self\r\n      explanatory Corey,\r\n      Tomas Feel\r\n      On Genitals Feel\r\n      on own or another individuals genitals; display of friendship and is\r\n      thought to bring appeasement Corey,\r\n      Tomas Reach\r\n      For Me Self\r\n      explanatory; reach out of cage to try to touch me Corey,\r\n      Sara Rest Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Sneeze Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Drink Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas Scratch Self\r\n      explanatory; usually themselves Corey,\r\n      Sissi, Sara, Tomas Hang Upside-down\r\n      with tail grasping object and supporting entire body Corey,\r\n      Sissi, Sara, Tomas Reach\r\n      Out Of Cage Self\r\n      explanatory; usually to get leaves, sticks, or other food dropped outside\r\n      of the cage Corey,\r\n      Sissi, Sara, Tomas Sit Self\r\n      explanatory Corey,\r\n      Sissi, Sara, Tomas In\r\naddition to using the video recording of the woolly monkeys for behavioral\r\nanalysis, it was also used for sound analysis. Iused a computer program called Sound Forge, which enabled me to make\r\nsound spectrographs, or sonograms, of the woolly monkey vocalizations. In order\r\nto analyze just the woolly monkey vocalizations and not all of the background\r\nnoise, adjustment was required. Using\r\nSound Forge enabled me to delete all of the outside and background noise\r\nincluding crickets, birds, trains, human voices, and so on. Iwas able to produce several sonograms from the data collected by\r\nlistening to the sounds while watching the screen and marking where Iheard\r\ncommon sounds of the woolly monkey. These\r\ncommon sounds included shrieks, squeaks, and grunts. Ithen performed a spectrum analysis, an option in Sound Forge, in order to view\r\nthe vocalizations in the form of a sound spectrograph. Although this analysis is not yet complete, it will be continued in the\r\nfuture. After more spectrographs\r\nare made and analyzed, Iwill be able to differentiate between individuals just\r\nby looking at their sonograms because it is my hypothesis that each individual\r\nproduces different sound spectrographs although they make the same\r\nvocalizations. The human ear might\r\nnot be able to differentiate between individuals when they are making the same\r\nsounds as others so this data will be useful in further vocalization research in\r\nwoolly monkey populations. The\r\nsound spectrograph below is of a squeak. [if gte mso 9]><xml>\r\n <o:OLEObject Type=\"Embed\" ProgID=\"MSPhotoEd.3\" ShapeID=\"_x0000_i1040\"\r\n  DrawAspect=\"Content\" ObjectID=\"_1110602637\">\r\n </o:OLEObject>\r\n</xml><![endif] The next sound spectrograph is of\r\na screech. The last sound spectrograph is of a grunt. For\r\nmy further research, Iwill be using a new method to record behaviors. Instead of using the proprietary Palm Pilot program, Iwill\r\nbe using a tablet PC with a voice recognition program so Ican just speak each\r\nbehavior as it occurs. The program\r\nis called Dragon records what Isay and analyzes the data in a similar manner to\r\nthat of the proprietary Palm Pilot program. Iwill also be using an Elura 40 digital video camcorder, which has\r\nsuperior resolution and sound quality combined with the ability to take digital\r\nphotographs. The camera also has a\r\nsteadier that eliminates most of the shakiness from holding the camera. The\r\nobservation of Troop II will begin when the two new unrelated male monkeys are\r\nintroduced to Monkey Island. Iwill\r\ncontinue recording more vocalizations and perform more in depth analysis using\r\nSound Forge. This research will be\r\nhelpful in teaching zoo personnel and others interested in woolly monkeys about\r\ntheir behaviors and vocalizations, as well as being useful for maintaining and\r\nbreeding captive troops."
    }
  ]
}