{
  "url": "http://www.borderlands.com/archives/arch/thermo.html",
  "content_hash": "dc5ccc9671a72412b188c04074da88f0c5b1baf3251624d6cd9b5637d0a7c53f",
  "total_blocks": 51,
  "retained_blocks": 2,
  "ignored_blocks": 49,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "p",
      "text": "THERMODYNAMICS AND FREE\r\nENERGY May 8, 1994 by Peter A. Lindemann. Reprinted from Borderlands Magazine The mainstream scientific community dismisses\r\nthe idea of \"Free Energy\" or \"Over-Unity\"\r\nmachines because they say that the behavior of such machines\r\nviolates the \"Second Law of Thermodynamics.\" The\r\npurpose of this article is to squarely face this issue from an\r\nalternative science point of view. Many engineers and inventors,\r\nworking in the alternative energy field, still mistakenly believe\r\nthat the \"Laws of Thermodynamics\" are universally true.\r\nFor them, the \"free energy\" machine can only be a\r\nclever scientific slight of hand where the machine becomes\r\n\"outlaw\", breaking some fundamental universe law. For\r\nprogress to be made in this field, the limitations and errors\r\ninherent in the \"Laws of Thermodynamics\" must be\r\nexposed. Only then will people realize that scientific\r\nexperimentation is the only reliable tool for revealing the\r\nbehavior of physical reality. In order to bring this about, it will be\r\nhelpful to quickly review some of the pivotal historical events\r\nwhich helped shape the modern scientific era with regards to\r\nthermodynamics. Before the year 1800, perpetual motion machines\r\nwere considered possible and heat was not regarded as a form of\r\nenergy. Both of these long standing assumptions, dating back\r\nthousands of years, were effectively toppled by the ideas of\r\nHermann von Helmholtz in 1847 when he postulated that\r\nsince no one had ever been able to build a working perpetual\r\nmotion machine, that just probably, it was not possible. In order\r\nto deny the possibility of perpetual motion and hold the argument\r\ntogether, he had to assume that energy in the system was being conserved . It had long been observed that mechanical devices could not\r\ntransfer energy perfectly. There was always some friction in the\r\nworking parts. Friction was not only known to impede the transfer\r\nof energy in the machine, but it was known to produce heat. In\r\norder to simultaneously explain the work loss and the heat gain,\r\nso that conservation could be satisfied, Helmholtz\r\npostulated that heat was a form of energy consisting of a small,\r\nrandom motion in the molecules of matter. He went on to speculate\r\nthat the loss of work in the machine as large scale motion was\r\nstill present as heat in the small scale motion of the molecules\r\nin the material the machine was made of. He suggested from this\r\nthat both the heat and work must be considered energy, and that\r\nit was the total that was conserved , rather than the heat\r\nor work separately. By 1850, Rudolf Clausius was able to synthesize\r\nthe work of Helmholtz, James Joule, Sadi Carnot and others to\r\nexpress a generalized statement that has become known as the\r\n\"First Law of Thermodynamics.\" It states that\r\n\"energy can be changed from one form to another, but it is\r\nneither created nor destroyed.\" By the time this thought\r\nbecame universally believed, it had totally transformed the\r\nintellectual landscape of mechanics, physics and energy dynamics.\r\nThis was a clean break from the set of thoughts and assumptions\r\nthat had come forward from antiquity. A new era in science had\r\nbegun. In understanding these historical developments,\r\nit is important to realize that besides the new theoretical\r\nexplanation about the nature of heat, all of the other data that\r\nled to the new theoretical generalizations was derived\r\nexperimentally. This can be illustrated by an observation made by\r\nSadi Carnot in his extensive work regarding the behavior of heat\r\nin machines. He states that \"in all cases in which work is\r\nproduced by the agency of heat, a quantity of heat is consumed\r\nthat is proportional to the work done; and conversely, by the\r\nexpenditure of an equal quantity of work, an equal quantity of\r\nheat is produced.\" This statement by Carnot was based on\r\nhundreds of experimental measurements. After such convincing\r\nexperimentation, it was not unreasonable for Clausius to conclude\r\nthat heat could be converted into mechanical work. It was,\r\nhowever, a theoretical leap of logic to conclude that energy, in\r\ngeneral, could be changed from one form to another. Before we go on, it is important, for our\r\npurposes, to be reminded that this new idea expressed as the\r\n\"First Law of Thermodynamics\" consists of a number of\r\noverlapping ideas and assumptions that can be expressed as\r\nfollows: 1) Perpetual motion machines are impossible 2) The nature of heat is reduced to the random\r\nmotions of molecular matter 3) Energy can be changed from one form to\r\nanother without any explanation as to how this conversion is\r\nactually accomplished in any specific case 4) Energy is not created in or destroyed by its\r\npassage through a mechanism 5) All forms of energy behave the same way All of these ideas are fundamentally inherent\r\nin \"The First Law of Thermodynamics.\" From an\r\nalternative science point of view, the experimental work of\r\nCarnot and Joule will stand for all time. It is the intellectual\r\noverlay of Helmholtz and Clausius, on this experimental work,\r\nwhere the problems are introduced. The theory of conversion and the ideas about the nature of heat will be taken up again\r\nlater in this article, after more ground work has been laid. The \"Second Law of Thermodynamics\"\r\nevolved out of further studies of the behavior of heat in closed\r\nsystems. Remarkably, there is no one statement that is\r\nuniversally recognized as the definitive expression of this so\r\ncalled \"Law\". Among the more popular statements which\r\nreflect the general understanding of the \"Second Law of\r\nThermodynamics\" are the following: \"In a closed system,\r\nentropy does not decrease\", \"The state of order in a\r\nclosed system does not spontaneously increase without the\r\napplication of work\", \"Among all the allowed states of\r\na system with given values of energy, number of particles and\r\nconstraints, one and only one is a stable equilibrium\r\nstate\", and \"It is impossible to construct a device\r\nthat operates in a cycle and produces no other effect than the\r\nproduction of work and exchange of heat with a single\r\nreservoir.\" For those who can fathom the language, these\r\nstatements clearly do not all express the same idea. Some have\r\nbroad ramifications while others are more narrowly defined. All\r\nof these statements grew out of the idea, expressed fairly well\r\nas the last statement in the series, that a perpetual motion\r\nmachine could not be made that operated on the principle of a\r\nwork/heat exchange when this process was limited to a known\r\nquantity of heat at the start. After that amount of heat was converted to work and the temperature of the reservoir was reduced to the\r\nambient temperature outside, no further work could be expected to\r\nbe produced. This is not only reasonable, but it is backed up by\r\nthousands of experiments. As long as the \"Law\" is\r\nclearly and narrowly defined as a statement that reflects upon\r\nthe behavior of heat in closed systems, this author has no\r\nproblem with agreeing completely. Problems arise, however, with some of the more\r\ngeneralized interpretations of the \"Law\" such as\r\n\"the state of order in a closed system does not\r\nspontaneously increase without the application of work.\" In\r\norder to understand why this statement is not universally true,\r\nit is important to clearly define our terms. We must understand\r\nwhat is meant by the \"state of order\" in a system, and\r\nwe must define the boundaries of the \"closure\" of that\r\nsystem. In the first case, the \"state of order\" in the\r\nsystem is generally regarded as the temperature. Understanding\r\nthis, we can rephrase this statement to say, that in a thermally\r\nisolated enclosure, the temperature will not increase unless work\r\nor energy is added to the system. Here again, by clearly defining\r\nour terms, and limiting the discussion to heat and work, we have\r\na universally true statement backed up by mountains of\r\nexperimental data. If, however, we define the \"state of\r\norder\" as a generalized \"quantity of energy\", and\r\nwe further define the \"closed system\" as the Universe,\r\nwe are led to believe that under no circumstance is it possible\r\nto create a condition where the concentration of energy will\r\nincrease spontaneously. This is not true! While it should be understood that most known\r\nchemical processes, standard electrical equipment and heat\r\ngenerally do behave this way, the Etheric Energy Field of the\r\nplanet does not. The Etheric Energy Field behaves in direct\r\nopposition to the more generalized understandings of the\r\n\"Second Law of Thermodynamics\" and this fact is backed\r\nup by considerable experimental data. One of the best documented\r\nexamples of this is the spontaneous temperature rise observed in\r\nthe \"orgone accumulator\", invented by Dr. Wilhelm Reich\r\nin 1940. Here, a simple enclosure made of alternating layers of\r\norganic and inorganic material, allows the ambient density of the\r\nEtheric Energy Field to become more concentrated in the local\r\narea, without the application of work. This new and higher\r\nenergy concentration is then reflected as a spontaneous rise in\r\ntemperature. This situation does not break the \"Second\r\nLaw\" in the narrow case, because we admit that new energy is\r\nentering the system. It does break the \"Second Law\" in\r\nthe general case because this energy is entering without the\r\napplication of external work. Reich's accumulator was designed as\r\nan attempt to shield and isolate this energy from its presence in\r\nthe environment. His data clearly showed, however, that he was\r\nnot able to isolate the energy effects inside the accumulator\r\nbecause the Etheric Energy Field easily penetrated the walls of\r\nthe enclosure. He eventually realized that with regard to Etheric\r\nEnergy Fields, it was impossible to \"close the system\"\r\nin the local sense. This is important to understand because it\r\ndirectly refutes the assumption that the universe consists only\r\nof closed systems at all levels of activity. Here then is a major problem with how the\r\nscientific community regards the \"Laws of\r\nThermodynamics.\" When the discussion is limited to the\r\nbehavior of heat in closed systems, the \"Second Law of\r\nThermodynamics\" is a well tested and accurate description of\r\nwhat happens under those circumstances. It is when it is\r\nincorrectly assumed that all forms of energy behave this way and\r\nthat enclosure of the system is possible at all levels, that\r\ngrossly false conclusions can be drawn from what started out as\r\nexperimentally derived observations. The scientific\r\ncommunity-at-large obviates these problems simply by denying the\r\nexistence of the Etheric Energy Field because it doesn't fit\r\nwithin their intellectual model. Unfortunately for them, the\r\nmounting experimental evidence is making this increasingly hard\r\nto do. Certainly, the best evidence to date of the\r\nexistence of the Etheric Energy Field and its capability of being\r\ndrawn to high concentrations without the application of work is\r\ndemonstrated by the Etheric Weather Engineering techniques\r\ndeveloped by Trevor James Constable and his Atmos Engineering\r\ngroup. As a member of this group, I have personally seen how\r\nsimple Etheric Energy projectors, that do no work in the\r\nclassical sense, can cause the etheric potentials in the\r\natmosphere to rise to such high concentrations that millions of\r\ngallons of water will precipitate from the air for hours at a\r\ntime. When these Etheric Energy projectors are\r\nmotorized, they draw a few hundred watts of electric energy. If\r\nthe rain produced is dropped behind a dam and then released\r\nthrough a hydro-electric turbine, the electrical energy gain in\r\nthe system can be enormous, on the order of 100,000 to 1. This\r\nmethod of creating \"free energy\" is a practical reality\r\ntoday. While I know of no community using this method for\r\nsupplying its energy needs, it is eminently practicable. This\r\nexample is theoretical in the sense that it has never been done,\r\nbut it is a good model of other \"free energy\" systems\r\nunder development around the world today. Because the input to motorize the Etheric\r\nEnergy projectors is electric and the output from the\r\nhydro-electric generators is electric, many people might mistake\r\nthis for a so-called \"over-unity\" system. There is\r\nnothing \"over-unity\" about this situation. Each and\r\nevery component of the machinery used in this system has\r\noperational and frictional losses. The energy tapped by the\r\nsystem is the atmospheric ether and all of the energy gain in the\r\nsystem occurs outside of the equipment. The fact that a small\r\nelectric input yields a huge electric output does not mean the\r\nsystem is operating \"over-unity. The problem with the \"over-unity\"\r\nconcept goes back to the \"First Law of Thermodynamics\"\r\nand its inherent idea about the ability to convert one\r\nform of energy into another. This assumption includes the idea\r\nthat these various conversions are accomplished at known\r\nand accepted rates of exchange. The idea of efficiency of\r\nconversion requires that the various rates of exchange are fixed\r\nand act as an upper limit for the calculation of a ratio that\r\napproaches one (100%) where the numerator of this fraction is the\r\n\"output\" and the denominator is the \"input.\"\r\nSince it is generally agreed that every machine experiences\r\nso-called losses, the idea that this ratio could be greater than\r\none is, of course, ridiculous. This, coupled with the assumption\r\nin the \"Second Law\" that all energy systems are closed,\r\n(meaning that no new energy can enter the system in-between the\r\n\"input\" and the \"output\") makes the idea of\r\nan \"over-unity\" system even more impossible than a mere\r\nperpetual motion machine. The line of logic embodied in the\r\n\"Laws of Thermodynamics\" is flawless. The problem\r\ndoesn't exist in the logic, but it does illustrate that logic\r\nalone is not enough to reveal the truth. The problem exists in\r\ncertain interpretations of these \"Laws.\" Let's go back\r\nand look at the \"First Law\" again in light of our\r\n\"over-unity\" discussion. \"Energy can be changed\r\nfrom one form to another, but it is neither created nor\r\ndestroyed.\" This seems simple enough to understand.\r\nUnderneath the surface, however, there is an assumption that this\r\nalso means that energy will not spontaneously appear or disappear\r\nfrom the system. This is also a necessary condition if conservation of energy is to be satisfied LOCALLY as well as UNIVERSALLY. This discussion becomes relevant, for instance,\r\nin describing the operation of the rotating magnet generator, the\r\nso called N-machine or Space Power Generator (SPG). Most of the\r\nimportant work in this field has been done by Bruce DePalma and\r\nParmahamsa Tewari. The following is a brief summary. The rotation\r\nof the magnet sets up two force fields that act at right angles\r\nto each other. These two force fields are the radially\r\ndistributed inertial frame of space (centrifugal force) and the\r\nintersecting axially distributed magnetic field of the rotating\r\nmagnet. The area of magnetized, polarized, inertial space appears\r\nto open up a region through which new energy can enter the\r\nsystem. When careful measurements are taken of current flows in\r\nthe generator and in the external circuit, evidence suggests that\r\nelectric charges are appearing at the periphery of the generator\r\nand disappearing at the center of the generator that do not\r\nactually pass through the generator. This experimental\r\nfinding may explain why this configuration of electric generator\r\nexperiences less mechanical drag than standard generator designs\r\nfor each unit of electrical output produced. While energy is\r\nprobably not being created or destroyed in the universal context,\r\nit is apparently appearing and disappearing from the machine\r\nduring operation in the local space. This extra energy can be\r\nused to produce useful work in external circuits. Tewari has\r\nshown that twice as much hydrogen can be generated from an\r\nelectrolysis cell run from the output of a SPG than if the cell\r\nis run directly. It is impossible to rationalize the behavior of\r\nthis style of electric generator with the ideas of simple conversion and local conservation as they are postulated in the\r\n\"First Law of Thermodynamics.\" In a standard generator, if all losses are\r\nignored for the moment, conventional theory says if 550 Ft-Lbs of\r\nwork are applied to the input shaft in one second, 746 Watts will\r\nbe delivered at the output. If I blindly believe that the\r\ngenerator simply has the mysterious ability to convert the\r\nmechanical energy into electrical energy, I don't ask the\r\nfollowing questions: what is the mechanism of this conversion?,\r\nwhere does the torque go?, and where does the electrical energy\r\ncome from? The apparent observation that the generated current\r\nproduces a motoring effect that opposes the input torque should\r\nnot be interpreted as a vindication of the conservation rule, but\r\nas an admission that this is an inefficient way to generate\r\nelectricity. The Space Power Generator experiences far less drag\r\nper unit of electrical output than a standard generator. This opens up a much larger discussion about\r\nthe validity of the conversion idea all together. Are\r\nthere actual and universal equivalents between the various forms\r\nof heat, mechanical work, and electricity? At this point, all we\r\nknow for sure are the various measurements that have been taken\r\nfrom the devices that demonstrate these energy translations. For\r\ninstance, in 1845, James Joule found that if he placed a small\r\npaddle wheel in a bucket of water, he had to apply 772.5\r\nfoot-pounds of mechanical work to spin the paddle wheel to raise\r\nthe temperature of one pound of water, one degree Fahrenheit.\r\nThis has led to very careful calculations that now set this\r\n\"universal conversion\" between mechanical work and heat\r\nat 778.26 FT-Lbs = 1 BTU. For paddle wheels in water, this is no\r\ndoubt true. But what happens if paddle wheels are not used? Is\r\nthere another method that does not use paddle wheels in water to convert mechanical work to heat that does the job better, with less\r\nexpenditure of work for the same heat gained? The answer is yes.\r\nIn fact, there are numerous patents on record to accomplish this.\r\nOne uses rotating parallel disks, not unlike the design of\r\nTesla's turbine, to heat water with less than half the mechanical\r\nexpenditure. Once again, we have entered a new scientific\r\nera where the exact equivalence between mechanical work as\r\nfoot-pounds, electrical work as watt-hours, and heat work as\r\nBTU's is not known! A wide variety of physical experiments\r\nhave demonstrated a broad range of differing energy translation\r\neffects. The intellectual edifice of Clausius' conversion idea is crumbling, and no one should allow their thinking to be\r\nconstrained by it any longer. The results of physical experiments\r\nhave all but disproved it. The \"First Law of\r\nThermodynamics\" should be seen only as an outmoded,\r\nintellectual MODEL that is not supported by all of the\r\nexperimental data. Likewise, the idea of \"over-unity\"\r\nshould be abandoned by those working on \"free energy\"\r\nsystems as it is an intellectual contradiction based both on the\r\nbelief in conversion and the ability to circumvent it .\r\n\" Over-unity\" is an oxymoron that should be removed\r\nfrom the vocabulary of the alternative science community. This brings me back to the other problem\r\npresented earlier, namely, the nature of heat itself. Is heat, as\r\nHermann von Helmholtz suggests, simply the random motion of\r\nmolecular matter, or is it something completely different, whose\r\npresence causes molecular matter to exhibit random motion? This\r\nis a very long and involved exploration that has already been\r\nhandled masterfully by Rudolf Steiner in March of 1920 and\r\npublished as his Warmth Course . I will summarize\r\nsome of these ideas briefly. The ancient's believed that there were four\r\n\"elements\" that all physical reality was composed of.\r\nThese were Earth, Water, Air and Fire. In modern language, we can\r\nrestate this as follows. There are four \"states\" that\r\nall matter appears as. These are solid, liquid, gas and heat.\r\nFrom an etheric science point of view, heat is the fourth state\r\nof matter and the transition state between matter and ether. Here\r\nis why. The only difference between the appearance of ice, water,\r\nor steam, for example, is its temperature or internal heat\r\ncondition. Heat is absolutely fundamental in all considerations\r\nregarding matter because a change in heat is the only element\r\nrequired to bring about a change of state from solid to liquid or\r\nfrom liquid to gas. In solid matter, the \"atoms\" are\r\nvery close together and they bind each other in a way that allows\r\nthem to hold their shape without being in a container. Heat can\r\nbe added to the solid and its temperature will rise,\r\ncorrespondingly, until the melting point is reached. At this\r\npoint, adding more heat does not raise its temperature, but\r\nrather causes the material to change state as the solid melts\r\ninto a liquid. Once all of the material is liquified, adding more\r\nheat once again causes the temperature to rise. In liquid matter,\r\nthe \"atoms\" are less close together and they bind each\r\nother in a way that allows the liquid to take the shape of\r\nwhatever open topped container it is put in. As more heat is\r\nadded to the liquid, the \"atoms\" move farther apart\r\nuntil the boiling point is reached. At this point, once again,\r\nadding more heat does not raise its temperature, but rather\r\ncauses the material to change state as the liquid boils into a\r\ngas. Once all of the material is gaseous, adding more heat once\r\nagain causes the temperature to rise. In gaseous matter, the\r\n\"atoms\" are so far apart that they will hold no shape\r\nat all and can only be contained by a complete enclosure. As more\r\nheat is added to the gas, the \"atoms\" become so\r\ndispersed that eventually, all that is left is the heat. The\r\nrelationships between heat, temperature, matter and state are\r\nquite complex and cannot easily be reduced to simple\r\nexplanations. Steiner's explorations of these relationships go\r\ninto great detail, forming a seamless line of logic, backed up by\r\na great deal of experimental data. Anyone interested in the\r\nnature of heat should study Rudolf Steiner's Warmth Course . While this may make no sense to people trained\r\nin mechanistic thought processes, it is much closer to the truth\r\nabout heat than the ideas of Helmholtz, with which Steiner was\r\ncompletely familiar. Helmholtz's idea that the nature of heat can\r\nbe fully described by the random motions of molecular matter is\r\nfar too simplistic. It ignores many of the well known behaviors\r\nof heat and matter as well as the existence of the Etheric Energy\r\nField. It should be considered an \"interesting\"\r\nhistorical attempt to describe heat that is not supported by all\r\nof the experimental data. For those who are not familiar with etheric\r\nscience, it might be useful to review some of the characteristics\r\nof the Etheric Energy Field at this time. The Etheric Energy\r\nField is made up of an extremely fine, mass-free fluid. Its\r\nactivity can be divided into four main levels. These different\r\naspects of the Ether have been called: the Warmth Ether, the\r\nLight Ether, the Tone (or Chemical) Ether, and the Life Ether.\r\nThe Etheric Energy Field, as a whole, penetrates all matter,\r\nflows around and through the planet in well defined ways,\r\nexhibits elastic characteristics, and spontaneously moves from\r\nlow concentrations to high concentrations before discharging.\r\nUnderstanding all of these factors has made engineering the\r\nweather a practical reality today. Many other amazing\r\ntechnologies also become possible when the ether is fully\r\nunderstood. Likewise, many aspects of today's science that are\r\nstill confusing eventually become clear. One area of the greatest confusion lies in the\r\nfield of electrical science. The entire study of what has been\r\ncalled \"static electricity\" is just a confusing\r\nencounter with the Light Ether as it behaves under certain\r\ncircumstances. When fully understood, so-called \"static\r\nelectricity\" will be seen to be neither static nor\r\nelectricity. Normal electricity always flows from high potential\r\nto low potential and usually requires metallic conductors to flow\r\nalong. On the other hand, \"static electricity\" does not\r\ndischarge in the same way, and readily moves and collects on both\r\nconductors and insulators. Because \"static electricity\"\r\nbehaves more like ether than electricity, I am going coin a term\r\nfor this form of energy when it is present in wires and circuits.\r\nI call it \"ETHERICITY\", to distinguish it from\r\nelectricity all together. In some ways, ethericity behaves like\r\nelectricity and in some ways it behaves differently. This has\r\nbeen the source of confusion. Up until now, most people have\r\nthought that there was only one kind of energy moving in\r\nelectrical style circuits. This can now change. Electric\r\nappliances are designed to run on the discharge of electric\r\npotential from high to low, as in the draining of a battery to\r\npower a load. Properly designed circuits employing ethericity run\r\nthe appliance on the charging phase, as the energy spontaneously\r\nmoves from low potential to high. Once the behaviors of\r\nethericity are clearly understood, it will be just as easy to run\r\nmotors and lights from this source as we now do on electricity.\r\nIn the 1940's, Dr. Wilhelm Reich demonstrated both lighting and\r\nmotoring effects running on the Etheric Energy Field that he\r\ntapped using his \"orgone accumulators\" and special\r\ncircuitry. But many other ways have been discovered to harness\r\nethericity. The patent office has many designs of so-called\r\n\"electrostatic\" motors on file that work quite well.\r\nThey all run on ethericity, including some powered by circuits\r\nset up between the ground and a wire suspended high in the air.\r\nMany types of capacitors will spontaneously charge up on days\r\nwith low relative humidity. This, too, is the classic appearance\r\nof ethericity. I have seen how an \"electrostatic\"\r\ngenerator failed to do anything, one humid morning, until the\r\nmoment that sunlight fell on the metallic surfaces. It then\r\njumped to life. This was one of the most convincing\r\ndemonstrations I have ever seen that \"static\r\nelectricity\" (ethericity) is related to light (the Light\r\nEther). Here then are some of the known characteristics\r\nof ethericity that engineers and inventors should understand: 1) Ethericity can be accumulated from the\r\nground or the air at almost any location 2) It can be \"reflected\" down wires\r\n(this is not conduction) 3) Flows of ethericity can be interrupted by\r\ndiodes and Mosfet type devices 4) Its potential can be raised or lowered in\r\nair core transformers 5) It can be stored in capacitors 6) It will operate neon style lighting, when\r\nthe potential is high enough 7) It can create fields of opposing forces in\r\ncoils and motor windings \"Free energy\" is here in the Etheric\r\nEnergy Field. Etheric Energy can be accumulated without the\r\nexpenditure of work, and then released in controlled ways to\r\nperform work, in properly engineered systems. Understanding this\r\nfact presents engineers and inventors the clearest and most\r\ndirect path to follow. Systems that precipitate heat directly\r\nfrom the ether have already been demonstrated in Dr. Reich's\r\naccumulator. Placing one of these accumulators over a moving body\r\nof water increases the precipitation of heat dramatically. This\r\nis a rich vane of truth waiting to reveal its secrets to the\r\nsystematic researcher. Likewise, power circuits that run on\r\nethericity for lighting and motive power are waiting to be\r\nperfected. Researchers in the \"free energy\"\r\nfield should not concern themselves with the ideas presented as\r\nthe so-called \"Laws of Thermodynamics\". The \"First\r\nLaw\", with its ideas of conversion and conservation, is\r\nessentially incorrect. There is no way to convert mechanical\r\nenergy into etheric energy, actually make one into the other.\r\nThis one example is enough to disprove the universal\r\ninterpretation of the conversion idea all together. Beyond this,\r\nthe energy forms that can be transmuted by the action of certain\r\nkinds of machines, apparently do so within a wide range of\r\nactivity, depending on the geometry of the machine. This throws\r\ninto question the idea of conservation, especially local\r\nconservation. These experimental findings render the \"First\r\nLaw\" without any basis in fact. The real universe does not\r\nbehave in accordance with these ideas. In the narrow case, the \"Second Law\"\r\nis really only a statement which describes the behavior of heat\r\nunder certain circumstances. This much is basically true, as it\r\nis founded on experimental observation. In the general case,\r\nhowever, the \"Second Law\" is an intellectual\r\nextrapolation that does not accurately describe the behavior of\r\nphysical reality under all circumstances. It embodies an\r\nerroneously concept of a mechanical universe which mysteriously\r\nburst forth (Big Bang) as a fully wound spring that has been\r\nunwinding ever since (\"in a closed system, entropy does not\r\ndecrease\"). It is a lifeless, empty vision that ignores the\r\nSource of the energy it started with and closes the minds of its\r\nadherents to the solutions at hand. Learning how to tap the non-thermodynamic\r\nforces in nature is the hope of the future. A modern society\r\nneeds light, heat, and motive power, all of which can be derived\r\ndirectly from the Etheric Energy Field without consuming limited\r\nphysical resources owned by monopoly interests. In this society, theoretical science has been\r\nelevated to a very high level of prestige. Under this system of\r\nbelief, the real needs of humanity have not been well served. It\r\nis time that these incorrect theories be carefully examined and\r\ndiscarded, so that experimental science can once again take the\r\nleading role in defining the nature of physical reality. Only\r\nthen will Etheric Science be free to offer its bounty of\r\nsolutions to a desperate and waiting world. Bibliography 1) The Cancer Biopathy by Dr. Wilhelm\r\nReich 2) Man or Matter by Ernst Lehrs, Rudolf\r\nSteiner Press 3) The Cosmic Pulse of Life by Trevor\r\nJames Constable, Borderland Sciences 4) Warmth Course by Rudolf Steiner,\r\nMercury Press 5) Cosmic Formative Forces by Guenter\r\nWachsmuth, Borderland Sciences 6) The Vril Compendium by Gerry\r\nVassilatos, Borderland Sciences 7) Loom of the Future by Trevor James\r\nConstable, Borderland Sciences"
    }
  ]
}