{
  "url": "http://www.britishsoftdrinks.com/htm/qa/Packaging/Packaging.htm",
  "content_hash": "f5614b709c937ba9d58c09274baebd4faa2049eedc068b4a79fe75447edafba5",
  "total_blocks": 270,
  "retained_blocks": 5,
  "ignored_blocks": 265,
  "blocks": [
    {
      "tag": "div",
      "text": "#BeginTemplate \"/Templates/qa-template.dwt\" DW6 Q&As introduction additives \n                    and ingredients bottled \n                    water draught \n                    dispense environment facts \n                    and figures fruit \n                    juice fruit \n                    juice authenticity health \n                    and diet jobs \n                    and careers labelling signpost \n                    labelling packaging prices glossary vending"
    },
    {
      "tag": "p",
      "text": "account \n                      queries contact \n                      us"
    },
    {
      "tag": "div",
      "text": "#BeginEditable \"textsv\" Packaging"
    },
    {
      "tag": "p",
      "text": "Is \n              the packaging used for soft drinks recyclable? All \n              packaging used by the soft drinks industry can be recycled and/or \n              re-used to make other useful products. For example: aluminium \n                cans are recycled and used with raw material to produce new batches \n                of cans; plastic bottles \n                can be used to make fleece textile products, fibre filling and \n                street furniture; glass bottles \n                can be reused or recycled to use in the production of new glass; \n                and paper and \n                board is recycled to produce tissue, paper bags, chip board, briefcases \n                and office furniture. What do soft \n              drinks companies do to reduce the amount of materials they use to \n              contain their products? The \n              soft drinks industry is at the forefront of packaging innovations \n              and is constantly looking at ways to reduce the amount of raw materials \n              used in various types of packaging. This process of \"lightweighting\" \n              means that not only are fewer materials being used, but savings \n              are also being made in terms of the energy required for the manufacture \n              and distribution of products. Today, the average can uses 35% less \n              aluminium than 10 years ago, with steel cans containing 50% less \n              steel and average PET plastic bottles containing 25% less PET. What are \n              the most popular types of packaging used to make soft drinks? The \n              main forms of packaging used by the soft drinks industry are: glass bottles plastic including \n                PET (Polyethylene terephthalate), PVC (Polyvinyl chloride), HDPE \n                (High density polyethylene), cups (made from polystyrene and polyethylene), \n                pouches (low density polyethylene) cans including \n                aluminium and steel paper such \n                as cartons Drinks come \n              in many different types of packaging. Why are certain products packaged \n              in some forms and not others? When \n              manufacturers are considering packaging for a soft drink they need \n              to consider the functions of packaging to ensure that the products \n              reach the consumer in the best possible condition. The functions \n              of packaging are to contain, protect, identify and sell the product \n              bearing in mind the impact upon the environment and the costs involved. Certain \n              packaging is more suitable for certain types of product than others \n              when you consider the above criteria. A summary of the various attributes \n              and disadvantages of the main forms of packaging when looking at \n              their functions is detailed here in PDF \n              format . What have \n              been the most important developments in terms of packaging for the \n              soft drinks industry? There \n              have been many varied developments in terms of packaging ranging \n              from lightweighting of different packaging, to the introduction \n              of new materials. For example the glass bottle is the traditional \n              soft drinks container. Originally this was heavy and bottle shape \n              was limited. Improvements in glass bottle design resulted in the \n              introduction of the lightweight glass bottle. Since \n              then the industry has enjoyed the introduction of PVC and PET bottles, \n              which enabled moulding of the bottles into various shapes, and the \n              advent of the aseptic filled paper carton. In addition to this there \n              has been the introduction of various closure systems to meet the \n              needs of customers for the different forms of packaging. Useful \n              web links - General Department \n                    of Trade and Industry www.dti.gov.uk European \n                    Council for Packaging and the Environment www.europen.be Food \n                    Standards Agency www.foodstandards.gov.uk Institute \n                    of Grocery Distribution www.igd.org.uk Industry \n                    Council for Packaging & the Environment www.incpen.org Valpak www.valpak.co.uk Useful \n              web links - Cans Aluminium \n                    Packaging Recycling Organisation www.alupro.org.uk The \n                    Can Makers Information Service www.canmakers.co.uk Steel \n                    Can Recycling Information Bureau www.scrib.org Useful \n              web links - Cartons Alliance \n                    for Beverage Cartons & the Environment www.ace.be www.wastewatch.org.uk Useful \n              web links - Glass British \n                    Glass www.britglass.org.uk Useful \n              web links - Plastic British \n                    Plastics Federation www.bpf.co.uk Recycling \n                    of Used Plastic Containers www.recoup.org #EndEditable"
    },
    {
      "tag": "div",
      "text": "www.toolshack.com web tools statistics hit counter code // End www.toolshack.com statistics web tools hit counter code #EndTemplate"
    }
  ]
}