{
  "url": "http://ceep.crc.uiuc.edu/poptopics/gradeconfig.html",
  "file_number": "30",
  "content_hash": "698835a0ac54c3185b5a465d5402ddff604be9e142b9337c5b67605d1b96a198",
  "total_blocks": 233,
  "retained_blocks": 34,
  "ignored_blocks": 199,
  "blocks": [
    {
      "tag": "div",
      "text": "Home About CEEP Popular Topics Publications ERIC/EECE Archive Questions Search ECRP Journal"
    },
    {
      "tag": "p",
      "text": "Early Childhood Research & Practice ( ECRP ) is a bilingual Internet  journal on the development, care, and education of young children."
    },
    {
      "tag": "div",
      "text": "The Clearinghouse on Early Education and Parenting (CEEP) is part of the the Early  Childhood and Parenting (ECAP) Collaborative at the University of Illinois at Urbana-Champaign. CEEP provides publications and information to the worldwide early childhood and parenting communities. Return: Home > Popular Topics #BeginEditable \"title\" Grade Configuration in K-12 Schools #EndEditable #BeginEditable \"author\" Nancy McEntire #EndEditable #BeginEditable \"date\" 2002 (Last updated May 2005) #EndEditable #BeginEditable \"intro\" Many educators and communities are searching for evidence on the best way to provide a high-quality education for their children and to make the best use of their education funds. One area that is of perennial interest is how to best configure the grades in local schools. Public education in the United States provides for kindergarten through grade 12 in a variety of grade arrangements, from the K-12 school to separate schools for single grades. Unfortunately, as Paglin and Fager (1997) point out: \"Research has not provided definitive answers to the myriad possible questions about grade span, but the questions have never gone away. They are questions which arise whenever school reform, increasing or declining enrollment, or financial considerations bring about a reorganization of existing schools, the building of new schools, or consolidation of districts\" (p. 2). Much of the research available has been done on rural or middle schools. The research on the \"best\" grade configuration is inconclusive. At best, it indicates factors to be considered in deciding on a school's grade span or a community's configuration of grades within its elementary and secondary school system. #EndEditable Contents #BeginEditable \"optional\" How do schools differ in grade configuration? Single-grade-level configurations Other grade-level configurations: Middle schools, K-12 How do grade configurations affect transitions? What factors do school districts consider when deciding on grade configuration? References Web Resources ERIC Resources #EndEditable #BeginEditable \"body\""
    },
    {
      "tag": "h2",
      "text": "How \r\n              do schools differ in grade configuration?"
    },
    {
      "tag": "p",
      "text": "Schools in \r\n              the United States are organized in different ways: some schools \r\n              include K-3, K-4, K-5, K-6, K-8, K-9, or K-12; others are organized \r\n              as middle schools, junior high schools, and senior high schools; \r\n              and still others consist of students in just one grade, such as \r\n              a kindergarten center or a ninth-grade center. Some schools include \r\n              pre-kindergarten. The U.S. Department of Education's National Center \r\n              for Education Statistics (2002) provides data on the number of regular \r\n              public school districts providing instruction and the percentage \r\n              of students in membership, by grade span and by state, for the school \r\n              year 2000-2001 ( http://nces.ed.gov /pubs2003/2003310.pdf , \r\n              Table 3)."
    },
    {
      "tag": "h2",
      "text": "Single-grade-level \r\n              configurations"
    },
    {
      "tag": "p",
      "text": "The literature \r\n              suggests that some school districts have found advantages to schools \r\n              that contain students at one grade level, although these advantages \r\n              are not necessarily supported by research (Reents, 2002):"
    },
    {
      "tag": "div",
      "text": "A single-grade \r\n                center, such as a school only for ninth-graders, can develop programs \r\n                specific to the needs of that age group. Siphoning \r\n                off students from several schools can relieve overcrowding at \r\n                those schools. Students \r\n                may be able to participate on an equal level in more activities \r\n                and be less influenced by older students. The greater \r\n                number of students in single-grade centers may enable the school \r\n                to increase course offerings."
    },
    {
      "tag": "p",
      "text": "The literature \r\n              also suggests some possible disadvantages to separate single-grade \r\n              configurations (Hopkins, 1997):"
    },
    {
      "tag": "div",
      "text": "The cost \r\n                and length of student travel increases, particularly in a school \r\n                district that covers a large area. Parent involvement \r\n                may decrease, possibly affected by the distance to the school \r\n                and the number of schools a family's children attend. Students \r\n                are required to make an increased number of school transitions. Fewer opportunities \r\n                are provided for interaction between age groups."
    },
    {
      "tag": "p",
      "text": "Hopkins (1997) \r\n              also suggests some additional factors for school districts to consider:"
    },
    {
      "tag": "div",
      "text": "Combining \r\n                schools into separate grade centers may affect whether neighborhood \r\n                schools close or remain open. Current \r\n                buildings may have a design more suitable for several grade levels. School population \r\n                may increase or decrease substantially as configurations change."
    },
    {
      "tag": "h2",
      "text": "Other \r\n              grade-level configurations: Middle schools, K-12"
    },
    {
      "tag": "p",
      "text": "\"Much \r\n              of what has happened with regards to school grade structure can \r\n              be attributed to the development of the middle school\" (Franklin \r\n              & Glascock, 1996, p. 4). The separation of students in grades \r\n              5 or 6 to 7 or 8 in middle schools is justified by some school districts \r\n              because districts believe that middle schools better meet the developmental \r\n              needs of preadolescents. As Howley (2002) points out, the developmental \r\n              needs of young adolescents differ from those of elementary school \r\n              children and older teenagers. \"Developmentally responsive middle \r\n              schools must take into account all that is known about young adolescents \r\n              and the cultural context in which they live\" (Lounsbury, 1996). \r\n              The number of middle schools increased by 35% from 1967 to 2000 \r\n              ( http://nces.ed.gov/programs/digest/d01/dt095.asp ). In the past \r\n              decade, researchers also have demonstrated renewed interest in schools \r\n              that include grades kindergarten through 12. A study of rural schools \r\n              that examined the relationship between grade configuration and student \r\n              achievement in Louisiana found that students in K-12 rural schools \r\n              did as well or better on achievement tests as students in separate \r\n              elementary, middle, or high schools. Students in high poverty areas \r\n              also did better in the K-12 schools (Franklin & Glascock, 1996). \r\n              A similar study in Texas analyzed data from a study of 1001 Texas \r\n              high schools, including 116 K-12 schools. This study produced similar \r\n              results (Bickel, Howley, Williams, & Glascock, 2000)."
    },
    {
      "tag": "h2",
      "text": "How \r\n              do grade configurations affect transitions?"
    },
    {
      "tag": "p",
      "text": "The division \r\n              of elementary schools into configurations that include fewer grades \r\n              requires that students make several transitions from one school \r\n              to another. Researchers note that transitions can be stressful for \r\n              students:"
    },
    {
      "tag": "div",
      "text": "Alspaugh \r\n                (1999) found a significant achievement loss during each transition \r\n                year. He also found that some students regain what is lost in \r\n                the following year, but it would seem that students who make fewer \r\n                transitions need fewer years to make up for achievement losses \r\n                caused by transitions. Another \r\n                study found that each time students switched schools, their feelings \r\n                of anonymity increased. Researchers who found that sixth-grade \r\n                students in both elementary and combination K-12 schools outperformed \r\n                students in middle schools or junior high schools considered the \r\n                number of transitions a significant factor. This study considered \r\n                8 schools with 7 different grade spans with student populations \r\n                of 82 to 1,200. The schools were located in both urban and rural \r\n                settings in 5 northwest states. The number of grades in the schools \r\n                ranged from 1 to 11 (Paglin & Fager, 1997). Another \r\n                research study found that girls in early adolescence suffered \r\n                from a drop in self-esteem, extracurricular participation, and \r\n                leadership behaviors when they made the transition into middle \r\n                school or junior high, but not if they remained in an elementary \r\n                school setting. This study found that the effects of this transition \r\n                lingered throughout the school years. For boys, the study found \r\n                similar negative effects in extracurricular participation and \r\n                grades, but not in self-esteem, when they made the transition \r\n                into middle school or junior high. The authors concluded that \r\n                the relatively protected elementary school setting made the entry \r\n                into adolescence less stressful for both boys and girls. The students \r\n                who had not had the stress of the earlier transition seemed to \r\n                cope better with the transition into high school than did other \r\n                students (Simmons & Blyth, 1987). Franklin \r\n                and Glascock (1996) found that sixth-grade boys experienced more \r\n                suspensions in middle schools or junior high schools than in elementary \r\n                schools, possibly related to the effects of the transition, the \r\n                school organization, or school size. This study was based on information \r\n                gathered from all Louisiana public schools during the 1992-1993 \r\n                school year."
    },
    {
      "tag": "h2",
      "text": "What \r\n              factors do school districts consider when deciding on grade configuration?"
    },
    {
      "tag": "p",
      "text": "Researchers \r\n              at the Northwest Regional Educational Laboratory looked at eight \r\n              schools with seven different grade spans. They examined the history \r\n              of each school's decision on grade configuration along with observed \r\n              advantages and disadvantages of each configuration and principals' \r\n              comments on the success of their programs (Paglin & Fager, 1997). \r\n              Based on this research, Paglin and Fager compiled a list of nine \r\n              factors that school districts might want to consider when making \r\n              decisions about grade configurations of individual schools:"
    },
    {
      "tag": "div",
      "text": "the cost \r\n                and length of student travel, particularly in a school district \r\n                that covers a large area a possible \r\n                increase or decrease in parent involvement, possibly affected \r\n                by the distance to the school and the number of schools a family's \r\n                children attend the number \r\n                of students at each grade level, which may affect class groupings \r\n                and courses offered the effect \r\n                of school setting on achievement, particularly for grades 6-9 effect on \r\n                whether the neighborhood schools close or remain open the number \r\n                of school transitions for students the opportunities \r\n                for interaction between age groups the influence \r\n                of older students on younger students the building \r\n                design-is it suitable for only a few or for several grade levels?"
    },
    {
      "tag": "p",
      "text": "Paglin and \r\n              Fager concluded that designing a school system to use a particular \r\n              span of grades in individual schools will not in itself guarantee \r\n              that students will learn well and be well adjusted."
    },
    {
      "tag": "h2",
      "text": "References"
    },
    {
      "tag": "p",
      "text": "Alspaugh, John \r\n              W. (1999). The interaction effect of transition grade to high \r\n              school with gender and grade level upon dropout rates . Montreal: \r\n              American Educational Research Association. (ERIC Document No.ED431066) Bickel, Robert; \r\n              Howley, Craig; Williams, Tony; & Glascock, Catherine. (2000, \r\n              November). Will the real \"Texas miracle in education\" \r\n              please stand up? Grade span configuration, achievement, and expenditure \r\n              per pupil . Randolph, VT: Rural School and Community Trust. (ERIC \r\n              Document No. ED447995) Franklin, Bobby \r\n              J., & Glascock, Catherine H. (1996, October). The relationship \r\n              between grade configuration and student performance in rural schools . \r\n              Paper presented at the Annual Conference of the National Rural Education \r\n              Association, San Antonio, TX. (ERIC Document No. ED403083) Hopkins, Gary. \r\n              (1997, September 8). Grade configuration: Who goes where? Education \r\n              World [Online]. Available: http://www.education-world.com/a_admin/admin017.shtml Howley, Craig. \r\n              (2002, March). Grade-span configurations. American Association \r\n              of School Administrators [Online]. Available: http://www.aasa.org/publications/saissuedetail.cfm?ItemNumber=1790&snItemNumber=950&tnItemNumber=951 . Lounsbury, \r\n              John H. (1996). Key characteristics of middle level schools [Online]. ERIC Digest. Champaign, IL: ERIC Clearinghouse on Elementary \r\n              and Early Childhood Education. (ERIC Document No. ED401050). Available: http://ceep.crc.uiuc.edu/eecearchive/digests/1996/louns96.html . National Center \r\n              for Education Statistics. (2002). Directory of public elementary \r\n              and secondary education agencies, 2000-2001 [Online]. Available: http://nces.ed.gov/pubs2003/2003310.pdf . Paglin, Catherine, \r\n              & Fager, Jennifer. (1997, July). Grade configuration: Who \r\n              goes where [Online]. Available: http://www.nwrel.org/request/july97/index.html ."
    },
    {
      "tag": "div",
      "text": "Reents, Jennifer \r\n            Newton. (2002, March). Isolating 9th graders. School Administrator [Online]. Available: http://www.aasa.org/publications/saarticledetail.cfm?ItemNumber=2668"
    },
    {
      "tag": "p",
      "text": "Simmons, Roberta \r\n              G., & Blyth, Dale A. (1987). Moving into adolescence: The \r\n              impact of pubertal change and school context . Hawthorne, NY: \r\n              de Gruyter."
    },
    {
      "tag": "h2",
      "text": "Web \r\n              Resources"
    },
    {
      "tag": "p",
      "text": "The Academic \r\n              Effectiveness of Small-Scale Schooling (An Update) http://www.ericdigests.org/1995-1/small.htm Age Appropriate \r\n              Schools http://www.djainc.com/ageappropriateschools.pdf The Case for \r\n              the Elemiddle School http://www.naesp.org/ContentLoad.do?contentId=534 Elementary \r\n              Grade Configuration Report, Frost and McCoy Elementary Schools This report contains research and recommendations on the grade configuration \r\n              of two elementary schools. Key points of considerations include: \r\n              transportation costs, parent involvement, staffing, special programs, \r\n              educational equity and diversity, assessment of existing facilities, \r\n              and budget implications. http://www.georgetownisd.org/filing_cabinet/curriculum/ ElementaryGradeConfigurationReport.pdf Elementary School Grade Span Configuration: New Evidence on Student Achievement,\r\n              Achievement Equity, and Cost Efficiency http://phkhome.northstarnet.org/ikepto/GradeCenterReport.htm Grade Configuration http://www.edfacilities.org/rl/grade_configuration.cfm Grade Configuration: \r\n              Who Goes Where? ( Education World ) http://www.education-world.com/a_admin/admin017.shtml Grade Configuration-Who \r\n              Goes Where (full-text report from the Northwest Regional Educational \r\n              Laboratory) http://www.nwrel.org/request/july97/article2.html Grade Configuration \r\n                Study Committee Final Report (Hopkinton, MA) http://www.hopkinton.k12.ma.us/schoolcommittee/Plans/Gradeconfig.pdf Grade-Level \r\n              Configurations http://www.aasa.org/publications/saissuedetail.cfm?ItemNumber=1790 Grade Span \r\n              (ERIC Clearinghouse on Educational Management) http://eric.uoregon.edu/trends_issues/organization/grade_span.html Grade Span \r\n              Configurations http://www.aasa.org/publications/saarticledetail.cfm?ItemNumber=2672 Grade Span \r\n              Configurations and Reconfigurations: With Rural Dilemmas in Mind http://oak.cats.ohiou.edu/~howleyc/gradespan1b.htm High School \r\n              Size, Achievement Equity, and Cost: Robust Interaction Effects and \r\n              Tentative Results http://epaa.asu.edu/epaa/v9n40.html The Hobbit Effect: Why Small Works in Public Schools http://www.ruraledu.org/site/apps/nl/content3.asp?c=beJMIZOCIrH&b= 1842453&ct=2907931 In the Middle: \r\n              Characteristics of Public Schools with a Focus on Middle Schools http://nces.ed.gov/programs/quarterly/vol_2/2_3/elem_middle.asp K-8 Schools: \r\n              An Idea for the New Millenium? http://www.educationworld.com/a_admin/admin115.shtml The (Limited) Evidence Regarding Effects of Grade-Span Configurations on Academic Achievement: What Rural Educators Should Know. ERIC Digest. http://www.ael.org/digests/edorc02-2.pdf Middle School Goes the Way of Junior High http://www.baltimoresun.com/news/local/bal-md.edbeat02jun02,0,2542113.column[Editor's note (4-25-06): this url is no longer active.] Motivation and Middle School Students http://ceep.crc.uiuc.edu/eecearchive/digests/1998/anderm98.html NMSA (National \r\n              Middle School Association) Research Summary #1: Grade Configuration http://www.nmsa.org/Research/ResearchSummaries/Summary1/tabid/252/Default.aspx NMSA (National \r\n              Middle School Association) Research Summary #8: Grade 5 in the Middle \r\n              School http://www.nmsa.org/Research/ResearchSummaries/Summary8/tabid/261/Default.aspx"
    },
    {
      "tag": "div",
      "text": "Number of Regular Public School Districts Providing instruction and Percentage of Students in Membership, by Grade Span and by state: School year 2000-01 http://nces.ed.gov/programs/quarterly/vol_4/4_3/3_4_t1.asp#table-4"
    },
    {
      "tag": "p",
      "text": "Public Elementary \r\n              Schools, by Grade Span and Average School Size, by State: 2000-2001 \r\n              Table 3 (To view this table, click on Table 3 under Summary Tables.) http://nces.ed.gov/pubs2003/2003310.pdf The Relationship Between Middle Level Grade Span Configuration, Professional Development, and Student Achievement http://www.nmsa.org/research/rmle/spring04/pdf/article_1.pdf [Editor's note (12-14-05): this url is no longer active.] Research about \r\n              School Size and School Performance in Impoverished Communities. \r\n              ERIC Digest http://www.ericdigests.org/2001-3/size.htm Research Summary on Grade Level Configurations http://www.nsba.org/site/doc.asp?TrackID=&SID=1&DID=9534&CID=282&VID=2 Revival of \r\n              the K-8 School http://www.aasa.org/publications/saissuedetail.cfm?ItemNumber=1790&snItemNumber=950&tnItemNumber=951 The Rise of the ‘Elemiddle’ School http://www.aasa.org/publications/saarticledetail.cfm?ItemNumber=984&snItemNumber=950&tnItemNumber=951 Schools by Type: State of California, 2002-03 Schools vary in their grade-level configuration. Most elementary schools encompass K-5, middle schools 6-8, junior high 7-9, and high schools 9-12 http://www.ed-data.k12.ca.us/ profile.asp?level=04&reportNumber=16#schoolsbytype The Transition \r\n              to Middle School http://ceep.crc.uiuc.edu/eecearchive/digests/1998/schuma98.html Education World: \r\n              Where Does Sixth Grade Belong? http://www.education-world.com/a_admin/admin060.shtml"
    },
    {
      "tag": "h2",
      "text": "ERIC \r\n              Resources"
    },
    {
      "tag": "p",
      "text": "How to Obtain ERIC Documents and Journal Articles: References identified with an ED (ERIC document), EJ (ERIC journal), or PS number are cited in the ERIC database. ERIC Documents (citations identified by an ED number) may be available full text from ERIC at no cost at the ERIC web site: http://www.eric.ed.gov/ . Journal articles are available from the original journal, interlibrary loan services, or article reproduction clearinghouses. ERIC Search \r\n              using identifier \"Grade Span Configuration,\" or descriptors \r\n              \"Instructional Program Divisions\" or \"School Organization.\" \r\n              Various grade levels, such as K-2 or 3-5 or 6-8 or 9-12, can be \r\n              used as keywords in combination with the identifier or descriptors. If you would \r\n              like to conduct your own free ERIC database searches via the Internet, \r\n              please go to http://www.eric.ed.gov/ERICWebPortal/Home.portal?_ nfpb=true&_pageLabel=ERIC_Search ."
    },
    {
      "tag": "h3",
      "text": "Grade Configuration"
    },
    {
      "tag": "p",
      "text": "ERIC database search through 05/2005 ED479332 TM035136 Title: The Effect of Grade Span Configuration and School-to-School Transition on Student Achievement. Author(s): Wren, Stephanie D. Pages: 18 Publication Date: 2003 Available from: EDRS Price MF01/PC01 Plus Postage. Language: English Document Type: Reports--Research (143) Geographic Source: U.S.; Michigan Journal Announcement: RIEAPR2004 The effect of grade span configuration (grouping of grades in schools) and school-to-school transition on student achievement was investigated. The Michigan Education Assessment Program test was used to collect data on the passing rate of students in 232 schools in a large urban inner city school district in the midwest. The results indicate that grade span configuration and school-to-school transition had significant positive and negative effects on student achievement respectively. The paper discusses implications for school districts. (Author) Descriptors: *Academic Achievement; Elementary Secondary Education; *Grade Span Configuration; *Instructional Program Divisions; State Programs; Testing Programs; Transfer Students; Urban Schools Identifiers: Michigan Educational Assessment Program; *Transition Time EJ640942 EA539336 Title: Revival of the K-8 School. Author(s): Pardini, Priscilla Source: School Administrator, v59 n3 p6-12 Mar 2002 Publication Date: 2002 ISSN: 00036-6439 Language: English Document Type: Journal articles (080); Reports--General (140); Reports--\r\n  Descriptive (141) Journal Announcement: CIJJUL2002 Describes the reasons for renewed interest in the K-8 school model, including dissatisfaction with middle schools, research linking improved academic achievement with K-8 grade configuration, and parent support. Includes examples of districts that have converted middle schools to K-8 schools. Identifies the challenges districts face in moving to K-8 schools. (PKP) Descriptors: Educational Research; Elementary Education; *Elementary Schools; Middle Schools; *School Restructuring ED473710 PS031086 Title: Update on the Relationship between Elementary Grade Span \r\n              and Student Achievement: Identification of Human Interactions and \r\n              Behaviors in a Kindergarten-2nd Grade Configured Young Primary Elementary \r\n              Which Resulted in Superior Student Achievement Observed in the 4th \r\n              and 5th Grade. Author(s): Norwood, H. S. Publication Date: December 15, 2002 Available from: EDRS Price MF01/PC02 Plus Postage. Language: English Document Type: Reports--Research (143) Geographic Source: U.S.; Alaska Journal Announcement: RIEOCT2003 This cross-sectional \r\n              study used primarily quantitative methods to investigate the superior \r\n              achievement of 4th- and 5th-grade students at Alaska's Kenai Peninsula \r\n              Borough School District who as young elementary students had attended \r\n              K-2 primary school, compared to peers who had attended a K-6, K-8, \r\n              or K-12 configured school. Since this study was limited to a single \r\n              school district that included all four elementary school configurations \r\n              in communities that were found to be similar, variables that historically \r\n              confuse the application of results to conclusions were systematically \r\n              eliminated as causal factors. To study the effect of the remaining \r\n              variables on student outcome, educational instructors that had experience \r\n              teaching in both a K-2 and other configurations within the district \r\n              were surveyed. The survey findings revealed the magnitude of the \r\n              variance between causal agents known to affect future student success \r\n              that exists in the K-2 versus other configuration elementary schools. \r\n              In order of decreasing magnitude, the following variables are more \r\n              prevalent in the K-2 environment than in other configurations, and \r\n              their increased presence related to superior student achievement \r\n              in later years: Resources, Parental Involvement, Collaboration (among \r\n              administrators, teachers, and special services personnel), Foundation \r\n              (ability to establish social and emotional competence, language, \r\n              cognition, teaching strategies that lead to next levels of accomplishment), \r\n              Relevant Teacher Training, Teacher Efficacy (with regard to aligning \r\n              primary students' interests and abilities), High Expectations, Principal's \r\n              Leadership, Teacher's Stability, and School Climate. (A copy of \r\n              the survey is included. Contains 14 references.) Descriptors: *Academic Achievement; Educational Environment; Elementary \r\n                Education; *Institutional Characteristics; Outcomes of Education; \r\n                *Performance Factors; *Primary Education; School Districts; *School \r\n        Organization Identifiers: Alaska ED472649 EA032306 Title: Directory of Public Elementary and Secondary Education Agencies, \r\n              2000-2001. Author(s) McDowell, Lena M.; Sietsema, John P. Author Affiliation: National Center for Education Statistics (ED), \r\n              Washington, DC.(EDD00004) Pages: 410 Publication Date: November 2002 Notes: For the 1999-2000 Directory, see ED 464 396. Report No: NCES-2003-310 Available from: EDRS Price MF01/PC17 Plus Postage. Availability: ED Pubs, P.O. Box 1398, Jessup, MD 20794-1398. Tel: \r\n              877-433-7827 (Toll Free). For full text: http://nces.ed.gov/pubs2003/2003310.pdf. Language: English Document Type: Numerical/Quantitative Data (110); Reference materials--Directories/Catalogs \r\n              (132) Geographic Source: U.S.; District of Columbia Journal Announcement: RIESEP2003 Government Level: Federal This directory \r\n              lists all public elementary and secondary education agencies in \r\n              the 50 states, the District of Columbia, five outlying areas, the \r\n              Bureau of Indian Affairs, and the Department of Defense, as reported \r\n              from the National Center for Education Statistics (NCES) Common \r\n              Core of Data (CCD) Local Education Agency Universe data collection \r\n              of spring 2001. In the introduction, several tables summarizing \r\n              the file contents are provided. The seven types of agencies listed \r\n              include regular school districts, supervisory union components, \r\n              supervisory union administrative centers, regional educational service \r\n              agencies, state-operated agencies, federally operated agencies, \r\n              and other agencies that cannot be appropriately classified using \r\n              another CCD designation. The directory provides up to 12 items of \r\n              information for each public elementary and secondary agency listed: \r\n              state, name of agency, mailing address, telephone number, name of \r\n              county, metropolitan status code, grade span, total student membership, \r\n              number of regular high school graduates for the 1999-2000 school \r\n              year, number of students with an individualized education program \r\n              (IEP), number of teachers, and number of schools. An appendix provides \r\n              state education agency addresses. (RT) Descriptors: \r\n              Elementary Secondary Education; Enrollment; Government Publications; \r\n              *Public Agencies; *Public Schools; *School Districts; School Personnel; \r\n              School Statistics; State Departments of Education Identifiers: Grade Span Configuration EJ648686 EA539683 Title: An Examination of K-5, 6-8 versus K-8 Grade Configurations. Author(s) Connolly, Faith; Yakimowski-Srebnick, Mary E.; Russo, \r\n              Carmen V. Source: ERS Spectrum, v20 n2 p28-37 Spr 2002 Publication Date: 2002 ISSN: 0740-7874 Language: English Document Type: Journal articles (080); Reports--Research (143) Journal Announcement: CIJNOV2002 Examines differences \r\n              in certain factors such as student achievement and student attendance \r\n              in K-8 versus K-5 and 6-8 grade configurations in Baltimore City \r\n              Public Schools. Finds, for example, that students in K-8 schools \r\n              had significantly higher reading, language arts, and mathematics \r\n              scores than did students in K-5 or 6-8 schools. (Contains 20 references.) \r\n              (PKP) Descriptors: Academic Achievement; Attendance; Educational History; \r\n                Grade 5; Grade 6; Grade 7; *Grade 8; *Instructional Program Divisions; \r\n                *Kindergarten; Middle Schools; Parents; Principals; Student Characteristics Identifiers: Baltimore City Public Schools MD EJ650573 EF502951 Title: How Should Schools Be Organized? Author(s) DeJong, William S.; Craig, Joyce Source: School Planning & Management, v41 n6 p26-32 Jun 2002 Publication Date: 2002 ISSN: 1086-4628 Language: English Document Type: Journal articles (080); Reports--Descriptive (141) Journal Announcement: CIJDEC2002 Explores the \r\n              impact of grade configuration decisions on the number and size of \r\n              elementary, middle, and high schools needed. Discusses various trends \r\n              regarding placement of sixth grade, ninth grade, and preschool classes \r\n            and the resurgence of K-8 and K-12 models. (EV) Descriptors: \r\n              Educational Facilities Planning; Grade 6; Grade 9; Instructional \r\n              Program Divisions; Middle Schools; Preschool Education; *School \r\n              Organization Identifiers: *Grade Span Configuration EJ640946 EA539340 Title: Middle Schools Still Matter. Author(s): Ecker, Marc; Dietz, Michael J.; Carlile, Susan Source: School Administrator, v59 n3 p30-33 Mar 2002 Publication Date: 2002 ISSN: 0036-6439 Language: English Document Type: Journal articles (080); Reports--Descriptive (141) Three public \r\n              school administrators (a superintendent, a middle school principal, \r\n              and a central-office administrator) discuss why educators and parents \r\n              should continue to support the middle-school grade configuration. \r\n              (PKP) Descriptors: \r\n              *Early Adolescents; Middle School Students; Middle School Teachers; \r\n              *Middle Schools; Transitional Programs Identifiers: *Grade Span Configuration EJ640945 EA539339 Title: Grade-Span Configurations. Author(s): Howley, Craig B. Source: School Administrator, v59 n3 p24-29 Mar 2002 Publication Date: 2002 ISSN: 0036-6439 Language: English Document Type: Journal articles (080); Reports--Research (143) Discusses debate \r\n              surrounding the advantages and disadvantages of various grade-span \r\n              configurations. Offers several provocative \"hunches\" concerning \r\n              the implications of grade-span-configuration research for practice. \r\n              Includes list of additional resources on grade-span configurations. \r\n              (PKP) Descriptors: \r\n              *Academic Achievement; Elementary Secondary Education; *Grade 6; \r\n              *Grade 7; *Instructional Program Divisions; *Rural Schools Identifiers: *Grade Span Configuration EJ630006 PS531911 Title: The Efficacy of Philadelphia's K-to-8 Schools Compared to Middle \r\n            Grades Schools. Author(s): Offenberg, Robert M. Source: Middle School Journal, v32 n4 p23-29 Mar 2001 Publication Date: 2001 ISSN: 0094-0771 Document Type: Journal articles (080); Reports--Descriptive (141); \r\n            Speeches/meeting papers (150) Natural experiments \r\n              explored the effects of attending public Philadelphia K-to-8 schools \r\n              or public middle schools on eighth- and ninth-grade achievement. \r\n              Found that students attending K-8 schools had higher reading, mathematics, \r\n              and science achievement than students attending middle schools serving \r\n              similar communities. Suggested that number of students in a grade \r\n              rather than school size contributed to the difference. (KB) Descriptors: \r\n              *Academic Achievement; Comparative Analysis; *Elementary Schools; \r\n              Mathematics Achievement; Middle School Students; *Middle Schools; \r\n              Outcomes of Education; Program Effectiveness; Reading Achievement; \r\n              *School Organization; *School Size; Science Achievement; Social \r\n              Differences Identifiers: Pennsylvania (Philadelphia) ED447995 RC022706 Title: Will the Real \"Texas Miracle in Education\" Please \r\n            Stand Up? Grade Span Configuration, Achievement, and Expenditure per \r\n            Pupil. Author(s): Bickel, Robert; Howley, Craig; Williams, Tony; Glascock, \r\n            Catherine Pages: 48 Publication Date: November 2000 Sponsoring Agency: Rural School and Community Trust, Randolph, VT. \r\n            (BBB35873) Available from: EDRS Price MF01/PC02 Plus Postage. Document Type: Reports--Research (143) Geographic Source: U.S.; Ohio Research across \r\n              seven very different states has shown that as schools get larger, \r\n              the average achievement among economically disadvantaged students \r\n              declines. A traditionally strong argument against smaller schools, \r\n              however, is that they are too expensive. Large consolidated schools \r\n              with narrowly specialized grade spans are typically offered as necessary \r\n              to save money and to meet the needs of different age groups. This \r\n              paper examines whether the size-by-socioeconomic status interaction \r\n              effect proves robust across alternative regression model specifications, \r\n              as it did across different states. It also explores whether the \r\n              equity gains associated with smaller schools are incompatible with \r\n              the need to save money. Analysis with four different regression \r\n              model specifications consistently found that increased school size \r\n              was related to increases in achievement-test-score costs associated \r\n              with economically disadvantaged students. School size was negatively \r\n              related to expenditure per pupil, but this relationship became increasingly \r\n              tenuous as size increased, and eventually savings became negligible. \r\n              In addition, organizational factors, especially as manifest in the \r\n              distinctive components of the single-unit school, were related to \r\n              cost reduction. For those interested in balancing expenditure per \r\n              pupil with achievement-based equity, the best grade-span configuration \r\n              seems to be a small single-unit school. (Contains 76 references.) \r\n              (SV) Descriptors: \r\n              *Academic Achievement; *Expenditure per Student; *High Schools; \r\n              Regression (Statistics); *School Size; Small Schools; *Socioeconomic \r\n              Status Identifiers: *Grade Span Configuration; *Texas; Unit Schools ED450991 RC022836 Title: High School Size, Achievement Equity, and Cost: Robust Interaction \r\n              Effects and Tentative Results. Author(s): Bickel, Robert; Howley, Craig; Williams, Tony; Glascock, \r\n              Catherine Pages: 49 Publication Date: 2000 Sponsoring Agency: Rural School and Community Trust, Washington, \r\n              DC. (BBB35927) Available from: EDRS Price MF01/PC02 Plus Postage. Document Type: Reports--Research (143) Geographic Source: U.S.; West Virginia Research has \r\n              revealed interactive effects of school size and socioeconomic status--as \r\n              school size increases, the mean measured achievement of schools \r\n              with disadvantaged students declines. The larger the number of less \r\n              advantaged students attending a school, the greater the decline. \r\n              This study also examined the claim that large schools with a narrow \r\n              range of grades necessarily save money by achieving economies of \r\n              scale. Results indicate that school size was negatively related \r\n              to costs, but this relationship became increasingly tenuous as school \r\n              size increased, with savings eventually becoming negligible. In \r\n              addition, analysis of organizational factors distinct to the single-unit \r\n              school indicates that if schools are designed solely to minimize \r\n              expenditure per pupil, the best configuration may be a large single-unit \r\n              school. However, if expenditure per pupil is balanced with achievement-based \r\n              equity, the best configuration seems to be one small single-unit \r\n              school per district. While decreased size would increase costs, \r\n              the fact that there is only one school with 13-15 grade levels would \r\n              substantially diminish costs. (Contains 69 references.) (TD) Descriptors: \r\n              *Academic Achievement; *Consolidated Schools; Disadvantaged; Elementary \r\n              Secondary Education; Equal Education; *Expenditure per Student; \r\n              High Schools; Interaction; Outcomes of Education; *School Size; \r\n              *Socioeconomic Status Identifiers: *Economies of Scale; Grade Span Configuration; Texas; \r\n              *Unit Schools ED440471 EA030387 Title: Grade Span. Author(s): Renchler, Ron Author Affiliation: National Association of Elementary School Principals, \r\n              Alexandria, VA.(BBB23667); ERIC Clearinghouse on Educational Management, \r\n              Eugene, OR.(SJJ69850) Source: Research Roundup, v16 n3 Spr 2000 Pages: 5 Publication Date: 2000 Sponsoring Agency: Office of Educational Research and Improvement \r\n              (ED), Washington, DC. (EDD00036) Contract No: ED-99-CO-0011 Available from: EDRS Price MF01/PC01 Plus Postage. Availability: National Association of Elementary School Principals, \r\n              1615 Duke Street, Alexandria, VA 22314-3483 ($2.50 prepaid; quantity \r\n              discounts). Document Type: Collected works--Serials (022); ERIC product (071) Geographic Source: U.S.; Oregon This issue \r\n              reviews grade span, or grade configuration. Catherine Paglin and \r\n              Jennifer Fager's \"Grade Configuration: Who Goes Where?\" \r\n              provides an overview of issues and concerns related to grade spans \r\n              and supplies profiles of eight Northwest schools with varying grade \r\n              spans. David F. Wihry, Theodore Coladarci, and Curtis Meadow's \"Grade \r\n              Span and Eighth-Grade Academic Achievement: Evidence from a Predominantly \r\n              Rural State\" reports on the influence of grade span on the \r\n              academic achievement of eight-grade students in Maine. David L. \r\n              Hough's \"The Elemiddle School: A Model for Middle Grades Reform\" \r\n              surveys the history of grade configuration and cites research indicating \r\n              that \"elemiddle\" schools (schools with both elementary \r\n              and middle-school grades) may be most appropriate for meeting educational \r\n              and social needs. Charlene G. Tucker and Gilbert N. Andrada's \"Accountability \r\n              Works: Analysis of Performance by Grade Span of School\" presents \r\n              results from a study measuring sixth-grade students' academic performance \r\n              on the \"Connecticut Mastery Test\" in relation to student \r\n              enrollment in schools having K-5 or K-6 configurations. John W. \r\n              Alspaugh's \"The Interaction Effect of Transition Grade to High \r\n              School with Gender and Grade Level upon Dropout Rates\" looks \r\n              at the influence of grade span and related factors on dropout rates \r\n              in high school. (DFR) Descriptors: \r\n              *Academic Achievement; Dropout Rate; Elementary Secondary Education; \r\n              *Instructional Program Divisions Identifiers: *Connecticut Mastery Testing Program; ERIC; *Grade \r\n              Span Configuration EJ584549 RC513199 Title: The Relationship between Grade Configuration and Student \r\n              Performance in Rural Schools. Author(s): Franklin, Bobby J.; Glascock, Catherine H. Source: Journal of Research in Rural Education, v14 n3 p149-53 Win \r\n              1998 Publication Date: 1998 ISSN: 8756-0534 Document Type: Journal articles (080); Reports--Research (143) Examines the \r\n              relationship between grade configuration in rural schools and student \r\n              attendance, suspension, and academic achievement for grades 6, 7, \r\n              10, and 11. In a large random sample of rural Louisiana schools, \r\n              students in elementary schools (K- 6/7) and unit schools (K-12) outperformed their middle and secondary \r\n              school peers. Contains 25 references. (Author/CDS) Descriptors: \r\n              *Academic Achievement; Attendance; *Educational Environment; Elementary \r\n              Secondary Education; Instructional Program Divisions; Rural Education; \r\n              *Rural Schools; Student Needs; Suspension Identifiers: *Grade Span Configuration; *Louisiana ED432033 EA029887 Title: Grade Configuration: Who Goes Where? By Request Series. Author(s): Paglin, Catherine; Fager, Jennifer Author Affiliation: Northwest Regional Educational Lab., Portland, \r\n              OR.(RIK65325) Pages: 48 Publication Date: July 1997 Sponsoring Agency: Office of Educational Research and Improvement \r\n              (ED), Washington, DC. (EDD00036) Contract No: RJ96006501 Available from: EDRS Price MF01/PC02 Plus Postage. Document Type: Reports--Descriptive (141) Geographic Source: U.S.; Oregon This booklet \r\n              is the fourth in a series of \"hot topic\" reports, that \r\n              address current educational concerns. The booklet examines questions \r\n              relating to grade configurations, its purpose being to increase \r\n              awareness and understanding of the issues surrounding grade span. \r\n              It explores the ways that schools have addressed concerns associated \r\n              with particular grade spans and suggests avenues for further inquiry. \r\n              The text focuses on historical trends in grade configuration and \r\n              the various contexts of grade spans, such as whether a school is \r\n              in a rural or an urban area. Most research on grade span focuses \r\n              on the middle grades and addresses such questions as: Which grades \r\n              should be grouped together in one school? How many grades should \r\n              be in one school? and How many school transitions will students \r\n              make during the K-12 years? Some tips for starting a school with \r\n              a grade span new to a school system are offered, followed by an \r\n              overview of grade-span considerations. The bulk of the volume describes \r\n              eight schools' experiences with grade spans, discussing such issues \r\n              as how the grade span came about and how the schools were structured \r\n              to meet the needs of the particular grades it contains. (RJM) Descriptors: \r\n              Elementary Secondary Education; *Instructional Program Divisions; \r\n              Program Descriptions; *School Organization; School Restructuring Identifiers: *Grade Span Configuration; United States (Northwest) ED411278 TM027261 Title: Accountability Works: Analysis of Performance by Grade Span \r\n              of School. Author(s): Tucker, Charlene G.; Andrada, Gilbert N. Pages: 23 Publication Date: March 1997 Notes: Paper presented at the Annual Meeting of the American Educational \r\n              Research Association (Chicago, IL, March 24-28, 1997). Available from: EDRS Price MF01/PC01 Plus Postage. Document Type: Reports--Evaluative (142); Speeches/meeting papers \r\n              (150) Geographic Source: U.S.; Connecticut For the past \r\n              decade in Connecticut, public school students have been tested in \r\n              the fall of grades 4, 6, and 8, and results have been attributed \r\n              to the school in which students are tested. Some Connecticut elementary \r\n              schools end at grade 5 (Type I) and some continue to grade 6 or \r\n              8 (Type II). Consistent results showed that schools that expected \r\n              to be accountable for sixth-grade results (Type II) produced better \r\n              performing sixth graders. Implications for designing and developing \r\n              accountability systems are discussed. (Contains six tables and four \r\n              references.) (Author/SLD) Descriptors: \r\n              *Academic Achievement; *Accountability; Elementary Education; *Expectation; \r\n              *Instructional Program Divisions; Multivariate Analysis; Public \r\n              Schools; *School Organization Identifiers: *Connecticut; Grade Span Configuration ED401058 RC020738 Title: K-12 Unit Schooling in Rural America: A First Description. Author(s) Howley, Craig; Harmon, Hobart Author Affiliation: Appalachia Educational Lab., Charleston, WV.(AWT03075) Pages: 34 Publication Date: October 14, 1996 Notes: Paper presented at the Annual Meeting of the National Rural \r\n              Education Association (San Antonio, TX, October 14, 1996). Available from: EDRS Price MF01/PC02 Plus Postage. Language: English Document Type: Reports--Research (143); Speeches/meeting papers \r\n              (150) Geographic Source: U.S.; West Virginia Journal Announcement: RIEMAR1997 This report \r\n              presents selected results of a national study of school districts \r\n              operating at least one K-12 unit school. Of the 706 districts operating \r\n              unit schools, 157 districts in 27 states responded to the survey. \r\n              The majority of respondents (106) were superintendents of one-school \r\n              districts, that is, districts in which the K-12 unit school was \r\n              the only school. Of the 53 multischool districts, about half operated \r\n              just one K-12 unit school. Data reveal that K-12 unit schools were \r\n              usually located in an agricultural region where socioeconomic status \r\n              was lower than the national average; the average unit school enrollment \r\n              was 414; most unit schools in multischool districts were comparatively \r\n              remote from key resources such as hospitals, interstate highways, \r\n              and cities; superintendents of single-school districts reported \r\n              higher rates of above-average test scores, postsecondary attendance, \r\n              and high school completion than did superintendents of multischool \r\n              districts; satellite and Internet systems were the most prevalent \r\n              forms of distance learning technologies in use; community attitudes \r\n              toward single-school districts were moderately and positively related \r\n              to the sustainability of the school; single-school districts spent \r\n              almost 50 percent more per pupil than multischool districts; and \r\n              single-school districts more often than multischool districts employed \r\n              cooperative strategies for maximizing resources such as joining \r\n              regional service agencies or cooperating with other districts. Includes \r\n              data tables and recommendations for research and practice. Contains \r\n      24 references. (LP) Descriptors: Administrator Attitudes; *Community Attitudes; Distance \r\n                Education; Educational Practices; Elementary Secondary Education; \r\n                Expenditure per Student; Geographic Isolation; Institutional Survival; \r\n                National Surveys; *Outcomes of Education; *Rural Schools; School \r\n                Demography; *School Districts; *School Surveys; Small Schools; Superintendents Identifiers: Grade Span Configuration; Small School Districts; *Sustainability; \r\n      *Unit Schools ED403083 RC020794 Title: The Relationship between Grade Configuration and Student \r\n              Performance in Rural Schools. Author(s): Franklin, Bobby J.; Glascock, Catherine H. Pages: 56 Publication Date: October 1996 Notes: Paper presented at the Annual Conference of the National \r\n              Rural Education Association (San Antonio, TX, October 11-14, 1996). Available from: EDRS Price MF01/PC03 Plus Postage. Document Type: Reports--Research (143); Speeches/meeting papers \r\n              (150) Geographic Source: U.S.; Louisiana This paper \r\n              examines the relationship between a school's grade configuration \r\n              and student performance in Louisiana. Results indicate that sixth- \r\n              and seventh-grade students performed better in elementary and K-12 \r\n              schools than in middle or secondary schools, in terms of both achievement \r\n              and persistence. Students in K-12 schools performed as well as those \r\n              in elementary schools overall and performed better in some cases \r\n              (grade 6 and high poverty). For grades 9-12, the K-12 school was \r\n              more beneficial to students than the traditional secondary school, \r\n              particularly in the area of student persistence or conduct. With \r\n              regard to academic achievement, secondary schools did not differ \r\n              significantly from K-12 schools regardless of school size or SES. \r\n              School size did appear to impact 11th- and 12th-grade student persistence \r\n              more within the secondary school environment than that of the K-12 \r\n              school. Contains 34 references and 29 data tables and figures. (Author/SV) Descriptors: \r\n              *Academic Achievement; Academic Persistence; *Educational Environment; \r\n              Elementary Schools; Instructional Program Divisions; Intermediate \r\n              Grades; Middle Schools; *Rural Education; *School Holding Power; \r\n              *School Organization; School Size; Secondary Education; Secondary \r\n              Schools; Socioeconomic Status Identifiers: *Grade Span Configuration; *Louisiana; Unit Schools ED389501 RC020367 Title: A Comparison of Four Enrollment Groups of K-8 and K-12 Missouri \r\n              Rural School Districts. Author(s): Alspaugh, John W. Pages: 8 Publication Date: October 1995 Notes: Paper presented at the Annual Conference of the National \r\n              Rural Education Association (Salt Lake City, UT, October 1995). Available from: EDRS Price MF01/PC01 Plus Postage. Document Type: Numerical/Quantitative Data (110); Reports--Research \r\n              (143); Speeches/meeting papers (150) Geographic Source: U.S.; Missouri This paper \r\n              compares school district characteristics for rural Missouri K-8 \r\n              and K-12 districts in four categories of enrollment size. A random \r\n              sample of 56 K-8 and 56 K-12 districts yielded 4 equal categories \r\n              of K-8 enrollment: 51-100, 101-150, 151-200, and more than 200 students. \r\n              Data are presented in graphic form for assessed valuation per pupil; \r\n              operating tax levy; expenditure per pupil; administrative cost per \r\n              pupil; teacher salaries; student-teacher ratio; and achievement \r\n              scores on the Missouri Mastery and Achievement Test (MMAT) for grades \r\n              3, 6, and 8. Two final graphs present data from 428 Missouri districts \r\n              showing that the high school dropout rate was positively related \r\n              to school size and negatively related to the high school grade span. \r\n              (SV) Descriptors: \r\n              *Academic Achievement; *Dropout Rate; Elementary Secondary Education; \r\n              *Expenditure per Student; *Rural Schools; *School District Size; \r\n              School District Wealth; *School Districts; School Size; Teacher \r\n              Salaries; Teacher Student Ratio Identifiers: Grade Span Configuration; *Missouri EJ505828 SP524248 Title: Transition Effects of School Grade-Level Organization on \r\n              Student Achievement. Author(s): Alspaugh, John W.; Harting, Roger D. Source: Journal of Research and Development in Education, v28 n3 \r\n              p145-49 Spr 1995 Publication Date: 1995 ISSN: 0022-426X Document Type: Journal articles (080); Reports--Research (143) Reports on \r\n              a study of the transition effects of grade-level organization on \r\n              student achievement as schools transitioned from self-contained \r\n              to departmentalized classes. Reading, math, and social studies achievement \r\n              scores of five equated rural school districts with K-4 through K-8 \r\n              organization were compared. Results noted a decline in achievement \r\n              during the transition year. (SM) Descriptors: \r\n              *Academic Achievement; *Achievement Gains; Departments; Elementary \r\n              Education; Elementary School Students; *Instructional Program Divisions; \r\n              Rural Schools; *School Organization; *Self Contained Classrooms; \r\n              *Transitional Schools Identifiers: Transitional Activities EJ496194 EA530201 Title: The Elemiddle School: A Model for Middle Grades Reform. Author(s): Hough, David L. Source: Principal, v74 n3 p6-9 Jan 1995 Publication Date: 1995 ISSN: 0271-6062 Document Type: Journal articles (080); Reports--Evaluative (142) \"Elemiddle\" \r\n              schools serve the needs of young adolescents, aged 10 to 14, in \r\n              any combination of grades 5 through 8, as part of an organizational \r\n              structure that includes lower grades. Research has shown that middle \r\n              schools with 6-8 grade spans and K-8 schools are most likely to \r\n              implement child-centered programs, practices, and policies than \r\n              schools with 7-9 or 7-12 grade spans. (MLH) Descriptors: \r\n              *Early Adolescents; *Educational Benefits; Educational Change; Elementary \r\n              Education; *Grouping (Instructional Purposes); *Instructional Program \r\n              Divisions; Intermediate Grades; Junior High Schools; Middle Schools; \r\n              *School Organization; *Student Centered Curriculum; Student Needs ED380245 RC019950 Title: An Examination of the Non-K12 School District Organizational \r\n              Form in New York State. Author(s): Monk, David H. Pages: 52 Publication Date: November 1994 Sponsoring Agency: New York State Education Dept., Albany. (QPX62775) Available from: EDRS Price MF01/PC03 Plus Postage. Document Type: Reports--Research (143); Test/questionnaires (160) Geographic Source: U.S.; New York This paper \r\n              reports on a study assessing the viability of the non-K-12 organizational \r\n              form as currently practiced in New York State. Impediments to success \r\n              with the non-K-12 form included inadequate transportation, the abruptness \r\n              of the transition, inopportune grade levels of transition, calendar \r\n              inconsistencies, inadequate communication, parental disenfranchisement, \r\n              curricular inconsistencies, narrowness of choice, and inherent bias \r\n              toward resident students. Recommendations to deal with all impediments \r\n              are included. Appendices include the high school and parent survey \r\n              instruments. (RAH) Descriptors: \r\n              *Academic Achievement; Elementary Secondary Education; Feeder Patterns; \r\n              High School Students; *Instructional Program Divisions; *Interdistrict \r\n              Policies; Organizational Change; *Parent Attitudes; Public Schools; \r\n              School District Reorganization; School District Size; *School Districts; \r\n              *Transfer Students Identifiers: *New York ED372883 RC019686 Title: The Cultural Contradictions of Middle Schooling for Rural \r\n              Community Survival. Author(s): DeYoung, Alan J.; And Others Pages: 39 Publication Date: July 1994 Available from: EDRS Price MF01/PC02 Plus Postage. Document Type: Information Analysis (070) Geographic Source: U.S.; Kentucky During 1968-91, \r\n              middle schools were the only school type to grow in number, increasing \r\n              by over 400 percent. Middle school advocates focus on early adolescents' \r\n              need for developmentally appropriate institutions, but show only \r\n              a weak historical understanding of the emergence and status of middle \r\n              schools. Critical factors in early support for the middle school \r\n              movement included urban interests in countering de facto school \r\n              segregation without use of busing, urban overcrowding of elementary \r\n              and high schools, and a \"bandwagon effect\"--the desire \r\n              to appear modern and reform oriented. The emergence of rural middle \r\n              schools under the cloak of psychological progress can be destructive \r\n              to both the declining sense of community in America, and to the \r\n              actual persistence of many rural communities still organized around \r\n              K-8 or K-6 public elementary schools. Examination of the National \r\n              Center for Education Statistics's Common Core of Data indicates \r\n              that the construction of rural middle schools has led to the closing \r\n              and consolidation of rural elementary schools. During the school \r\n              years 1987/88-1991/92 the proportion of schools that were middle \r\n              schools increased 20 percent in rural areas, was unchanged in suburban \r\n              areas, and decreased 6 percent in urban areas. At the same time, \r\n              the proportion of rural schools that were K-8 declined precipitously. \r\n              Emerging school reform agendas that provide alternatives to the \r\n              \"inevitability\" of consolidation include efforts to restructure \r\n              schools as caring communities (requiring active parent and community \r\n              participation), and the development of rural schools as centers \r\n              for integrated social services. Contains 52 references. (SV) Descriptors: \r\n              Early Adolescents; *Educational Change; Educational Philosophy; \r\n              *Instructional Program Divisions; Intermediate Grades; Junior High \r\n              Schools; *Middle Schools; *Rural Schools; School Closing; *School \r\n              Community Relationship; *School Organization Identifiers: *Community Viability EJ464589 RC509333 Title: Grade Span and Eighth-Grade Academic Achievement: Evidence \r\n              from a Predominantly Rural State. Author(s): Wihry, David F.; And Others Source: Journal of Research in Rural Education, v8 n2 p58-70 Sum \r\n              1992 Publication Date: 1992 ISSN: 8756-0534 Document Type: Journal articles (080); Reports--Research (143) In 163 Maine \r\n              schools, the performance of eighth-grade students on standardized \r\n              tests, especially reading achievement, was highest in elementary \r\n              settings (K-8, K-9, 3-8) and lowest in junior-senior high school \r\n              settings (6-12, 7-12, 8-12), when socioeconomic status and teacher \r\n              experience were controlled. (SV) Descriptors: \r\n              *Academic Achievement; *Educational Environment; Elementary Schools; \r\n              Elementary Secondary Education; *Grade 8; *Instructional Program \r\n              Divisions; Middle Schools; Rural Schools; *School Organization; \r\n              Secondary Schools; Student School Relationship Identifiers: *Maine EJ454389 EA527376 Title: Grade-Level Reorganization in a Small School District: Making \r\n              and Implementing the Decision. Author(s): Vann, Allan S. Source: ERS Spectrum, v10 n4 p10-17 Fall 1992 Publication Date: 1992 ISSN: 0740-7874 Document Type: Journal articles (080); Reports--Descriptive (141) A New York \r\n              school district was forced to consider a grade-level reorganization \r\n              or possible school closing, primarily resulting from severe economic \r\n              pressures. Describes the advantages and disadvantages of reorganizing \r\n              2 K-5 elementary schools into a K-2 primary school and a 3-5 intermediate \r\n              school. Cites four basic reasons frequently offered to support district \r\n              reorganization. (MLF) Descriptors: \r\n              *Administrator Role; Economic Factors; Elementary Education; *Instructional \r\n              Program Divisions; *Intermediate Grades; *Primary Education; Public \r\n              Schools; *School District Reorganization; School District Size; \r\n              *Transitional Programs Identifiers: *Elwood Union Free School District NY ED327000 EA022588 Title: Schools in the Middle: Progress 1968-1988. Schools in the \r\n              Middle: A Report on Trends and Practices. Author(s): Alexander, William M.; McEwin, C. Kenneth Author Affiliation: National Association of Secondary School Principals, \r\n              Reston, VA.(FGK56325) Pages: 9 Publication Date: September 1989 Notes: Colored print in section headings, on gray paper, may not \r\n              film adequately. For related documents, see EA 022 586-587. ISSN: 0276-4482 Available from: EDRS Price MF01 Plus Postage. PC Not Available from \r\n              EDRS. Availability: Publications, National Association of Secondary School \r\n              Principals, 1904 Association Drive, Reston, VA 22091 ($1.50; quantity \r\n              discounts). Document Type: Collected works--Serials (022) Geographic Source: U.S.; Virginia Target Audience: Practitioners; Policymakers Designed as \r\n              an overview of the progress of middle schools in the last two decades, \r\n              this document compares results from a 1968 survey that sampled 10 \r\n              percent of middle schools with at least three, and not more than \r\n              five grades, and including grades 6 and 7, with those of a similar \r\n              1988 survey. Following a brief summary of the origins of the middle \r\n              school is a discussion of survey results regarding changes in rationale \r\n              and specific preparation undertaken for introducing middle school \r\n              organization and problems perceived in teacher education. Finally, \r\n              conclusions are presented regarding the differences between schools \r\n              containing grades 5-8 or 6-8 and those with grades 7 and 8 or 7-9. \r\n              Included are four tables and five graphs. (8 references) (CLA) Descriptors: \r\n              *Educational Development; Graphs; *Instructional Program Divisions; \r\n              Intermediate Grades; Junior High Schools; *Middle Schools; School \r\n              Surveys; Tables (Data) ED315897 EA021645 Title: Middle Level Education in California: A Survey of Programs \r\n              and Organization. Author(s): Hough, David L. Author Affiliation: California Educational Research Cooperative, \r\n              Riverside.(BBB27382) Pages: 53 Publication Date: February 1989 Available from: EDRS Price MF01/PC03 Plus Postage. Document Type: Reports--Evaluative (142) Geographic Source: U.S.; California The second \r\n              in a four-phase research project, this report presents data from \r\n              a stratified random sample of California middle schools using four \r\n              grade span configurations (K-8, 6-8, 7-8, and 7-9). This phase, \r\n              a pilot study, is designing a methodology to help researchers discriminate \r\n              among the number, percentage, and types of programs offered by the \r\n              various organizational patterns. The research is intended to assist \r\n              policymakers confronted with implementation decisions regarding \r\n              middle level programs. Future research should focus on program effectiveness \r\n              relative to \"transescents'\" needs and to goals established \r\n              by the individual school. Policymakers should explore various alternative \r\n              programs and practice modifications, regardless of the grade spans \r\n              adopted. (Eight references) (MLH) Descriptors: \r\n              *Curriculum; *Extracurricular Activities; *Grouping (Instructional \r\n              Purposes); Hidden Curriculum; *Instructional Program Divisions; \r\n              Junior High Schools; *Middle Schools; *Pilot Projects Identifiers: *California ED315896 EA021644 Title: Vertical Articulation for the Middle Grades. Author(s): Hough, David Author Affiliation: California Educational Research Cooperative, \r\n              Riverside.(BBB27382) Pages: 61 Publication Date: 1989 Available from: EDRS Price MF01/PC03 Plus Postage. Document Type: Reports--Descriptive (141) Geographic Source: U.S.; California The junior \r\n              high school, typically grades 7-8 or 7-9, offers a program that \r\n              is \"not- quite-yet-but-trying-to-be\" a high school. The organization \r\n              of the middle school (commonly the grades 6-8), however, is based \r\n              on a philosophy of education that was specifically designed to meet \r\n              the special needs of a preadolescent learner; middle schools incorporate \r\n              unique curricula to better effect the transition between elementary \r\n              and high school programs, rather than attempt to approximate one \r\n              or the other. Many educators, perceiving junior highs as a \"failed\" \r\n              promise, have turned to the middle school philosophy as an affirmation \r\n              of a higher level of commitment. Indeed, since 1964, the number \r\n              of new middle schools replacing traditional junior highs has progressively \r\n              increased. A review of research on middle-level education indicates \r\n              that: (1) although primarily an administrative concern driven by \r\n              attendance boundaries, grade level organization had little impact \r\n              on middle-level students' academic achievement; and (2) the terms \r\n              \"junior high school\" and \"middle school\" do \r\n              not define a school's program. Additionally, the effective schools \r\n              research has given rise to discriminant analyses of effective middle \r\n              school variables and allowed researchers to identify those characteristics \r\n              most commonly found within \"exemplary\" middle schools. \r\n              (159 references) (KM) Descriptors: \r\n              Age Grade Placement; Classes (Groups of Students); Curriculum Enrichment; \r\n              Educational Development; Educational Environment; Grade 6; Grade \r\n              7; Grade 8; Grouping (Instructional Purposes); Instructional Program \r\n              Divisions; Junior High Schools; *Middle Schools; *Preadolescents; \r\n              *School Organization; *Transitional Programs EJ466872 EA528302 Title: When Your K-5 School Changes to 3-5. Author(s): Vann, Allan S. Source: Principal, v73 n1 p20-22 Sep 1993 Publication Date: 1993 ISSN: 0271-6062 Document Type: Journal articles (080); Reports--Descriptive (141) Describes a \r\n              district's reorganization of 2 K-5 schools into 1 for all K-2 grades \r\n              and 1 for all 3-5 grades for economic reasons. The principal of \r\n              the 3-5 facility views better focus and certain innovative initiatives \r\n              (involving coverage of special topics, a whole-language reading \r\n              program, and a sequential-research-skills approach) as advantages. \r\n              (MLH) Descriptors: \r\n              Elementary Education; *Guidelines; *Instructional Innovation; *Principals; \r\n              *Program Implementation; *School Organization Identifiers: *Elwood School District NY EJ466851 EA528251 Title: Elementary School Reorganization: Looking Back One Year Later. Author(s): Vann, Allan S. Source: ERS Spectrum, v11 n3 p32-37 Sum 1993 Publication Date: 1993 ISSN: 0740-7874 Document Type: Journal articles (080); Reports--Descriptive (141) Evaluates a \r\n              small New York school district's efforts to reorganize its two K-5 \r\n              elementary schools into one K-2 primary grade school and one 3-5 \r\n              intermediate school, focusing on student, staff, and parent reactions. \r\n              Although the new arrangement created more focused schools, the intermediate \r\n              principal misses the energy deriving from the Kindergarten Thanksgiving \r\n              feast and various primary-grade activities. (MLH) Descriptors: \r\n              Elementary Education; *Parent Attitudes; *Principals; *Program Evaluation; \r\n              Program Implementation; *School Organization; *Student Reaction; \r\n              *Teacher Response Identifiers: *Elwood Union Free School District NY ED340604 SE052546 Title: The Impact of Transition from Junior Highs to Middle Schools \r\n              on Science Programs. Author(s): Jones, M. Gail Pages: 20 Publication Date: April 1991 Notes: Paper presented at the Annual Meeting of the National Association \r\n              for Research in Science Teaching (Lake Geneva, WI, April 7-10, 1991). Available from: EDRS Price MF01/PC01 Plus Postage. Document Type: Speeches/meeting papers (150) Geographic Source: U.S.; North Carolina Nationally \r\n              many middle-level schools are changing from a traditional junior \r\n              high school structure (grades 7-9) to middle schools (grades 6-8). \r\n              A case study examined the impact of middle school organizational \r\n              changes that occurred as a large North Carolina school system converted \r\n              from junior high schools to middle schools on science teachers and \r\n              science instruction. The study found: that science instruction was \r\n              enhanced under the new organizational structure; teachers had more \r\n              instructional time; and teachers were supportive about the middle \r\n              school organization. (KR) Descriptors: \r\n              *Case Studies; Elementary School Science; Inservice Teacher Education; \r\n              Interdisciplinary Approach; Intermediate Grades; *Junior High Schools; \r\n              Laboratory Equipment; *Middle Schools; Preservice Teacher Education; \r\n              Program Descriptions; Qualitative Research; *School Organization; \r\n              Science Education; *Secondary School Science ED331157 EA022910 Title: Middle Level Organization--A Curriculum Policy Analysis. Author(s): Hough, David L. Pages: 63 Publication Date: March 1991 Notes: Paper presented at the Annual Meeting of the National Association \r\n              of Secondary School Principals (Orlando, FL, March 1991). Available from: EDRS Price MF01/PC03 Plus Postage. Document Type: Reports--Research (143); Speeches/meeting papers \r\n              (150) Geographic Source: U.S.; California Significant \r\n              differences among school grade-span types regarding the level of \r\n              program implementation are influenced by the level of philosophical \r\n              commitment; as school grade spans include lower-lower-grade levels, \r\n              the level of commitment to the program increases. A conceptual model \r\n              of latent variables that impact the middle-level writing curriculum--teacher \r\n              characteristics, philosophical commitment, writing curriculum, policy, \r\n              and school grade-span organization--is developed. Sixteen tables \r\n              and six figures are included. (53 references) (LMI) Descriptors: \r\n              Educational Philosophy; *Elementary School Curriculum; *English \r\n              Curriculum; Intermediate Grades; Junior High Schools; *Language \r\n              Arts; *Middle Schools; Organizational Climate; *School Organization; \r\n              Teacher Attitudes; Teacher Characteristics; *Writing Instruction ED301313 PS017585 Title: Life in the Three Sixth Grades. Author(s): Lounsbury, John H.; Johnston, J. Howard Author Affiliation: National Association of Secondary School Principals, \r\n              Reston, Va. Publication Date: 1988 Pages: 143p. Notes: Report No: ISBN-0-88210-212-5 Available From: National Association of Secondary School Principals, \r\n              1904 Association Drive, Reston, VA 22091 ($9.00). EDRS Price - MF01 Plus Postage. PC Not Available from EDRS. Document Type: RESEARCH REPORT (143); BOOK (010) Geographic Source: U.S.; Virginia In its six \r\n              chapters, this report assesses the status of the sixth grade. The \r\n              shadow study technique was employed to address three specific questions: \r\n              (1) What is a sixth grader's day in school really like? (2) In what \r\n              ways do the programs provided for sixth graders differ, depending \r\n              on where the grade is located in the school system? and (3) How \r\n              does knowledge of the nature and needs of sixth graders match up \r\n              with the program actually provided? Sixth grades studied were initial, \r\n              middle, or terminal grades. Conclusions and recommendations make \r\n              up chapter 6. In appendices, related research is cited, methodology \r\n              is described, and listings of observers, schools, and analysts are \r\n              provided. (RH) Descriptors: \r\n              Comparative Analysis; *Educational Experience; *Elementary School \r\n              Students; *Grade 6; *Instructional Program Divisions; Intermediate \r\n              Grades; Profiles Identifiers: *Program Characteristics; *Shadow Studies ED297417 EA019797 Title: The Effects of Various Middle-Grade Configurations. Author(s): Sailor, Perry Author Affiliation: Austin Independent School District, Tex. 1986 Pages: 15p. Notes: Report No: AISD-85-20 EDRS Price - MF01/PC01 Plus Postage. Document Type: REVIEW LITERATURE (070) Geographic Source: U.S.; Texas This paper \r\n              summarizes research relevant to the Austin Independent School District's \r\n              proposal to move sixth graders from an elementary school (K-6 or \r\n              K,4-6) to a middle school (6-8) grade grouping. A summary of the \r\n              evolution of middle-grade education is presented. Three areas affected \r\n              by grade organization are discussed: academic achievement, nonacademic \r\n              outcomes (self-concept and anxiety), and homogeneous grade groups. \r\n              The grade organization studies of various middle grade configurations \r\n              did not show any consistent effects one way or the other. References \r\n              to 36 studies are included. (SI) Descriptors: \r\n              Academic Achievement; Behavior Change; Elementary School Students; \r\n              *Grade 6; *Instructional Program Divisions; Intermediate Grades; \r\n              *Middle Schools Identifiers: *Austin Independent School District TX ED270404 SP027606 Title: Grade Organization in Secondary Schools, with Particular \r\n              Reference to the Junior-Senior High School Model (Grades 7-12 or \r\n              6-12). Author(s): Lake, Sara Author Affiliation: San Mateo County Office of Education, Redwood \r\n              City, CA. SMERC Information Center. Jun 1985 Pages: 22p. EDRS Price - MF01/PC01 Plus Postage. Document Type: REVIEW LITERATURE (070) Geographic Source: U.S.; California In the United \r\n              States, a \"two-tiered\" school system--elementary and secondary \r\n              education--is often spoken of, yet throughout this century the trend \r\n              has been toward a \"three tiered\" system--elementary, junior \r\n              high/intermediate/middle school, and high school. This paper reviews \r\n              literature and research regarding these trends, the advantages and \r\n              disadvantages of both systems, and the effects of grade organization \r\n              patterns on students. Particular emphasis is given to the middle/junior \r\n              high school system. The paper concludes with suggestions for changing \r\n              grade organization patterns. Appendixes include references, a chart \r\n              showing secondary grade organization patterns, and an outline of \r\n              advantages and disadvantages in the systems. (CB) Descriptors: \r\n              Educational Trends; *Elementary Secondary Education; *Instructional \r\n              Program Divisions; Junior High Schools; Middle Schools; *School \r\n              Organization; *Secondary Schools ED252928 EA017415 Title: Primary and Intermediate Grade Configurations: A Review of \r\n              the Literature. Author(s): Raze, Nasus Author Affiliation: San Mateo County Office of Education, Redwood \r\n              City, CA. SMERC Information Center. Jan 1985 Pages: 9p. EDRS Price - MF01/PC01 Plus Postage. Document Type: REVIEW LITERATURE (070); EVALUATIVE REPORT (142) Geographic Source: U.S.; California Target Audience: Researchers This literature \r\n              review concerns the concept of alternative grade configurations \r\n              at the elementary level, in which elementary schools are subdivided \r\n              into primary (K-2) and intermediate (3-5) units. Because of the \r\n              paucity of literature on this concept, the major part of the report \r\n              focuses on the reorganization of the elementary schools of the South \r\n              Allegheny (Pennsylvania) school district. Although the K-2, 3-5 \r\n              structure is often implemented in response to declining enrollment, \r\n              other educational benefits cited may include better concentration \r\n              on the educational and psychological needs of children in the two \r\n              age groups, though one research study showed no significant differences \r\n              in student achievement, attitude toward school, extracurricular \r\n              participation, or career aspiration. The goals of the South Allegheny \r\n              reorganization (in response to declining enrollment) were to equalize \r\n              class sizes to facilitate multilevel instruction in reading and \r\n              math, and to make better use of staff, school buildings, and instructional \r\n              resources. Each of these objectives is described in detail, along \r\n              with perceived disadvantages. An evaluative report revealed that \r\n              the new grade structure saved money and resulted in improved discipline, \r\n              student attitudes, and student interaction. Finally, literature \r\n              on the implementation process is briefly reviewed, emphasizing the \r\n              need for clear articulation between grade levels. Notes and references \r\n              are included. (TE) Descriptors: \r\n              Age Grade Placement; *Class Organization; Developmental Stages; \r\n              Educational Environment; Elementary Education; *Grouping (Instructional \r\n              Purposes); *Homogeneous Grouping; *Instructional Program Divisions; \r\n              *School Organization; Student Placement Identifiers: *South Allegheny School District PA"
    },
    {
      "tag": "div",
      "text": "#EndEditable Return: Home > Popular Topics Popular Topics | ECRP Journal | Publications | ERIC/EECE Archive | Questions | Search Printed from the CEEP Web site: http://ceep.crc.uiuc.edu University of Illinois at Urbana-Champaign College of Education Early Childhood and Parenting Collaborative CEEP is located at the University of Illinois at Urbana-Champaign Children's Research Center; 51 Gerty Drive Champaign, IL 61820-7469 Phone: 217/333-1386 or 877/275-3227 Fax: 217/244-7732 CEEP Web Address: http://ceep.crc.uiuc.edu Send comments to the CEEP Webmaster ."
    }
  ]
}