{
  "url": "http://www.bumperdumper.com/bumper2.htm",
  "content_hash": "ee04a750cfa5f6ed70dfe4536780bbac482ff4af75934822c539396426bbddcf",
  "total_blocks": 192,
  "retained_blocks": 6,
  "ignored_blocks": 186,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "p",
      "text": "Hunting,\r\nfishing, camping, and off road ! Outdoor enthusiasts,\r\nconstruction sites, travel, and more. Use it on the coast or the\r\nplains, the mountains or the hills. introducing the original UNCLE\r\nBOOGER'S BUMPER\r\nDUMPER U.S. Patent # 6125480 SCROLL DOWN AND ORDER NOW Use in Disaster\r\nRelief, Hurricane and Earthquake preparedness, and other\r\nsituations where a sanitation situation may occur. The\r\n        Bumper Dumper $59.95 Includes frame for 2x2 hitch receiver and toilet seat The\r\n        Bumper Dumper $59.95 Includes frame for 2x2 hitch receiver and toilet seat Uncle\r\n        Booger's Bumper Dumper The\r\n        only hitch mounted portable toilet patented to use any\r\n        standard full size toilet seat. It's the\r\n        most comfortable,stable and sanitary porta potty in the\r\n        world. Use it in the hitch receiver or as a stand alone unit. You\r\n        can use a bag or a bucket . Order Now Accepted You can\r\nuse the Bumper Dumper as a stand alone unit as well as hitch mounted. Order Now Accepted"
    },
    {
      "tag": "div",
      "text": "Here is the Bumper Dumper as a stand alone unit using a 5 gallon bucket lined with\r\n        a kitchen trash bag. For extra back end support you\r\n        can lean the back of the frame against a tree or some\r\n        stable object."
    },
    {
      "tag": "p",
      "text": "How sturdy is it you ask? Just\r\nclick here and see As Seen\r\nOn The\r\nTonight Show with Jay Leno Saturday,\r\nDecember 08, 2001 TRUCKS! - a studio set\r\nbased how-to/new vehicle show addressing the light truck market\r\nwith special emphasis on pickups and sport utility vehicles. FOX BEST DAMN SPORTS SHOW PERIOD December\r\n10, 2001 Boating\r\nMagazine (Jan.2002 issue) on page 22\r\nof December 26, 2000 HILLARY TELLS ALL issue THE\r\nBUMPER DUMPER IS NOW AVAILABLE AT: Tell\r\nem' Uncle Booger sent ya 5300\r\nGlenmont ,Houston, Texas 77081 (713) 974-4440 3003 Bingle, Houston, TX 77080 Toll Free No: (800) 259-4436 Phone No: (713) 647-8065 8710 Antelop, Houston,TX 77063 Local:713-681-5310 Toll-free: 877-421-6072 115 York Street, Taney Town, MD  21787 (410) 756-2430 WOODS\r\n& WETLANDS Little Rock, AR (501) 568-3337 ROCK'N\r\nM FEED STORE Hempstead, Texas (979) 826-2788 DiIORIO\r\nFARMS & ROADSIDE MARKETS Hempstead, Texas (979) 826-8754 Bucks\r\nand Ducks Sporting Goods Texarkana,AR (870) 773-4725 M&S Distribution Leesburg, GA (229) 344-5279 Call\r\nyour local sporting goods or hardware supply store and ask them\r\nif they carry the Bumper Dumper . If they don't\r\ntell them to get it. Of course if they don't carry it and you\r\nwant to order one right now you can just Order Now or give us a call at (281) 277-3309. We'd\r\nsurely appreciate it ! The\r\n        Bumper Dumper You\r\n        now have the option to attach a sealable bucket\r\n        underneath the toilet seat. Bumper\r\n        Dumper toilet paper holder. Most\r\n        buckets with the circumference of a 5 gallon bucket easily slides into the\r\n        attachment grooves underneath the frame. Call\r\nyour local sporting goods store and ask for Uncle Booger's Bumper\r\nDumper . If they don't have it tell them to get it! or order now from us directly The Bumper\r\n        Dumper is not just an\r\n        accessory, it's a necessity. Whether you are a\r\n        hunter, fisherman, camper, or off- roader, the Bumper\r\n        Dumper is a great item for all outdoor enthusiasts. It's\r\n        great to have on construction sites, traveling with\r\n        kids,or at the beach. Anywhere you may need to go while\r\n        on the go the Bumper Dumper is a must have\r\n        item. Just a trailer hitch receiver on the back of your\r\n        vehicle with a Bumper Dumper , and no more\r\n        squatting in a bush, no more unstable, flimsy,\r\n        rickety,under sized porta potty,and no more smelly\r\n        unsanitary outhouses. Just plug the Bumper Dumper into your hitch\r\n        receiver and the comfort of home is there when nature\r\n        calls. Easy Online ordering now\r\n        available. Click here. Have\r\nyou ever been stuck in the middle of nowhere with no place to go? Has this happened to you?\r\nYou're at the campsite or in the middle of nowhere and suddenly\r\nnature calls. What do you do? You squeamishly go looking for a\r\nquiet spot behind a bush to do your thing. You cautiously avoid\r\nthe poison oak and ivy. As you carefully squat down and try to\r\nrelax a snake suddenly comes slithering through the weeds and\r\nstartles you. What a mess! Now when nature calls you can go in comfort where ever you are\r\nwith the one and only Bumper Dumper . No more looking for the right spot, no\r\nmore trying to balance while squatting, and no more surprises\r\nfrom creepy critters. Just park your vehicle in a nice secluded\r\nspot, plug the Bumper Dumper in to your trailer hitch receiver, and\r\nVOILA!! A portable toilet sturdy enough to hold 500 lbs. and just\r\nas comfortable as using the bathroom at home. You can even set up\r\na privacy screen for complete comfort. Has\r\nthis happened to you? You're driving on a\r\nlong secluded stretch of road. You and the family had a big\r\ndinner at the last restaurant about an hour ago and someone's\r\ngotta go. \"Can you hold it till the next stop\", you\r\nask. You drive a few miles and the sign says next station 90\r\nmiles ahead. Meanwhile, she tells you she needs to go too, but\r\nshe can wait till the next stop. You keep driving a while and\r\nfind yourself starting to feel the urge as well. By this time\r\neveryone is getting pretty anxious. You finally see the exit to\r\nthe station and the brain kicks in. Everyone knows it's almost\r\ntime for relief. You quickly exit and pull in to park. You get\r\nthe restroom key from the attendant and hurry to open the door. You open\r\nthe door and see this!!!! Not\r\nAnymore! It's\r\nSuper Sanitary At one time or\r\nanother you'll wish you had a Bumper Dumper . It's great on those long road trips. The Bumper Dumper is light weight and stores easily. Now\r\nyou have a safe and sanitary alternative to those road side\r\nnightmares. You can be assured of a sanitary place to go wherever\r\nyou go. Take it hunting, fishing, camping, boating, vacation, on\r\nthe job, in the field, or anywhere you may need to go. Click here to Order\r\n        Online Now or Call (281)277-3309 Fax:(281)277-3188 Visa and Mastercard Accepted Click to Order Now"
    },
    {
      "tag": "div",
      "text": "The Bumper\r\n        Dumper is great to have\r\n        anywhere you go. No other portable toilet can compare to\r\n        the support, stability and comfort that the Bumper Dumper offers. The frame is\r\n        made from quality steel and comes with a standard size\r\n        toilet seat. It's the only portable toilet you can use\r\n        your own seat on. Almost any standard size toilet seat\r\n        can be mounted to the frame so you can attach a padded\r\n        seat or the favorite seat of your choice. The Bumper\r\n        Dumper will last a long long\r\n        time and it's light weight and so easy to use. If you\r\n        have a trailer hitch receiver and travel or engage in\r\n        outdoor activities where restrooms are far and few in\r\n        between the Bumper Dumper is a must have item. Makes a great gift too."
    },
    {
      "tag": "p",
      "text": "When\r\n        traveling just pull off to a secluded spot and plug the\r\n        Bumper Dumper into the hitch\r\n        receiver. No more having to wait for the next unsanitary\r\n        rest ar ea. U se the Bumper Dumper when you need to go on the go. ORDER NOW $59.95 Call (281) 277-3309 Fax: (281) 277-3188 E\r\nmail: bumperdmpr@aol.com Now Available The first edition of the Uncle Booger T Shirt\r\n        Collection Click here to go to T Shirt Page Just click here to come in and check out\r\n        the T's ORDER NOW Start your Uncle Booger T Shirt Collection with the first edition\r\n        Booger Family T Shirt. ARE YOU LOOKING TO BUY OR SELL REAL ESTATE IN\r\nTEXAS? CLICK HERE FOR INFORMATION Click here to Check out Macks Leatherworks Uncle Booger\r\nwould like to thank the following sponsors for supplying the\r\nvehicles used at Texas Trophy Hunters\r\nExtravaganza. For the best deals on your next Toyota tell them Uncle Booger\r\nsent you! Please contact: HOUSTON SAN\r\n        ANTONIO FT.\r\n        WORTH Michael\r\n        Wolf Fleet Manager Sterling McCall Toyota 9400 Southwest Freeway Houston, Texas 77074 (713) 270-3900 John\r\n        Chervinskis Fleet Manager Alamo Toyota 2119 N.E. Loop 410 San Antonio, Texas 78217 (210) 657-6100 Nolan\r\n        Martin Fleet Manager Gary\r\n        McKinny Toyota 8901 Hwy 80 West Ft. Worth, Texas 76116 (817)560-1500 More Products\r\nand accessories coming soon so keep checking back To get\r\non our e mail list respond with \"Add me to your list\"\r\nat: bumperdmpr@aol.com or webbot bot=\"HTMLMarkup\" startspan Join the mailing list Enter your name and email address: Name: Email: Subscribe Unsubscribe webbot\r\nbot=\"HTMLMarkup\" endspan i-checksum=\"7441\" Click here to see what radio\r\nstations have interviewed Uncle Booger As\r\nSeen in Dave Barry's Unbearable Holiday Gift Guide LINKS TO SHOPPING, INFORMATION, AND\r\nOTHER GREAT OUTDOORS STUFF Comments, Testimonials,\r\nand More (Send us\r\nyour stories, pictures, testimonials, and comments on the Bumper\r\nDumper via snail mail or e\r\nmail.You may just get it posted up on this page. By sending us\r\nyour material you grant us the right to use the material. Any\r\nmaterials sent will not be returned. Thank you) Click here\r\nfor an interview with GOD For Great Music and \r\nEntertainment Check Out BILLY BLOCKS WESTERN BEAT For\r\nSuccessful Marketing, Consulting, Web Sites, and Promotions\r\ncontact STEPSINC@alltel.net Click here to see Uncle Boogers Awards\r\nPage Contact\r\nus for information on becoming a Bumper Dumper distributor at: Steps Enterprises Inc. (281) 277-3309 fax (281) 277-3188 e mail: bumperdmpr@aol.com Our prayers are with our brave men\r\nand women serving to preserve Freedom and Justice . You are visitor webbot\r\nbot=\"HTMLMarkup\" startspan alt=\"Site Meter\" Copyright (c)2000 Site Meter webbot\r\nbot=\"HTMLMarkup\" endspan i-checksum=\"9007\""
    }
  ]
}