{
  "url": "http://www.caligirl.net/cg/aboutme-cravings.htm",
  "content_hash": "9aeedf918a24b329823331ca96695f9b4fad53de0bd084041f9740703d86692f",
  "total_blocks": 46,
  "retained_blocks": 1,
  "ignored_blocks": 45,
  "blocks": [
    {
      "tag": "p",
      "text": "About Me Last Updated March 2003 Cravings & Fandom Food: Anything\n        that doesn't have seafood in it. The only seafood I don't mind\n        is Tuna and Shark. I eat poultry more than beef. The types of food I do like are\n        Irish (gotta love the champ potatoes!), Mediterranean, Peruvian Food and some Asian\n        foods like Thai. Ethnic Gourmet \n        Foods has some great frozen Thai dishes. Sweets: Sour Skittles, \n        gummy worms and Mocha Blast with Jamocha Almond Fudge (at Baskin \n        Robbins). Dreyer's Dreamer Ice Cream has two awesome flavors I like; Tiramisu \n        and Deep Dish Apple Pie. YUM! Now if I was trying to be a\n        health nut... Pears, Plums, Strawberries and Watermelon are my favorite fruits. Drinks: I\n        don't drink soda as much as I used to but Cherry Pepsi or Cherry Coke is\n        normally the choice if I do. My main drink is water, ice tea and my\n        addiction to swoon over hot Mochas. Hobbies: IRC, Singing, Rollerblading, Hanging out with friends, seeing the latest movies\n        in the theatres, walking\n        on the beach, Gaming , lighthouses and\n        collecting leopard items. Music: I love trance but I\n        enjoy listening to male singers/bands more often then the female singers.\n        I like most styles of music except I rarely fall for classical, opera or\n        jazz. If I had to name bands here, it would be ones like Coldplay, Rage \n        Against the Machine, 3 \n        Doors Down, Newsboys, Audio Adrenaline, Creed, P.O.D, Linkin Park\n        and Nickelback. Movies : I \n        enjoy too many! Action movies rock and romantic puppy love movies are on \n        the hit list right now. However, I totally fell in love with Lord of the \n        Rings series. Favorite Actors: Edward\n        Norton, Jude Law, Heath Ledger and Orlando Bloom. There are other actors\n        I like for their character though. Like Nicholas Cage is great at acting and so\n        forth. Although I have to admit, I have only liked Val Kilmer for\n        his lips. Books: Well\n        my last book was about a dog breed on Pembroke Welsh Corgis. I was going\n        to buy a puppy but I am going to hold off now. College and work is going\n        to ruin any training time for a puppy right now. Although, one of my\n        buddies has been trying to get my into these fantasy dragon books so I\n        may start reading a lot more again. I also need to buy the Lord of the\n        Rings set soon. Sports: Not\n        really into sports like my guy friends. I occasionally enjoy watching\n        Football, Hockey games (live ones are fun), and racing (Nascar). Flowers: When\n        I worked in a floral department (for a few years) I used to get asked\n        what type of flower was my favorite over and over and over again. I'd\n        always try to change the subject when I could tell the guy was single.\n        Hehe. Finally I'd have to tell them because some guys are smarter than\n        others. So I might as well spill the beans here. I am not a rose person.\n        I think they are pretty but when it comes down to it if I do get one\n        single rose it seems more valuable to me than having a dozen. Two seems\n        more like a connection with you and the person you love. I used to get\n        one single rose from a guy I dated last year. It seemed so much more\n        thoughtful than a bouquet. I got so much more excited than I would with\n        more than one. I wonder why? He normally gave them to me when I wasn't\n        expecting it... but they were also never red... he'd give me yellow or\n        pink. When I would see red roses from men before it just didn't hit the\n        heart. I think that sounds odd because every woman loves a rose. So down\n        to my favorites... I absolutely love Lilies. There are different types\n        that are gorgeous but even the regular hybrid colored ones just shine in\n        brilliance. Then last but not least are the silver roses. Those have a\n        hint of a blue lavender look but the smell can just melt a girl. Scent: The\n        smell of Silver roses and watermelon or vanilla type of scents. But my\n        favorite of all is a Men's Cologne: Acqua Di Gio by Giorgio Armani Favorite Colors: Many\n        different kinds of Blues have always been my favorite (lets just say\n        turquoise and teals could be thrown in here too... yes I am allowed to\n        cheat when it comes to colors). Forest Green (the\n        color of my truck) and Purple have been the recent colors that have\n        caught my eyes lately though. Back\n        to Main / About\n        Me"
    }
  ]
}