{
  "url": "http://www.cambridgeesol.org/research/savisual.htm",
  "file_number": "305",
  "content_hash": "195b565c1925b403a11ab2893c800c17ddaa5113a18b06863b2da9e04ac5dd96",
  "total_blocks": 205,
  "retained_blocks": 17,
  "ignored_blocks": 188,
  "blocks": [
    {
      "tag": "div",
      "text": "DWLayoutTable Home | Exams | Teaching Awards | Recognition | Research | Centres | Support | About \n              us InstanceBeginEditable name=\"lh_side_nav_text\" DWLayoutTable Special arrangements"
    },
    {
      "tag": "p",
      "text": "Special Arrangements overview Learning difficulties Hearing difficulties Visual difficulties"
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable DWLayoutTable Site Pathways For Language Learners For \n              Teachers For Schools/Universities For Employers Site Guide InstanceBeginEditable name=\"top_body_text\" Special \n\t\t\t\t\tArrangements for candidates with visual difficulties InstanceEndEditable InstanceBeginEditable name=\"body_text\""
    },
    {
      "tag": "p",
      "text": "Visual difficulties may range from a minor condition \n          to total blindness, and Cambridge ESOL can supply enlarged and modified \n          question papers for less serious difficulties, or brailled and modified \n          question papers where these are required. Exams If you have visual difficulties, you can ask for \n          Special Arrangements to be made so that you can take the following exams:"
    },
    {
      "tag": "div",
      "text": "Key English Test (KET) Preliminary English Test (PET) First Certificate in English (FCE) Certificate in Advanced English (CAE) Certificate of Proficiency in English (CPE) Business English Certificates (BEC) International English Testing System (IELTS) Young Learners English (YLE) Certificates in English Language Skills (CELS) Certificates in ESOL Skills for Life"
    },
    {
      "tag": "p",
      "text": "Applications for Special Arrangements for other \n         ESOL examinations not listed above may be possible. How to apply for Special Arrangements You must apply \n          through your centre as soon as possible. In the case of IELTS you \n          must apply \n          through your IELTS centre . Please check the latest dates for application which \n          vary according to the exam and are usually several months before the \n          exam. Your centre will tell you when you must apply. The centre will ask for full details of your particular \n          visual difficulty, and make all the necessary special arrangements for \n          you to take the exam. You may be asked to provide a medical certificate. Please read through the following sections carefully, \n          and make sure that you ask for all the necessary arrangements to be \n          made. See also the Important notes section below. What Special Arrangements you can request 1. Extra Time If you have visual difficulties, you will almost \n          certainly need extra time to complete a paper. You may ask for an extra \n          25% of the normal time allowed for a paper. You may ask for more than 25% extra time. This might \n          be necessary if, for example, it takes you a long time to read the questions \n          or record your answers. Remember, however, that too much extra time may \n          make you very tired. You will also be allowed to have breaks whilst taking \n          a paper, in addition to any extra time you need. Ask your centre to \n          tell you what you will be allowed. 2. Reading the question papers in a different way If you are partially sighted you may use the following \n          equipment:"
    },
    {
      "tag": "div",
      "text": "magnifying glass closed-circuit television (CCTV) hand-held scanning apparatus."
    },
    {
      "tag": "p",
      "text": "You may ask a 'reader' to read and re-read questions \n          to you (but see the Important notes section below). 3. Writing your answers in a different way If you wish, you may record your answers in the \n          following ways:"
    },
    {
      "tag": "div",
      "text": "you may use your Braille machine you may use your Braille machine, linked to a printer you may use a typewriter or word-processor. If you want to use a \n            word-processor, it must not have a spellcheck or thesaurus facility you may dictate your answers to an amanuensis (see the Important \n            notes section below)."
    },
    {
      "tag": "p",
      "text": "4. Braille question papers Braille versions of KET, PET, FCE, CAE, CPE, BEC, \n          CELS and IELTS (certain papers only) can normally be made available. Please tell us whether you need your papers in contracted \n          or uncontracted Braille. Please note:"
    },
    {
      "tag": "div",
      "text": "the supervisor will also have a print version of each Braille paper in some papers we arrange for the texts and the questions to be \n            brailled in separate booklets."
    },
    {
      "tag": "p",
      "text": "We can send you past exam papers in Braille as practice \n          material. Please ask us in good time, if you would like us to send you \n          some past papers. Contact the ESOL Special Circumstances Unit (see the \n          Further information section below). 5. Enlarged Question Papers You can ask for two different kinds of enlarged \n          question paper. Type 1: We enlarge the standard question paper making no changes to the layout \n          or material. You will receive A3 size question papers. (Usually 15.5 point) Type 2: We change the question papers, removing 'visual' material which is not \n          essential for answering the question. We then make large-print versions \n          of the papers in A4 size. (Usually 18 point bold) Note that we can also supply reduced print question \n          papers. 6. Listening Tests We make special arrangements for these tests. Many of the questions in the listening tests ask \n          candidates to make notes while they listen to a tape. If you are blind \n          or have visual difficulties you may not be able to do this. We produce a special version of the listening test. You will hear the same material and answer the same \n          questions as other candidates. However, the supervisor will: stop the tape before each part of the test to allow you enough time \n            to read the questions stop the tape at certain points during each part to allow you enough \n            time to write one or more answers stop the tape after each part to allow you enough time to check \n            your answers. You should note that when the tape is paused during \n          a part, you: may not need to write an answer at all. may need to write more than one answer. 7. Speaking Tests For KET, PET, FCE, CAE, BEC or CELS, you must normally \n          take the speaking test with a partner. If you have visual difficulties, you can apply to: have extra time if it takes you longer than usual to read any exam \n            material or decide what you want to say take the test with a partner who is not taking the examination take the test without a partner (i.e. in the parts of the test which \n            usually ask both candidates to talk to each other, you talk to the \n            examiner instead). (Please note that this option is not available \n            for BEC or CELS.) use adapted visual material (see below). Parts of the speaking test for some exams are visual \n          - they use pictures taken from newspapers or magazines, for example. If you are partially sighted we can supply enlarged \n          copies of these pictures. If you find it difficult to use enlarged pictures \n          we can supply enlarged print versions of written descriptions of the \n          photographs. Talk to your centre about which would be best for you. We can also supply material in Braille for blind \n          candidates. For example, in the Braille version of the FCE Speaking \n          Test: the examiner will spend a few minutes asking you to talk about yourself you will then be given short written descriptions of two photographs \n            in Braille. The examiner will ask you to compare and contrast the \n            situations in the descriptions and give your opinion about them. You \n            will have about a minute to do this finally you will be asked to take part in various conversational \n            activities using brailled notes or information. 8. Having a 'reader' or an amanuensis. A reader is a person who will read the questions \n          out to you. Note that the reader will not explain the questions to you \n          or offer any advice. A reader is not usually allowed to read out the \n          texts in a Reading Test. An amanuensis is a person who will write down your \n          answers. If you would like an amanuensis to write down your answers, \n          you should note that: you will be asked to spell certain words you must also indicate punctuation. The amanuensis will also read your answers back \n          to you if you wish. Please contact your centre if you would like to \n          know more about having a reader or an amanuensis. We recommend that you practise with a reader/amanuensis \n          before the examination. For example, you should make sure that you can \n          spell out the letters of the alphabet. Important notes Please note that it may not always be possible \n          for a Braille version of a particular examination to be prepared. British Standard Braille is moving over towards the optional use of   capital letters.   Skills for Life   Level 1 & 2 Reading may specifically test the use of capitals.   Capitals will therefore be included in Braille versions of Skills for Life   Reading in those tasks which test their use, and candidates who are preparing to   take a Braille version of Skills for Life should be made aware of this. Capitals   will not be included in texts or questions for other tasks for the time being. Cambridge ESOL reserves the right not to approve \n            applications for Special Arrangements. No application will be considered \n            unless it has the unreserved support of the centre. Further information If you would like information or advice, please \n          first contact your centre . For further information or advice about Special \n          Arrangements contact: Customer Support Unit University of Cambridge ESOL Examinations 1 Hills Road Cambridge CB1 2EU United Kingdom Tel. +44 1223 553997 Fax. +44 1223 553621 e-mail ESOLhelpdesk@ucles.org.uk InstanceEndEditable"
    },
    {
      "tag": "div",
      "text": "DWLayoutTable Country Sites"
    },
    {
      "tag": "p",
      "text": "For more information on Cambridge ESOL exams in your country or language:"
    },
    {
      "tag": "div",
      "text": "Select Arabic Argentina Austria Brazil China France Germany Greece Indonesia Iran Italy Mexico Russian Spain Switzerland Thailand Vietnam Exam Centres DWLayoutTable Find a centre Search the Site Examinations DWLayoutTable General English Business English Academic English Young Learners English Teaching Awards Legal\n\t\t      English Quick Links InstanceBeginEditable name=\"rh_side_nav_text\""
    },
    {
      "tag": "p",
      "text": "Research \n                Notes Studies in Language \n                Testing Jobs Centres FAQs"
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable"
    }
  ]
}