{
  "url": "http://www.canadianchristianity.com/cgi-bin/na.cgi?nationalupdates/050202liberals",
  "file_number": "307",
  "content_hash": "3a7217162219b0ed7171463e70ca5e848c35e2e401e7f311d231a3238cc97d1c",
  "total_blocks": 95,
  "retained_blocks": 4,
  "ignored_blocks": 91,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\""
    },
    {
      "tag": "p",
      "text": "Liberals table same-sex marriage bill despite protests, opposition By Meghan Wood CANADIAN justice minister Irwin Cotler tabled legislation to allow same-sex\nmarriage in the House of Commons Tuesday. If passed, Bill\nC-38 would redefine marriage as a \"union between two persons.\" As a\nresult, consequential amendments would also have to be made to the\nCanada\nBusiness Corporations Act, the Civilian War-related Benefits Act, the\nDivorce Act and the Income Tax Act. \"What will be the social effects of refashioning a fundamental social\ninstitution -- to marriage itself, to spouses, children and society?\"\nresponded Bruce Clemenger, president of the Evangelical\nFellowship of Canada (EFC). \"It is a sad day when the language of\nhusband and wife is removed from federal legislation. Is this what\nCanadians want? It is a distorted notion of tolerance and respect that\neclipses this distinctive relationship.\" If the bill is passed, the Liberal government would not use the\nConstitution's notwithstanding clause to preserve the current\ndefinition\nof marriage, as between two people of the opposite sex. The\nnotwithstanding clause allows the government to create laws that will\noperate in spite of some Charter rights that the laws appear to\nviolate.\nThough these declarations last only five years, they can be re-enacted\nindefinitely. Focus on\nthe\nFamily Canada president Terence\nRolston said \"there will be consequences\" if the legislation goes\nthrough. \"If passed, [this] experiment will be on the backs of our\nchildren,\" he said. \"But God puts our governments into power and he is\nsovereign over them. I believe in the power of prayer. Now's the time\nfor\nCanadian voices to be heard in the democratic process.\" Foreign affairs minister Pierre Pettigrew has said that churches and\nother\nfaith-based organizations should not intervene in matters of government\nand that Canadians need to \"distinguish between civil and religious\nmarriage.\" Responding to Pettigrew's remarks, Rolston said, \"How marriage is\nrecognized is important as to how society values the institution of\nmarriage. The law should underline and support the institution that God\nordained. It is a covenant.\" Janet Epp Buckingham, director of law and public policy at EFC, said\nmore\nthan 75 percent of marriages in Canada are performed by clergy. \"It is clearly a deeply religious constitution,\" she explains. \"It is\nnaive and impossible to say that you can change civil marriage without\nit\nhaving an impact on religious marriage and religious institutions.\" Gilles Marchildon, executive director of Egale Canada, a gay and\nlesbian\nrights group, said it is a \"dangerous blurring of the lines\" between\nchurch and state \"when any faith wants its view of the world and its\nview\nfor its own institutions imposed on society at large.\" But Rolston disagreed. \"This is one of the most significant issues to\nhit\nthe government in the past 30 years. We do live in a free and\ndemocratic\ncountry. We have the opportunity to vote and be involved in the\ndemocratic\nprocess. We shouldn't neglect the freedom of speaking out here for the\ntruth of God's word, proclaiming it to those in authority.\" Bill C-38 does state that \"officials of religious groups are free to\nrefuse to perform marriages that are not in accordance with their\nreligious beliefs.\" However, since only provincial governments have the\nauthority to legislate protection of religious freedom to the\nsolemnization of marriage, Buckingham said this issue is \"a political\nfootball\" being tossed between the federal and provincial governments. \"We have not seen any action by the provincial governments to protect\nreligious freedom,\" she says. \"Churches and religious institutions are\nbeing set up for endless court cases.\" The Vancouver Chinese Evangelical Ministerial Fellowship, representing\n95\nChinese Christian churches that includes 25,000 individuals, released a\ndeclaration opposing the bill January 28. The declaration stated that \"changing the tradition of marriage in the\nmanner proposed by the Federal Government goes against the intention of\nGod's creation and it runs counter to the moral traditions deeply held\nby\nChinese and people from other ethnic backgrounds . . . the government\nhas\nno right to ignore the will of the people in order to be politically\ncorrect.\" Related stories: Cotler\nannounces same-sex bill for next week, moves to silence Liberal\ncritics The Liberal government will defiantly push ahead\nwith\nplans to introduce a same-sex marriage bill next week in the face of\nincreasingly vocal opposition from critics outside and inside the\nparty. Canadian Press, January 26 Liberals\nwill introduce same-sex bill next week The matter dominated\nthe\nthree-day Liberal caucus winter retreat again yesterday and government\nwhip Karen Redman predicted that the bill will pass with a comfortable\nmargin. CanWest News Service, January 27 Also: Vancouver\nSun Manitoba\nMP likely to be only New Democrat to vote against same-sex\nbill NDP member of Parliament Bev Desjarlais said yesterday\nshe\nwill vote against her party's line on gay marriage and will accept the\nconsequences. CanWest News Service, January 27 Also: Vancouver\nSun Lesbian\ncouple pleads with Harper Tory leader not swayed by\nemotional\nappeal Vancouver Sun , January 27 Lunch\nwith a same-sex dissident After watching her breeze through\nanother series of television interviews, you ask Belinda Stronach if\nshe's\nsick of the same-sex issue. \"You can't have too much sex,\" the\ncamera-friendly Conservative MP grins. Hot-blooded males within earshot\nreact by clutching their chests in cardiac arrest. She watches my pen\nhit\nthe notebook. \"Um, I didn't say that.\" OK, fine, but the moments of\nsilence during our subsequent lunch speak volumes about a party now\nproudly and loudly aligning itself as the last defender of marriage's\ntraditional opposite-sex definition. Don Martin, National\nPost ,\nJanuary 27 B.C.\nCatholics urged from the pulpit to write their MPs on same sex\nmarriage \"Some within society, supported by judges and\nlegislators, are trying to turn the marriage debate into a human rights\nissue,\" writes Vancouver Archbishop Raymond Roussin in a three-page\npastoral letter to be read from the diocese's pulpits and sent out on\nFriday. \"But that is not what marriage is about. As a social\ninstitution,\nmarriage is concerned with the common good, not individual\nrights.\" Canadian Press, January 28 Stay\nout of marriage debate, church told Same-sex law not your\nbusiness, Pettigrew argues, but archbishop insists he can say what he\nwants Ottawa Citizen , January 28 Also: National\nPost | Edmonton\nJournal Liberal\nadmits it's futile to fight same-sex bill Issue dominates\nparty\nagenda CanWest News Service, January 28 Tories\nriled by Harper's tactic Activist quits riding post over\ncampaign against same-sex marriage, another urges leader to drop\nissue Ottawa Citizen , January 28 Nanaimo\nMP says Liberals split on same-sex debate If Prime Minister\nPaul Martin goes ahead with his vote on same sex marriage, he'll find\nthere's a whole lot more opposition to the idea than he bargained for,\nsays Nanaimo-Alberni MP Dr. James Lunney. BC Newspaper Group,\nJanuary\n28 Polygamy:\na challenge to multicultural fans The homosexual lobby and\nits\nallies insist that same-sex marriage can't possibly lead to polygamy,\nbecause, you see, gay sex is legal but polygamy is forbidden by the\nCriminal Code. How stuffy. How arrogant. That might be the gay lobby's\nview. That might be the lofty liberal-left view. That might be the\ncolumnists' view. But they aren't the ones who would decide whether to\nlaunch a constitutional challenge. That would be the polygamists'\ndecision. Trevor Lautens, North Shore News , January 28 Anti-same-sex\nside strikes back Even though the battle appears about over\nin\nCanada, a new book offers some intellectual counter-punching Douglas\nTodd, Vancouver Sun , January 29 Belinda's\ntune off key Belinda Stronach is busy telling the media that\nthe Conservative Party should not become involved in the gay marriage\nissue. Belinda has views on things? Who knew! Michael Coren, Toronto\nSun , January 29 What\nis family? Forget concerns that same-sex marriages will\ndestroy\ntraditional marriage and the traditional family. Heterosexuals have\nalready taken care of that Daphne Bramham, Vancouver Sun ,\nJanuary 29 Pettigrew\nputs boots to religious Canadians If any Canadian cabinet\nminister were to announce that all citizens who believe in God should\nbe\nforbidden to vote, not only would he be out of the cabinet, he might be\nput into an insane asylum. Such a thing is, in other words,\nunthinkable.\nYet a senior Canadian cabinet minister said something last week that\namounted to exactly this, and nobody (nobody in the cabinet anyway)\nsaid\nanything. Ted Byfield, Calgary Sun , January 30 Parties\nexpect heated session of Parliament Budget also coming\nup National Post , January 31 Religious\ngroups mobilize to support traditional marriage 'What are\nyou\nwilling to sacrifice to defend the Church?' National Post ,\nJanuary 31 Defining\nmarriage is a job for Parliament In 1982, Canada's legal\nsystem\nwas fundamentally changed by the adoption of the Charter of Rights and\nFreedoms. Before that time, Parliament and the provinces, acting\npursuant\nto the jurisdiction granted under the British North America Act of\n1867,\nwere legislatively supreme. Although the courts did have the authority\nto\nstrike down legislation, their right to do so extended only to\nsituations\nin which a particular legislature strayed into the jurisdiction\nassigned\nto another. Vic Toews, National Post , January 31 A\nperverse vision of church-state relations I expect the irony\nwas lost on him. The Liberal Cabinet having just returned from a\nlengthy\nAsian tour, Foreign Minister Pierre Pettigrew announced that religious\nleaders should not involve themselves in the gay marriage debate. The\nPrime Minister had just been chatting up the gay marriage issue in\nIndia\nand China. The government enthusiastically wants to talk about gay\nmarriage, even overseas, but thinks that Canadians should shut up about\nit\nat home. Or more to the point of Mr. Pettigrew's remarks, that Catholic\nbishops should keep silent. \"I find that the separation of church and\nthe\nstate is one of the most beautiful inventions of modern times,\" said\nMr.\nPettigrew. The authoritarians of China do not find the invention quite\nso\nfetching; their aesthetic judgment favours a different modern invention\n--\ncommunism. And they have more effective ways of silencing their\nbishops:\nputting them in jail. Fr. Raymond J. de Souza, National Post ,\nJanuary 31 Same-sex\nmarriage debate is over I support equality. And so, I\nsupport\nsame-sex marriage. Basil \"Buzz\" Hargrove, Financial Post ,\nJanuary 31 Same-sex\nbill hits house Religious group warns MPs of political\nprice CanWest News Service, February 1 Also: Vancouver\nSun Same-sex\nbill introduced in House of Commons The Liberal government\nintroduced its long-awaited and controversial same-sex marriage bill in\nthe House of Commons Tuesday, containing two carefully worded sections\nproviding protection for religious groups. The wording was aimed at\ncalming opposition to the bill from some churches and the Conservative\nParty. Globe and Mail , February 1 Casting\nmarriage as a panacea Let's not be too tough on columnist\nMaggie Gallagher. If marriage's primary cheerleader says she can't\nremember getting US$21,500 from the Bush administration in 2002 to\nconsult\non its initiative to promote marriage among the poor, why not believe\nher?\nIn the current political climate, the demands on a \"marriage expert\"\nextolling the virtues of \"traditional\" marriage resemble those faced by\nair traffic controllers at O'Hare. Anne Kingston, National\nPost ,\nFebruary 1 Tories\nvow to amend new bill Justice critic Toews says his party\nwants\nmore protection for religious groups CanWest News Service, February\n2 Also: Vancouver\nSun Most\nwant referendum Canadians back gay rights but want marriage\npreserved as is, National Post/Global National poll\nfinds National\nPost , February 2 Religious\ngroups divided over legislation As parliamentarians now\nbegin\nwhat could be several months of debate, some observers vowed to use\nthat\ntime to prove how similar laws in other countries have led to wide\nsocial\nproblems. Meanwhile, supporters of the bill lashed out at Conservative\nleader Stephen Harper, who has led opposition to same-sex marriage in\nParliament, accusing him of trying to scare this country's immigrant\ncommunities into opposing the legislation by appealing to their\ntraditional religious beliefs. National Post , February 2 Majority\nof B.C. MPs to battle same-sex bill A clear majority of\nB.C.'s\n36 MPs in the House of Commons are part of a campaign to defeat Liberal\nlegislation tabled Tuesday aimed at legalizing same-sex marriage across\nCanada. All but two of the 22 B.C. Conservative have stated publicly\nthey\nwill vote against the bill, even though several opinion polls have\nsuggested that a majority of British Columbians back the thrust of the\nLiberal legislation. Vancouver Sun , February 2 A\nfew questions for Stephen Harper How, precisely, do you\nintend\nto protect traditional marriage? Peter McKnight, Vancouver\nSun ,\nFebruary 2 Rights\ncrusade continues apace Most Canadians, it seems, are of the\nview that progress is wonderful -- if only it would stop.\nUnfortunately,\nIrwin Cotler, Canada's Justice Minister, is not one of them. John\nIvison, National Post , February 2 Getting\nbeyond same-sex marriage In March, the Conservative Party of\nCanada will hold its founding convention and policy forum in Montreal.\nThis is a historic juncture, an opportunity for the new party to set\nits\ncourse and take a key step toward winning the trust of\nCanadians. Belinda Stronach, National Post , February 2"
    },
    {
      "tag": "div",
      "text": "Search Archives Canadian Directory Category Books & Music Camps Chaplains Churches Counsellors Denom. Offices Education Schools Higher Ed. Homeschooling Ministerials Ministries Retreats"
    },
    {
      "tag": "p",
      "text": "Contact Us Partner with us! Advertise on\n\nCC.com Search The\nBible Version: NIV NASB RSV KJV NKJV Darby YLT WE All Passage: Search word(s): The Bible Gateway(TM) is a service of Gospel\nCommunications Network (Gospelcom)"
    }
  ]
}