{
  "url": "http://www.cbrrescue.org/articles/bringhome.htm",
  "content_hash": "a7eda9bacb6db001048d4d7b5bbcee7aa6a6c3999d2336ec11bfeb77d540da4b",
  "total_blocks": 48,
  "retained_blocks": 13,
  "ignored_blocks": 35,
  "blocks": [
    {
      "tag": "p",
      "text": "Bringing\r\n    Home Your Newly Adopted Rescue Chesapeake Bay Retriever First things first - CONGRATULATIONS !!!\r\n    We are all so happy that you chose to help a Chessie in need and were willing to open your\r\n    home and hearts to this Brown Dog! The theme of this information packet is \" SET YOUR DOG\r\n    UP TO SUCCEED !\" By understanding your new dog's behavior - you can anticipate\r\n    problems and correct them calmly and as quickly as possible. Be reasonable in your\r\n    expectations. We want the adoption of your Chessie to be a \"win-win\" situation\r\n    on both sides! Before you pick up your new Chesapeake Bay Retriever"
    },
    {
      "tag": "div",
      "text": "Since you've chosen to adopt a Chesapeake Bay retriever, you've probably educated yourself\r\n    about 1) the reasons this breed is unique (American bred\r\n    retriever, not related to Goldens and Labradors), 2) the breed's behavior\r\n    characteristics (intensely loyal, protective, sensitive and serious) and 3) changes to your current lifestyle that this Chessie will cause (time set aside daily for exercise\r\n    and work , either obedience or retrieving). The Chesapeake Bay Retriever Relief\r\n    & Rescue website ( www.cbrrescue.org ) has\r\n    information about the uniqueness of this breed, Chessie behavior and dog ownership that\r\n    you might want to read and review."
    },
    {
      "tag": "p",
      "text": "The adoption coordinator that you worked with told you about\r\n    your Chessie's history, veterinary information, evaluations and current eating, sleeping\r\n    and activity routines so that his transition into your home can be easier. Dogs need order\r\n    and are extremely routine oriented . We recommend that you find out all you can\r\n    about his routine - and duplicate what you can - before you start to re-orient him\r\n    to the rhythms and schedules of your home. Work out your house rules and dog-care\r\n    regimen in advance among the human members of your household. Who will walk the dog first\r\n    thing in the morning? Who will feed him at night? Will Chessie be allowed on the couch or\r\n    bed? Where will he sleep at night? Will he be crated? To ensure a smooth transition, you will already have supplies (collar, ID tag, leash, food, bowls, crate and toys) for your Chessie. Try and arrange the arrival of your new dog for a weekend -\r\n    or when you can be home for a few days - for quality, hands-on time . If you have resident pets , make sure they are\r\n    up-to-date on their shots and in general good health before bringing home your new dog.\r\n    Despite the best efforts of the rescue organization, previous owner or foster family,\r\n    viruses can be spread and occasionally go home with adopted rescue dogs. You may wish to\r\n    set up an appointment with your own vet to check out your new dog and set up an\r\n    inoculation schedule, depending on the veterinary care your rescue dog has received. Register for an obedience class . Don't ignore this\r\n    very important step in setting yourself and your rescued Chessie up for success! Be dogged\r\n    about finding an obedience class or trainer. There are many positive reinforcement-based\r\n    dog obedience classes that teach dog manners, canine good citizenship and discipline. Try\r\n    to register for a class starting about 3 to 4 weeks after your dog has\r\n    come home with you. It is important that your new dog has some time to adjust to you and\r\n    your home before putting him into the stimulating environment of an obedience\r\n    class. Even the shortest \"dog manners\" course offered at your vet's will\r\n    reinforce the new bond between you and your new Chessie, will give you a valuable\r\n    face-to-face resource for questions about your dog's behavior, and will provide a powerful\r\n    tool for moderating your rescue dog's less attractive behavior traits! Remember, Chessies\r\n    need work - this is a really easy way to provide him with active, mental work that you'll\r\n    approve of! The rewards are obvious - what a joy it is to have a well-mannered, trained\r\n    Chessie companion! New families often ask about changing the adopted dog's\r\n    name . If you desire to, it is fine. Many times, the dogs are given names at random by\r\n    a shelter. The dog will learn his new name if it's overused in the beginning. It is in no\r\n    way traumatic to the dog to change his name. When you arrive home... Things to expect: You should expect your new dog to act differently than how he did when you met him at the\r\n    foster/owner's home. He will be excited, nervous and maybe tired after the trip to your\r\n    house. Being routine-oriented, your Chessie may have just gotten comfortable at his foster\r\n    home and now recognizes that the routine is changing yet again. He doesn't know the\r\n    smells, the sounds, and importantly, the routines and rules of your house. This is very\r\n    confusing for your Chessie. Dogs display anxiety and nervousness by: panting,\r\n    pacing, lack of eye contact, \"not listening,\" housebreaking accidents, excessive\r\n    chewing, gastric upset (vomiting, diarrhea, loose stools), crying, whining, jumpiness and\r\n    barking. This is a litany of behaviors any and every dog owner dreads! As long as you\r\n    understand where these behaviors originate, you can perhaps address them before they appear and deal effectively when they do! Your goal in the next weeks is to reduce\r\n    the \"noise & confusion in his head\" and get him to relax, to be calm and\r\n    show him how to be good. Despite your joy at adopting this Chessie (and after a few\r\n    enthusiastic hugs and kisses), you should be calm and gentle and firm with your Chessie.\r\n    Talk to him in a calm, low voice as you travel home - avoid playing the car radio and\r\n    having too many people with you when you pick him up. All rescue dogs go through a \"honeymoon period.\"\r\n    After the first day or so, the dog may be very quiet and extraordinarily controlled and\r\n    \"good.\" The \"real\" dog appears two to four weeks later - after he's\r\n    mostly figured out the house rules, the schedule of the days, and the characters of his\r\n    new family. At this time, he'll start testing out his position in the pack, and may\r\n    \"regress\" to puppyhood behaviors and \"bad\" behavior. Be patient with\r\n    him, firm in your expectations, praise him for appropriate behavior - especially when he\r\n    is lying quietly and behaving himself. Don't praise for nothing constantly - the dog will\r\n    learn to tune out your praise over time! Things to Do: LEASH YOUR DOG TO INTRODUCE HIM TO YOUR HOME! When you first bring your new dog home, make sure you have her on a leash! Spend\r\n    the first 15-30 minutes walking her outside around the perimeter of your yard or the area\r\n    that you will be with her most on your property. Walk slowly - let her \"lead\"\r\n    mostly - and let her sniff and pause if she wants to. She is getting used to the \"lay\r\n    of the land\" and all the smells associated with her new home. She will undoubtedly\r\n    relieve herself - this is her way of making herself at home by adding her mark to the\r\n    smells of your home, and now her new home. Obviously you want this to happen outside! If\r\n    you have a place you wish this to happen, encourage her to \"get busy\" in that\r\n    area and praise her warmly when she does. The excitement of the move and new family will\r\n    cause her to have to relieve herself more often than normal . You must be prepared\r\n    to give her plenty of opportunities to do this in the beginning! Whenever the rescue dog\r\n    is not confined, supervise her - set this dog up to win! You might want to consider isolating the new dog from your\r\n    resident dogs during the first entry to your home - he will appreciate safe and quiet at\r\n    first as he explores your home. Crate your resident dog or have someone take him for a\r\n    walk while your new dog explores. Let the new dog explore the house - leave her on leash and\r\n    make sure she's supervised AT ALL TIMES! We recommend leaving your new dog on leash in the\r\n    house for the first day. Don't even leave the dog unsupervised while you answer the phone! Once inside your house, a male may still accidentally mark a\r\n    door, plant or chair when he first walks inside your home. This is out of nervousness (or\r\n    he may smell another dog), so it is best to leave him on the leash indoors the first day.\r\n    If he starts to lift his leg, give him a short jerk on the leash and tell him\r\n    \"No,\" that should stop him immediately and remind him of his housebreaking\r\n    manners. Follow up this correction by taking him outside in case he's not just marking!\r\n    Bear in mind that if your Chessie has a few accidents, it does not necessarily mean that\r\n    he is not housebroken. We can't emphasize enough how much nerves and excitement can cause uncharacteristic\r\n    accidents . Watch for typical pre-piddling behavior - circling, sniffing, etc. Do not\r\n    scold or hit a dog for having an accident - rather, verbally get his attention, grab the\r\n    leash, and take him right outside to his spot to do his business. If he does it, praise\r\n    him! Once he relaxes and learns the rhythms and routines of your home, all his manners\r\n    will return! Even in a fenced yard, you'll want to leave your rescued\r\n    Chessie on leash for the first week or so. This way, you can reinforce a recall command\r\n    and help monitor pack behavior if you have other dogs. Until your new dog bonds to you and\r\n    makes good eye contact, we recommend leaving her on leash. PROVIDE QUIET TIME!"
    },
    {
      "tag": "div",
      "text": "Quiet time will be important for your new Chessie in the first week. Because of his\r\n    nervousness and anxiety, he will get worn out fast. His recent past may include a shelter\r\n    stay which has worn him out with worry. Despite your excitement, try and resist inviting\r\n    friends and relatives over to visit him. Give him time to get used to your immediate\r\n    family and resident pets only. If the dog does not solicit play or attention from you, let\r\n    him alone to sleep or establish himself. Believe it or not, we don't want you to force him\r\n    to play at first!"
    },
    {
      "tag": "p",
      "text": "FEED YOUR NEW DOG! Feed your new dog twice a day; half in the morning, half at night. Ask and encourage the\r\n    dog to sit before putting the bowl down. Put the food bowl down for 15 minutes. If the dog\r\n    does not eat her food, pick up the bowl until the next mealtime. After a couple of days of\r\n    this routing, even the most finicky of eaters will change their minds. Feeding this way\r\n    you can monitor exactly how much she is eating. If you have other dogs , feed your rescue dog away from\r\n    them but at the same time. You can feed in the same room, but use opposite corners,\r\n    putting the dominant dog's bowl down first. This is usually the resident dog on the first\r\n    few nights - but that situation may change over time! You may want to arrange having\r\n    another adult in the room for the first week of feedings to monitor the \"pack\r\n    behavior.\" Watch that each dog sticks to his own bowl. Keep vigilant over feeding\r\n    time for a couple of months until the pack positions are worked out. CONSIDER CRATING YOUR DOG!"
    },
    {
      "tag": "div",
      "text": "Many of the Chessies that pass through rescue have been crate trained at one time or\r\n    another. Every dog needs a place to escape to, a place to call his own, and a crate\r\n    provides an answer to these needs! Your new Chessie will have some degree of separation\r\n    anxiety when you leave him for work or alone at home. Crating the dog in the beginning\r\n    will eliminate accidents, chewing destruction, and other mischievous activity that is\r\n    rooted in nervousness and insecurity. Your dog is safest in the crate when you are not\r\n    home until you can totally trust him loose in the house. This is especially true if you\r\n    have resident pets because you can't supervise their interactions when you're away or\r\n    asleep! Children should be taught to leave the dog alone if he retreats to his crate. You\r\n    should never use the crate for disciplining. The crate must be a dog's sanctuary for crate\r\n    training to be effective. Crates are great for traveling with your dog later - the dog\r\n    will always have a familiar den to retreat to and feel comfortable and reassured."
    },
    {
      "tag": "p",
      "text": "Each time your dog is confined, make sure the dog knows she's\r\n    a good girl. If the Chessie is particularly emotional or anxious, try making good byes and\r\n    hellos as unemotional & nonchalant as possible. While crating a dog helps make everybody safe, crating should\r\n    NOT be abused by locking the dog in the crate all the time. Chessies need to be with you\r\n    and should be with you unless they cannot be supervised or trusted alone in the house. For\r\n    instance, if you are going to shower and the dog still sometimes chews, crate him for\r\n    those 15 minutes for safety, but then let him out to be with you. If the dog is crated\r\n    while you are work all day - you MUST make an extra effort to let the dog \"hang\"\r\n    with you in the house until he is reliable loose in the house. If you prefer not to crate, make sure to set aside a safe,\r\n    indestructible space in your home for your rescue dog. You may want to try using baby\r\n    gates in the kitchen or hallway. Remember, you may really want to keep your dog on easy\r\n    cleanup flooring at first!! If the area of confinement is too large, you may begin to have\r\n    housebreaking accidents. We do not recommend the basement or garage, since your dog will\r\n    not feel \"part of the family\" isolated away from it. If he can see and hear you,\r\n    much the better. This is why wire style crates are so effective in the house. BE PATIENT DURING THE HONEYMOON PERIOD!"
    },
    {
      "tag": "div",
      "text": "There is a good chance that your rescued Chessie will show his insecurity by following you\r\n    everywhere! This will include trying to hang with you in the bathroom, watching TV with\r\n    you, getting the mail, and undoubtedly wanting to sleep with you. It is not unusual for\r\n    him to whine or cry or bark if confined away from you at night - lights out at a new\r\n    strange place is a stressful thing for him. If you put the crate close to your bedroom or\r\n    somewhere he can see you, the problems are usually minimized. Safe chew toys in the crate\r\n    at night will give him something to do if he's awake. Remember, during the first couple of\r\n    weeks, the dog will probably get quite tired and worn out by the day's activities, so\r\n    establishing a sleep schedule is usually not a big deal. As you wean him from the crating\r\n    at night, make sure he has been well exercised - a tired Chessie is usually a really good\r\n    Chessie indoors!!"
    },
    {
      "tag": "p",
      "text": "ESTABLISH A ROUTINE!"
    },
    {
      "tag": "div",
      "text": "Try to develop and use a consistent daily routine for feeding, exercising, and\r\n    bathroom duties. Dogs are creatures of habit and routine translates into security for\r\n    them. If you do the same things in the same way and in the same order, he will settle in\r\n    more quickly and learn what is expected of him and when."
    },
    {
      "tag": "p",
      "text": "Let your new Chessie out to air and take care of business as\r\n    soon as you rise in the mornings. Feed him after a short walk or romp in the yard. Give\r\n    him another chance to relieve himself before you go to work. Upon return from work,\r\n    immediately let the dog out for exercise and bathroom break (this is NOT the time to read\r\n    the mail, make a phone call or flop yourself on the sofa!!!). If he's exercised heavily,\r\n    wait 30 minutes or so before the evening feeding. He'll need another bathroom break\r\n    anywhere from 30 minutes to several hours after the evening meal, depending on his age -\r\n    it'll be your job to figure this out. He should get another airing right before you go to\r\n    bed. SOCIALIZE YOUR RESCUED CHESSIE!"
    },
    {
      "tag": "div",
      "text": "Rescue dogs come from a variety of backgrounds, but all dogs can do with more\r\n    socialization. After your dog has time to settle in your home and is starting to look to\r\n    you with confidence (2-3 weeks), start providing new socialization opportunities."
    },
    {
      "tag": "p",
      "text": "Now you can start inviting your friends and relatives over.\r\n    Do introductions to new people gradually. Introductions can take the form of petting,\r\n    playing fetch, even going for a walk. Do not force the dog to accept new people -\r\n    do it positively, with lots of praise, allowing the dog to approach people rather than new\r\n    people approaching your dog!!! Be sure to tell your visitors that your dog is new from\r\n    rescue so they need to be more sensitive. Don't reach for the dog right away - let him\r\n    come to them. If he does not go to the new person, that visitor should completely ignore\r\n    the dog. Suggest after the dog has met/sniffed the new person that they pat the side of\r\n    the dog's neck or side of the shoulder instead. Patting a dog on the top of the head is\r\n    interpreted by dogs as a powerful dominance attempt and can be a challenge to some dogs, a\r\n    frightening thing to others. Start taking your dog new places - nearby parks, dog-allowed\r\n    beaches - and, especially to obedience classes! The opportunity will allow you to\r\n    determine how your dog responds to strange people, dogs and places. LOVE AND ENJOY YOUR NEW DOG!! Authority without domination. Love without subservience. Respect without fear. This is an adage used by workers in GSD rescue. It is\r\n    appropriate for rescued Chessies, too, and we'd like people to think about it as they live\r\n    with and train their rescue dogs. You do not need to frighten you dog into complying with\r\n    household obedience commands, or prove to him that you are the toughest creature around by\r\n    using constant brute force. You DO need to show your dog that you are the leader in the\r\n    household, a leader he should put his trust in following. You can do this by\r\n    \"telling\" your dog this in a language he understands - body language and daily\r\n    habits. Respect is not something that you can force a creature into giving you. Above all, be patient, firm and consistent with your new\r\n    Chessie. Use positive reinforcement and lots of praise when she's good. When mistakes are\r\n    made, correct her when it's happening, and praise her when she modifies her behavior.\r\n    Undoubtedly you will get lots of advice - good and bad - from other dog owners! Read and\r\n    research as much as you can to prepare yourself. Understand that sometimes you may need to\r\n    try more than one approach to a problem because every Chessie is different. Most rescue\r\n    and adoption coordinators will follow-up on the dogs they place. Most rescuers are backed\r\n    up by dog behavior and health experts within their own local organization, so if they\r\n    don't know the answer to a problem, they can ask others. Don't be afraid to ask questions,\r\n    bring up new situations, and feelings of frustration that you may have! Our goal is to\r\n    make sure rescue dogs never have to be uprooted again, so we are quite interested in\r\n    helping you troubleshoot any problems - the sooner the better before they become big\r\n    problems that threaten the placement! Most of all, be prepared to give and receive more love,\r\n    affection and loyalty than you ever thought possible! Enjoy your brown dog for many years\r\n    to come and thanks again for helping us rescue Chessies! - credit for many of these tips is due to German Shepherd\r\n    Dog Rescue of New England, Inc., Labrador Retriever Rescue, Inc., and the American Kennel\r\n    Club. other resources on the web: www.canismajor.com , cindy.tittle.moore"
    }
  ]
}