{
  "url": "http://www.cbsnews.com/stories/2005/01/16/iraq/main667256.shtml",
  "file_number": "318",
  "content_hash": "29c22f1b77c8ac0de5a61284c426f155b6febe3a807b865dc63e945ba4f0cc2b",
  "total_blocks": 336,
  "retained_blocks": 4,
  "ignored_blocks": 332,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" HTML for CBSNews.com Search Stories Videos The Web Collections Home | U.S. | World | Politics | SciTech | Health | Entertainment | Business | Opinion | <span class=\"linkred\">NEW </span> Strange News | Sports | Blogs | Interactives | Mobile | Video [ Build Playlist ] CBS Evening News [ Watch Now ]  | The Early Show | 48 Hours | 60 Minutes &nbsp;&nbsp;|&nbsp;&nbsp;<a href=\"/sections/earlyshow/saturday/main3480.shtml\" class=\"link\" target=\"_top\">The Saturday Early Show</a> | CBS Sunday Morning | Face The Nation | Up To The Minute Start Answers.com support section End Answers.com support section"
    },
    {
      "tag": "h2",
      "text": "Iraq: No-Drive Zone During Voting?"
    },
    {
      "tag": "h1",
      "text": "Gov't May Ban Private Vehicles For 3 Days To Curb Car Bombing Odds"
    },
    {
      "tag": "div",
      "text": "World Main Page War On Terror Iraq: After Saddam World War On Terror Reporter's Notebook Letter From Asia Diplomatic Dispatches Audible.com Downloads World Video Special Section: The Latest Stories Interactives: Iraq Three Years Later Postwar Iraq New Government Attacks Map Hostages Held Daily Photos Fallen Heroes WMD Fallout Abuse At Abu Ghraib <hr width = 50%>\n\n\n<b> Video Archives:</b><br>\n\n <a href=\"javascript:PopUp('http://www.cbsnews.com/elements/2004/11/08/world/videoarchive654219.shtml',540,400)\" class=\"link\" >Fallujah Fight</a><br>\n\t\t\t\n <a href=\"javascript:PopUp('http://www.cbsnews.com/elements/2004/03/09/iraq/videoarchive604934.shtml',540,400)\" class=\"link\" >War Anniversary</a><br>\n\n <a href=\"javascript:PopUp('http://www.cbsnews.com/elements/2003/12/14/iraq/videoarchive588429.shtml',540,400)\" class=\"link\" >Saddam Capture, Court</a><br> Interactive Attacks Map Details on the insurgency and terrorism that has continued to take lives since the fall of Saddam. Interactive Battle For Iraq Forming a government, the insurgency, key players, background and photos. Interactive Fallen Heroes Profiles of U.S. soldiers who've died in Iraq, a look at the war's toll and pictures of mourning. RELATED STORIES & LINKS CIA: Iraq Could Be Terror Hotbed New Report On The U.S.'s Future International Relations Points To Danger In Iraq Iraqi Guard Bus Attacked 15 Guardsmen Said To Be Kidnapped; 3 U.S. GIs Killed Elsewhere Hotel Violence In Baghdad Turkish Businessman Kidnapped, Six Iraqis Killed At Baghdad Hotel Aide To Top Iraq Cleric Killed Man Aligned With Shiite Grand Ayatollah Al-Sistani, 5 Others Killed Dangerous Skies Over Iraq Insurgents Stepping Up Attacks On U.S. Supply Planes Iraq PM: Areas Unsafe For Vote Allawi Says Disenfranchised Areas Will Not Be Widespread No Basis For WMD Smuggling Claims White House Theory That WMDs Were Removed From Iraq Unfounded Bomb Kills GIs In Tank 2nd Blast In A Week Aimed At U.S. Armored Vehicle In Iraq Graner Gets Ten Years Faced Up To 15; Said Superiors Ordered His Abu Ghraib Actions Baghdad Dep. Police Chief Killed Deputy Police Chief And His Son Shot While On Their Way To Work Jan. 15, 2005 Quote \"It's a magnet for Mujahideen from around the world  from all over the Arab world and all over the Muslim world, Indonesia and the Philippines.\" Former CIA Agent Michael Scheuer, on Iraq (CBS/AP) Iraqi officials said Saturday they are considering new measures to protect voters in the Jan. 30 national election, including a three-day, nationwide ban on driving to discourage car-bombings. Fresh clashes broke out in the troubled northern city of Mosul, where most election officials have fled their jobs in fear. A U.S. military helicopter made an emergency landing in Mosul after drawing ground fire, the U.S. command said. Also, a U.S. Marine was killed in action Saturday in a tense area just south of Baghdad; the U.S. military claimed insurgents are being aided by former Saddam Hussein loyalists now in Syria; and leading Shiite politicians tried to dispel fears they would impose an Iranian-style clerical regime and appealed to Sunnis to participate in balloting. U.S. and Iraqi officials fear a surge in insurgent attacks as the election approaches. Many members of the Sunni Arab minority are expected to boycott the balloting, and Sunni rebel groups have threatened to attack polling stations. To prevent that, an Iraqi Cabinet minister told reporters that authorities are considering a number of special measures, including restrictions on the movement of private vehicles, and possible security cordons around polling stations. Provincial Affairs minister Waeil Abdel-Latif gave no details about the proposed restrictions, but security officials said they included banning all private vehicle traffic across the country for three days around the election. That would make it easier to spot would-be vehicle bombers and to inhibit rebel movements. \"The government is determined to make available facilities and security guarantees to ensure the success of the election,\" Abdel-Latif said. In other developments: Army Spc. Charles Graner Jr., the suspected ringleader of abuse at the Abu Ghraib prison in Iraq, took the stand for the first time Saturday and said he was ordered by interrogators to physically mistreat and sexually humiliate prisoners. Speaking a day after his conviction for the abuse, Graner described himself as a by-the-book prison guard who was corrupted by superiors. Three mortar shells exploded Saturday near Baghdad's heavily guarded Green Zone, causing no casualties but sending American and Iraqi officials scurrying for cover. It marked the third straight day of rebel attacks on the Green Zone, the nerve center of the U.S. and Iraqi administration, after a lull of a couple of weeks. A roadside bomb ripped through a U.S. convoy Saturday on the western edge of Baghdad, destroying a truck, police Lt. Akram al-Zubaie said. There were no reports of casualties. U.S. troops arrested six suspected insurgents, including a former Iraqi general, in raids around Baghdad early Saturday, U.S. officials said. The general, who was not identified, was suspected of planning insurgent attacks. Underscoring the security threat, fresh clashes broke out Saturday in the troubled northern city of Mosul between U.S. troops and insurgents, after the rebels blasted an American convoy. After the blast, insurgents opened fire on American troops, who then raided a nearby agricultural research station looking for the assailants. A U.S. Army OH58 Kiowa helicopter made an emergency landing in Mosul, Iraq's third-largest city, after receiving ground fire. The two crew members escaped injury, the command said. In Baghdad, Brig. Gen. Carter Ham, the U.S. general responsible for security in northern Iraq, said that virtually every election worker in Ninevah province, which includes Mosul, quit recently because of security fears. Ham said a new election coordinator was scrambling to find workers with about two weeks left before the election and that staffers may have to be sent there from other parts of the country. \"To tell you the truth, we don't know how many staff there actually were,\" he told reporters. \"But we know that at one point, there were essentially none left.\" Ham also said there were indications that insurgents were getting support from Iraqis who fled to Syria, about 70 miles west of Mosul, after Saddam's regime collapsed. \"There are some indications, clearly, that the insurgency is receiving some support from former regime forces that are based in Syria,\" Ham said, echoing allegations by Iraqi officials. Security fears and opposition within the Sunni community have led to calls by some Sunni politicians to delay the election, a proposal strongly rejected by the U.S. administration and the country's powerful Shiite clerical hierarchy. Iraqis will choose a 275-member parliament as well as provincial administrations. Voters in the Kurdish autonomous region will also select a new regional parliament. However, U.S. and Iraqi officials fear that a low Sunni turnout could cast doubt on the new government's legitimacy. Many Sunni Arabs, who make up an estimated 20 percent of Iraq's nearly 26 million people, fear a loss of political power to the Shiites  an estimated 60 percent of the population. During a press conference Saturday, leading Shiite politicians sought to dispel fears they would impose an Iranian-style clerical regime and appealed to Sunnis to participate in balloting. \"The issue is who do you want to obey  Saddam Hussein, Osama bin Laden ... or the Iraqi people,\" said Mouwaffaq al-Rubaie, the government's national security adviser. \"There is no intention or plan to form an Islamic or religious state in Iraq ... or an Iranian style government.\" Shiite candidate Ahmad Chalabi, once the Pentagon's choice to rule Iraq, said he planned to meet with Sunni leaders to encourage them to vote. \"I believe that this impression that the Sunnis will not vote will be dispelled quickly,\" he said. \"They will vote.\" In another development Saturday, the Defense Ministry confirmed a report in a major Arabic daily that an Iraqi woman trained by members of Saddam's regime in Syria tried to assassinate the defense minister but fainted before carrying out her mission. Al Hayat newspaper quoted Defense Minister Hazem Shaalan as saying the assassination attempt took place in his Baghdad office more than a week ago. Shaalan told the newspaper that the woman, who is about 40, entered the ministry claiming she wanted to deliver important security information. \"As she was sitting in the presence of several officials from the ministry, she surprised everyone by taking out a pistol she was carrying and pointed it at me from a distance of about one meter, but in the last moment she collapsed and started crying,\" he was quoted as saying. MMV CBS Broadcasting Inc. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed. The Associated Press contributed to this report. INSIDE Iraq: After Saddam Parents Of Slain Soldiers Visit Iraq Group Of Seven Parents Makes Pilgrimage To See Where Their Children Died • U.S. Troop Deaths In Iraq Exceed 9/11 Toll • Saddam One Step Closer To Execution • Biden Vows To Fight Troop Surge In Iraq • More TOP STORIES Saddam One Step Closer To Execution Appeals Court Upholds Death Sentence; Judge Says Former Iraqi Leader Will Be Hanged Within 30 Days • U.S. Troop Deaths In Iraq Exceed 9/11 Toll • Heartburn Drugs Linked To Hip Fractures • Male-Stalking Rapist Puzzles Experts • More Back To Top Advertisement CBSNEWS EYE-BOX STARTS HERE Patrolling Tikrit Two or three times per day, soldiers from Charlie Company patrol the streets of Tikrit. They monitor rebuilding and soldier training, but have to keep watch for much more, David Martin reports. RELATED VIDEO Patrolling Tikrit | CIA's Iraq Doubts | Hometown Ambush | Secretive Election Preps | Shiite Cleric Rep Killed | Iraq Steps Up Propaganda War | C-130, The 'Flying Truck' | IRAQ: AFTER SADDAM VIDEOS All Iraq: After Saddam Videos Gates To Report Iraq Findings | Bush Undecided On Troop Surge | Sergeant Proposes From Iraq | Gates Works On Iraq Strategy | TOP VIDEOS All Videos Two Earthquakes Shake Taiwan | Notebook: Re-Gifting | First Look: Saddam's Execution | Christmas Storm Hits Florida | More Video CBSNEWS I-BOX ENDS HERE STORIES: The Perfect Pot Pie | E-Mail A Serious Use For Silly String | E-Mail Tragic End To Search For Missing Dad | E-Mail Search For Hero Dad Ends In Tragedy | E-Mail Laura Bush Among Four Ladies In Red | E-Mail VIDEOS: Training Ground | Share Missing Father's Body Found | Share Iraqi Government's Next Step | Share Will Bush Change Course? | Share 'It's Not Their Son' | Share Wireless Alerts: CBS News To Go E-Mail Sign-Up: Breaking News | Today On CBS News | 60 Minutes | 48 Hours | The Early Show | CBS Sunday Morning | News Summaries Recommended Sites: CBS Corporation | The ShowBuzz | CBS.com | CBS SportsLine | CWTV.com | ETOnline.com | The INSIDER | CBS Store | CBS Careers | CBS Cares Site Map | Video Site Map | RSS News Feeds | Help | Advertise With Us | Contact Us | Terms of Service | Privacy Policy | CBS Bios | Internships HTML for CBSNews.com Search Stories Videos The Web Collections MMVI, CBS Broadcasting Inc. All Rights Reserved. Pop Under script>\nvar loc = document.location.href;\nif(loc.match(\"source=GoogleRSS\")){}\nelse{\nvar _l = '1013290775'; // location_ext_id \nvar _p = 480;\nvar _f = 1; \nvar pub_click_url = '';\nvar _isaclick=1; \nvar topURL = document.location.href;\nif ((topURL.indexOf('main100.shtml')==-1) && (topURL != \"http://www.cbsnews.com/\") && (topURL != \"http://www.cbsnews.com/index.shtml\")) {\nvar _extra = (pub_click_url == \"\" ? \"\" : ( _isaclick ? \"&aclick=\"+pub_click_url : \"&pclick=\"+pub_click_url)); \nvar _ta = (document.domain).split (\".\"); var psd = (_ta.length > 1 ? \".\" + _ta[_ta.length - 2] + \".\" + _ta[_ta.length - 1] : document.domain); var _cn = \"LL\" + _l + \"=\"; var _call = document.cookie.indexOf (_cn); var _il = 1; var _tl = 0; var _ex; var _rnd = (new Date ()).getTime (); if (_call >= 0) { _pos = document.cookie.substring (_call).indexOf (';'); if (_pos > 0) _val = document.cookie.substring (_call + _cn.length, _call + _pos); else _val = document.cookie.substring (_call + _cn.length); if (_val.indexOf ('.') > 0) { _il = _val.substring (0, _val.indexOf ('.')); _ex = _val.substring (_val.indexOf ('.') + 1); _tl = _ex - (new Date ()).getTime (); } if (_tl <= 0) document.cookie = _cn + \";domain=\" + psd + \";path=/;expires=\" + (new Date ((new Date ()).getTime () - 1000000)).toGMTString () + \";\"; } if (_il < _f || _tl <= 0) { var expiry = (new Date((new Date()).getTime()+_p*2*60*1000)).toGMTString(); if (document.cookie.indexOf(_cn) < 0 ) document.cookie=_cn+''+(1)+'.'+((new Date()).getTime()+_p*60*1000)+';domain='+psd+';path=/;expires='+expiry; else document.cookie=_cn+''+(_il-0+1)+'.'+_ex+';domain='+psd+';path=/;expires='+expiry; \ndocument.write(\"<if\" + \"rame  STYLE='position:absolute;top:-100px;left:0px;width:1px;height:1px;' src='http://adopt.specificclick.net/adopt.sm?l=\"+_l + \"&sz=pop&r=h&rnd=\"+_rnd+_extra+\"'> </ifr\"+\"ame>\");\n}\n}\n}   //end of else\n\n</script /DO NOT REMOVE/"
    }
  ]
}