{
  "url": "http://www.ces.ncsu.edu/nreos/forest/xmas/growing/ag95-IV.htm",
  "file_number": "325",
  "content_hash": "653437ca3d10aca8d85a013ede6b06c4bba8a272c3002fbdbe41e58bafc394e2",
  "total_blocks": 148,
  "retained_blocks": 43,
  "ignored_blocks": 105,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\" This HTML document was generated by PageMaker On Mon Oct 20 14:44:17 1997 from \"C:\\PROJECTS\\Ag95\\ag95.p65\" Generation of PM publication page 16 Growing Christmas Trees in North Carolina"
    },
    {
      "tag": "h2",
      "text": "Christmas Tree Fertility"
    },
    {
      "tag": "p",
      "text": "Optimum fertilization promotes quality growth and \r\ngives trees luxuriant foliage with a deep, rich color. Trees \r\nwith balanced nutrients are more resistant to pest problems \r\nand environmental stresses. The amount of fertilizer or \r\nlime needed to achieve optimum nutrient levels in the tree \r\nwill vary with different soils and sites or even different \r\nland use history. Too much of a nutrient is often as harmful \r\nto Christmas trees as too little. The only way to \r\noptimize tree growth is to follow through with site-specific \r\nfertilizer applications based on the results of timely soil and \r\ntissue analysis. Effective fertilizer management is an \r\nongoing process that succeeds best when carefully planned \r\nand maintained throughout the crop rotation. Soil samples should be taken regularly throughout \r\nthe course of growing Christmas trees. The first soil \r\nsamples should be taken during initial site evaluation. If the pH \r\nor nutrients such as phosphorus or calcium are low, \r\nmaterials can be tilled into the soil before tree planting \r\nwith greater success than later top dressing of fertilizers \r\nor lime. Subsequent soil samples should be collected at \r\nleast every other year, and many growers choose to take \r\nannual samples. Time invested in careful collection of \r\nsoil samples will increase effectiveness of any \r\nfollowing fertilizer applications. In North Carolina, soil \r\nsample boxes can be obtained and samples sent from any \r\nNorth Carolina Cooperative Extension Service County \r\nCenter. The North Carolina Department of Agriculture \r\nprovides soil and plant tissue analysis as well as other \r\ndiagnostic services to in-state residents. Once the trees in a field are well established, \r\nplant tissue samples should periodically be collected along \r\nwith regular soil samples. Tissue analysis provides the status \r\nof 11 nutrients inside the plant (four more than reported \r\nin soil analysis). Tissue sampling also reflects what a plant \r\nis actually able to obtain from the soil, not just what \r\nis available. Under normal growing conditions, \r\ntissue samples should accompany the soil samples at about \r\nthe middle of the rotation and then again the year \r\nbefore harvest. Usually about two shoots are collected from \r\nthe same five to 10 trees from which soil is sampled. \r\nTissue sampling is a necessary tool for evaluating and \r\nfine-tuning fertility management. When fertility problems occur in a field, \r\nadditional sampling can be useful. Problem areas should be \r\nsampled (and managed) separately from normal areas of a \r\nfield. The contrast between normal and problem samples \r\ncan often pinpoint the cause of a fertility problem. \r\nOften multiple-depth soil sampling can provide greater \r\ninsight than a single topsoil sample. When nutritional \r\nproblems occur, matching tissue samples should accompany \r\nany special soil sampling. It may take several seasons \r\nto correct a fertility problem. Fertilizer materials should be targeted to the \r\nrecommendations and deficiencies identified by soil and \r\ntissue analysis for each field, without applying a single \r\nblended material across the board. Annual applications of \r\nnitrogen per acre are recommended based on the requirements \r\nof the crop and the age and size of the trees. \r\nDifferent amounts of a nitrogen fertilizer will be needed \r\ndepending on the percentage of actual nitrogen contained in \r\nit. Different nitrogen sources have varying effect on \r\npH, soluble salt index, and leaching and should be \r\nselected accordingly. Different blends can also satisfy the need \r\nfor certain amounts of phosphorous, potassium, or \r\nother nutrients and should be selected to fulfill the ratio \r\nof requirements for each nutrient. See Table 4 for a list \r\nof commonly used fertilizers and their characteristics. Table 4. Common fertilizer choices for Christmas trees Table 01 Row 01 Name Percent N-P-K Lb Lime Neutralized by 100Lb of N Additional  Comments Table 01 Row 02 Ammonium Nitrate 33-0-0 180 High soluble salt content, can leach Table 01 Row 03 Ammonium Sulfate 21-0-0 38 Used to lower pH Table 01 Row 04 Calcium Nitrate 16-0-0 0 Source of soluble calcium Table 01 Row 05 Urea 46-0-0 180 Concentrated form of N, leaches slowly Table 01 Row 06 Diammonium Phosphate 18-46-0 180 Most available source of P Table 01 Row 07 Potassium Nitrate 13-0-44 0 Table 01 Row 08 Balanced Blends 10-10-10 17-17-17 19-19-19 variable Can be high insoluble salts and leach readily Table 01 Row 09 Concentrated Super Phosphate 0-46-0 0 Best when incorporated Table 01 Row 10 Murate of Potash 0-0-60 0 High soluble salts, best used in dormant season Table 01 Row 11 Potassium Sulfate 0-0-50 0 Lower soluble salts, best used in growing season Table 01 Row 12 Potassium Magnesium Sulfate 0-0-22 0 Good where Mg and Kboth needed Both the timing and method of fertilizer \r\napplication are critical to successful nutrient management. \r\nDifferent nutrients have their own requirements for timing. \r\nMaterials with a high soluble salt content containing nitrogen \r\nor potassium should not be applied during the heat \r\nof summer or during a drought. Large applications should \r\nbe split between two timings. Phosphorus should be built \r\nup early in a crop rotation rather than adding an \r\nincremental amount each season. Early in a rotation, many \r\ngrowers band fertilizer outside the dripline of small trees \r\nto maximize availability, but after trees are about 2 years \r\nold, broadcast applications are most effective. Where \r\ngrowers mechanize their fertilization, they are often able \r\nto achieve a more uniform broadcast application. \r\nWhile ground-applied fertilization is the primary method \r\nof nutrient delivery, it occasionally must be \r\nsupplemented with foliar-applied liquid sprays particularly \r\nwhere micronutrients are deficient or tied up in the soil. For a fertility program to succeed, a variety of \r\ntools and methods must be used, usually in different \r\ncombinations from season to season."
    },
    {
      "tag": "h2",
      "text": "Best Management Practices to Protect Water Quality and \r\nthe Environment"
    },
    {
      "tag": "p",
      "text": "Although of primary importance, tree quality and \r\nnet farm profit are not the only objectives that a \r\nChristmas tree grower should pursue. Afarmer should manage \r\nthe crop in such a way that production can be sustained \r\nwell into the future. To achieve this, the quality of life must \r\nbe protected on all levels. Soil must be protected \r\nfrom erosion. Surface and groundwater must be protected \r\nfrom sedimentation and contamination by fertilizers \r\nor pesticides. Wildlife should not be harmed by any \r\nfarming practices. The health of farm workers should not \r\nbe endangered by improper handling, storage, or use \r\nof pesticides. Christmas tree farmers who invest in practices \r\nand inputs that accomplish these goals usually show a \r\ngreater long-term profit because the land is maintained at \r\nhighly productive levels. Collectively, the added or \r\nalternative production practices that protect the quality of life \r\nare called best management practices . For production to \r\nbe sustained, a combination of the following best \r\nmanagement practices should be in place on every Christmas \r\n tree farm."
    },
    {
      "tag": "h3",
      "text": "Farm Road Construction"
    },
    {
      "tag": "p",
      "text": "The roads on many farms are too steep, are constructed \r\nof easily erodible material, and/or are poorly designed \r\nto manage flood water. Roads constructed at no more than \r\na 9 percent grade will not generally wash out. \r\nAdequate drainage ditches with large gravel or riprap will \r\neliminate erosion of the roadbed and water drainage problems \r\nin fields below the road. Installing an adequate surface \r\nto handle traffic is also critical. With increasing grade, \r\nslope length, and traffic, fescue grass will fail before a \r\ngravel surface will. Professional advice from soil \r\nconservationists should be utilized to develop plans for long-lasting \r\nroads (and fields) or to solve problems with existing roads."
    },
    {
      "tag": "h6",
      "text": "Proper road and draniage construction prevents erosion and reduces\r\npotential for root diseases."
    },
    {
      "tag": "h3",
      "text": "Field Borders and Stream Buffers"
    },
    {
      "tag": "p",
      "text": "Field borders and stream buffers are perhaps the \r\ncheapest way to contain sediments and any nutrients or \r\npesticides that are present in the sediments. A 10- to \r\n25-foot-wide grassy strip will trap sedimentation from all but the \r\nmost severe rain storms. These strips can usually double \r\nas field roads."
    },
    {
      "tag": "h3",
      "text": "Low-Impact Site Preparation"
    },
    {
      "tag": "p",
      "text": "Some land currently in Christmas tree production is \r\ntoo steep and erodible to bear extensive mechanical \r\nsite preparation. Soils also may be too shallow or \r\neasily compacted to withstand the heavy traffic. Less \r\ndisruptive site preparation practices have been developed for \r\nthese situations. Any timber and brush is cut close to the \r\nground without disturbing the mat of roots that hold the soil \r\nin place. All or a majority of stumps are left undisturbed. \r\nNo tillage is attempted. If seedlings are planted \r\nmechanically, any areas near stumps are planted by hand or left \r\nempty. Hardwood sprouts from stumps are a greater \r\nproblem with this approach, but labeled herbicides can \r\ncontrol them. Achieving optimum fertility may also be \r\nmore difficult without tillage, but by preserving the \r\ntopsoil, Christmas tree production can be sustained on \r\nthese difficult sites."
    },
    {
      "tag": "h3",
      "text": "Pest Scouting"
    },
    {
      "tag": "p",
      "text": "By scouting for pests, growers can reduce the frequency \r\nof pesticide applications and the cost of pest \r\nmanagement program while increasing the effectiveness of their \r\nefforts. Pest thresholds and scouting methods have been \r\ndeveloped for most of the major Christmas tree pests. \r\nInformation generated by scouting indicates the need for \r\npesticide applications and assures that such applications \r\nare targeted to potentially damaging pest populations."
    },
    {
      "tag": "h3",
      "text": "Pesticide Alternatives"
    },
    {
      "tag": "p",
      "text": "Where several pesticides are labeled for a specific \r\nChristmas tree pest, growers have the choice of selecting \r\nthe material that is least toxic to beneficial insects, \r\nthe environment, and wildlife. Toxicity of certain \r\npesticides to specific groups of animals, such as fish or \r\naquatic insects, can vary significantly. Safe pesticide choices \r\nwill change depending on proximity to critical habitats or \r\neven the season and life cycle of vulnerable wildlife \r\nspecies. Some less-toxic materials may require different \r\nequipment, handling, or timing from traditional \r\npesticide choices. Be sure to evaluate all factors when \r\nconsidering pesticide selection. For some pests, growers can \r\napply pesticides at alternative times, such as fall or winter, \r\nwhen beneficial insects or at-risk wildlife are not present."
    },
    {
      "tag": "h6",
      "text": "Groundcover suppression rather than elimination is \r\na part of good management."
    },
    {
      "tag": "h3",
      "text": "Groundcover Management"
    },
    {
      "tag": "p",
      "text": "Production of quality Christmas trees depends largely \r\non the balanced management of weed competition. Unchecked weed competition hurts tree growth, but \r\nrepeated exposure of the soil surface with resulting \r\nerosion will shorten the productive life of a field. Out of \r\nnecessity, growers have moved away from predominant use \r\nof long-lasting pre-emergent herbicides and \r\nbare-ground weed control. Groundcovers are the primary tool \r\nfor stabilizing the soil within a field of trees. Best \r\nmanagement practices involve suppression of native \r\nvegetation and/or establishment of cover crops. This \r\nreduces competition for nutrients, water, and space while \r\nmaintaining almost total coverage of the soil. An \r\nalternative practice is to sow cover crops, such as clover or rye, \r\nthat reduce germination of native weed seeds and that can \r\nbe managed more uniformly. Regardless of the \r\napproach, groundcovers are a second crop that must be \r\nconsciously managed in any Christmas tree field."
    },
    {
      "tag": "h3",
      "text": "Nutrient Management"
    },
    {
      "tag": "p",
      "text": "In North Carolina regions having sandy soils and \r\nshallow water tables, nutrient management is a critical factor \r\nin the availability of clean and healthy drinking water. \r\nLarge applications of fertilizer can possibly leach into \r\nthe groundwater. Smaller applications spread out over \r\na season can increase uptake by the crop and reduce \r\nthe probability of leaching. Leaching of fertilizer into \r\nthe groundwater is not generally a major problem, but \r\nsome precautions are still necessary. Best management \r\npractices depend on regular use of soil and tissue analysis as \r\nthe basis for all fertilizer and lime applications. \r\nApplications should be specific to the needs of each field. \r\nWhere practical, annual nitrogen requirements should be \r\nsplit into two applications to reduce leaching potential and \r\nrisk of salt injury to tree roots."
    },
    {
      "tag": "h3",
      "text": "Pesticide Handling, Storage, and Disposal"
    },
    {
      "tag": "p",
      "text": "Pesticides are most hazardous when they are in \r\nconcentrated form during mixing, storage, and disposal. \r\nPesticides should always be mixed and loaded far away \r\nfrom wells, springs, or streams. Progressive farmers are \r\ninstalling covered and contained concrete mixing pads, \r\nwhich capture any spills or rinse water. Secure pesticide \r\nstorage areas are built on the same pads. PVC field mixing \r\npads eliminate risky pouring from pesticide containers and \r\ncost less than permanent facilities. When empty, all \r\nliquid pesticide containers should be triple-rinsed and \r\npunctured before disposal in landfills. Other methods of disposing \r\nof containers are illegal and risk groundwater \r\ncontamination. For liability and safety considerations, farm managers \r\nand foremen should all be knowledgeable about the \r\nhandling, storage, and legal disposal of pesticides and their \r\ncontainers. Pesticide handlers must complete the \r\nappropriate licensing and pesticide training."
    },
    {
      "tag": "h3",
      "text": "Wellhead Protection"
    },
    {
      "tag": "p",
      "text": "Poorly-constructed wellheads are a major source \r\nof groundwater contamination from fertilizers or \r\npesticides. Good wells are grouted and sealed with concrete \r\nand, ideally, enclosed in a concrete cover with a concrete \r\nfloor. Several management practices can reduce the risk \r\nof groundwater contamination regardless of well \r\nconstruction. No agricultural materials should be mixed at \r\nthe wellhead. Hoses or faucets should provide water at \r\na mixing area away from and preferably downhill from \r\nthe wellhead. Agrassy buffer at least 10 feet wide \r\nshould protect the well from high traffic areas or any \r\npesticide application areas. The well cover should be above \r\nthe surrounding landscape and the immediate land \r\nshould slope away from the well. If production areas are above \r\na well, consideration should be given to the leachability \r\nof fertilizers or pesticides used."
    },
    {
      "tag": "h3",
      "text": "Summary"
    },
    {
      "tag": "p",
      "text": "Christmas trees are a renewable and sustainable \r\nagricultural crop. With appropriate consideration of \r\nwater quality, environmental considerations, and worker \r\nsafety, problems need not occur."
    },
    {
      "tag": "h2",
      "text": "Shaping of Christmas Trees"
    },
    {
      "tag": "p",
      "text": "Shaping is necessary for high-quality Christmas trees. \r\nThe term \"shaping\" is applied to any cutting done to shape \r\nthe plant to its desired appearance. This may done by \r\neither shearing or pruning. The term \"shearing\" refers to cutting back the \r\ncurrent year's growth of the leader and lateral limbs. \r\nShearing reduces deformities and improves the shape of the \r\ntree. Pruning is the removal of injured, dead, or diseased \r\nparts or wood older than the current growth. Since any one set of guidelines is not suitable for \r\nall trees, several species will be considered separately. \r\nIdeally a tree should resemble a cone, wide at the base \r\nand tapering uniformly to the tip. The base should be \r\nabout two-thirds as wide as the tree is tall. Taper is defined as \r\nthe tree width at the base divided by the tree height. \r\nAcceptable standards for a taper will range from a minimum \r\nwidth of 40 percent of the height to a maximum of 90 \r\npercent. Some growers prefer to shear using knives with a \r\n14-inch blade, although strong hedge shears and \r\nspecially-designed machines can be used with success. If knives \r\nare used, they should have high-quality blades that retain \r\na very sharp edge with minimum sharpening. Regardless \r\nof the type of tool used, personal safety is a primary concern."
    },
    {
      "tag": "h3",
      "text": "Firs and Spruces"
    },
    {
      "tag": "p",
      "text": "Firs and spruces require substantially different \r\ntreatments than pines. In these species, lateral buds develop along \r\nthe current leader and branch growth and are not \r\ninitiated from fascicles (bundles of needles found on pines). \r\nNew growth may be cut any time after branch elongation is \r\n80 percent complete until the following spring before \r\nnew growth starts. It is best to use a minimum amount of shearing \r\nand pruning so that the trees will have a natural \r\nappearance. The main thing to strive for is compactness by \r\ncontrolling height and lateral growth. Most growers cut the leaders \r\n in summer, although the same process may be used   \r\n until late spring just before dormancy is broken. \r\nTo maintain the desired cone shape, the terminal portion \r\nof lateral branches are also removed. Correct \r\nsummer shearing allows for development of a denser, \r\nhigher-quality tree, through growth of vegetative buds on \r\nthe stem and branches. When the trees reach 3 to 4 feet in height, \r\nbottom branches may be cut to provide a \"handle,\" depending \r\non what buyers expect."
    },
    {
      "tag": "h3",
      "text": "White Pine"
    },
    {
      "tag": "p",
      "text": "It is important to start shearing white pine at the \r\nproper year and season. When the tree is about 12 to 24 inches \r\nin height, the terminal bud should be removed to \r\nprovide more limbs for what will be the base of the tree. This \r\nheight should be adjusted upward for a tree growing on a \r\nsteep slope. Shearing will stimulate production of buds \r\nand make the tree more dense and compact. The season \r\nto shear white pine is between the time the new \r\nleader completes its growth and before it \"hardens.\" These \r\ndates vary with the growing conditions, the elevation, and \r\nthe season, but is generally during the period of June to \r\nearly-July. Start shearing by cutting the leader to desired \r\nlength (10 to 14 inches is usually best) at a 45-degree angle, \r\nwith the face of the cut in a northerly direction to \r\nreduce drying. The side branches of the top whorl should be \r\ncut so that they are 3 to 5 inches shorter than the terminal. \r\nThe side branches are then clipped to shape the tree into \r\na cone. Overshearing should be avoided, as close- \r\nshaved trees are not the most desirable. Shearing should be restricted to the current \r\nyear's growth because older growth does not usually set \r\nbuds. When the tree is about 3 feet to 4 feet high, \r\nbottom branches should be cut off so that a handle will \r\nbe available when the tree is harvested."
    },
    {
      "tag": "h3",
      "text": "Virginia Pine"
    },
    {
      "tag": "p",
      "text": "Guidelines for shaping Virginia pine are generally \r\nsimilar to those for white pine. However, because of its \r\ngrowth habit, Virginia pine needs to be sheared at least twice \r\nand sometimes more frequently each year. Time of shearing can be better judged from \r\nneedle growth than the calendar. Agood rule is to begin \r\nshearing when new needles are one-half as long as needles from \r\nthe previous flush. Corrective shaping can usually be done at any time \r\nof the year. It is extremely important that multiple \r\nleaders be removed early in the life of the tree. \r\nAdditionally \"handles\" should be pruned at least 2 years before harvest."
    },
    {
      "tag": "h3",
      "text": "Redcedar and Leyland Cypress"
    },
    {
      "tag": "p",
      "text": "Redcedar can be sheared lightly at any time during \r\nthe growing season with hedge clippers or knives. \r\nLeyland cypress should also be sheared lightly, with the best \r\ntime late in the growing season."
    },
    {
      "tag": "h2",
      "text": "Groundcover Management"
    },
    {
      "tag": "p",
      "text": "Groundcover or vegetation management is essential \r\nin producing high-quality Christmas trees. Many \r\ngrowers have produced Christmas trees with bare ground \r\nbecause they were worried about groundcover competition \r\nfor water, nutrients, and light. However, maintaining \r\nbare soil can lead to soil deterioration resulting in \r\nincreased soil erosion, poor root growth, and poor tree \r\nquality. There are many groundcovers ranging from native \r\nplants to introduced plant species which, if managed \r\nproperly, can be used as a groundcover without impacting \r\ntree growth and quality. Scouting weed species in the plantation is the first \r\nstep in a groundcover management program. Information \r\non weed identification can be obtained from various \r\nagencies, and there are many good weed identification \r\nreferences (see Appendix ).\r\n Identifying the type, density, and \r\nlocation of the vegetation in the plantation is an important part \r\nof the management process. Vegetation may be grouped into five major \r\ncategories: perennial grasses, perennial broadleafs, annual \r\ngrasses, annual broadleafs, and woody perennial vegetation \r\n(trees, shrubs, and vines). Whether the vegetation occurs between the rows \r\nor within rows is also important. Competition is \r\ngreatest from vegetation in the area immediately around the tree \r\nor within a row. Vegetation growing between the rows is \r\nless of a competitive threat simply because it is further \r\nfrom the tree. Since perennial grasses are very competitive, \r\ngrowers should minimize them within rows. In addition, \r\nperennial grasses found between rows should be mechanically \r\nor chemically mowed (suppressed via low rates of \r\npost-emergence herbicides) to control competition. While woody vegetation is not particularly \r\ncompetitive, it does interfere with tree work, and is easiest \r\nto control prior to planting. Since most woody vegetation \r\nis perennial with well established deep root systems, it \r\ncan be particularly difficult to control. Choice of \r\ncontrol measures and timing is critical. Vegetation desirable for use as groundcover \r\ngenerally exhibits one of two useful characteristics: it is \r\nnaturally less competitive, or it is reliably controlled either \r\nthrough mechanical or chemical mowing. Less \r\ncompetitive groundcovers include broadleaf annuals or perennials \r\nthat seldom grow tall enough to interfere with tree \r\ngrowth. Such species include strawberries, violets, \r\ndandelions, plantains, groundsels, and common trailing \r\ncinquefoil. Groundcovers that can and must be suppressed \r\nbecause they are otherwise too competitive or interfere \r\nwith shearing or harvest include clover, smartweed, wild \r\ncarrot, yarrow, red sorrel, nimblewill grass, chickweed, \r\nannual grasses, and some perennial grasses. The two principal methods for maintaining groundcover at an acceptable height between the rows \r\nare mechanical mowing and chemical application, \r\neither separately or in combination."
    },
    {
      "tag": "h3",
      "text": "Mechanical Mowing"
    },
    {
      "tag": "p",
      "text": "Mowing is an effective way to keep competing \r\nplants under control between rows. Properly timed \r\nmowing reduces competition, rodent damage, and fire \r\nhazard. Rotary-type mowers are usually preferred for \r\ngrass control, as sickle bars are particularly apt to damage or \r\ncut trees. However, mechanical mowing will favor \r\ngrass species that are most competitive to trees. Mowing alone must be repeated several times \r\nduring the growing season. It should be done often enough \r\nto prevent the grasses from forming seeds that could \r\ngerminate within the row. Weather greatly determines timing \r\nof the first and subsequent mowing operations. Acool, \r\ndry spring can delay the first mowing. Subsequent \r\nmowing during the growing season depends largely on the \r\nfrequency and amount of rainfall and fertility of the site."
    },
    {
      "tag": "h3",
      "text": "Chemical Application"
    },
    {
      "tag": "p",
      "text": "Herbicides are an effective substitute to \r\nmechanical mowing for controlling competition by weeds and \r\ngrasses. Herbicides are generally classified as either \r\npre-emergent or post-emergent, depending on the stage of the weeds \r\nthe herbicide is designed to control. The effectiveness of a chemical can vary from \r\nno response to a complete kill, depending on \r\napplication conditions and procedures. To be effective, \r\nherbicides should be carefully selected. Several different uses \r\nof chemicals are in new plantings in a cleanly \r\ncultivated field, new plantings in a sod, or on established \r\nplantations. Response to chemicals will depend on several \r\nfactors, such as size, kind and growing condition of target \r\nplants, time of application, soil composition, rainfall, \r\ntemperature, rate of deterioration before being incorporated \r\ninto the soil, and persistence of the chemical. Most \r\nproperly-formulated herbicides are short-lived in the \r\nenvironment, but still they must be carefully used to prevent \r\nlong-lasting effects by changing the composition of the plant \r\ncommunity. \"Chemical mowing\" is a term used to describe \r\nthe practice of applying post-emergent herbicides at low \r\nrates to stunt or suppress weeds and grasses. This practice \r\nwas developed to provide growers with a cost-effective, \r\nsoil conserving alternative to broadcast application of \r\npre-emergence herbicides or mechanical mowing. \r\nChemical mowing can be used as a broadcast application or as \r\na between-row treatment where trees were \r\npreviously banded in the row with pre-emergence herbicides. Chemical mowing is generally more economical \r\nthan traditional mechanical mowing. The application of \r\nlow rates of herbicides two or three times during the \r\ngrowing season is usually less expensive than maintaining \r\nmowers and paying for the labor to mow several times a \r\nseason. Chemical mowing typically provides control for 6 to \r\n8 weeks, compared to 3 to 4 weeks for mechanical mowing. Chemical mowing also fits well with many of \r\nthe strategies used in Integrated Pest Management (IPM).     \r\nIt is especially important to the management of white \r\ngrubs. By leaving a ragged height of suppressed vegetation, \r\nMay and June beetles (the adults of white grubs) are less \r\nlikely to lay their eggs than they are in mechanically \r\nmowed vegetation. It should be noted that the need for \r\npre-emergence herbicide applications cannot be totally eliminated \r\nby chemical mowing. Next section Back to Contents"
    }
  ]
}