{
  "url": "http://www.cgernon.com/sptf/care.htm",
  "file_number": "326",
  "content_hash": "14244fbbfc639fc9a1b1ff2a7623213488891c4b0fe25224c3eb3c6e1bdea647",
  "total_blocks": 29,
  "retained_blocks": 10,
  "ignored_blocks": 19,
  "blocks": [
    {
      "tag": "div",
      "text": "File Name:\\sptf\\care.htm"
    },
    {
      "tag": "h1",
      "text": "Care of Real Christmas Trees"
    },
    {
      "tag": "h4",
      "text": "The care of all the different species of trees is essentially the same. As soon as you arrive home place the tree in a bucket of water. Should the sap on\r\nthe butt of\r\nthe tree have become \"crusty\", cut a thin slice (about 1/2\" thick) off the butt and place it in\r\nwater immediately. This is not necessary if you are using the new intravenous watering\r\nsystem. Leave the netting on the tree until you install the stand and bring it indoors. The\r\nnetting\r\nmakes it much easier to get the tree through doors and halls. Locate the tree well away from sources of heat, such as fireplaces, heater vents,\r\nspace heaters\r\nand stoves. An anti-transpirant is helpful in keeping your tree fresh. If the trees were not treated\r\nin the\r\nfield, you may want to treat it yourself. Keep in mind that all trees can consume large amounts of water. But the Leylands\r\nand\r\nSapphires are unbelievable. You should expect them to consume 2-3 gallons per day. Water\r\nconsumption decreases as time progresses. The extent to which you care for your tree will\r\ndetermine it freshness during the Christmas season. Christmas tree safety is very important and its your responsibility. There has never\r\nbeen a\r\ncase where a Christmas tree auto-ignited. Most fires originate from faulty wiring in the\r\nlights.\r\nBefore you string the lights on the tree, test each string. If they are not working properly and\r\ncan not be readily repaired, discard them and purchase new ones. The risk of a fire is not\r\nworth the cost of a string of lights. Always unplug the lights at bed time or when you are\r\ngoing to be out of the house."
    },
    {
      "tag": "h1",
      "text": "New Technology for Christmas Trees"
    },
    {
      "tag": "h3",
      "text": "Standtastic Adjustable Stand-"
    },
    {
      "tag": "p",
      "text": "(Harold Odom, inventor)"
    },
    {
      "tag": "h4",
      "text": "This new tree stand can actually save marriages by making the setup of the annual\r\nChristmas tree\r\nso simple and easy that the customary family bickering and fighting is all but eliminated. The\r\ntwo primary functions of a Christmas tree stand are; first, to hold the tree and; second, to\r\nprovide\r\na means of adjustment so that it can be plumbed vertically. The Standtastic stand has separate\r\nand independent features to accomplish these two primary functions. The handle of the tree is\r\nsecured in the trough of the support bracket using two quick release bands (hose clamps).\r\nThe\r\nbands are tightened using a screwdriver. Stand the tree up by tipping it over on the two long\r\nlegs.\r\nUse your foot to extend the remaining short leg. With the tree standing, adjust the thumb\r\nscrews\r\nto obtain the required vertical orientation. In the case of large heavy trees, it may be\r\nnecessary to\r\nlift the weight off the leg being adjusted to make the thumb screw easier to turn. Keep in\r\nmind\r\nthat, a small change in the leg angle will make large change in the tree position. So, the\r\nthumb\r\nscrews should be adjusted in 1/4 turn or 1/2 turn increments. Once the entire family is satisfied with the tree position, a separate water bowl can be\r\nplaced\r\nunder the butt of the tree, or the I-V can be installed. Because the water bowl is left behind\r\nwhen\r\nthe tree is being taken down, the possibility of spilling the water is greatly reduced."
    },
    {
      "tag": "h3",
      "text": "Christmas Tree I-V-"
    },
    {
      "tag": "p",
      "text": "internal watering system"
    },
    {
      "tag": "h4",
      "text": "This system replaces the conventional \"butt in bowl\" watering apparatus. It consists of\r\na syphon\r\ntube, two expanding rubber sleeves, a pinch valve and a used gallon milk jug as a water\r\nreservoir. Two 1/2\" diameter holes are drilled in to the woody tissue of the tree trunk. The\r\nsyphon is started by covering the vent hole in the jug stopper and squeezing the jug. Once\r\nthe\r\nsyphon has been established, the flow is stopped using the pinch valve. The expanding rubber\r\nsleeves are place into the drilled holes in the trunk. The pinch valve is opened and the flow\r\nof\r\nwater to the tree begins. Capillary act carries the water up the trunk and out the branches to\r\nthe\r\ntree foliage, keeping it fresh and pliable. This watering system has a number of significant advantages. The water reservoir is\r\nreadily\r\nvisible. It is not covered by the tree skirt and Christmas packages. So, there is no question as\r\nto\r\nwhen it needs refilling. The reservoir is easily refilled. Simply close the pinch valve, remove\r\nthe\r\nsyphon tube and stopper, bring the jug to the faucet, fill it, return it to the tree, replace the\r\nstopper and tube, and open the pinch valve. Since the entire system is closed, the water\r\nnever\r\nbecomes contaminated or stagnant. When it's time for the tree to come down, simply remove\r\nthe\r\njug, the syphon tube and expanding sleeves. The tree is now ready to be moved with no risk\r\nof\r\nspilling an attached water bowl. Allow the tubes to drain and dry; and store the system til\r\nnext\r\nyear. While the tree is up, a drip pan should be placed on the floor under the butt of the\r\ntree so that any\r\ndripping sap, or water, will not stain the carpet. Back to the Front Gate ."
    }
  ]
}