{
  "url": "http://www.channel4.com/4car/road-tests/C/citroen/c3pluriel03-/c3pluriel03--comequipt.html",
  "content_hash": "34d8a29270e2a27c38e4e93290278f2cb9a03670d1d3e6ee4d594af9bee2ae65",
  "total_blocks": 284,
  "retained_blocks": 1,
  "ignored_blocks": 283,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" DO NOT DELETE THIS FILE E4 More4 Film4 4Radio 4oD A-Z Sitemap Home Watch Online TV Entertainment Lifestyle News Documentaries Interact WEB STATS // END WEB STATS // END CHANNEL4 NAVIGATION START 4car PAGE STRUCTURE LHC 4CAR NAVIGATION HOME HOME PARIS MOTOR SHOW \r\n\t<tr><td class=\"navOffA\" width=\"11%\">&nbsp;</td><td class=\"navOffA\"><a href=\"/4car/feature/motorshows/2006/paris/index.html\" class=\"navstyle1\"><b>PARIS MOTOR SHOW</b></a></td><td width=\"1%\" valign=\"bottom\" class=\"navOffB\"><img src=\"/4car/media/page_furniture/blue_cnr.gif\" alt=\"\"></td></tr>\r\n\t<tr><td colspan=\"3\" height=\"1\"></td></tr> ROAD TESTS ROAD TESTS ROAD TESTS SUB NAV Road Tests A-Z Long-Term Tests Video Test Drives GALLERIES GALLERIES VIDEOS VIDEOS NEWS NEWS FEATURES FEATURES READERS DRIVES READERS' DRIVES BEST CARS IN CLASS BEST CARS IN CLASS NEW CARS NEW CARS USED CARS USED CARS SERVICES SERVICES CAR FACT FINDER CAR FACT FINDER FUTURE MODELS FUTURE MODELS 100 GREATEST... 100 GREATEST... FORUM FORUM ULTIMATE CAR QUIZ ULTIMATE CAR QUIZ CHAT / VOTE / WIN PLAY / VOTE / WIN 4CAR PROMOS NEW: 5 buttons // NEW: 5 buttons div containing link to rss Get the Road Test feed What is RSS? BUTTON AD CODE //BUTTON AD CODE LHC BOX LINKS //LHC BOX LINKS BUTTON AD CODE //PAGE STRUCTURE LHC PAGE STRUCTURE CENTRAL CONTENT Road Test: Citroen C3 Pluriel  (2003-) Superminis //ITEM CONTENT CONTAINER RATING TABLE COMFORT AND EQUIPMENT RATING: Given its versatility, the Pluriel is fairly refined, although long trips will not be completely relaxing even with the roof closed; motorway roar is never fully silenced. The squashy front seats are pretty comfortable, a sensation heightened by the airy view out, but in the back, it's cramped. The ride quality is fairly soft, but it's not soft enough to stop the body quivering on rougher roads, or the structure rattling and creaking too. But in the context of the price and its versatility, the tremors through the Pluriel's body aren't too bad. It's still too early to say whether it will stay that way with age, though. Not surprisingly, with the roof folded and all four windows dropped - a very enjoyable configuration on a hot summer's day - there's a lot of wind roar, but it's tolerable, even on a longish drive. The high windscreen offers good protection against buffeting, and it's nice to have the choice of different degrees of exposure to the elements. You can just about get two adults in the rear seats, though front seat occupants may have to move their chairs forward to accommodate back-benchers' legs. You certainly wouldn't call it spacious, but it's tolerable for short trips. The two rear seats are less shaped and more bench-like than those in the Peugeot 206 CC, so there is some scope for overflow/sitting sideways. The driver and front seat passenger have plenty of room, though, and where the Pluriel really comes into its own is with its boot space. Better than many conventional superminis with the roof in place - or even with the rear screen and fabric stowed away (these fit under the floor) - the roof structure does not compromise luggage capacity. With the rear seats folded, a long, flat load bay can be created - roof up or down - and whilst it's not quite the pick-up truck Citroen claimed in its original blurb, the Pluriel can double up as something quite useful if you need to transport that flatpack or go to the rubbish tip.  A single-slot CD player and radio with six speakers and steering wheel-mounted controls are fitted as standard, and it's a decent system (not that you can hear it that well with the roof down). Citroen dealers offer a five-CD autochanger for extra cost, but there's no satellite navigation on the options list. //ITEM CONTENT CONTAINER Start page nav previous: Running Costs next: Avr. Owner Test Rating Back to Index // End page nav Start link list Introduction Citroen's C3 Pluriel really is unique. A four-seat cabriolet version o... // End link list Start road test ratings Reliability & Quality Image Driving Performance Safety & Security Running Costs Comfort & Equipment Readers' Drives //End road test ratings PAGE ELEMENT BLUE PROMO BOX BEST SUPERMINIS Want to know the best cars in this class? Here's our current picks. Vauxhall Corsa Peugeot 207 Toyota Yaris See Best Superminis In Class TOOLS AND LINKS BOX DUOBLE LINKS BOX the tools SSI has been inserted here. //PAGE STRUCTURE CENTRAL CONTENT PAGE STRUCTURE RHC standard sky 120x600 banner AD //PAGE STRUCTURE RHC 4car Footer CONTACT US | TERMS & CONDITIONS | PRIVACY POLICY | ABOUT 4CAR | //4car Footer //END 4CAR 4car Ads SiteCatalyst code version: H.6.\nCopyright 1997-2006 Omniture, Inc. More info available at\nhttp://www.omniture.com /DO NOT REMOVE/ End SiteCatalyst code version: H.6. <script language=\"javascript\" src=\"/4car/advertorial/volvo_survey2/media/js/volvosurvey.js\" type=\"text/javascript\"></script> //4car Ads"
    }
  ]
}