{
  "url": "http://www.childrensabilityfund.ab.ca/donatenow.htm",
  "file_number": "331",
  "content_hash": "b0a8d10cd596cda281ebdfd45a7094f9841b0f16063dde09758b83cae5e6ba20",
  "total_blocks": 244,
  "retained_blocks": 2,
  "ignored_blocks": 242,
  "blocks": [
    {
      "tag": "div",
      "text": "Home button code: Home Aboutus button code: Mandate History Our \n                    staff Board \n                    of directors Newsletters About \n      us whatwedo button code: Helping individuals Helping groups Bursaries Program \n                    contact info What \n      we do donatenow button code: Annual campaign Endowment fund Planned \n                    giving Bursary \n                    fund Gift \n                    in kind Events \n                    sponsors Donate \n      Now donatenow button code: Volunteer \n                    recognition Wear \n                    Mascot's outfit Christmas \n                    party Casino Silver \n                    Skate Bowling Gold Brick Golf Tournament River Valley Relay Wing \n                    Ding Volunteer \n                    Contact Info Volunteers events button code: Shining Star Silver \n                    Skate Bowlling Golf Tournament River Valley Relay Wing \n                    Ding Special Events sponsors Special \n                    Events contact info Special \n      Events kidsclub button code: Puzzle Matching Comic \n                    book Links Tic Tac Toe Kids \n      club thankyou button code: Gold \n                    Star Club Corporate Superstars Partnerships Supporters Donate Now Annual campaign Bursary fund Endowment fund Gift in kind Event Sponsor Planned giving Program Outright Gifts Future Gifts Gifts that give back Donation Contact Info Donor Bill of Rights"
    },
    {
      "tag": "p",
      "text": "Donate Now Helping Us The Children's Ability Fund has been working with our loyal donors\n\t\t\t   for more than 50 years to develop a greater understanding of the\n\t\t\t   needs of people with disabilities throughout Edmonton and northern\n\t\t\t   Alberta. With your help, we have been instrumental in providing\n\t\t\t   assistance to hundreds of individuals and many groups and organizations.\n\t\t\t   Over the last ten years more than 2 million dollars has been granted\n              for equipment... but the need continues and we need your\n              help! <a href=\"word_files/donationsheet.doc\" target=\"_blank\"> ... or download the donation form . There are several ways you can contribute to the Children's Ability Fund Donate to our annual campaign Join the Monthly Donation Program Add to the Bursary Fund Contribute to the Endowment Fund Donate a gift-in-kind Be an Event Sponsor Participate in the Planned Giving Program Donate to the ANNUAL CAMPAIGN Each year we ask our loyal donors to assist us with their continued support by\n\t\t\tmaking an annual contribution.  With ongoing funding we are able to make a \n\t\t\tdifference in the life of a person with a disability like Richard Hi!\n\t\t\tMy  name is Richard. You've never met me, but I'm one of the many\n\t\t\tpeople  helped by the Children's Ability Fund. Iam writing because\n\t\t\tIwant to help this very special organization raise more     \n\t\t\t            \n\t\t\t            \n\t\t\t money\n\t\t\tthis year\t\n              than ever before. When Iwas just one year old, Ihad a stroke. This left me with a brain injury and \n\t\t\tin a wheelchair. Icannot speak much at all - but Ihave so much to say! For 9 years \n\t\t\tIused a Touch Talker to help me communicate with my family and friends. After awhile\n\t\t\tit kept breaking down. Iwas so good at typing it couldn't keep up to me! When Istarted high school. \n              Iwas so nervous. Iwas going to be meeting new friends and wanted\n\t\t\t  to make sure Icould talk to them so they could get to know me. That's when Iwrote to the Children's Ability Fund and asked them to help buy a new talking device. The one that Ireally liked was called the Delta Talker. Iknew it would help me learn, meet new friends and become more independent. Now so many great things have happened! Ihave my new talking \n              device and have met many new friends at my school. Ireally enjoy \n              visiting with them and Ilike to answer questions in class. My teachers \n              say Iam a good student, especially in science and math. This could \n              not have happened without help from the Children's Ability Fund. They have helped so many people like me. Now, Iwant others to feel as great as Ido. Please help them help others. Make a donation today. Your donation will make  a big difference to others - just like it did for me. Thank you for reading my letter. Maybe someday Ican show you my new talker. Back to top Add to the Bursary Fund Some friends of the Children's Ability Fund chose to make a donation \n              specifically to assist students with a disability. The Bursary Fund \n              was established to ensure a continued commitment to providing an \n              annual bursary to students in need through the \n\t\t\t               \n\t\t\t  Children's Ability Fund Bursary. Contribute to the Endowment Fund In 1987, the Endowment Fund was established to ensure the continuity and longevity of the \n\t\t\t  organization and its goals and to ensure that the resources would be available to meet the \n\t\t\t  growing demand our economy has placed on non-profit organizations to provide funding for \n\t\t\t  the necessary equipment to people with disabilities. Our target is $5,000,000 and we are happy to report that we have\n              reached the half way mark. Donations made directly through the Endowment Fund and received through\n\t\t\t  the Planned Giving Program are invested and the resources\n\t\t\t  are used to ensure the long-term financial stability of the Children's\n\t\t\t  Ability Fund. Donate a Gift in Kind Cash donations are not the only way to contribute... Other suggestions are: Donate a prize to be \n            given away at one of our special events Donate services to be used \n            in house or given away as a prize Start an employee/employer \n            matching grant program Offer employees paid time off \n            to volunteer Hold a fun company event and \n            donate the proceeds Be a Shining Star Back to top Be an Event Sponsor See our special opportunities... Participate in the Planned Giving... leave a long term gift. There \n              are many ways to leave a lasting legacy like... Outright Gifts... Outright gifts - either of cash or other property - provide support \n              for the Children's Ability Fund's programs for individuals and groups, like the\n\t\t\t  Playground Project and the Bikes for Tykes Project. There are many ways of making outright gifts, they share a common characteristic,\n\t\t\t they can used as soon as the gift is made. Giving cash - whether by cheque, money order, \n\t\t\t      credit card or currency - is the most familiar way to \n\t\t\t      contribute to the Children's Ability Fund. Giving appreciated property like stocks and bonds is becoming a more widely used \n\t\t\t      means of donating to a charity especially because of the \n\t\t\t  favorable tax implications. Giving a gift of a Certified Cultural Property allows donors special tax \n\t\t\t      considerations (there are also special guidelines that must be adhered to.) Future Gifts... Many people who would like to make a gift to charity cannot afford\n\t\t\t   to during their lifetime. There are other ways of ensuring that\n\t\t\t   those charities that are dear to you will receive a donation on\n\t\t\t   your behalf. Giving through your will. There are several alternatives for donating to a charity \n\t\t\t      through your will; a general bequest, a specific bequest, a residual bequest\n\t\t\t      designates, or a contingent bequest. Life Insurance. There are several ways to make a future gift to a charity through \n\t\t\t\t    the purchase of a life insurance policy. Gifts that Give Back... Gifts that provide lifetime income to a donor are a type of future gift. \n              Some examples are: gift annuities charitable remainder trusts gifts of residual interest Changes to the federal tax legislation have created more giving \n              opportunities than ever before. Donation Contact Info For more information about our planned giving program, please contact: Carol Russ Excutive Director Children's Ability Fund (780) 454-9191 Donor Bill of Rights Link to the Donor Bill of \n\t\t\tRights document... Back to top"
    }
  ]
}