{
  "url": "http://www.christianitytoday.com/ct/2004/001/30.35.html",
  "content_hash": "f8afe9c493dfb9e9f7b6a229e737a80772eae097d3c872511d0eaffcd231f398",
  "total_blocks": 205,
  "retained_blocks": 3,
  "ignored_blocks": 202,
  "blocks": [
    {
      "tag": "div",
      "text": "empty Site Search: Home CT Mag Church/Ministry Bible/Life Communities Chat Entertainment Schools/Jobs Shopping Free! Help Member Login |  E-mail: Password Not a member? Join now ! Search: Christianity Today Hot Issues Faith & Thought Churches & Ministry Culture & Technology World Report Weblog Movies Columns Seminary & Grad School Guide Search by Name or use: Advanced Search to search by major, region, cost, affiliation, enrollment, more! Search by Location & Setting Programs & Degrees Enrollment Affiliation Athletics Costs, Scholarships & Grants List All Schools Member Services My Account <a href=\"/\" class=\"leftnav_text\">Password Help</a><br /> Contact Us Related Sites ChristianityToday.com Bible & Reference Sermon Illustrations January 2004 FREE ARTICLE PREVIEW ARTICLE TOOLS Find similar articles E-mail this page <img src=\"/home/img/icon-font.gif\" width=\"15\" height=\"15\" align=\"absmiddle\" /> Font size: <a href=\"javascript:fontSize(1);\" class=\"nav_tool\">larger</a> | <a href=\"javascript:fontSize(-1);\" class=\"nav_tool\">smaller</a><br /> Back to the Garden Our task is neither to shield nature from humanity nor to tame all wilderness. A Christianity Today editorial January 1, 2004"
    },
    {
      "tag": "p",
      "text": "T he heat continued long after the fires went out. Who was to blame for the fires that tarnished the Golden State? Those blazes killed 22 residents, destroyed 3,600 homes, and burned over 750,000 acres. What could we do to stop it from happening again? As any firefighter will tell you, the cause and the solution to wildfire is rarely simple. While those who started the fires should be held accountable, they were not responsible for the drought in Western states and other contributing factors that made the fires spread so quickly. Chief among the culprits: dead and diseased trees, drying underbrush, and aggressive attempts to stamp out all fires (which led to accumulating deadwood), which have turned many Western forests into major wildfires in waiting. While some debate the effects of logging and livestock, almost everyone agrees that the quantity of easily ignitable fuel in several forests is, well, unnatural . Underneath agreement on the problem, however, remains division on the nature of nature and our role in it. The debate will reignite, and the California wildfires vividly demonstrated that ecology is not purely academic. The Bible teaches Christians to embrace a theology in which God is both immanent in his creation and transcendent and beyond it; one in which humans are both part of God's creation and its subduers and caretakers. In short, though Adam and Eve's fall made our jobs more difficult, we still have the same job: we were created to be gardeners. Our calling as stewards of creation is neither to protect nature from human \"intrusion\" nor to tame all wilderness. Some Christians have wrongly joined with Thoreau in romanticizing the outdoors; other Christians have taken another extreme. \"In God's law neither man ..."
    },
    {
      "tag": "div",
      "text": "mag_ctprint_read 50 <_if item.capabilities=\"contains(mag_ctprint_read)\"> Are you a CTLibrary member or a Christianity Today subscriber with archives privileges? To read the rest of this article, log in here: E-mail Password If you're a Christianity Today print subscriber... ...but have not yet registered for online access to CTLibrary.com, you can receive a full-year's access for just $29.95! Register Here If you're NOT a Christianity Today print subscriber... You're entitled to a special, introductory offer for new subscribers only!  Subscribe now and receive a one-year Christianity Today print magazine subscription and one-year access to all Christianity Today archives for just $39.95! Subscribe now! <_else>\r\n\t\t\t\t\t\t\t\t\t<table cellpadding=\"5\" cellspacing=\"0\" border=\"0\" width=\"100%\" class=\"bg_2\">\r\n\t\t\t\t\t\t\t\t\t\t<form method=\"post\" action=\"%%url.full%%\">\r\n\t\t\t\t\t\t\t\t\t\t<tr>\r\n\t\t\t\t\t\t\t\t\t\t\t<td align=\"center\" class=\"topnav_text\">\r\n\t\t\t\t\t\t\t\t\t\t\t\t<b>Are you a CTLibrary member?</b><br />\r\n\t\t\t\t\t\t\t\t\t\t\t\tTo read the rest of this article, log in here:<br />\r\n\t\t\t\t\t\t\t\t\t\t\t\tE-mail <input type=\"text\" name=\"email\" value=\"%%query.email%%\" size=\"12\" maxlength=\"64\" />&nbsp;Password <input type=\"password\" name=\"password\" size=\"12\" maxlength=\"16\" /><input type=\"hidden\" name=\"login\" value=\"true\" />&nbsp;<input type=\"submit\" value=\"go\"/>\r\n\t\t\t\t\t\t\t\t\t\t\t</td>\r\n\t\t\t\t\t\t\t\t\t\t</tr>\r\n\t\t\t\t\t\t\t\t\t\t</form>\r\n\t\t\t\t\t\t\t\t\t</table>\r\n\t\t\t\t\t\t\t\t</_else>\r\n\t\t\t\t\t\t\t\t</_if> <_include file=\"/home/inc/login.txt\" /> <_include file=\"/home/inc/promo_article.txt\" /> Subscribe! Risk-free trial issue Give a gift subscription Shopping ChristianBook.com Books | Music | Videos | Gifts Bible Studies Christian History Leadership Training Small Group Resources Featured Items Subscribe to CTDirect Get CT headlines in your mailbox every day! Home CT Mag Church/Ministry Bible/Life Communities Chat Entertainment Schools/Jobs Shopping Free! Help Magazines: Books & Culture Christian History & Biography Christianity Today Church Law Today Church Treasurer Alert Ignite Your Faith Leadership Journal Marriage Partnership Men of Integrity MOMsense Today's Christian Today's Christian Woman Your Church ChristianityTodayLibrary.com Resources: BuildingChurchLeaders.com ChristianBibleStudies.com Christian College Guide Christian History Back Issues Christian Music Today Christianity Today Movies Church Products & Services Church Safety ChurchSiteCreator.com PreachingToday.com PreachingTodaySermons.com Seminary/Grad School Guide www.ChristianityToday.com Copyright © 1994–2006 Christianity Today International Privacy Policy | Contact Us | Advertise with Us Lyris Clickstream Tag"
    }
  ]
}