{
  "url": "http://www.cmic.info/stories01C/",
  "file_number": "338",
  "content_hash": "91a4ec6faec057d9fc86a5cc7fc77a4286d695b0336c680766cac721a96ab568",
  "total_blocks": 146,
  "retained_blocks": 5,
  "ignored_blocks": 141,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation msnavigation msnavigation"
    },
    {
      "tag": "p",
      "text": "Central Region Baie-Comeau in Innu Language WYD Follow-up in Sept-Iles Gasp Hearst Adult Bible School Geraldton parish needs ... Evangelization takes many forms Sault-Ste-Marie Forming the spiritual leaders \n      of ... Two dreams and four loves The changing face of Reserve life WYD Cross in Manitoulin Island Thunder Bay Little 'Cathedral of the North' \n    in ... Building a chapel for Armstrong"
    },
    {
      "tag": "div",
      "text": "Atlantic Northern Pacific Western HomePage Magazine - Back Issues Subscription Free magazine msnavigation"
    },
    {
      "tag": "p",
      "text": "Montagnais \nwomen help Oblate priest translate sacred works Psalms and New Testament in Innu language off the press Oblate \nFather Joseph Pirson was translating the texts of the different Masses in his \nlittle mission parish in the Diocese of Baie-Comeau in Northern Quebec when an \nidea dawned on him: Irealized that it would be good to have all the psalms \ntranslated in Innu language. His work, started 20 years ago, has since been expanded to \ninclude the New Testament. The work of two decades has recently been published \nin two volumes: Aiamieu-Nikamun Mashinaikan, a translation of the Book of \nPsalms, and Sheshust-Kanisht: Inniun Uttaimun, a translation of the New \nTestament. Fr. Pirson envisioned the book to be read at home by the \nnative people. The Montagnais Indians do not have a lot of materials \npublished in their language. Two Montagnais women, Mrs. Celine Bellefleur and Mrs. \nPhilomena Gregoire from Sept-les, Quebec, did most of the work, says Fr. Pirson. \nThey were perfect translators. They know their own language very well as well \nas French. The first book on \nthe New Testament is the most important, says Fr. Pirson, and required more \ncollaboration from the Innu community. Fr. Pirson was born on April 20, 1924, in the town of \nCorbion sur Semois in Belgium. He took his first vows as an Oblate Missionary of \nMary Immaculate on September 8, 1943, and served as a priest with the Diocese of \nNamur, also in Belgium. He came to Canada in early 1949, and was assigned to \nRichmond Gulf, a mission on the East Coast of Hudson Bay for two years. Then his \nbishop, Bishop Lionel Scheffer of Labrador City-Schefferville in Newfoundland \nand Labrador, sent him to Davis Inlet on the Labrador coast to learn a native \nlanguageMontagnaiswith another Oblate, Father Joseph Cyr. The next year, he says, the bishop sent me to Northwest \nRiver also on Labrador coast, to establish a mission among the native people \nthere, and where Istayed 20 years. In 1972, he went back to Davis Inlet for two years. In 1974, he left the \nLabrador coast to minister in the North Shore of St. Lawrence River, in a \ncommunity called Sept-les, or Seven Islands. After a year, he went to \nBetsiamites, a Montagnais community in Northern Quebec. He served for 30 years \nin these two missions, and went for brief stints to La Romaine (another native \nvillage), St. Augustine, and Mont Joli. Working in Bestsiamites , a community of 3,000 people, had \nbeen a very pleasant experience, he recollects. Sometimes it was hard, but \nmost of the time it was a happy time. In all, Fr. Pirson has served the missions for 55 years. \nHe says he would recommend others to do the same ministry. More than ever, the \npeople need to receive the good news of Jesus Christ. Iwas happy to be close to \nthe people and to their life, and to fulfil my missionary vocation. Since his \nretirement in 2002, Fr. Pirson has been living in Betsiamites, Northern Quebec. Copyrights 2005, First published in Catholic Missions IN \nCanada Magazine, Summer 2005, pages 20-21. msnavigation"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    }
  ]
}