{
  "url": "http://www.columbia.edu/itc/mealac/pritchett/00islamlinks/txt_sir_sayyid_lucknow_1887.html",
  "file_number": "341",
  "content_hash": "4a9df9bc4fc5b42a5f167110410b66e63ddc873237d9102183761b728bbbec66",
  "total_blocks": 34,
  "retained_blocks": 6,
  "ignored_blocks": 28,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\" Source: Sir\nSyed Ahmed on the Present State of Indian Politics, Consisting of Speeches\nand Letters Reprinted from the \"Pioneer\" (Allahabad: The Pioneer Press,\n1888), pp. 1-24. Modern facsimile version (Lahore: Sang-e-Meel Publications,\n1982). Translator unknown. The text presented here has been slightly edited\nfor classroom use, and its punctuation slightly improved, by FWP. Paragraph\nnumbers, and some paragraph breaks, and annotations in square brackets\nhave been added by FWP. The original spelling have been retained; all the\nfootnotes are original. NOTE: In virtually every place where the Pioneer 's\ntranslation says \"nation,\" the Urdu word is actually \" qaum ,\" or\n\"community.\" * This\nsummary translation juxtaposed to a literal translation by FWP *"
    },
    {
      "tag": "p",
      "text": "SPEECH OF SIR SYED AHMED AT LUCKNOW [1887]"
    },
    {
      "tag": "blockquote",
      "text": "A LECTURE was given by the Hon'ble Sir Syed Ahmed Khan,\nbefore a large and very influential audience of Mahomedans in Lucknow,\non 18th December, 1887, at 8.30 P.M., in the Baradari, Kaisarbagh, on the\nattitude the Mahomedan community ought to assume towards the Government,\nthe political questions of the day, and the Bengali movement. The meeding\nwas attended not only by the Mahomedans of Lucknow, but by gentlemen who\nhad come from all parts of Upper India to be present at the Mahomedan Educational\nCongress. It represented the intellect and the aristocracy, the brain and\nthe muscle, of the Mahomedan community. There were present the taluqdars\nof Oudh, members of the Government Services, the Army, the Professions\nof Law, the Press and the Priesthood; Syeds, Shaikhs, Moghals and Pathans\nbelonging to some of the noblest families in India; and representatives\nof every school of thought, from orthodox Sunni and Shiah Maulvis to the\nyoung men trained in Indian colleges or in England. The Syed's speech lasted\nan hour and a half, and was delivered with great eloquence. It was received\nwith enthusiastic applause. The chair was occupied by Munshi Imtiaz Ali,\nthe [[2]] legal adviser of the Oudh Taluqdars' Association, a distinguished\npleader belonging to an ancient and noble Arab family of Oudh. The speech\nwas delivered in Urdu, taken down by Munshi Aziz-ud-din, and afterwards\nrevised by Sir Syed himself. The substance of the lecture was as follows:--"
    },
    {
      "tag": "p",
      "text": "{1}[* 01 *] G ENTLEMEN,\n--Iam not given to speaking on politics, and Ido not recollect having\never previously given a political lecture. My attention has always been\ndirected towards the education of my brother Mahomedans, for from education\nIanticipate much benefit for my people, for Hindustan, and for the Government.\nBut at the present time circumstances have arisen which make it necessary\nfor me, Ithink, to tell my brother Musalmans clearly what my opinions\nare. The object, gentlemen, of this lecture is to explain the attitude\nwhich the Mahomedan community ought to adopt with regard to the political\nmovements of the time. Iam not going to give a philosophical discourse,\nnor to speak of those abstract questions on political economy which would\nrequire many lectures fully to deal with; but Iam simply going to express\nmy opinions in a plain and straightforward manner, leaving it to everyone\nwho hears me to agree with me or differ from me. The reason why Istand\nhere to address you today is because there has grown up in India a political\nagitation, and it is necessary to determine what action should be taken\nby the Mahomedan community with regard to it. Although my own thoughts\nand desires are towards my own community, [[3]] yet Ishall discuss whether\nor not this agitation is useful for the country and for the other nations\nwho live in it. If it be useful, we must follow it; but if dangerous for\nthe country or our nation, we must hold aloof. {2}[* 02 *] Before Ienter on this subject, let me briefly describe the methods of\nrule adopted by our Government, which has now been here for nearly a hundred\nyears. Its method is this: to keep in its own hands all questions of foreign\npolicy and all matters affecting its army. Ihope that we, who are subjects\nof the Empire, will not seek to interfere in those matters which Government\nhas set apart as its own. If the Government fight Afghanistan or conquer\nBurma, it is no business of ours to criticise its policy. Our interests\nwill not suffer from these matters being left in the hands of Government.\nBut we are concerned with matters affecting internal policy; and we have\nto observe what method Government has adopted for dealing with them. Government\nhas made a Council for making laws affecting the lives, property, and comfort\nof the people. For this Council she selects from all Provinces those officials\nwho are best acquainted with the administration and the condition of the\npeople, and also some Raïses /1/ who, on account of their high social position, are worthy of a seat in\nthat assembly. {3}[* 03 *] Some people may ask Why should\nthey be chosen on account of social position instead of ability? On this,\ngentlemen, Iwill say a few words. It is a great misfortune and I [[4]] ask your pardon for saying it that the landed gentry of India have not the trained ability which makes\nthem worthy of occupying those seats. But you must not neglect those circumstances\nwhich compel Government to adopt this policy. It is very necessary that\nfor the Viceroy's Council the members should be of high social position.\nIask you Would our aristocracy\nlike that a man of low caste or insignificant origin, though he be a B.A.\nor M.A., and have the requisite ability, should be in a position of authority\nabove them and have power in making laws that affect their lives and property?\nNever! Nobody would like it. ( Cheers. ) Aseat in the Council of\nthe Viceroy is a position of great honour and prestige. None but a man\nof good breeding can the Viceroy take as his colleague, treat as his brother,\nand invite to entertainments at which he may have to dine with Dukes and\nEarls. Hence no blame can be attached to Government for making those great\nRaïses members of the Council. It is our great misfortune that our\nRaïses are such that they are unable to devise laws useful for the\ncountry. {4}[* 04 *] The method of procedure in the Council is this. If any member introduce\na subject of importance and difficulty, a commission is appointed which\ncollects evidence and digests it. The matter is discussed in every newspaper,\nand memorials are invited from Associations. The Council then discusses\nthe matter, every member speaking his views with great vigour and earnestness,\nmore even than was displayed in the discussion on the third resolution\n[[5]] in the Mahomedan Educational Congress, /2/ advocating what he thinks necessary for the welfare of the country; and\nas regardless of the Viceroy's presence as if he were a figure of white\nstone. Ihave had the honour of being in this Council. Ido not recollect\nany matter of importance concerning which ten or twenty memorials were\nnot sent in. A Select Committee was then appointed, which read through\nthese memorials and discussed them at length, many of which on consideration\nturned out to be thorough nonsense. Extracts from Urdu papers were also\nconsidered. Although not in my presence, yet often amendments suggested\nby these memorials have been adopted. This is the method of our Government.\nAfter this the law is passed and sent to the Secretary of State, who is\nassisted by the Council of State, which consists of men of the highest\nability, who have lived for a long time in India and have often held all\noffices, from that of Assistant Collector to Lieutenant-Governor. If they\nthink it expedient it is passed, otherwise a short note of four lines cancels\nit. Often people make objections to the laws so passed, and in some cases\nthey are perhaps right; but in the majority of cases, as far as my experience\ngoes, those very people who sit in their houses and make objections would,\nif they had been on the Viceroy's Council, have supported them. Many details\nappear wrong on superficial consideration, but when all the circumstances\nand difficulties [[6]] are taken into account, they are seen to be right.\nIn conclusion, whether the laws be good or bad, no one can say that Government\nacts independently of the wishes and opinions of its subjects. Often it\nadopts some of the views expressed in newspapers and memorials. Can we\nsay that Government, in the method it has adopted for legislation, acts\nwithout regard to the opinions of the people? Can we say that we have no\nshare in the making of the laws? Most certainly not. ( Cheers. ) {5}[* 05 *] There is now another great duty of Government. That is, that in whatever\ncountry Government establishes its dominion, that dominion should be made\nstrong, firm, and secure. Ibelieve that if any of my friends were made\nViceroy; he would be as loyal to Her Majesty the Queen-Empress of India\nas is our present Viceroy, Lord Dufferin. And his first duty would be to\nsee that the Empire of Her Majesty were made so firm that no enemy, external,\nor internal, could shake it. ( Cheers. ) If it were my fortune to\nbe Viceroy; Ispeak from my heart when Isay Iwould not be equally, but\nmore, anxious to see the rule of the Queen placed on a firm basis. ( Cheers. )\nIt is a first principle of Empire that it is the supreme duty of everyone,\nwhether Hindustani or Englishman, in whose power it rests, to do what he\ncan to strengthen the Government of Her Majesty the Queen. The second duty\nof Government is to preserve peace, to give personal freedom, to protect\nlife and property; to punish criminals, and to decide civil [[7]] disputes.\nNow, everyone will admit that Government completely fulfils its duty in\nthis respect. {6}[* 06 *] Many people think that the laws have become too numerous; and consequently\nthat lawsuits have become more complicated, and thus lead to disputes between\nthe zamindar /3/ and\nthe kashtkar . /4/ But\nthis is the opinion of the critics who sit in their houses, who if they\nsat on the Viceroy's Council would change their views. The multiplicity\nof laws depends upon the condition of the country and of its people. New\ncompanies and new industries are springing into existence. New and unforeseen\nlegal rights have arisen which are not provided for in the Mahomedan law.\nHence, when the country is changing at such a rate, it is absolutely necessary\nthat new laws should be brought forward to deal with the new circumstances.\nGovernment does not want to increase the number of laws, but when the conditions\nof the country change, it becomes unavoidable. Taking all these things\ninto account, Icannot but think that there is no requirement of the country\nthat cannot be brought to the notice of Government. And nothing can prevent\nour expressing our views on the subject and being heard by Government.\nSo that whatever comfort we can experience under any Government, we have\nunder the British Government. ( Cheers. ) {7}[* 07 *] Icome now to the main subject on which Iwish to address you. That is The\nNational Congress and the demands which that body makes of [[8]] Government.\nIcannot allude to its proposals in detail because, as far as Iam aware,\nthere are forty-nine of them, and the time at my disposal is short. Imust\ntherefore select the most important. That about which the greatest agitation\nhas taken place is the following. When the Government of India passed out\nof the hands of the East India Company into those of the Queen, a law was\npassed saying that all subjects of Her Majesty, whether white or black,\nEuropean or Indian, should be equally eligible for appointments. This was\nconfirmed by the Queen's Proclamation. We have to see whether, in the rules\nmade for admission to civil appointments, any exception has been made to\nthis or not; whether we have been excluded from any appointments for which\nwe are fitted. Nobody can point out a case in which for any appointment\na distinction of race has been made. It is true that for the Covenanted\nCivil Service a special set of rules has been made; namely, that candidates\nhave to pass a competitive examination in England. Perhaps it will occur\nto everyone that this examination ought not to be held in England, and\nthe proposal about which the greatest agitation has taken place is that\nit should be.held in India. And to this is added another proposal that\nall posts in the subordinate service, from that of Tahsildar to Subordinate\nJudge, should also be given by competitive examination. {8}[* 08 *] Ido not think it necessary for me on this occasion to discuss the question\nwhy the competitive examination is held in England, and what would [[9]]\nbe the evils arising from its transference to India. But Iam going to\nspeak of the evils likely to follow the introduction into India of the\ncompetitive principle. Ido not wish to speak in the interest of my own\nco-religionists, but to express faithfully whether Ithink the country\nis prepared for competitive examination or not. What is the result of competitive\nexamination in England? You know that men of all social positions, sons\nof Dukes or Earls, of darzies /5/ and people of low rank, are equally allowed to pass this examination. Men\nof both high and low family come to India in the Civil Service. And it\nis the universal belief that it is not expedient for Government to bring\nthe men of low rank; and that the men of good social position treat Indian\ngentlemen with becoming politeness, maintain the prestige of the British\nrace, and impress on the hearts of the people a sense of British justice,\nand are useful both to Government and to the country. But those who come\nfrom England, come from a country so far removed from our eyes that we\ndo not know whether they are the sons of Lords or Dukes or of darzies ;\nand therefore if those who govern us are of  humble rank, we cannot\nperceive the fact. But as regards Indians, the case is different. Men of\ngood family would never like to trust their lives and property to people\nof low rank with whose humble origin they are well acquainted. ( Cheers. ) {9}[* 09 *] Leave this a moment, and consider what are the conditions [[10]] which\nmake\nthe introduction into a country of competitive examinations expedient,\nand then see whether our own country is ready for it or not. This is no\ndifficult question of political economy. Everyone can understand that the\nfirst condition for the introduction of competitive examination into a\ncountry is that all people in that country, from the highest to thc lowest,\nshould belong to one nation. In such a country no particular difficulties\nare likely to arise. The second case is that of a country in which there\nare two nationalities which have become so united as to be practically\none nation. England and Scotland are a case in point. In the past many\nwars were waged between those countries, and many acts of bravery were\ndone on both sides; but those times have gone, and they are now like one\nnation. But this is not the case with our country, which is peopled with\ndifferent nations. Consider the Hindus alone. The Hindus of our Province,\nthe Bengalis of the East, and the Mahrattas of the Deccan, do not form\none nation. If in your opinion the peoples of India do form one nation,\nthen no doubt competitive examination may be introduced; but if this be\nnot so, then competitive examination is not suited to the country. The\nthird case is that of a country in which there are different nationalities\nwhich are on an equal footing as regards the competition, whether they\ntake advantage of it or not. Now, Iask you, have Mahomedans attained to\nsuch a position as regards higher English education, which is necessary\nfor higher appointments, as to put them [[11]] on a level with Hindus or\nnot? Most certainly not. Now Itake Mahomedans and the Hindus of our Province\ntogether, and ask whether they are able to compete with the Bengalis or\nnot? Most certainly not. When this is the case, how can competitive examination\nbe introduced into our country? ( Cheers. ) {10}[* 10 *] Think for a moment what would be the result if all appointments were given\nby competitive examination. Over all races, not only over Mahomedans but\nover Rajas of high position and the brave Rajputs who have not forgotten\nthe swords of their ancestors, would be placed as ruler a Bengali who at\nsight of a table knife would crawl under his chair. ( Uproarious cheers\nand laughter. ) There would remain no part of the country in which we\nshould see at the tables of justice and authority any face except those\nof Bengalis. Iam delighted to see the Bengalis making progress, but the\nquestion is What would be the result\non the administration of the country? Do you think that the Rajput and\nthe fiery Pathan, who are not afraid of being hanged or of encountering\nthe swords of the police or the bayonets of the army, could remain in peace\nunder the Bengalis? ( Cheers. ) This would be the outcome of the proposal\nif accepted. Therefore if any of you men of good position, Raïses, men of the middle classes, men of noble\nfamily to whom God has given sentiments of honour if you accept that the country should groan under the yoke of Bengali rule\nand its people lick the Bengali shoes, then, in the name of God! jump\ninto the train, sit down, and be [[12]] off to Madras, /6/ be off to Madras! ( Loud cheers and laughter. ) But if you think\nthat the prosperity and honour of the country would be ruined, then, brothers,\nsit in your houses, inform Government of your circumstances, and bring\nyour wants to its notice in a calm and courteous manner. {11}[* 11 *] The second demand of the National Congress is that the people should elect\na section of the Viceroy's Council. They want to copy the English House\nof Lords and the House of Commons. The elected members are to be like members\nof the House of Commons; the appointed members like the House of Lords.\nNow, let us suppose the Viceroy's Council [to be] made in this manner.\nAnd let us suppose first of all that we have universal sufferage, as in\nAmerica, and that everybody, chamars /7/ and\nall, have votes. And first suppose that all the Mahomedan electors vote\nfor a Mahomedan member, and all Hindu electors for a Hindu member; and\nnow count how many votes the Mahomedan members have and how many the Hindu.\nIt is certain the Hindu members will have four times as many, because their\npopulation is four times as numerous. Therefore we can prove by mathematics\nthat there will be four votes for the Hindu to every one vote for the Mahomedan.\nAnd now how can the Mahomedan guard his interests? It would be like a game\nof dice in which one man had four dice, and the other only one. {12}[* 12 *] In the second place, suppose [[13]] that the electorate be limited. Some\nmethod of qualification must be made; for example, that people with a certain\nincome shall be electors. Now, Iask you, O Mahomedans! Weep at your condition!\nHave you such wealth that you can compete with the Hindus? Most certainly\nnot. Suppose, for example, that an income of Rs. 5,000 a year be fixed\non, how many Mahomedans will there be? Which party will have the larger\nnumber of votes? Iput aside the case that by a rare stroke of luck a blessing\ncomes through the roof, and some Mahomedan is elected. In the normal case\nno single Mahomedan will secure a seat in the Viceroy's Council. The whole\nCouncil will consist of Babu So-and-so Mitter, Babu So-and-So Ghose, and\nBabu So-and-so Chuckerbutty. /8/ ( Laughter. ) Again, what will be the result for the Hindus of our\nProvince, though their condition be better than that of the Mahomedans?\nWhat will be the result for those Rajputs, the swords of whose ancestors\nare still wet with blood? And what will be the result for the peace of\nthe country? Is there any hope that we and our brave brothers the Rajputs\ncan endure it in silence? {13}[* 13 *] Now, we will suppose a third kind of election. Suppose a rule to be made\nthat a suitable number of Mahomedans and a suitable number of Hindus are\nto be chosen. Iam aghast when Ithink on what grounds this number is likely\nto be determined. Of necessity, proportion to total population will be\ntaken. So there will be one [[14]] number for us to every four for the\nHindus. No other condition can be laid down. Then they will have four votes\nand we shall have one. {14}[* 14 *] Now, Iwill make a fourth supposition. Leaving aside the question as to\nthe suitability of members with regard to population, let us suppose that\na rule is laid down that half the members are to be Mahomedan and half\nHindus, and that the Mahomedans and Hindus are each to elect their own\nmen. Now, Iask you to pardon me for saying something which Isay with\na sore heart. In the whole nation there is no person who is equal to the\nHindus in fitness for the work. Ihave worked in the Council for four years,\nand Ihave always known well that there can be no man more incompetent\nor worse fitted for the post than myself. ( \"No, No!\" ) And show me\nthe man who, when elected, will leave his business and undertake the expense\nof living in Calcutta and Simla, leaving alone the trouble of the journeys.\nTell me who there is of our nation in the Punjab, Oudh, and North-Western\nProvinces who will leave his business, incur these expenses, and attend\nthe Viceroy's Council for the sake of his countryrnen. When this is the\ncondition of your nation, is it expedient for you to take part in this\nbusiness, on the absurd supposition that the demands of the Congress would,\nif granted, be beneficial for the country? Spurn such foolish notions.\nIt is certainly not expedient to adopt this cry Chalo\nMadras! /9/ Chalo Madras! without\nthinking of the consequences. {15}[* 15 *] [[15]] Besides this there is another important consideration, which is\nthis. Suppose that a man of our own nationality were made Viceroy of India;\nthat is, the deputy of Her Most Gracious Majesty the Queen-Empress. Could\nsuch a person grant demands like these, keeping in view the duty of preserving\nthe Empire on a firm and secure basis? Never! Then how absurd to suppose\nthat the British Government can grant these requests! The result of these\nunrealisable and impossible proposals can be only this: that for a piece\nof sheer nonsense, the hearts of everybody will be discontented with Government;\nand everybody will believe that Government exerts over us a tyrannical\nrule, and turns a deaf ear to our requests. And thus anger and excitement\nwill spread throughout the people, and the peace of the country will be\ndestroyed. {16}[* 16 *] Everybody knows well that the agitation of the Bengalis is not the agitation\nof the whole of India. But suppose it were the agitation of the whole of\nIndia, and that every nation had taken part in it, do you suppose the Government\nis so weak that it would not suppress it, but must needs be itself overwhelmed?\nHave you not seen what took place in the Mutiny? It was a time of great\ndifficulty. The army had revolted; some budmash es /10/ had joined it; and Government wrongly believed that the people at large\nwere taking part in the rebellion. Iam the man who attacked this wrong\nnotion, and while Government was hanging its officials [actually, \"while\nthe Government officials were hanging people\"], Iprinted [[16]] a pamphlet\n[\"The Causes of the Indian Revolt\"], and told Government that it was entirely\nfalse to suppose that the people at large were rebellious. But in spite\nof all these difficulties, what harm could this rebellion do to Government?\nBefore the [reinforcing] English troops had landed she had regained her\nauthority from shore to shore. Hence, what benefit is expected from all\nthis for the country, and what revolution in the Government can we produce?\nThe only results can be to produce a useless uproar, to raise suspicions\nin Government, and to bring back again that time which we experienced thirty\nor thirty-one years ago. This is on the supposition that by all of us coming\ntogether we could do something; but if you take the agitation as it is,\nwhat could it accomplish? The case of Ireland is held up as an example.\nIwill not discuss the question whether that agitation is right or wrong.\nIwill only point out that there are at this moment in Ireland thousands\nof men ready to give up their lives at the point of the sword. Men of high\nposition who sympathise with that movement fear neither the prison nor\nthe bayonets of the police. Will you kindly point out to me ten men among\nour agitators who will consent to stand face to face with the bayonets?\nWhen this is the case, then what sort of an uproar is this, and is it of\nsuch a nature that we ought to join it? {17}[* 17 *] We ought to consider carefully our own circumstances and the circumstances\nof Government. If Government entertains unfavourable sentiments towards\nour community, then Isay with the utmost force that these [[17]] sentiments\nare entirely wrong. At the same time if we are just, we must admit that\nsuch sentiments would be by no means unnatural. Irepeat it. If Government\nentertains these bad sentiments, it is a sign of incompetence and folly.\nBut Isay this: we ought to consider whether Government can entertain such\nthoughts or not. Has she any excuse for such suspicions, or not? Ireply\nthat she certainly has. Think for a moment who you are. What is this nation\nof ours? We are those who ruled India for six or seven hundred years. ( Cheers. )\nFrom our hands the country was taken by Govemment into its own. Is it not\nnatural then for Government to entertain such thoughts? Is Government so\nfoolish as to suppose that in seventy years we have forgotten all our grandeur\nand our empire? Although, should Government entertain such notions, she\nis certainly wrong; yet we must remember she has ample excuse. We do not\nlive on fish, nor are we afraid of using a knife and fork lest we should\ncut our fingers. ( Cheers. ) Our nation is of the blood of those who\nmade not only Arabia, but Asia and Europe, to tremble. It is our nation\nwhich conquered with its sword the whole of India, although its peoples\nwere all of one religion. ( Cheers. ) Isay again that if Government\nentertains suspicions of us, it is wrong. But do her the justice and admit\nthat there is a reasonable ground for such suspicions. Can a wise ruler\nforget what the state of things was so short a time ago? He can never forget\nit. If then the Mahomedans [[18]] also join these monstrous and unreasonable\nschemes, which are impossible of fulfilment, and which are disastrous for\nthe country and for our nation, what will be the result? If Government\nbe wise and Lord Dufferin be a capable Viceroy, then he will realise that\na Mahomedan agitation is not the same as a Bengali agitation, and he will\nbe bound to apply an adequate remedy. If Iwere Viceroy; and my nation\ntook part in this affair, Iwould first of all drop down on them, and make\nthem feel their mistake. {18}[* 18 *] Our course of action should be such as to convince Government of the wrongness\nof her suspicions regarding us, if she entertain any. We should cultivate\nmutual affection. What we want, we should ask for as friends. And if any\nill-will exist, it should be cleansed away. Iam glad that some Pathans\nof the N.-W. P. [North-West Provinces] and Oudh are here today, and Ihope\nsome Hindu Rajputs are also present. My friend Yusuf Shah of the Punjab\nsits here, and he knows well the mood of mind of the people of the Punjab,\nof the Sikhs and Musalmans. Suppose that this agitation that has arisen\nin Bengal and Iimagine that no\ndanger can spring from it there suppose that this agitation extends to these Provinces, to the Rajputs\nand Pathans of Peshawar, do you think it will confine itself to writing\nwith the pen giz, giz, giz,\ngiz, giz [the scratching of  a pen] and to mere talking buk, buk,\nbuk, buk [babbling]? It will then be necessary for Government to send\nits army and show by bayonets what the proper remedy for this agitation\nis. Ibelieve that when Government [[19]] sees the Mahomedans and other\nbrave races taking part in this stupid agitation, it will be necessary\nfor Government to pass a new law and to fill the jails. Omy brothers!\nChildren of my heart! This is your relationship to Government: you should\nconduct yourself in a straightforward and calm manner; not come together\nto make a noise and a hubbub like a flock of crows. ( Cheers and laughter. ) {19}[* 19 *] Icome now to some other proposals of the Congress. We have now a very\ncharming suggestion. These people wish to have the Budget of India submitted\nto them for sanction: \"Leave aside political expenses; but ask our opinion\nabout the expenses of the army. Why on earth has Government made so big\nan army? Why have you put Governors in Bombay and Madras? Pack them off\nat once!\" Itoo am of the opinion that their ideas should certainly be\ncarried out. Ionly ask them to say who, not only of them but of the whole\npeople of India, can tell me about the new kinds of cannon which have been\ninvented which is the mouth and\nwhich the butt end. Can anyone tell me the expense of firing a shot? Does\nanyone understand the condition of the army? One who has seen the battlefield,\nthe hail-shower of shots, the falling of the brave soldiers one over another,\nmay know what equipments are needed for an army. If then under these circumstances,\na Mahomedan were on this Council, or a Bengali one of that nation which in learning is the crown of all Indian nations,\nwhich has raised itself by [[20]] the might of learning from a low to a\nhigh position how could he give\nany advice? How ridiculous then for those who have never seen a battlefield,\nor even the mouth of a cannon, to want to prepare the Budget for the army! {20}[* 20 *] Astill more charming proposal is the following. When some people wrote\narticles in newspapers, showing that it was impossible to establish representative\ngovernment in India, and bringing forward cogent reasons, then they came\ndown a little from their high flight and said, \"Let us sit in the Council,\nlet us chatter; but take votes or not, as you please\"; can you tell me\nthe meaning of this, or the use of this folly? {21}[* 21 *] Another very laughable idea is this. Stress is laid on these suggestions:\nthat the Arms Act be repealed, that Indian Volunteers be enlisted, and\nthat army schools be established in India. But do you know what nation\nis proposing them? If such proposals had come from Mahomedans or from our\nRajput brothers, whose ancestors always wore the sword, which although\nit is taken from their belts yet still remains in their hearts if they had made such proposals there would have been some sense in it.\nBut what nation makes these demands? Iagree with them in this, and consider\nthat Government has committed two very great mistakes. One is not to trust\nthe Hindustanis and to allow them to become volunteers. Asecond error\nof Government of the greatest magnitude is this: that it does not give\nappointments in the army to those brave people whose [[21]] ancestors did\nnot use the pen to write with; no, but a different kind of pen ( cheers ) nor did they use\nblack ink, but the ink they dipped their pens in was red, red ink which\nflows from the bodies of men. ( Cheers. ) Obrothers! Ihave fought\nGovernment in the harshest language about these points. The time is, however,\ncoming when my brothers, Pathans, Syeds, Hashimi, and Kereishi, whose blood\nsmells of the blood of Abraham, will appear in glittering uniform as Colonels\nand Majors in the army. But we must wait for that time. Government will\nmost certainly attend to it; provided you do not give rise to suspicions\nof disloyalty. Obrothers! Government, too, is under some difficulties\nas regards this last charge Ihave brought against her. Until she can trust\nus as she can her white soldiers, she cannot do it. But we ought to give\nproof that whatever we were in former days, that time has gone; and that\nnow we are as well-disposed to her as the Highlanders of Scotland. And\nthen we should claim this from Government. {22}[* 22 *] Iwill suppose for a moment that you have conquered a part of Europe, and\nhave become its rulers. Iask whether you would equally trust the men of\nthat country. This was a mere supposition. Icome now to a real example.\nWhen you conquered India, what did you yourself do? For how many centuries\nwas there no Hindu in the army list? But when the time of the Moghal family\ncame and mutual trust was established, the Hindus were given very high\nappointments. Think how many years old is the British rule. How long ago\nwas the [[22]] Mutiny? And tell me how many years ago Government suffered\nsuch grievous troubles, though they arose from the ignorant and not from\nthe gentlemen? Also call to mind that in the Madras Presidency, Government\nhas given permission to the people to enlist as volunteers. Isay, too,\nthat this concession was premature; but it is a proof that when trust is\nestablished, Government will have no objection to make you also volunteers.\nAnd when we shall be qualified, we shall acquire those positions with which\nour forefathers were honoured. Government has advanced one step. She has\nalso shown a desire to admit us to the civil appointments in the Empire.\n( Cheers. ) {23}[* 23 *] In the time of Lord Ripon Ihappened to be a member of the Council. Lord\nRipon had a very good heart and kind disposition, and every qualification\nfor a Governor. But unfortunately his hand was weak. His ideas were Radical.\nAt that time the Local Board and Municipality Bills were brought forward,\nand the intention of them was that everybody should be appointed by election.\nGentlemen, Iam not a Conservative, Iam a great Liberal. But to forget\nthe prosperity of one's nation is not a sign of wisdom. The only person\nwho was opposed to the system of election was myself. If Iam not bragging\ntoo much, Imay, Ithink, say that it was on account of my speech that\nLord Ripon changed his opinion and made one-third of the members appointed\nand two-thirds elected. Now just consider the result of election. In no\ntown are Hindus and Mahomedans equal. Can the Mahomedans suppress [[23]]\nthe Hindus and become the masters of our \"Self-Government\"? In Calcutta\nan old, bearded Mahomedan of noble family met me and said that a terrible\ncalamity had befallen them. In his town there were eighteen elected members,\nnot one of whom was a Mahomedan; all were Hindus. Now he wanted Government\nto appoint some Mahomedan; and he hoped Government would appoint himself.\nThis is the state of things in all cities. In Aligarh also, were there\nnot a special rule, it would be impossible for any Mahomedan, except my\nfriend Maulvi Mahomed Yusuf, to be elected; and at last he too would have\nto rely on being appointed by Government. Then how can we walk along a\nroad for which neither we nor the country is prepared? {24}[* 24 *] Iam now tired and have no further strength left. Ican say no more. But\nin conclusion, Ihave one thing to say, lest my friends should say that\nIhave not told them what is of advantage for our nation and for the country;\nand by what thing we may attain prosperity. My age is above seventy. Although\nIcannot live to see my nation attain to such a position as my heart longs\nfor for it, yet my friends who are present in this meeting will certainly\nsee the nation attain such honour, prosperity and high rank, if they attend\nto my advice. But my friends, do not liken me to that dyer who, only possessing\nmango-coloured dye, said mango-coloured dye was the only one he liked.\nIassure you that the only thing which can raise you to a high rank is high\neducation . Until our nation can give [[24]] birth to a highly-educated\npeople, it will remain degraded; it will be below others, and will not\nattain such honour as Idesire for it. These precepts Ihave given you\nfrom the bottom of my heart. Ido not care if any one calls me a madman\nor anything else. It was my duty to tell those things which, in my opinion,\nare necessary for the welfare of my nation, and to cleanse my hands before\nGod the Omnipotent, the Merciful, and the Forgiver of sins."
    },
    {
      "tag": "blockquote",
      "text": "Three cheers were then given for Sir Syed Ahmed, and three\ncheers for the Chairman, who had presided also throughout the meetings\nof the Mahomedan Educational Congress."
    },
    {
      "tag": "p",
      "text": "* Sir Sayyid's follow-up\nspeech on these issues: Meerut, 1878 * NOTES /1/ Men of position and\ninfluence. /2/ A Congress recently\nheld in Lucknow for the discussion of Mahomedan education. /3/ Landlord. /4/ Tenant. /5/ Tailors. /6/ The National Congress\nwas then sitting at Madras. /7/ Avery low caste. /8/ Common Bengali names. /9/ Be off to Madras. /10/ Scoundrels. -- more on\nSir Sayyid -- Glossary -- fwp's\nmain page --"
    }
  ]
}