{
  "url": "http://www.corpwatch.org/article.php?id=12201",
  "file_number": "351",
  "content_hash": "9825eebcc3db29059fecacf2c1f35dcc1b662a3d92f6b51e5a9b7812f20cdf3d",
  "total_blocks": 203,
  "retained_blocks": 5,
  "ignored_blocks": 198,
  "blocks": [
    {
      "tag": "div",
      "text": "Header"
    },
    {
      "tag": "p",
      "text": "Contact l Sitemap"
    },
    {
      "tag": "div",
      "text": "End Header Center Text BEGIN BREADCRUMB CODE BEGIN BREADCRUMB CODE Home » Industries » War & Disaster Profiteering » U.K.: Protesting Revolving Door of ... E-Mail Page Printer Safe END BREADCRUMB CODE U.K.: Protesting Revolving Door of Arms Trade in Elections Campaign Against Arms Trade, which includes the group Christian Campaign Against Arms Trade, is calling for an end to the unfair political influence which arms companies have on Government policy. Ekklesia May 4th, 2005"
    },
    {
      "tag": "p",
      "text": "StartFragment Protestors, including Christians, will seek to highlight the 'revolving door' between arms companies and the Government in an election protest this morning. Demonstrators are protesting outside the Annual General Meeting of the worlds fourth largest arms manufacturer, BAE Systems PLC at The Queen Elizabeth II Conference Centre, in Westminster, London. A door, resembling the door to Number 10 Downing Street, set on an axis so it can rotate with an actor dressed as Tony Blair will invite two BAE Systems businessmen into number 10 with a banner backdrop reading BAE Systems: Take Them Out of Number 10 outside the AGM venue. 'Shareholder activists' will also attend the AGM. Campaign Against Arms Trade, which includes the group Christian Campaign Against Arms Trade, is calling for an end to the unfair political influence which arms companies have on Government policy. The revolving door between Government and arms companies is one of the mechanisms that allows arms companies inappropriate access to Government and corporate capture, say campaigners. CAATs new campaign Call the Shots aims to redress the public interest by exposing these mechanisms and calling for safeguards to be introduced. Anna Jones, a spokesperson for Campaign Against Arms Trade said; \"Under the Labour Government, as with previous administrations, its been business as usual for arms exports to repressive regimes and conflict zones. The new incumbents to 10 Downing Street should put the public interest first and remove the mechanisms, like the revolving door, which allow arms companies to capture arms export policy.\""
    },
    {
      "tag": "div",
      "text": "FAIR USE NOTICE. This document may contain copyrighted materialwhose use has not been specifically authorized by the copyright owner.CorpWatch is making this article available in our efforts to advance the understanding of corporate accountability, human rights, labor rights, social and environmental justice issues. We believe that this constitutes a 'fair use' of the copyrighted material as provided for in section 107 of the U.S. Copyright Law. If you wish to use this copyrighted material for purposes of your own that go beyond 'fair use,' you must obtain permission from the copyright owner. End Center Text Right Nav Box Search CorpWatch Company Profiles Boeing Lockheed Martin Northrop Grumman General Dynamics Raytheon United Technologies Halliburton General Electric Science Applications International Corporation CSC/ DynCorp News KATRINA: Hurricane Victims Say Agents Advised Against Flood Coverage US: The Rise and Fall of a War Profiteer IRAQ: Army to End Expansive, Exclusive Halliburton Deal KATRINA: First trial of insurance lawsuit set to open KATRINA: 'Breathtaking' Waste and Fraud in Hurricane Aid More » Join War Profiteers List End Right Nav Box Footer 1611 Telegraph Avenue., #702  Oakland, CA 94612 USA  510-271-8080 Design by Tumis.com  Powered by RadicalDesigns.org End Footer"
    }
  ]
}