{
  "url": "http://www.cottagesunlimited.com/sales.htm",
  "file_number": "352",
  "content_hash": "5515dff91a6a9c1d64a33dd4623e6508af118dc2205e6600ffee9646b431a45c",
  "total_blocks": 336,
  "retained_blocks": 5,
  "ignored_blocks": 331,
  "blocks": [
    {
      "tag": "div",
      "text": "#BeginTemplate \"/Templates/generalsales.dwt\" Cottages Unlimited \r\n          Realty Inc. Brokerage SALES tel: 613-283-8770 - Sales \r\n          email - Sales fax: 613-283-9119 2008 4th Line Beckwith, Smiths Falls, ON. Canada, K7A 4S7"
    },
    {
      "tag": "p",
      "text": "Site \r\n          Section Links: Home - Sold - Rental Cottages - Disclaimer - Webmaster"
    },
    {
      "tag": "div",
      "text": "#BeginEditable \"info%20here\" SALES \r\n          LISTINGS #EndEditable #BeginEditable \"add%20info%20here\" We focus on Country Homes & Land, and Waterfront Properties Sales \r\n            Section Links: New \r\n            listings are at the top of each section Waterfront \r\n            Cottages, Homes Country \r\n            Rural Lots Boats \r\n            for Sale by Owners Waterfront \r\n          Lots Recently \r\n            Sold Listings Homes \r\n            for Sale by Owners LOOKING TO SELL? We're basically sold out! Become one of our many \"SOLDS\" call \r\n            us today! Waterfront \r\n            Cottages & Homes Sorry, \r\n            it's SOLD! 234 \r\n          Gardiner Shore Road, Mississippi Lake, 15 minutes to Kanata, 1/2 hour \r\n          from downtown Ottawa - $219,900 Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com 364 \r\n          Farren Lake Lane 5, close to Perth and Westport - $249,900 Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com 501 \r\n          Stewart Lane, Dalhousie Lake, near Perth, 80 km to Kanata, one hour \r\n          to Ottawa - $299,900 Quiet lake, many year round homes. \r\n          Three bedroom, 1.5 bathroom (with jacuzzi) lakeside country home at \r\n          end of lane. Oversized 2-storey garage with upstairs loft/bunky and \r\n          deck, perennial gardens. Near Dalhousie Glen Golf course, restaurant, \r\n          and Purdons conservation area. Very easy access all year. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n          it's SOLD! 126 \r\n          Red Rock Lane, Becks Shore, Mississippi Lake, near Carleton Place - $319,900 Beautiful long western views \r\n          from this year round, 3 bedroom, 1.5 bathroom home/cottage on dead-end \r\n          lane. Central air, well, septic, & 115 ft of good waterfront with \r\n          gradual entry. Fenced area for the little ones! Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com FireRoad \r\n          25, #2525, Big Rideau Lake, near Portland and Perth - $669,900 Heart of the Big Rideau on south shore. Quite private, year-round \r\n          executive retreat on 3 + acres, 135 ft good, deep waterfront, prestigious \r\n          area off Briton-Houghton Bay Road. Waterfront home is 3-level, 3 bedroom, \r\n          2.5 bathrooms. Broker of Record: Janice Hastie-Waugh . tel: \r\n          613-283-8770, janice@cottagesunlimited.com 628 \r\n          New York Lane, Bennett Lake, near Perth - $389,900 Completely private 1 year old (August 2005) waterfront home \r\n          on a 1+/- acre lot at the end of a dead-end road. Immaculate three \r\n          bedroom (2 up, one down), 2 1/2 bathroom, finished lower level with \r\n          walkout, 32ft x 12ft cedar deck, 2 car garage. Abeautiful home in the \r\n          heart of nature, yet only one hour from Ottawa. Broker of Record: Janice Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com 152 \r\n          Sand Pit Lane - Crow Lake, near Westport - $659,900 Just 15 minutes from Westport! Dramatic year-round waterfront \r\n          showplace: 2,150 sq. ft. home with all contemporary conveniences & \r\n          comforts. 3 bedrooms; 2 1/2 bathrooms (1 ensuite). Huge glass-and-cedar \r\n          deck. Excellent waterfront. Abeauty! Broker of Record: Janice Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! 2421 \r\n          Nolans Road, Montague Township, 20 minutes to Kanata - $199,900 Bright and roomy 3+1 bedroom, 2 bathroom home on pretty, private \r\n          1+ acre property, on a quiet back road. Hardwood floors in main \r\n          living area, central vacuum, finished lower level with walkout, woodstove, \r\n          screened porch, deck. Insulated & wired 2 + car garage and workshop. \r\n          Easy access to Highway 15. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! Dalhousie \r\n          Lake, McDonald's Corners, close to Perth, 85 km to Kanata, one hour \r\n          to Ottawa - $299,900 Great 3 bedroom open-concept, handcrafted \r\n          scribed log cottage/home: 133ft shallow, gradual waterfront. Quite \r\n          private, with 6.2 acres. Pine tongue & groove floors, large porch, \r\n          block foundation, full undeveloped basement, metal roof, septic. Easy \r\n          to become year round home. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! 854 \r\n          Narrows Lock Road, Upper Rideau Lake - $529,900 Exceptional opportunity to get on the Rideau System with this \r\n          great family waterfront getaway. Two year-old, 5 + 1 bedroom log home \r\n          on very private 2.66 acres. Two separate living spaces under one roof, \r\n          spectacular view, excellent waterfront, western exposure. Easy year-round \r\n          access, minutes to Highways 15 and 42. This property is priced to sell! Broker of Record: Janice Hastie-Waugh . tel: \r\n          613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! 222 \r\n          Gardiners Shore Road, Mississippi Lake, near Carleton Place - $189,900 Excellent waterfront, immaculate gardens and beautiful sunsets \r\n          await. Year round open concept one bedroom home with sitting room solarium, \r\n          computer area and wonderful view. Wade in to the sandy gradual entry \r\n          waterfront and enjoy! tel: 613-283-8770, sales@cottagesunlimited.com Click \r\n            here to return to top of page Waterfront \r\n            Lots 4.59 acre lot, Hungry Bay \r\n          Road, Hungry Lake, near Arden, Central Frontenac Township - $74,900 LOT F-1 - Private, treed 4.59 acre lot with cabin to use while \r\n          you build your getaway or year-round home. View of Hungry Lake in fall \r\n          and winter, water near property. tel: 613-283-8770, sales@cottagesunlimited.com 100+/- acre lot on navigable \r\n          creek, near Arden, Central Frontenac Township ... $39,900 LOT M-4 - 100+/- acres on navigable creek, with access to \r\n          pristine Hungry Lake, in the heart of picturesque birdwatching/fishing/hunting \r\n          country. Build your own naturalist's retreat in this peaceful, private \r\n          spot. Boat access only Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Only \r\n          3 Lots Remaining! Prices: $149,900 - $199,900 Pink dots are sold lots. Premiere Waterfront Estate Subdivision located on the St. Lawrence River in the beautiful Thousand Islands. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Click \r\n            here to return to top of page Country \r\n            Rural Lots Perth Road, on Franktown side of Perth \r\n          - 98 acres - $98,000 Dreaming of a country estate? Build your ideal home on 98 private \r\n          acres of level, open land and mixed bush. Easy access, close to amenities. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Click \r\n            here to return to top of page Recently \r\n            Sold Listings SOLD \r\n            on 1st Showing! 99 \r\n          McNee Drive, Golden Lake, near Deacon - $139,900 Great opportunity to get into the cottage market! 170ft of \r\n          clean, clear waterfront on Golden Lake, along with a 2 bedroom cottage, \r\n          good privacy, and a bunkie/guest cabin with loft for extra sleeping \r\n          for kids or guests. Landscaping done in 2004 using 100% cedar beams. \r\n          Cedar observation deck built in 2004. Large deck provides stunning views. \r\n          This property is ready to move in and enjoy for the rest of the season. Broker of Record: Janice Hastie-Waugh . tel: \r\n          613-283-8770, janice@cottagesunlimited.com SOLD \r\n            on 1st Showing! 408 \r\n          Black Bass Bay Road, Mississippi Lake, 35 minutes from Ottawa - $239,900 3 season, true old-fashioned cottage on a beautiful treed \r\n          level lot, on a quiet dead-end road. Three bedroom, 4 piece bathroom, \r\n          2 inch tongue and groove pine floors in main living area, and new 100 \r\n          amp service. Great swimming waterfront with sandy shore , dock, \r\n          20ft x 20ft boathouse, big open view. Includes extra lot across the \r\n          road. Call today! Broker of Record: Janice Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! 5+/- acre waterfront lot on Hungry Lake , near Arden, \r\n          Central Frontenac Township ... $99,900 LOT M-5 - One of the best lots on the Big Island! 5+/- acres of beautiful Precambrian shield land; great \r\n          swimming and fishing on this pristine lake. Large rock outcroppings, \r\n          tall pines, maples, birch, and oaks: a lovely setting to build your \r\n          cottage. Boat access only . Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com SOLD - in 3 \r\n            days ! 92 \r\n          Drummond St., Perth - $184,900 Pride of ownership is evident in this nearly new, 2 bedroom bungalow. Large deck off back of house for summer enjoyment! HRV system, central \r\n          air, bright eat-in kitchen and main floor laundry are just a few of \r\n          the many features of this well-maintained home. 12' x 12' shed for added \r\n          storage. Easy access to highway and hospital! Sales Rep.: Wendy Boyer. tel: 613-283-8770, res: 613-253-9260, sales@cottagesunlimited.com Sorry, it's SOLD! Lot 24, Island \r\n                View Drive, Bay of St. Lawrence St. Lawrence River, near Gananoque and Kingston - $149,900 Spacious, level 2.2 acre, waterview corner lot in professionally-designed, \r\n          private waterfront community of prestigious homes, heart of beautiful \r\n          Thousand Islands. Min/ Gananoque & Kingston. Excellent for executive \r\n          or retirement. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, it's SOLD! 234 \r\n          Park Crescent, Rockhaven Park, Carleton Place - $78,000 Bright and roomy 2 bedroom mobile home in adult-only Rockhaven \r\n          Park. Great condition, many features: lots of windows & closets, \r\n          central air conditioning, gas fireplace, heated sunroom, large porch,carport, \r\n          perennial gardens. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com SOLD - on second showing! 110 \r\n          Scott Lane, 1400 Narrows Lock Rd, Upper Rideau Lake, 15 minutes to Westport \r\n          and Perth Beautiful wide-open view of the Rideau. Open-concept 3 bedroom \r\n          year-round waterfront home/cottage on spacious, treed property, with \r\n          beautiful lake views from most rooms. Great screened porch opening \r\n          to large L-shaped upper deck, large 31ft deck/dock at water, excellent \r\n          swimming & boating, access to whole Rideau system. Agem! Broker \r\n          of Record: Janice Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com SOLD - on second showing! 103 \r\n          Finch Lane, Mississippi Lake, 15 minutes to Carleton Place, 45 minutes \r\n          to Ottawa - $259,900 Centrally located 1 bedroom cottage + 2 bedroom bunkie, with \r\n          243 ft. shoreline, and its own point. Beautiful new big screened \r\n          gazebo. Complete new renovation on cottage, fully winterized. Swimming, \r\n          fishing off dock, boating, and nature-watching. Peaceful, private location \r\n          on dead-end road. Incredible view! Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, it's SOLD! 108 \r\n          Christie Lake Lane 42, Christie Lake, near Perth and Westport - $129,900 20 minutes from Perth or Westport. Not on waterfront, but comes \r\n          with deeded access to your own waterfront dock - without waterfront \r\n          price! Charming year-round 2 bedroom home, minutes to excellent \r\n          waterfront. Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, it's SOLD! 102 \r\n          Snedden Rd., Mississippi River, near Blakeney and Almonte - $124,900 Cozy 2 bedroom 4-season cottage with 135 ft.frontage on the \r\n          Mississippi River. Recent renovations: big deck, vinyl siding, some \r\n          new windows, propane heat, roof. Well, septic, washer/dryer hookup. Sales Rep.: Wendy Boyer. tel: 613-283-8770, res: 613-253-9260, sales@cottagesunlimited.com Sorry, it's SOLD! 2250 \r\n          Hungry Bay Road, near Arden - $129,900 - $129,900 Nature lover's paradise: bright, cozy year-round cottage \r\n          in peaceful spot overlooking navigable creek, with DEEDED ACCESS to Hungry Lake. Above detached two-car garage is huge loft, with 4-piece \r\n          bathroom: workshop or guest quarters. Acomfortable home in a charming \r\n          spot with access to clean, clear Hungry Lake, and at a great price! Broker of Record: Janice \r\n          Hastie-Waugh . tel: 613-283-8770, janice@cottagesunlimited.com Sorry, \r\n            it's SOLD! 20 \r\n          Saumure Trail, Ottawa River, near Lapasse - $139,900 Waterfront home, just 1 hour 20 minutes from Ottawa. 2 bedroom \r\n          winterized, excellent condition, level lot, beautiful 100' gradual,sandy \r\n          waterfront. Great swimming & fishing, Well and septic. Broker of Record: Janice Hastie-Waugh . \r\n          tel: 613-283-8770, janice@cottagesunlimited.com"
    },
    {
      "tag": "p",
      "text": "Sorry, \r\n            it's SOLD!"
    },
    {
      "tag": "div",
      "text": "75 \r\n          Sullivan Point Road, Ottawa River - $109,900 4-season access on \r\n          paved, dead-end road to c ute, \r\n          old-fashioned cottage with sand beach. 2-bedroom, \r\n          3-season, outbuildings, septic. Level lot. Great spot for kids! Broker of Record: Janice Hastie-Waugh . \r\n          tel: 613-283-8770, janice@cottagesunlimited.com Click \r\n            here to return to top of page Click \r\n            here to see more SOLD listings #EndEditable DISCLAIMER: We make every effort to ensure our information posted on our web site is \r\naccurate and complete. However, errors do occur. If there is a discrepancy between the information posted on the web site, and the information from the office, the information supplied by the office will be deemed correct . If you should \r\nnotice any errors or broken links etc. please let us know - or share your thoughts \r\nwith the webmaster. Please try and be specific on the details of the errors or \r\nproblems. © 1997-2006 CTF Designs. #EndTemplate"
    }
  ]
}