{
  "url": "http://www.countyofinyo.org/Board%20Agenda%20Minutes/board_mi_nutes_-_july_23,_2002.htm",
  "file_number": "353",
  "content_hash": "3f308acc59c7052e0c139bbd3b7c3fbdcd2f7fa96cef1038a18dabdd3cd70d78",
  "total_blocks": 179,
  "retained_blocks": 100,
  "ignored_blocks": 79,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation mstheme mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme msnavigation msnavigation mstheme"
    },
    {
      "tag": "p",
      "text": "mstheme"
    },
    {
      "tag": "div",
      "text": "msnavigation mstheme mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "County\n      of Inyo Board\n      of Supervisors mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme"
    },
    {
      "tag": "h3",
      "text": "SPECIAL MEETING"
    },
    {
      "tag": "p",
      "text": "The Board of\nSupervisors of the County of Inyo, State of California, met in special session\nat the hour of 9:20 a.m., on Tuesday,\nJuly 23, 2002 , in the Board of Supervisors Room, County Administrative\nCenter, Independence, with the following Supervisors present: Chairperson Linda Arcularius presiding, Julie Bear, Ervin R. Lent,\nCarroll M. Hambleton, Jr., and Michael Dorame. Supervisor Dorame provided the Invocation, and\nSupervisor Bear led the Pledge of Allegiance ."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Public Comment"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The\n      Chairperson announced the public comment period. Dr. Susan Holgate, Director of Health and Human Services, updated\n      the Board on the In-Home Supportive Services Advisory Board activities. The County Administrator advised the Board of the schedule for\n      public meetings on the African Bee situation in the County, to be held in\n      Olancha July 29, 2002, from 6:00 p.m. to 7:00 p.m., in Lone Pine on July\n      29, 2002, from 7:30 p.m. to 8:30 p.m., in Independence on July 30, 2002,\n      from 6:00 p.m., to 7:00 p.m., in Big Pine on July 30, 2002, from 7:30 p.m.\n      to 8:30 p.m., and in Bishop, on August 1, 2002, from 7:00 p.m. to 8:00\n      p.m. The Chairperson informed\n      the public that the Board had concluded Budget Hearings yesterday, July\n      22, 2002."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Sheriff/Identix\n      Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to approve the\n      Contract between the County of Inyo and Identix, Inc., for the provision\n      of services and maintenance of Identix equipment, for the period of July\n      1, 2002, through June 30, 2003, in an amount not to exceed $16,194.22,\n      contingent upon the Boards adoption of a FY 2002/03 budget; and\n      authorize the Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Rd.\n      Dept./Annual Road Report Contract with State"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved by Supervisor Bear and seconded by Supervisor\n      Hambleton to approve the Contract between the County of Inyo and the State\n      of California for the preparation of the annual Road Report for fiscal\n      year ending June 30, 2002, in an amount not to exceed $4,000, contingent\n      upon the Boards adoption of a FY 2002/03 budget; and authorize the\n      Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Rd.\n      Dept./ Cascade Software Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved by Supervisor Bear and seconded by Supervisor\n      Hambleton to approve the Agreement between the County of Inyo and Cascade\n      Software Systems, Inc., for the provision of software maintenance and\n      support services for the Road Departments Cost Accounting Program for\n      the period of July 1, 2002, through June 30, 2003, in an amount not to\n      exceed $8,317.90, contingent upon the Boards adoption of a FY 2002/03\n      budget; and authorize the Chairperson to sign. Motion\n      carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "P.W./Tennis\n      Court Rehabilitation Project"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved by Supervisor Bear and seconded by Supervisor\n      Hambleton to approve the Plans, Special Provisions and Bid Documents, for\n      the Inyo County Parks and Recreation Tennis Court Rehabilitation Project;\n      and authorize the Public Works Director to advertise for bids for the\n      project. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-Hlth\n      Serv./ Chlamydia Awareness Prevention Grant"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to (a) accept the\n      State funding for the Chlamydia Awareness and Prevention Project; and (b)\n      approve the Contract between the County of Inyo and the State of\n      California Department of Health Services for the Chlamydia Awareness and\n      Prevention Project, in an amount not to exceed $10,600, for the period of\n      July 1, 2002, through June 30, 2004; and authorize the Chairperson to\n      sign. Motion carried\n      unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-Hlth\n      Serv.-Emergency Serv./ State of California OES - Local Bioterrorism"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to (a) approve the\n      Contract between the County of Inyo and the State of California Emergency\n      Preparedness Office to address emergency response to local bioterrorism in\n      an amount not to exceed $43,758 for the period of February 15, 2002,\n      through August 31, 2003; and authorize the Chairperson to sign; and (b)\n      authorize the Director of Health and Human Services to sign the Local\n      Jurisdiction Work Plan. Motion\n      carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-Hlth\n      Serv./ Bioterrorism Preparedness Consulting Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to declare\n      Bioterrorism Preparedness Consulting as a sole-source provider for\n      bioterrorism consulting services and approve the Contract between the\n      County of Inyo and Bioterrorism Preparedness Consulting for the provision\n      of consultation services for the period of July 15, 2002, through June 30,\n      2003, in an amount not to exceed $18,800, contingent upon the Boards\n      adoption of a FY 2002/03 budget; and authorize the Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-CalWorks/\n      Supt. Of Schools Child Care Services Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to approve the\n      Contract between the County of Inyo and the Superintendent of Schools for\n      Child Care Services for the period of July 1, 2002, through June 30, 2003,\n      in an amount not to exceed $380,000, contingent upon the Boards\n      adoption of a FY 2002/03 budget; and authorize the Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-Behavioral\n      Hlth Serv./NNA Final Contract FY 2002-2003"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to approve the\n      Amendment to the Negotiated Net Amount Contract between the County of Inyo\n      and the State of California, Department of Alcohol and Drug Programs for\n      the provision of alcohol and drug prevention and treatment services,\n      increasing the contract by $36,933 for the period of July 1, 2001, through\n      June 30, 2002, for a total final amount of $587,594; and authorize the\n      Chairperson to sign. Motion\n      carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "H&H-Behavioral\n      Hlth Serv./JPA Mental Hlth Data System Microcom- puter Users Assoc"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Moved\n      by Supervisor Bear and seconded by Supervisor Hambleton to (a) approve the\n      Joint Powers Agreement (JPA) allowing Inyo County to participate as part\n      of twelve counties in a Mental Health Data System Microcomputer Users\n      Association and authorize the Chairperson to sign; and (b) authorize a\n      $2,223 expenditure payable to Glenn County as the JPA Administrator, for\n      Inyo Countys participation in the JPA. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Sheriff/Simplex\n      Grinnell Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The Undersheriff Jack Goodrich, asked that\n      throughout the Contract the reference to June 31, 2003 be changed to\n      reflect June 30, 2003. Moved\n      by Supervisor Dorame and seconded by Supervisor Lent to approve the\n      Contract between the County of Inyo and SimplexGrinnell for maintenance\n      services for the period of July 1, 2002, through June 30, 2003, in an\n      amount not to exceed $28,200, contingent upon the Boards adoption of a\n      FY 2002/03 budget, as amended to reflect the date of June 30, 2003;\n      and authorize the Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "CSA #2/Payment of Invoice\n      for Emergency Services"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The County Administrator provided a brief\n      overview of the request for authorization to pay a vendor invoice for\n      emergency repair work on the CSA #2 sewer system. He explained that the Auditor would not pay the invoice\n      under a warrant as in the past, but was changing the procedure and\n      requiring it be authorized for payment through the purchasing process. Mr. Mendez explained that through the purchasing process anything\n      over $2,000 requires Board approval. Mr. Jeff Jewett, Public Works Director, explained that in the past\n      Public Works would authorize the necessary repairs and once they were\n      completed and approved, the invoice was sent to the Auditors Office on\n      a warrant request for payment. The Board requested that the Auditor join the meeting in order to\n      discuss the change in process and postponed further discussion on the item\n      until the Auditor was available."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "CAO-Personnel/ Liebert\n      Cassidy Whitmore Contract"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The County Administrator explained that the\n      Contract with Liebert Cassidy Whitmore would provide training\n      opportunities for Staff. In\n      response to a query regarding the recent management training, Mr. Mendez\n      indicated that he would be providing the training material provided at the\n      session to the Board. Moved\n      by Supervisor Dorame and seconded by Supervisor Bear to approve the\n      Contract between the County of Inyo and Liebert Cassidy Whitmore, for\n      special employment relations services for the period of July 1, 2002,\n      through June 30, 2003, in an amount not to exceed $2,500, contingent upon\n      the Boards adoption of a FY 2002/03 budget; and authorize the\n      Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "CSA #2/Payment of Invoice\n      for Emergency Services"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The Auditor, Mr. George Holland, joined the\n      meeting and provided additional clarification on the request for\n      authorization to pay a Dr. Drain invoice for repair of the CSA #2 sewer\n      system. He explained that\n      while in the past he had paid these types of invoices on a warrant request\n      from the Public Works Department, in reviewing this invoice he had\n      determined that the CSA #2 was a County operation and as such work\n      performed for the CSA #2 should have to follow the Countys purchasing\n      procedures. Mr. Paul Bruce, County Counsel, explained the difference\n      between a CSD, which is a Community Services District and has autonomy in\n      its operations, and a CSA, which is a County Service Area, whose\n      operations are governed by the County. The Board, Mr. Mendez, Mr. Jewett, and Mr. Holland discussed the\n      process change for payment of CSA #2 invoices. Several Board Members expressed concern with the delay in payment\n      of invoices this extended process has caused, explaining that it would\n      seem that the vendor is being penalized by a change in the internal\n      payment process. Alternatives\n      and options to expedite payments were discussed, with the Board requesting\n      that a Contract with Dr. Drain for emergency repair services be formulated\n      and presented to the Board in the future. Moved by Supervisor Bear and seconded by Supervisor Dorame to\n      direct the Auditor-Controller to pay an invoice from Doctor Drain, Inc.,\n      in the amount of $5,714 plus any applicable late charges for annual\n      maintenance of the sewer systems, as well as all future invoices for\n      work/materials performed for the CSA #2, until such time as a Contract for\n      these services is approved. Motion\n      carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "CAO-Personnel/ Employee\n      Organizations MOU Amendments"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The County Administrator and County Counsel\n      provided additional clarification on the term of the extension to the\n      Employee Organization MOUs. They\n      explained that the existing terms of the MOUs would remain in place\n      until such time as different MOUs are approved or negotiations reach\n      impasse. Moved by Supervisor\n      Hambleton and seconded by Supervisor Dorame to approve A) amendment No. 1 to the Comprehensive Memorandum of Understanding\n      between the County of Inyo and the Inyo County Employees Association\n      extending the terms of the current MOU; and B) Amendment No. 1 to the\n      Comprehensive Memorandum of Understanding between the County of Inyo and\n      the Elected Officials Assistants Association extending the terms of the\n      existing MOU; and C) authorize the Chairperson to sign. Motion carried unanimously."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "BofS/Minute Approval"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The\n      County Administrator requested that the Board divide the minutes of the\n      June 25, 2002, Board Meeting into a morning and afternoon session to\n      facilitate approval due to Supervisor Dorames absence from the entire\n      meeting, Supervisor Bear arriving after the meeting had begun and\n      Supervisor Lent leaving before the meeting had concluded. Moved by Supervisor Hambleton and seconded by\n      Supervisor Lent to approve the minutes of the morning session of the June\n      25, 2002, Board of Supervisor Meeting. Motion carried unanimously, on a\n      three-to-zero vote, with Supervisors Arcularius, Lent and Hambleton voting\n      yes, and with Supervisors Dorame and Bear abstaining. Moved by Supervisor Bear and seconded by Supervisor Hambleton to\n      approve the minutes of the afternoon session of the June 25, 2002, Board\n      of Supervisors Meeting. Motion\n      carried unanimously, on a three-to-zero vote, with Supervisors Arcularius,\n      Bear and Hambleton voting yes, and with Supervisors Dorame and Lent\n      abstaining. Moved by Supervisor Bear and seconded by Supervisor\n      Dorame to approve the minutes of the July 2, 2002, Board of Supervisors\n      Meeting. Motion carried\n      unanimously. Moved by Supervisor Hambleton and seconded by\n      Supervisor Lent to approve the minutes of the July 9, 2002, Board of\n      Supervisors Meeting. Motion carried unanimously, on a four-to-zero\n      vote, with Supervisors Arcularius, Lent, Hambleton and Dorame voting yes,\n      and with Supervisor Bear abstaining."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Board Members and Staff\n      Reports"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The Board\n      Members reported on their activities during the preceding weeks, since the\n      last Board Reports, including Interagency Visitor Center Meeting, a Great\n      Basin Air Pollution Control Board Meeting, a tour of the Big Pine\n      Convalescent Hospital property, an LTC Meeting, an update on the Big Pine\n      Fire, the NACo Annual Conference, Child Development Policy Institute Board\n      Meeting, Standing Committee Meeting, the Junior Livestock Auction and with\n      Supervisor Arcularius asking that a discussion regarding how the County\n      wants to proceed with the Wilderness Act being agendized."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Closed Session"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The Chairperson recessed open session at\n      12:40 p.m., to convene in closed session, with all Board Members present\n      to discuss Agenda Items No. 17. CONFERENCE\n      WITH LEGAL COUNSEL EXISTING/ANTICIPATED LITIGATION (Pursuant to Government\n      Code Section 54956.9(a)(c)  One Case - Sierra Club v. City of Los Angeles, Department of Water and Power, Inyo\n      County Superior Court Case No. SICVCV01-29768; No. 18. CONFERENCE WITH LEGAL COUNSEL\n      EXISTING/ANTICIPATED LITIGATION (Pursuant to Government Code Section\n      54956.9(a)(c)  One Case - Irrigation of Laws Ranch Dispute between LADWP and\n      County of Inyo, Adjudication of Dispute Pursuant to the Long Term Water\n      Agreement entered June 1997 as Stipulation and Order of Judgment, Inyo\n      County Superior Court, Case 12908; No. 19. CONFERENCE\n      WITH LEGAL COUNSEL EXISTING/ANTICIPATED LITIGATION (Pursuant to Government\n      Code Section 54956.9(a)(c)  One Case - LORP Pumpback Station\n      Dispute between LADWP and County of Inyo, Adjudication of Dispute Pursuant\n      to the Long Term Water Agreement entered June 1997 as Stipulation and\n      Order of Judgment, Inyo County Superior Court, Case 12908; No. 20. CONFERENCE\n      WITH LABOR NEGOTIATOR (Pursuant to Government Code Section 54957.6) - Instructions to Negotiators re: wages, salaries and benefits \n      Employee Organization - ICEA - Negotiators - County Administrator and\n      Personnel Analyst; and No. 21. CONFERENCE\n      WITH LABOR NEGOTIATOR (Pursuant to Government Code Section 54957.6) - Instructions to Negotiators re: wages, salaries and benefits \n      Employee Organization - Elective Officials Assistant Association (EOAA) -\n      Negotiator - County Administrative Officer and Personnel Analyst. The Chairperson recessed closed session at 12:45 p.m., reconvening\n      at 2:00 p.m., with all Board Members present to continue closed session\n      discussion."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Report on Closed Session"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The Chairperson recessed closed session at\n      4:50 p.m., to reconvene in open session to receive a report on closed\n      session. County Counsel\n      reported there were no items discussed in closed session which were\n      required by law to be reported on in open session."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Adjournment"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "The\n      Chairperson adjourned the Special Meeting in memory of Lorna Gracey, a\n      retired Inyo County Employee and the wife of past Supervisor Robert Gracey,\n      who had passed away last week. The\n      Chairperson adjourned the meeting in Lornas memory at 4:50 p.m., to\n      9:00 a.m., August 6, 2002, in the Board of Supervisors Room, at the County\n      Administrative Center, in Independence."
    },
    {
      "tag": "div",
      "text": "mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "_____________________________________ Chairperson,\nInyo County Board of Supervisors Attest: REN\nL. MENDEZ Clerk of the Board by: ___________________________________ Patricia\nGunsolley, Assistant mstheme"
    },
    {
      "tag": "div",
      "text": "msnavigation msnavigation msnavigation mstheme"
    },
    {
      "tag": "p",
      "text": "HOME"
    },
    {
      "tag": "div",
      "text": "msthemeseparator"
    },
    {
      "tag": "p",
      "text": "Disclaimer: The County of Inyo reserves\nthe right to make changes and improvements to its Web site at any time and\nwithout notice, and assumes no liability for damages incurred directly or indirectly as a result of errors,\nomissions or discrepancies. Copyright\n 2001 County of Inyo Last\nUpdated: May 18, 2006"
    },
    {
      "tag": "div",
      "text": "mstheme msnavigation"
    }
  ]
}