{
  "url": "http://www.cyberbilly.com/meathenge/archives/000225.html",
  "file_number": "364",
  "content_hash": "38428ffd6b370a8408d84432e3ae988ff08933e92a18f56120b8a84883103d21",
  "total_blocks": 35,
  "retained_blocks": 9,
  "ignored_blocks": 26,
  "blocks": [
    {
      "tag": "div",
      "text": "EDIT DIV STYLE HEIGHT FROM TOP « Garlic Festival - California Mop Sauce | Main | California Bay Laurel - In Jars? »"
    },
    {
      "tag": "h3",
      "text": "Baby Back Ribs - MeatHenge Style"
    },
    {
      "tag": "div",
      "text": "Posted by Biggles on October 27, 2003"
    },
    {
      "tag": "p",
      "text": "Well, it's been just over a week since MeatFest and Ihave a mid-week luncheon planned.  Maybe once a year or so Ihave some friends come over for a nice lungeon consisting mostly of ... well ... meat. It's good meat and this coming Thursday Iplan on having several chickens roasting in a mesquite grill oven. Iknew it was coming, and wasn't sure if Iwas up to the task.  So the first thing Idid was buy a few racks of baby back ribs to hone my skills. They did just fine. Ididn't get an after shot because they were so good Ijust stood over the cutting board and ate what Iwanted.  Which was mostly all of them.  Oh well, what you gonna do?"
    },
    {
      "tag": "div",
      "text": "Posted by Biggles at October 27, 2003  7:43 PM Comments trackbacks and pings Comments"
    },
    {
      "tag": "p",
      "text": "So are you using briquettes, or hardwood charcoal?  If the latter, how the hell do you keep the stuff burning long enough to make ribs?  Do you just add more during the cooking? Posted by: Robert at October 27, 2003  8:53 PM You did good, hon.  The ribs were very rich and yummy-licious.  It was like drinking pure, melted butter. Posted by: Mama at October 27, 2003  9:05 PM Hey Robert, Ihaven't used briquettes in years.  I'm a grilling snob. That being said, Iuse mesquite hardwood charcoal with water soaked hickory or raw hickory chunks when Ican find it. Iuse one of those round tall charcoal stoves to lite the fire and Iget about 1.5 hours out of one stove full. When the grill fire starts to get low, Ipreburn a load in the round cylinder stove and add full-on burning mesquite love. That way the cooking area doesn't take a temperature nose dive. Depending upon how hungry Iam, Ican get it done in 3 or 5 hours. Baby ribs take maybe 2 or so. If you can master making fires, you can master cooking with them. If you can't make a decent fire and control it to YOUR needs, you'll never get a consistent food. So get out there and master that fire !!!!! Posted by: Dr. Biggles at October 28, 2003  8:00 AM"
    },
    {
      "tag": "div",
      "text": "Post a comment"
    },
    {
      "tag": "p",
      "text": "Name: Email Address: URL: Remember Me? Yes No Comments:"
    },
    {
      "tag": "div",
      "text": "Comments trackbacks and pings"
    }
  ]
}