{
  "url": "http://www.danagioia.net/essays/elongfellow.htm",
  "file_number": "367",
  "content_hash": "fb57939692bacc0c329163c4687e56cbcc97688dd208786b991cc25d99811efb",
  "total_blocks": 60,
  "retained_blocks": 16,
  "ignored_blocks": 44,
  "blocks": [
    {
      "tag": "p",
      "text": "Essays \n              Index Reviews \n              and Author's Notes"
    },
    {
      "tag": "div",
      "text": "W. \n                H. Auden Anthony \n                Burgess Charles Causley Anton \n                Chekhov Peter \n                Davison T.S. \n                Eliot William \n                Everson James \n                Fenton Jack \n          Foley Robert \n                Frost Thom \n                Gunn R.S. \n                Gwynn John \n          Haines Donald \n                Hall H.L. \n                Hix Barbara \n                Howes Randall \n                Jarrell Donald \n                Justice John \n                Keats Weldon \n          Kees Garrison Keillor Ted \n          Kooser Philip \n                Levine Henry \n                Wadsworth Longfellow Gabriel \n                Garcia Marquez Robert \n                McDowell Samuel \n                Menashe Czeslaw \n                Milosz Frederick \n                Morgan Ogden Nash Ronald \n                Perry Edgar \n                Allan Poe Adrienne \n                Rich Kay \n                Ryan William \n                Jay Smith James \n                Tate Richard \n                Wilbur"
    },
    {
      "tag": "p",
      "text": "American \n              Poetry"
    },
    {
      "tag": "div",
      "text": "\"Can \n                Poetry Matter? \"Notes \n                Toward a New Bohemia\" \"What \n                is Italian-American Poetry?\""
    },
    {
      "tag": "p",
      "text": "Literature \n              in California"
    },
    {
      "tag": "div",
      "text": "\"Literary \n                L.A., with No Apology\" \"Fallen \n          Western Star\" \"On \n                Being a California Poet\""
    },
    {
      "tag": "p",
      "text": "Poetry \n              and Business"
    },
    {
      "tag": "div",
      "text": "\" Being \n                Outted\" \"A \n          Spy in the House of Commerce\""
    },
    {
      "tag": "p",
      "text": "Writing & Reading"
    },
    {
      "tag": "div",
      "text": "\"Lonely Impulse of Delight\" \"A Californian in Vienna\" \"Accentual \n                Verse\" \"Connect \n          the Prose and the Passion\""
    },
    {
      "tag": "p",
      "text": "Fine \n              Press Printing and Manuscripts"
    },
    {
      "tag": "div",
      "text": "\"Designing \n                Literature: Creative Collaboration\" \"The \n          Hand of the Poet: The Magical Value of Manuscripts\""
    },
    {
      "tag": "p",
      "text": "Film \n              & Music"
    },
    {
      "tag": "div",
      "text": "\"Drama \n                at the Opera House\" \"Glass \n                Appeal: Philip Glass's Film Scores\" \"Handel's \n                Many Messiahs\" \"Moulin Rogue: Baz Luhrman's La \n                Bohème \" \"Warner \n                Brothe rs' \n                Fat Men\""
    },
    {
      "tag": "p",
      "text": "On \n              \"Paul Revere's Ride\" by Henry Wadsworth Longfellow By \n              Dana Gioia Henry \n                Wadsworth Longfellow was the most popular poet in American history. \n                His work commanded a readership that is almost unimaginable today \n                even for best-selling novels. In terms of their reach and influence, \n                Longfellow's poems resembled studio-era Hollywood films: they \n                were popular works of art enjoyed by huge, diverse audiences that \n                crossed all social classes and age groups. Writing in a period \n                before the electronic media usurped the serious literary artist's \n                role as society's story-teller, Longfellow did as much as any \n                author or politician of his time to shape the way nineteenth-century \n                Americans saw themselves, their nation, and their past. At a crucial \n                time in American history–just as the Revolutionary War receded \n                from living memory and the disastrous Civil War inexorably approached–Longfellow \n                created the national myths for which his new and still unstoried \n                country hungered. His poems gave his contemporaries the words, \n                images, myths, and heroes by which they explained America to one \n                another and themselves. There is no better example of Longfellow's \n                genius at creating meaningful and enduring national myth than \n                \"Paul Revere's Ride.\" The \n                opening lines of \"Paul Revere's Ride\" are still so famous \n                that even people who have not read the entire poem often know \n                them by heart. They have become, in fact, so familiar that most \n                readers might easily take them for granted and miss the striking \n                and paradoxical rhetorical figures they contain. The poem's narrator, \n                for example, begins by saying, \"Listen, my children, and you shall \n                hear.\" He addresses the tale specifically to children, and yet \n                the work is not in any narrow sense a children's poem. \"Paul Revere's \n                Ride\" was published in The Atlantic Monthly , hardly a juvenile \n                journal, and was eventually collected in Longfellow's masterful \n                book of interwoven narrative poems, Tales of a Wayside Inn (1863), where it is spoken by the Landlord to an audience \n                of adult men. Why then does the poem begin by addressing only \n                one part of its intended audience? By \n                invoking children in the opening line of his patriotic poem, Longfellow \n                implicitly defines his narrative as a story the older generation \n                considers important enough to pass down to posterity. What will \n                follow, therefore, is not merely an interesting story but a legacy–one \n                of the traditional tales that defines both the audience and the \n                speaker's identity. Perhaps for this reason, Longfellow placed \n                \"Paul Revere's Ride\" as the first story told in Tales of a \n                Wayside Inn . The characters in the book meet and tell their \n                tales at a tavern in Sudbury, Massachusetts, not far from Boston. \n                Revere's historical exploits would have been a proud part of their \n                shared local lore. Longfellow's \n                inclusion of the date in the third line serves a similar rhetorical \n                function. (Once again the familiarity of the opening lines makes \n                us forget how odd it is to present a complete date–day, month, \n                and year–in a poem. Longfellow never did so elsewhere in \n                his poetry.) The implicit message of the line is clear: Paul Revere's \n                achievements were of such singular importance that we must learn \n                the date by heart and teach it to posterity. Everyone in Longfellow's \n                original audience would have understood the significance of the \n                date. April 18, 1775 was the day before the American Revolution \n                began. The next morning at Lexington and Concord, the American \n                colonists would fire their \"shot heard round the world\" and initiate \n                their successful armed resistance against the British Empire. \n                The narrator also explains the necessity of passing this piece \n                of heritage on by reminding the listeners that \"hardly a man is \n                now alive / who remembers that famous day and year.\" The original \n                witnesses are now mostly dead. It has become the audience's responsibility \n                to preserve the memory of Revere's heroic deeds. Longfellow \n                was an immensely versatile poet who excelled at virtually every \n                form and genre from the epic to the sonnet. No form, however, \n                better displayed his distinctive gifts than the short narrative \n                poem. Nineteenth century readers greatly esteemed the form, which \n                combines the narrative pleasures of fiction with the verbal music \n                of verse. Modern critics, however, have generally downgraded narrative \n                poetry in favor of lyric verse. Longfellow's reputation has been \n                especially hard hit by the change in critical consensus, and once \n                popular poems like \"Paul Revere's Ride\" have consequently disappeared \n                from academic anthologies. The special qualities of these poems \n                seem antithetical to the lyric traditions of modern poetry, which \n                prize verbal compression, intellectual complexity, elliptical \n                style, and self-referential movement. Longfellow's greatest gifts \n                were best suited to more public poetry–forceful clarity, \n                evocative simplicity, emotional directness, and a genius for memorable \n                (indeed often unforgettable) phrasing. William \n                Butler Yeats once commented that Longfellow's popularity came \n                because \"he tells his story or idea so that one needs nothing \n                but his verses to understand it.\" That observation particularly \n                applies to \"Paul Revere's Ride,\" which takes a complicated historical \n                incident embedded in the politics of Revolutionary America and \n                retells it with narrative clarity, emotional power, and masterful \n                pacing. From the poem's first publication, historians have complained \n                that Longfellow distorted the actual incident and put far too \n                much emphasis on Revere's individual role. But Longfellow was \n                not interested in scholarly precision; he wanted to create a stirring \n                patriotic myth. In the process he took Paul Revere, a regional \n                folk hero hardly known outside Massachusetts, and turned him into \n                a national icon. To accomplish this feat, Longfellow mythologized \n                both the incident and the man. The new Revere became the symbolic \n                figure who awakens America to fight for freedom. The actual incident, \n                a literal call to arms for the Revolution, required less mythologization. \n                After all, revolutions are already the stuff of myth. Longfellow \n                had only to streamline the historical narrative so that the poem \n                could focus on a central heroic figure. The resulting story–despite \n                the scholarly complaints–is actually not too far from fact. \n                (Longfellow took considerably fewer liberties than Shakespeare \n                did with British history.) The final poem does not merely recount \n                an historical incident; it dramatizes unconquerable Yankee individuality \n                against the old order of European despotism. Longfellow \n                was a master of narrative pacing. His description of Revere's \n                friend climbing the Old North Church tower displays the poet's \n                ability to make each narrative moment matter. By slowing down \n                the plot at this crucial moment, Longfellow not only builds suspense; \n                he also adds evocative physical details that heightens the moods. \n                (Decades later Hollywood would discover the same procedures.) \n                Reaching the belfry, the friend startles \"the pigeons from their \n                perch.\" Fluttering around in they make \"masses and moving shapes \n                of shade.\" The man now pauses to look down at the graves that \n                surrounded an eighteenth century church–an image that perhaps, \n                prefigures the deadly battle to be fought the next day. This lyric \n                moment of reflection provides a false sense of calm before the \n                explosive action that will follow. The man now remembers the task \n                at hand. There is a crucial deed to do. The \n                scene now shifts suddenly–with a decisive cinematic cut–to \n                the opposite shore where the solitary Revere waits for the signal. \n                (What other nineteenth-century American poet would have handled \n                this transition so boldly?) The historical Revere was one of many \n                riders, but Longfellow understood the powerful appeal of the single \n                heroic individual who fights oppression and makes a decisive impact \n                –another narrative lesson not lost on Hollywood. Longfellow's \n                Revere is not a revolutionary organizer; he is a man of action. \n                As soon as he sees the first lantern, he springs into the saddle, \n                though he is smart enough to wait for the second light before \n                he rides off. The \n                rest of the poem is pure action–mostly one long tableau of \n                Revere's ride from village to town to village. Once again the \n                effect, to a modern reader, is quintissentially cinematic. Longfellow's \n                galloping triple meters create a thrilling sense of speed, and \n                the rhetorical device of stating the time of night when Revere \n                enters each village adds a cumulative feeling of the rider's urgency. \n                Few poets could sustain a single, linear action for nearly forty \n                lines as Longfellow manages so compellingly in the poem's extended \n                climax. The last two stanzas also demonstrate Longfellow's narrative \n                authority. As the poet makes the sudden but clear transition from \n                Revere's arrival in the town of Concord to the following day's \n                conflict, Longfellow masterfully summarizes the Battle of Concord \n                in only eight lines. Once again, however, he rhetorically conscripts \n                the listener to collaborate in completing the story. \"You know \n                the rest,\" says the narrator, \"In the books you have read.\" Ingeniously, \n                Longfellow acknowledges the importance of the next day's battle \n                without accepting the artistic necessity to describe it in detail. The \n                final stanza returns to the image of Revere riding through the \n                night. Now presented outside of the strictly linear chronology \n                that has hitherto characterized the poem, the galloping Revere \n                acquires an overtly symbolic quality. He is no longer the historical \n                figure awakening the Middlesex villages and farms. He has become \n                a timeless emblem of American courage and independence. Significantly, \n                the verb tenses in the final stanza shift from the past ( rode ) \n                in the opening five lines to the future tense ( shall echo , will waken ) in the closing lines. The relevance of Longfellow's \n                patriotic symbol would not have been lost on the poet's original \n                audience–the mostly New England Yankee readers of the Boston-based Atlantic Monthly . Although Longfellow ostensibly mythologizes \n                the Revolutionary War, his poem addresses a more immediate crisis–the \n                impending break-up of the Union. Published a few months before \n                the Confederate attack on Fort Sumter initiated America's bloodiest \n                war, \"Paul Revere's Ride\" was Longfellow's reminder to New Englanders \n                of the courage their ancestors demonstrated in forming the Union. \n                Another \"hour of darkness and peril and need,\" the poem's closing \n                lines implicitly warn, now draws near. The author's intentions \n                were overtly political–to build public resolve to fight slavery \n                and protect the Union–but he embodied his message in a poem \n                compellingly told in purely narrative terms. Longfellow's \"Paul \n                Revere's Ride\" was so successful that modern readers no longer \n                remember it as a poem but as a national legend. Underneath the \n                myth, however, a fine poem waits to be rediscovered."
    },
    {
      "tag": "div",
      "text": "© \n      1998 Dana Gioia First published in Poetry for Students, Volume 2 (Gale 1998) Questions about this site? Send a message to the site manager ."
    }
  ]
}