{
  "url": "http://www.divorce.co.uk/legal/englandwales/legalcloserlook/questions/freqaskquestions.htm",
  "file_number": "378",
  "content_hash": "fc978a62f79142f2bdb3db0126a8fb85078a97df2e4ae240202378b2a78ca05f",
  "total_blocks": 126,
  "retained_blocks": 4,
  "ignored_blocks": 122,
  "blocks": [
    {
      "tag": "div",
      "text": "Start NavBar Divorce\r\n        and Separation The\r\n        law relating to children Finance Frequently\r\n        asked questions Site\r\n        Plan"
    },
    {
      "tag": "h3",
      "text": "Frequently \r\n                  Asked Questions"
    },
    {
      "tag": "p",
      "text": "Here are some of the most common questions that get asked. \r\n                      Click on Question to view the response. Does \r\n                      it matter who divorces whom? Is \r\n                      the new law of divorce going to be easier? Which \r\n                      court does it have to be in? Do \r\n                      the children automatically live with their mother? Is \r\n                      a 50/50 split the usual financial settlement? Should \r\n                      Iclose my joint account? What \r\n                      happens to my house if Idie? What \r\n                      happens to the children if Idie? Can \r\n                      Ichange my child’s surname? How \r\n                      can Ikeep legal fees down? Click \r\n                    here for liability disclaimers Does \r\n                    it matter who divorces whom? There are some disadvantages in \r\n                    being the one who is divorced. Firstly, you can be ordered \r\n                    to pay the legal fees for the divorce; this may seem (and \r\n                    often is) extremely unfair, a case of adding injury to insult. \r\n                    This is based on the old principle in the courts that if you \r\n                    prove your case then you get your costs, despite the fact \r\n                    that it is not always appropriate in the family justice system. \r\n                    However, if the practicalities of the actual divorce are agreed \r\n                    by both parties, it is also possible to agree that the two \r\n                    of you will share the legal fees between you, or indeed that \r\n                    the person who actually files the petition will not seek an \r\n                    order for costs against the spouse. Secondly, you may have the unpleasantness \r\n                    of being on the receiving end of some legal description of \r\n                    your private life, especially if the divorce is based on unreasonable \r\n                    behaviour. It is possible to file an Answer to the allegations \r\n                    and try to regain control of the process by forcing a compromise \r\n                    on the allegations made, but most prefer to avoid the legal \r\n                    complications and significant expense of doing so. Nevertheless, \r\n                    allegations made as to unreasonable behaviour do often stick \r\n                    in the gullet as the contents of the Petition rarely have \r\n                    much to do with why the marriage broke down. But who petitions against whom \r\n                    rarely spills over in to other more important areas, such \r\n                    as the children or finance. It is worth just checking that \r\n                    none of the allegations in the Petition relate to dealing \r\n                    with the children or to financial issues, since once the divorce \r\n                    is granted, those allegations become a finding of fact. Unless \r\n                    it is specifically agreed beforehand, these findings can be \r\n                    referred to in linked proceedings. The usual way of preventing such \r\n                    difficulties - and much acrimony too - is to offer the Petition \r\n                    in draft before it is sent to the court. Any items that cause \r\n                    particular upset can be discussed and either watered down \r\n                    or left out. This is not something that everyone has to do, \r\n                    but is very much in the spirit of the SFLA Code of Practice. An early discussion with an SFLA \r\n                    solicitor can help resolve some of these issues. back \r\n                    to list of questions Is \r\n                    there going to be a new law of divorce? The Family Law Act 1996 was passed \r\n                    in a fanfare, hailed as going some way towards removing acrimony \r\n                    in the divorce process by getting rid of the concept of 'fault'. \r\n                    However, the Government has since announced that those parts \r\n                    of the Act dealing with divorce will not now come into force. We are, unfortunately, left with \r\n                    the present system for the foreseeable future. back \r\n                    to list of questions Which \r\n                    court does it have to be in? If the divorce is going to take \r\n                    place in England and Wales, it is possible to get any County \r\n                    Court that is empowered to deal with divorce to issue proceedings. It is usual to use your local court \r\n                    for convenience's sake. Some use a court that is out of their \r\n                    area for fear of coming into contact with people they know \r\n                    in the local context (Mrs Simpson used Ipswich!). The Principal \r\n                    Registry in London is used by many who do not live there, \r\n                    for a mixture of all of these reasons or perhaps they believe \r\n                    that that court will handle their case better. Practices and judicial attitudes \r\n                    vary from court to court. Experienced solicitors with knowledge \r\n                    of the system sometimes choose a particular court for a particular \r\n                    case, to try and gain some advantage for their client. But for the vast majority of cases \r\n                    it is convenience that is the deciding factor - convenience \r\n                    for the solicitors particularly, since they will charge for \r\n                    their travel time to court. In any event courts have the power \r\n                    to order cases to be transferred to the court that is most \r\n                    appropriate - in the view of the judge rather than anyone \r\n                    else. back \r\n                    to list of questions Do \r\n                    children automatically live with their mother? Married parents share joint parental \r\n                    responsibility and come before the Court as equals. The children's \r\n                    welfare is the court's paramount consideration. If there is a dispute as to with \r\n                    which parent the children should live, one or other of them \r\n                    must issue an application for a Residence Order. In considering \r\n                    which parent is best able to meet the child's best interests, \r\n                    the Court will apply the \"welfare checklist\" (s1(3) \r\n                    Children Act 1989). The application of the Welfare \r\n                    Checklist points towards pragmatism: Who is best able to meet the \r\n                      child's day to day needs? What has the domestic routine \r\n                      been in the child's life to date? Even if there is little to choose \r\n                      between the two parents in terms of their actual parenting \r\n                      skills, are the work commitments of one more conducive to \r\n                      having primary care of the children? This last consideration \r\n                      is often fundamental and traditionally, has tended to work \r\n                      in favour of mothers, but increasingly, this need not necessarily \r\n                      be the case. Even where one parent does have \r\n                      a Residence Order in his or her favour, that does not alter \r\n                      the fact that the other parent retains parental responsibility \r\n                      and has an important role to play in the child's life. In \r\n                      theory at least, a Residence Order is not a passport to \r\n                      making important decisions about the child's upbringing \r\n                      on a unilateral basis. In the case of unmarried parents, \r\n                      the mother has sole parental responsibility until the father \r\n                      acquires it by way of an agreement, or Court Order. He will \r\n                      however be granted parental responsibility automatically \r\n                      if he has a Residence Order in his favour. In the case of very young children, it is a fact that \r\n                      courts tend to assume they are better off living with their \r\n                      mother unless clearly shown to the contrary. Nevertheless, \r\n                      there is no presumption of law and the courts have to consider \r\n                      each case on its individual merits. Although the odds may \r\n                      seem stacked against a father, the facts may mean that this \r\n                      is not necessarily the case. back \r\n                    to list of questions Is \r\n                    a 50/50 split the usual financial settlement? Recent cases concerning 'big money' \r\n                    - where the assets available for division clearly exceed the \r\n                    parties' needs - have focused on the concept of equality of \r\n                    outcome. This may or may not mean that the assets are divided \r\n                    50/50 in these cases. What it does mean is that contributions \r\n                    to the running of the home and the bringing up of children \r\n                    are valued equally by the court on divorce to contributions \r\n                    made by economically rewarding work. There may be other considerations \r\n                    - for example, the liquidity of the assets making up the family \r\n                    pot, or any inheritances received, or particularly bad financial \r\n                    conduct on one side, which dictate that the outcome should \r\n                    not be equal. Fairness is the key - and a 50/50 split will \r\n                    not be fair in all cases. Each case has to be looked at individually. It depends on \r\n                    the circumstances of those involved. In most cases, the financial settlement \r\n                    will reflect what each person needs fundamentally, money to \r\n                    pay all the bills and to sort out somewhere to live. Having an equal split is sometimes \r\n                    the starting point, but a lot of other factors have to be \r\n                    taken into account. See the section on FINANCE for more details. This explains how the law works. The great strength of the law is \r\n                    that it is flexible enough to treat each family differently. \r\n                    But that does make it difficult to work out what is right \r\n                    for you. We recommend that you consult a \r\n                    solicitor about your own case - to see what the likely outcomes \r\n                    might be. back \r\n                    to list of questions Should \r\n                    Iclose my joint account? Many couples do not make any changes \r\n                    to their banking arrangements until financial negotiations \r\n                    are well advanced. But if there is a risk that large \r\n                    sums may be drawn out - or if there is a risk that credit \r\n                    or charge cards may be used inappropriately - then it may \r\n                    be safer to take action to prevent this. The danger is that if an account \r\n                    or credit card is suddenly frozen, solicitors may be involved \r\n                    immediately to ask for maintenance arrangements to be set \r\n                    up - perhaps through the courts. Much depends on whether you can \r\n                    trust each other enough to leave things as they are. If you need to rearrange the accounts \r\n                    on separation we recommend that you try to agree those changes \r\n                    first. Think about mediation. If you have concerns about this \r\n                    area then consult a solicitor. back \r\n                    to list of questions What \r\n                    happens to my house if Idie? You need to check the way in which \r\n                    your home is owned. Is it in your sole name? If it is, it \r\n                    will pass under the terms of your will or intestacy. There are two ways of owning a home jointly - as equitable \r\n                    joint tenants, or as tenants-in-common. Many couples own their home as joint tenants, which means \r\n                    in such a way that if one of them dies, the other owns the \r\n                    property outright automatically. This arrangement may still be the \r\n                    right one after separation - at least for the time being. It is possible though to change \r\n                    the way in which you own any property jointly - so that if \r\n                    one of you dies then his or her share passes to their estate \r\n                    and is then dealt with under their will i.e. to set up a tenancy-in-common. \r\n                    This is called severing the joint tenancy by giving a formal \r\n                    Notice of Severance to the other joint owner. Your solicitor can prepare this \r\n                    for you. You should always take advice on this point because \r\n                    it may lead to claims against your estate if you die. It may be helpful to prepare a \r\n                    new will early on - even if this is only a temporary measure. The decree absolute of divorce \r\n                    automatically alters your will in so far as it relates to \r\n                    the other spouse. It is important to consider changing your \r\n                    will at that stage in any event. back \r\n                    to list of questions What \r\n                    happens to the children if Idie? Where both parents have parental \r\n                    responsibility, in the event of the death of one, the surviving \r\n                    parent will retain sole parental responsibility. The exception to this is where \r\n                    the parent who died had a Residence Order in his or \r\n                    her favour, in which case, any guardian appointed in the deceased \r\n                    parents Will will automatically assume Parental Responsibility in tandem with the surviving parent. If there is a dispute between those \r\n                    with parental responsibility as to with whom a child should \r\n                    live in the event of the death of his or her primary carer, \r\n                    then an application for a Residence Order needs to \r\n                    be made to the Court who will then determine with whom the \r\n                    child should live. back \r\n                    to list of questions Can \r\n                    Ichange my child’s surname? Neither parent, nor indeed any \r\n                    other person, can change a child’s surname without the \r\n                    written consent of every person with parental responsibility \r\n                    or the leave of the Court. Even in cases where the parents \r\n                    are unmarried, the Court has suggested that such a step should \r\n                    generally not be taken without either the other parent's agreement \r\n                    or a court decision. Changing a child’s surname is obviously \r\n                    a very emotive step, since the surname may provide an important \r\n                    link to the parent with whom the child does not normally live; \r\n                    it may also express a preference to be known as the child \r\n                    of the step-parent. The Court will not consider it \r\n                    appropriate to change a child’s surname just because \r\n                    it is different to that of their half–or–step-siblings, \r\n                    nor even simply because the child wants it changed. The Court \r\n                    will not sanction a change in surname lightly; there is a \r\n                    presumption in favour of the status quo. Increasingly, children may be part \r\n                    of a step-family in which children do not all share the same \r\n                    surname. It is therefore important that any such proposal \r\n                    is very carefully thought through and justifiable on quite \r\n                    strict grounds, such as where there is no ongoing relationship \r\n                    whatsoever with the other biological parent and so to retain \r\n                    that name causes distress and confusion. The uppermost consideration for \r\n                    the Court in considering whether a change of surname is appropriate \r\n                    is the child’s welfare and best interests. It is everything \r\n                    to do with the rights of the child and nothing to do with \r\n                    any asserted parental rights. How those best interests are \r\n                    met will depend upon balancing a range of factors including: the original surname with which \r\n                      the child was registered and whether all the circumstances \r\n                      justify such a change (ie. is there a good enough reason?); whether the change of name has \r\n                      already happened and how long ago; the age of the child involved \r\n                      and whether he or she is deemed competent to understand \r\n                      the complexity of issues arising; the need to preserve a link \r\n                      between the child and the non-residential parent, regardless \r\n                      of contact arrangements; whether the reaction of either \r\n                      parent to the decision and any consequences would cause \r\n                      practical detriment to the child; the strength of the child's \r\n                      connection with the current surname. In certain instances the Court \r\n                    has made a distinction between a child’s \"official\" \r\n                    name and the name by which the child chooses to be known; \r\n                    this to be particularly relevant with an older child, although \r\n                    the parents themselves would be obliged not to cause them \r\n                    to be known by anything other than the official name. However, \r\n                    in another case involving teenage children the Court decided \r\n                    that the father’s surname should be kept in the face \r\n                    of opposition from the children and in circumstances where \r\n                    no contact was taking place in order to underline the importance \r\n                    of the paternal link. Inevitably, the issue continues \r\n                    to be a difficult and highly emotionally-charged one to resolve, \r\n                    but one in which the Court considers it important enough to \r\n                    be involved where the parents cannot agree. back \r\n                    to list of questions How \r\n                    can Ikeep my legal fees down? Solicitors usually charge for their \r\n                    time - the more of their time you use up, the more they cost. Here are some tips for keeping \r\n                    fees down: Use this site and tell your \r\n                      family about it! Don't talk to your solicitor \r\n                      about emotional problems - there are better qualified people \r\n                      to help with those who cost less. Solicitors will be sympathetic \r\n                      and may need to know some background but their skills are \r\n                      different . Use mediation to sort out as \r\n                      much as possible - your solicitor has a vital role to play \r\n                      even if you mediate, but you may be able to sort out a lot \r\n                      of issues yourselves - and certainly a lot of the financial \r\n                      disclosure . Use a check-list of things you \r\n                      want to ask - you will be charged for each call you make, \r\n                      so be sure beforehand that you know all the things you want \r\n                      to ask about - you will save on the additional calls . Keep a file (somewhere safe) \r\n                      of all your solicitor's letters and documents in an organized \r\n                      format. It is important that you can keep track of the advice \r\n                      you have had, and you are likely to have to refer to what \r\n                      has been sent to you. Some of your queries may already have \r\n                      been answered . Keep a file of all your bank \r\n                      , credit card and charge card statements - and the rest \r\n                      of your financial information. One of the expensive tasks \r\n                      your solicitor may well have to do is examine your financial \r\n                      position; if this is in chaos you will be paying for your \r\n                      solicitor to prepare details of your outgoings, your mortgage \r\n                      and life assurance, your pensions and so on. Fill in as much as you can of \r\n                      our Financial Checklist - you will find this under Finance , \r\n                      in particular the section Practical \r\n                      Steps . Don't bother your solicitor \r\n                      with less important things which could be done by a secretary \r\n                      - if it is anything other than advice, then ask a secretary \r\n                      who is involved, for confirmation of dates or appointments, \r\n                      copy documents etc. back \r\n                    to list of questions"
    },
    {
      "tag": "div",
      "text": "End End NavBar"
    }
  ]
}