{
  "url": "http://www.eia.doe.gov/oiaf/issues/wind_supply.html",
  "content_hash": "64715f20a61df35508add98e71b20e2bbc157fbf0b90f77ab3664e23f3b96753",
  "total_blocks": 129,
  "retained_blocks": 3,
  "ignored_blocks": 126,
  "blocks": [
    {
      "tag": "p",
      "text": "Report\r\n    Contents Report#:EIA/DOE-0607(99) Preface Trends\r\n      in Power Plant Operating Costs Sectoral\r\n      Pricing in a Restructured Electricity Market Modeling\r\n      the Costs of U.S. Wind Supply Modeling\r\n      Technology Learning in the National Energy Modeling System Employment\r\n      Trends in Oil and Gas Extraction Price\r\n      Responsiveness in the NEMS Buildings Sector Models Annual\r\n      Energy Outlook Forecast Evaluation National\r\n      Energy Modeling System/ Annual Energy Outlook Conference Summary Completed\r\n    Report in PDF Format (862 KB) Related Links Forcasting Page EIA Homepage by Thomas W. Petersik Representing Wind Generating Technology Data Inputs Capacity\r\n          and Dispatch Methodologies Wind\r\n          Energy Characterization Basis\r\n      for Wind Cost Adjustment Factors Evidence\r\n          from Experience Evidence\r\n          from Regional Supply Evaluations Cost\r\n      Adjustment Factors for U.S. Wind Supply Small\r\n          Regions:  Adapting CEC Information to ECAR, MAAC, NY, NE, and\r\n          SERC Large\r\n          Regions:  Adapting the NWPPC Estimates The\r\n          ERCOT Special Case Wind\r\n      Projections Issues\r\n      in EIA Wind Capital Cost Adjustment Factors Conclusion"
    },
    {
      "tag": "div",
      "text": "Renewable energy sources, including wind power, are increasingly seen as\r\n a way of meeting the Nation’s energy requirements while also contributing\r\n to carbon emissions reductions, promoting fossil fuel conservation, and\r\n reducing other harmful pollutants such as sulfur dioxide and nitrogen oxide.\r\n However, renewables can also be more expensive, and by their nature some\r\n are not always available to meet baseload electricity demands. This paper\r\n describes the methodology used in the National Energy Modeling System (NEMS)\r\n for representing electricity generation from wind power, one of the more\r\n mature and lower cost renewable energy technologies, and one that has been\r\n prominently mentioned as a means of helping to meet the Kyoto Protocol’s\r\n carbon reduction targets for the United States."
    },
    {
      "tag": "p",
      "text": "Introduction Existing wind power capacity in the United States today is approximately\r\n 2,000 megawatts—about 0.2 percent of all U.S. grid-connected electricity\r\n generating capacity—and accounts for about 0.1 percent of generation. 1 As a carbon-free technology, however, wind power is increasingly discussed\r\n for its potential in meeting U.S. and global carbon reduction targets,\r\n such as those proposed in the 1998 Kyoto accords. Wind technology does\r\n not have fuel requirements as do coal, gas, and petroleum generating technologies;\r\n however, both the equipment costs and the costs of accommodating special\r\n characteristics such as intermittence, resource variability, competing\r\n demands for land use, and transmission and distribution availability can\r\n add to the costs of generating electricity from wind. The purpose of this paper is to describe how the Energy Information Administration\r\n(EIA) addresses in the National Energy Modeling System (NEMS) the natural\r\n resource, transmission and distribution, and market factors that affect\r\n the cost of U.S. electricity generation from wind resources. This introduction\r\n summarizes general electricity modeling in NEMS. The second section, “Representing\r\n Wind Generating Technology,” outlines the overall NEMS representation of\r\n wind, including identification of the cost adjustment factors. The third\r\n and fourth sections, “Basis for Wind Cost Adjustment Factors” and “Cost\r\n Adjustment Factors for U.S. Wind Supply, ”provide EIA’s justification for\r\n and derivation of the cost adjustment factors. The sections show applications\r\n of the factors in recent EIA forecasts for wind power, identify key issues\r\n for further examination, and conclude by summarizing the importance of\r\n the issue of cost. NEMS is an integrated computer model of the U.S. energy economy. It includes\r\n modules representing all the major supply and demand sectors that produce\r\n and consume energy. Within NEMS, the selection of new generating capacity,\r\n including wind, is based on the relative costs of competing technologies.\r\n Electricity generating technologies compete based on capital, fuel, and\r\n operations and maintenance (O&M) costs for providing U.S. regional baseload,\r\n intermediate, and peaking electric power supply. Intermittent technologies\r\n such as wind also compete on their ability to meet electricity demand at\r\n the time winds are available. Capital costs for all generating technologies are affected by a number\r\n of characteristics. Using information from the Department of Energy, the\r\n Electric Power Research Institute, published reports, meetings with industry\r\n and technology representatives, and others, EIA estimates the initial capital\r\n cost for each technology. 2 Capital costs decrease as experience with the\r\n technology increases (learning-by-doing effects), and as domestic and international\r\n capacity penetrate electric power markets. 3 At high rates of growth, however,\r\n capital costs may temporarily increase in response to short-term bottlenecks. Fuel costs also affect technology competition. For fossil fuels, fuel costs\r\n are projected separately in NEMS in the individual fuel supply modules,\r\n providing inputs for subsequent choices among generating technologies.\r\n In contrast, the availability and cost of wind energy— essentially its\r\n “fuel” cost—are represented in two ways. First, wind turbine capacity factors\r\n used in NEMS vary by geographic region, time of day and season, and by\r\n the estimated energy content of available winds (wind class). Second, experience\r\n indicates that the energy availability of wind turbines is also affected\r\n by other factors in addition to region, time, and wind class. EIA expresses\r\n these additional factors along with others by adjusting wind technology\r\n capital costs. The derivation of the adjustments is the primary focus of\r\n this paper. Representing Wind Generating Technology The methodology for projecting electricity generation from wind power consists\r\n of a series of data inputs, capacity and dispatch algorithms, and specific\r\n components for characterizing wind energy supply. Each is discussed below. Data Inputs The primary data inputs are existing wind generating capacity, future capacity\r\n planned by electricity producers, wind technology cost and performance\r\n characteristics, wind capacity factors, and cost adjustment factors. EIA\r\n collects information on existing capacity and that planned for the future\r\n from electric utilities and nonutilities, including independent power producers\r\n and small power producers. Planned capacity commitments include capacity\r\n under construction, under contract, mandated by law or regulation, or under\r\n commitment by an electricity producer. Mandated new wind capacity in Minnesota and Iowa, as well as estimates\r\n of new wind capacity to be installed under State renewable portfolio standards,\r\n are included as planned capacity. In 1999, for example, more than 600 megawatts\r\n of new wind generating capacity are planned, scheduled to take advantage\r\n of the Federal renewable energy production incentive before its expiration\r\n on July 1, 1999. Proposals or goals for new capacity that have not yet\r\n resulted in firm commitments are not included as “planned.” Capital costs for new generating technologies are assumed to decline as\r\n more units enter service and experience increases. EIA derives estimates\r\n for the key cost and performance values for wind power from a variety of\r\n sources, including the Electric Power Research Institute, the Department\r\n of Energy, other industry participants, and current market data. 4 Capacity and Dispatch Methodologies In order to meet projected growth in the demand for electricity and to\r\n replace retiring generating units, new capacity is added over and above\r\n existing and known plans for new capacity. The essential steps in the methodology\r\n are to determine future capacity needs based on peak demands, subtract\r\n current (net of retirements) capacity from those needs, and project the\r\n types of capacity that must be built to reach the target. The technology\r\n choice is based primarily on total costs over a 30-year horizon, including\r\n capital, O&M, and fuel costs. Technology choice is also affected by subsidies\r\n and taxes, such as those associated with meeting environmental requirements.\r\n Intermittent technologies— mainly wind and solar—are special cases, because\r\n they are not always available and thus have a reduced ability to meet demands.\r\n This problem is resolved by segmenting annual electricity demand into a\r\n number of “slices,” defined by season and time of day. Wind and solar compete\r\n directly for new capacity to serve those parts of the load for which they\r\n are most suited, and they are not penalized by considering overall annual\r\n demands only, for which they would be too expensive. However, because they\r\n are not always available, their credited contribution to meet the peak\r\n demand is reduced, because their inclusion reduces the overall reliability\r\n of the system. The impact of this reduction is that more fossil-fuel-fired\r\n capacity may be built to meet the reliability requirements when wind is\r\n chosen as the most economical technology. Unlike fossil fuel technologies that can be dispatched at varying capacity\r\n factors depending on demand and marginal cost, wind power is dispatched\r\n in NEMS at specified capacity factors derived by EIA and differing by hour\r\n of the day, season, region, and wind class. Wind capacity factors are based\r\n in part on the performance of actual units and in part on the maximum performance\r\n suggested by research on characteristics of new technologies. In addition,\r\n some improvement in wind capacity factors over time is assumed as new capacity\r\n is used and electricity producers learn how to operate their units more\r\n efficiently. Wind Energy Characterization Wind energy is the “fuel” for wind technologies. Because wind’s fuel value\r\n is partly incorporated in capital costs and is not separately priced, EIA\r\n modifies capital costs for wind projects on the basis of three key characteristics:\r\n wind class, costs of building new transmission interconnection with the\r\n existing transmission and distribution network, and cost adjustment factors.\r\n The cost adjustment factors account for variations in natural resource\r\n quality, costs of upgrading the existing network, and effects of alternative\r\n uses for lands with wind resources. For wind resources to be useful for\r\n electricity generation, the site must (1) have sufficiently powerful winds,\r\n (2) be located near existing transmission networks, and (3) be economically\r\n accessible considering additional natural resource, transmission network,\r\n and market factors. Wind technology opportunities are first identified by regional estimates\r\n of available wind energy. The foundation of EIA’s wind supply characterizations\r\n is the adaptation of standard wind supply maps provided by the Pacific\r\n Northwest Laboratory (PNL). 5 The PNL wind data are first expressed in square\r\n kilometers of land, shown by electricity market region and by wind energy\r\n class. Wind energy values are grouped among seven wind-speed classes, with\r\n higher numbers indicating greater energy resources (Table 1). The few class\r\n 7 wind resources are included with class 6 (designated in Table 1 as “6+”),\r\n and winds below class 4 are generally regarded as not economically useful.\r\n Recognizing that some lands will not be made available for wind power use,\r\n EIA has adopted PNL’s “moderate” wind resource exclusion scenario (Table\r\n 2). 6 Applying these criteria, EIA determines U.S. wind resources by region\r\n (Table 3). Table\r\n1. Wind Classes for Wind Energy Characterization Table\r\n2. Percentages of Lands Excluded from Wind Energy Characterization in the\r\nPacific Northwest Laboratory Moderate Exclusion Scenario Table\r\n3. U.S. Wind Resources for Electricity Generation, by Wind Class and NEMS Region As shown in Table 3, the United States has ample wind resources. Figure\r\n 1 shows the potential U.S. wind supply for wind power stations at different\r\n capital costs (excluding learning effects, improving capacity factors,\r\n and cost adjustment factors). 7 Although wind technologies are not comparable\r\n to baseload or other generating capacity, total U.S. wind resources equal\r\n about three times total U.S. generating capacity and could produce roughly\r\n twice the nation’s current electric power generation, if costs were not\r\n an issue. 8 However, U.S. wind resources are heavily concentrated in a few\r\n regions (the NEMS electricity regions are shown in Figure 2). Nearly 60\r\n percent of all U.S. wind resources are in the MAPP region, and no economically\r\n useful wind resources are recorded in FL and MAIN. Further, nearly 90 percent\r\n of U.S. wind resources are in the least valuable class, class 4. Thus,\r\n while plentiful overall, the best U.S. wind resources are not necessarily\r\n near either population concentrations or electricity demand centers. Figure\r\n1. U.S. Wind Supply [source] Figure\r\n2. Electricity Market Model Regions [source] The second step in the characterization limits usable wind energy resources\r\n to those sufficiently close to existing 115- to 230-kilovolt transmission\r\n lines. They fall within three distance zones (Table 4). All new generating\r\n capacity, regardless of technology type, has an associated standard transmission\r\n interconnection fee, which varies by region but averages about $225 per\r\n kilowatt. This fee represents the average cost of building a new line interconnecting\r\n the new generating plant with the existing network. In addition, extra\r\n costs averaging $5 per kilowatt per additional mile are added to account\r\n for the greater distance of wind sites from existing transmission networks\r\n (Table 4). Table\r\n      4. Distance Zones, Miles From Wind Resources to Existing Transmission\r\n      Lines Finally, composite cost adjustment factors (Table 5) account for expected\r\n additional costs confronting actual U.S. wind development. All new wind\r\n generating capacity in every region is subject to one of five capital cost\r\n adjustment factors (steps). Capacity in the least-cost steps (steps 1 and\r\n 2) corresponds to the definition of economically accessible energy reserves.\r\n Capacity in steps 1 through 4 encompasses technically accessible resources\r\n (at current prices). All capacity (steps 1 through 5) encompasses the total\r\n wind resource base. 9 Table\r\n      5. U.S. Wind Resources by Region and Cost Adjustment Factor The cost adjustment factors reapportion each region’s total wind resources\r\n shown in Table 3. They allow an initial portion of regional wind resources to be built at no increase in\r\n capital costs, with increasing proportions constructed at capital cost\r\n increases of 20, 50, 100, and 200 percent above the base cost. 10 In the\r\n NWP region, for example, 7.7 gigawatts of wind resources are available\r\n at the base cost (itself affected by overall learning, capacity factor\r\n change, etc.), an additional 13.2 gigawatts are available at 20 percent\r\n above base cost, 8.6 gigawatts at 50 percent above, and 1.5 gigawatts at\r\n double the base cost. All remaining resources of the PNL allocation for\r\n NWP (275.2 gigawatts) are relegated to the most expensive step, step 5,\r\n with a 200-percent cost increase. Learning-by-doing also affects wind technology capital costs. A region’s\r\n resulting wind technology capital cost depends both on the overall nationwide\r\n increase in wind capacity, which lowers capital costs through learning-by-doing\r\n effects, and on the proportion of the region’s wind resources already used,\r\n which increases costs of further penetration. Cost adjustment factors are superimposed on the existing regional totals\r\n shown in Table 3. As a result, the cost-increasing effects of the cost\r\n adjustment factors are not evenly distributed within wind classes, but\r\n first apply to class 6 wind resources until either the resource or the\r\n weighted proportion is exhausted. Extending the NWP example, the subtotal\r\n of all 31 gigawatts of wind resources for the region, shown in steps 1-4\r\n of Table 5, are obtained from the 70.3 gigawatts of class 6+ resources\r\n shown in Table 3. The effect of the cost adjustment factors is to redistribute available\r\n U.S. wind supplies. Figure 3 shows the redistribution at the National level.\r\n Figure 4—at a much reduced scale—shows the redistribution for the Northwest\r\n(NWP). 11 Clearly the effect of reallocation is to markedly reduce the quantities\r\n of wind available at all but the highest costs. Whereas wind supplies under\r\n class 6 designation alone (Table 3) offer nearly 102 gigawatts of least-cost\r\n wind supply, the effect of imposing cost adjustment factors is that only\r\n 28 gigawatts are in the least-cost step and 41 gigawatts in the next, together\r\n equaling only two-thirds of the best wind resources in the PNL-based allocation. Figure\r\n3. Comparing U.S. Wind Supply Estimates [source] Figure\r\n4. Electricity Market Model Regions [source] Basis for Wind Cost Adjustment Factors Evidence From Experience Separate from issues of turbine manufacturing cost, the supposition of\r\n plentiful U.S. wind supplies suggests relatively trouble-free siting of\r\n wind plants in the early years of commercial wind power development. However,\r\n actual U.S. plants proposed or entering service in the 1990s are confronting\r\n significant additional project costs, suggesting that unencumbered U.S.\r\n wind\r\nresources are not necessarily as plentiful as characterized in general\r\n cost estimates. 12 First, natural phenomena can impose additional costs on new wind sites.\r\n Too strong or off-peak winds, storms, freezing, lightning, hail, vegetation,\r\n erosion, bird and animal habitat requirements, or other natural characteristics\r\n raise costs, reduce output, or reduce wind’s market value. New wind plants\r\n in Minnesota, Iowa, Vermont, and Wyoming require reinforcement to cope\r\n with winter storms and heating equipment to remove ice, which degrades\r\n performance and forces occasional shutdowns. Texas wind plants confront\r\n additional costs— both in original installation and in unanticipated replacements\r\n and repairs—from violent wind storms, tornadoes, hail, and lightning. In\r\n the West and Midwest, late winter and spring peak winds miss the summer\r\n electricity peaking demands. In the Northwest, winds tend to be unpredictable.\r\n Terrain slope and variation also raise costs and preclude developing large\r\n portions of otherwise attractive new wind sites in Minnesota and Wyoming.\r\n Steep, heavily vegetated, and difficult terrain eliminate many parts of\r\n New England and Northwest lands because of both higher installation costs\r\n for turbines, lines, roads, etc., and higher maintenance costs. Finally,\r\n coping with insects, birds, and local animals can raise costs or preclude\r\n current use of otherwise attractive wind areas. Insects coat Midwestern\r\n wind turbine blades, degrading performance and necessitating more frequent\r\n blade cleaning, thereby reducing output while increasing costs. Lessons\r\n learned from bird kills in 1980s California projects has accelerated 1990s\r\n avoidance of less expensive lattice towers, addition of special coatings\r\n and markings on turbines, measures to discourage nesting, and in some cases,\r\n avoidance of attractive windy areas used by migrating birds. Second, although EIA accounts for costs of interconnecting new wind plants\r\n to the existing transmission network, the already loaded network is often\r\n unable to accommodate additional wind resources in important wind areas,\r\n thereby raising costs and reducing least-cost wind development opportunities.\r\n Northern States Power, ostensibly awash in wind resources relatively near\r\n transmission lines (Table 3), finds the existing in-state transmission\r\n network loaded and unable to accommodate more than 425 megawatts of wind\r\n capacity from the supposedly ample Buffalo Ridge wind area. 13 New wind\r\n projects in Wyoming and in Oregon faced significant cost hurdles in upgrades\r\n and power transmission charges. Major expansion of western wind power requires\r\n significant upgrades over a very long transmission corridor, and plentiful\r\n West Texas and panhandle winds face additional costs for wheeling power\r\n to major electric power markets in central Texas. Finally, additional market preferences for alternative land use increase\r\n wind project costs and preclude otherwise excellent wind power projects,\r\n such as in Columbia Hills and Rattlesnake Hills (Washington), Burlington\r\n (Vermont), and Cape Cod (Massachusetts). In the West and Northwest, environmental,\r\n scenic, cultural, and religious values effectively restrict or preclude\r\n wind power development. Protection of birds, of Native American cultural\r\n and religious values, and of scenic vistas plays prominently in the elimination\r\n of seemingly excellent wind sites. Lack of detailed information precludes separate representation of each\r\n additional cost in NEMS. However, observation of their effects on new U.S.\r\n wind plants— along with noticeably higher than expected capital costs—leads\r\n EIA to conclude that the additional factors need to be represented in the\r\n wind cost methodology. Literature reviews and contacts with industry professionals\r\n show that every large wind facility installed in the United States in the\r\n 1990s has been subject to at least some of the forces underlying the factors.\r\n Moreover, whereas EPRI-DOE estimates indicate that actual installed costs\r\n for new wind plants should average below $900 per kilowatt by 1999, costs\r\n for recent large installations appear to exceed $1,200 per kilowatt. For\r\n example, the 34-megawatt Big Spring project in Texas, reported at $40 million,\r\n averages $1,176 per kilowatt; a reported $235 million for the 193-megawatt\r\n wind facility at Alta, Iowa, yields an average cost of $1,220 per kilowatt;\r\n two new Northern Alternative Energy projects at Buffalo Ridge in Minnesota\r\n totaling 23.1 megawatts and $32 million average $1,380 per kilowatt; and\r\n the $60 million 41.4-megawatt Foote Creek Project in Wyoming yields a cost\r\n of $1,450 per kilowatt. 14 While these values may include some components\r\n not usually included in overnight capital cost definitions, EIA is not\r\n aware of any recent wind project completed at less than $1,000 per kilowatt. Evidence From Regional Supply Evaluations Three specific regional wind resource reviews—in Minnesota, California,\r\n and by the Northwest Power Planning Council (NWPPC)—indicate that economically\r\n accessible wind resources are less plentiful than indicated by wind speed\r\n and distance from transmission networks alone. The studies range from qualitative\r\n (Minnesota) to quantitative (California) to fairly detailed (NWPPC). In 1996, Minnesota’s “Appel Report” to the Minnesota Legislative Electric\r\n Task Force concluded with respect to wind resource areas that “. . . massive\r\n development of wind and biomass generation systems in Minnesota will require\r\n additions to the transmission system . . . [because] much of the renewable\r\n resource area lacks transmission capability . . . .” 15 The Appel Report—\r\n along with Northern States Power‘s difficulty in siting more than 425 megawatts—is\r\n the basis for sharply restricting least-cost wind supplies in MAPP and\r\n other similarly well-endowed wind resource regions. The 1991 California Energy Commission (CEC) report, Technical Potential\r\n of Alternative Technologies , provides some quantitative information, essentially\r\n providing a technical upper bound of “reasonable” wind potential for that\r\n State. 16 While acknowledging a much larger PNL estimate of 37,000 megawatts\r\n as “gross technical potential,” the CEC assessment of individual sites\r\n concludes that a reasonable technical potential for California is 4,460\r\n megawatts under existing transmission constraints. 17 Loosening the transmission\r\n constraints somewhat increases the total technical potential to 5,385 megawatts. 18 In either case, the CEC estimates stand in sharp contrast to the 20.1 gigawatts\r\n shown in Table 3. The 1996 NWPPC study, Northwest Power in Transition , provides one fairly\r\n detailed study relating wind technology costs and quantities. 19 The NWPPC\r\n study covers only the states of Idaho, Montana, Oregon, and Washington.\r\n Nevertheless, it provides a useful exposition of the general shape of a\r\n likely wind supply function. Figure 4 includes a representation of the\r\n NWPPC values (converted by EIA to capital costs), with NWPPC wind generating\r\n capacities doubled to account for the larger NWP region represented in NEMS. The NWPPC wind supply function identifies 10,700 megawatts of potential\r\n wind power available in the four States at a range of costs below 20 cents\r\n per kilowatthour. Further, the report acknowledges that private developers\r\n have likely identified other cost-effective sites, and that still other\r\n sites probably exist, though they are likely small and best suited for\r\n local loads. The NWPPC supply also illustrates limits to accessibility for wind power.\r\n Of the total 10,700 megawatts, NWPPC estimates that less than 2,000 megawatts\r\n could be developed at 6 cents per kilowatthour or less (1995 dollars) in\r\n the absence of a new transmission intertie to Montana. Moreover, the low\r\n costs would be achieved only if enough wind development occurred to distribute\r\n the high fixed costs of the necessary transmission upgrades. (Because of\r\n typically low capacity factors for wind projects, the cost of amortizing\r\n an increment of new transmission capacity is assigned to far fewer kilowatthours\r\n for a wind project than for typical fossil-fueled projects, again raising\r\n costs for wind-generated power.) Finally, although transmission remains\r\n the most important limiting factor, site viability is also limited by wind\r\n characteristics, topography, weather, environmental and habitat concerns,\r\n and land use conflicts. The Minnesota, CEC, and NWPPC studies provide useful information for U.S.\r\n wind supply estimation. First, they begin to recognize economic constraints\r\n on some of the most important wind resources in the Nation. Second, they\r\n both quantify opportunities and identify general reasons for limitations\r\n in accessing wind resources. As such, they form a valuable base for EIA’s\r\n representation of U.S. wind power. The three assessments have limitations,\r\n however, for wider application. The NWPPC study characterizes only part\r\n of the NEMS NWP region. Moreover, California and the Northwest—featuring\r\n great distances, large mountains, forests, and significant scenic, cultural,\r\n and environmental challenges—may not be representative of important Midwestern\r\n and Southwestern wind regions for which detailed information is not available. Cost Adjustment Factors for U.S. Wind Supply The five cost adjustment factors are broad applications of rates of cost\r\n increase and proportions of wind supplies derived from the Minnesota, CEC,\r\n and NWPPC wind resource information. In general, EIA makes the following\r\n assumptions: Regional estimates developed by EIA will not exceed estimates made by authoritative\r\n studies prepared by individual regions. Therefore, the CEC and NWPPC results\r\n set upper bounds on quantities and costs of economically accessible wind\r\n resources for those regions. EIA relaxes this assumption somewhat in the\r\n Northwest, to accommodate both NWPPC acknowledgment of additional “undiscovered”\r\n resources and adjustments for the larger NEMS region. There are fewer economically accessible winds (reserves) than technically\r\n accessible ones. The U.S. Department of Energy indicates that less than\r\n 1 percent of all technically accessible wind resources are economically\r\n accessible reserves, although technologies have improved since those estimates\r\n were made. 20 EIA takes into account that published wind resource estimates\r\n already exclude some land for economic reasons and assumes a much less\r\n severe reduction. Least-cost wind resources in every region are assumed to be sufficient\r\n to meet future wind capacity requirements in the EIA reference case. Wind resource distributions for small regions (those with fewer wind resources)\r\n are assumed to resemble the CEC distribution; wind distributions in large\r\n regions are assumed to resemble the distribution of the NWPPC study. Examining Table 3 or Table 5 shows two broad regional groups, “small” wind\r\n regions with relatively few wind resources (less than 25,000 megawatts)\r\n and “large” wind regions with extensive wind resources (more than 175,000\r\n megawatts). Given that CNV falls in the “small” category and NWP in the\r\n “large,” EIA first established distributions for CNV and NWP and then broadly\r\n applied those distributions to other regions. As a result, ECAR, MAAC,\r\n NY, NE, and STV follow the CNV example, while MAPP, SPP, and RA follow\r\n the NWP distribution. Because its winds are considered generally accessible,\r\n ERCOT is treated as a special case of a small wind region, with higher\r\n proportions of its winds in lower cost categories. EIA employs five discrete cost steps. Steps 1 and 2 represent two cost\r\n levels for wind reserves, either economically accessible now or in the\r\n very near future. Reserves plus higher cost steps 3 and 4 yield technically\r\n accessible resources, those which could reasonably become reserves by 2020.\r\n Step 5 represents that part of wind resources which EIA does not consider\r\n economically accessible by 2020 under any normal circumstances. The technical\r\n potential of 4,460 megawatts set by CEC, for example, becomes the control\r\n total for steps 1 through 4 in the EIA distribution. EIA derives steps 2, 3, and 4 from two sources. First, to be useful, each\r\n of the cost steps needs to show meaningful cost increases; therefore, EIA\r\n chose each step to clearly differentiate major cost classes. Second, particularly\r\n for the initial steps, EIA very broadly applied cost breaks exhibited in\r\n the NWPPC supply. Finally, EIA chose the 200-percent increase (step 5)\r\n to separate resources determined extraordinarily unlikely to be economically\r\n accessible. All PNL wind resources in California and the Northwest in excess\r\n of the NWPPC and CEC estimates (as adjusted by EIA) are assigned the 200-percent\r\n increase; similar proportions are then applied to the PNL estimates for\r\n other regions. Small Regions: Adapting CEC Information to\r\nECAR, MAAC, NY, NE, and SERC Using the CEC total as an approximate upper bound for California’s technically\r\n accessible resources, EIA assigns 4,522 megawatts as the total of steps\r\n 1-4 and the remaining 15,585 megawatts to step 5. Of the 4, 522 megawatts,\r\n 1,710 megawatts representing already installed wind generating capacity\r\n are assigned to step 1 (reserves). In order to provide opportunities for\r\n least-cost growth and expansion in the other cost categories—but with no\r\n information available for the distribution—EIA allocates the remaining\r\n 2,812 megawatts equally across the 4 technically accessible resource steps.\r\n In effect, the CEC allocation places about 10 percent of wind resources\r\n in the lowest cost step and about 80 percent in step 5. Other “small” wind resource regions are similar but not identical to\r\nCNV.\r\n The CNV allocation is unusual because of the large already-built component\r\n and the independently determined CEC bound. Therefore, for other small\r\n regions, a slightly lower proportion of total wind resources is assigned\r\n to step 1 and higher proportions are assigned to steps 2-4. Further, recognizing\r\n that U.S. Department of Energy and other energy resource characterizations\r\n show increasing resource proportions at higher costs, EIA generally increases\r\n the wind resource proportions for small regions as costs increase. 21 Finally,\r\n for all small regions except CNV, EIA increases the four lower cost step\r\n shares to offset the use of average rather than marginal costs (see below). Large Regions: Adapting the NWPPC Estimates Before applying the NWPPC results to other regions, EIA first adapts them\r\n to the larger NWP geographic region and then adjusts them to reflect the\r\n use of average cost steps rather than a continuous cost function. First,\r\n EIA doubled the NWPPC wind supply estimate for each supply step. The NWP\r\n region in NEMS is roughly twice the geographic size of the NWPPC region\r\n (Figure 2). Although the additional States in NWP (Nevada, Utah, and the\r\n western half of Wyoming) are less well endowed with wind resources than\r\n the NWPPC region, nevertheless, the NWPPC believes its region also contains\r\n additional undiscovered wind resources not included in its published wind\r\n supply. Therefore, to avoid underestimating total wind resources in the\r\n NWP region, EIA doubled the NWPPC wind supply estimates—from over 10,000\r\n megawatts to nearly 21,000 megawatts—as an estimate of all economically\r\n accessible wind in NWP steps 1-4. Second, for both small and large wind resource regions, EIA increases the\r\n lower cost supplies to offset consequences of employing average costs in\r\n the defined steps. A drawback of step functions employing average costs\r\n is to overstate the marginal costs of the first units within each range.\r\n Overstating marginal costs for new technologies could have the effect of\r\n preventing initial purchases and thereby precluding the entire path of\r\n investment, learning, lower costs, and additional investment. To compensate\r\n for such overpricing, EIA reallocates portions of capacity from higher\r\n cost steps to lower cost ones, including some supply from step 5 into step\r\n 4, and thereby increases total wind supply in steps 1-4 to nearly 31,000\r\n megawatts. The effect of both EIA adjustments to NWPPC wind resources is to greatly\r\n increase lower cost wind supplies in NWP relative to the NWPPC estimates.\r\n Whereas NWPPC has less than 2,000 megawatts of least-cost wind supplies\r\n (including some winds in the Blackfoot Wind Resource area), EIA assigns\r\n 7,653 megawatts to step 1 for the NWP region. Whereas the NWPPC estimates\r\n yield less than 11,000 megawatts for all NWPPC wind resources, EIA includes\r\n nearly 21,000 megawatts for NWP reserves and nearly 31,000 megawatts for\r\n all NWP technically accessible resources in steps 1-4. The NWPPC allocation is applied to the wind-rich MAPP, SPP, and RA regions,\r\n although steps 2-4 are assigned increasing quantities at higher costs to\r\n reflect the normal shape of supply functions. Step 1 is also reduced to\r\n reflect the scale of limitations on transmission access demonstrated by\r\n the Northern States Power experience at Buffalo Ridge. In effect, the NWPPC\r\n allocation places less than 3 percent of wind resources in the lowest cost\r\n step and more than 80 percent in step 5. The ERCOT Special Case ERCOT, covering major portions of Texas, is handled separately. The electrically\r\n integrated ERCOT region excludes most of the excellent winds in the western\r\n and panhandle areas of Texas. As a result, ERCOT becomes a small wind resource\r\n region, with less than 10,000 megawatts of wind resources in total. On\r\n the other hand, both ERCOT terrain and market conditions appear excellent\r\n for wind development. Therefore, EIA has assigned ERCOT a unique wind supply\r\n function offering moderate wind volumes at low costs (15 percent in step\r\n 1) and growing shares at intermediate higher costs, but with only 7 percent\r\n in the highest cost step 5. Wind Projections Recent EIA forecasts illustrate application of the wind cost adjustment\r\n factors. Table 6 shows EIA projections for U.S. wind generating capacity\r\n in 2020, by region, from the reference and high renewables cases of the Annual Energy Outlook 1999 ( AEO99 ) and in a case taken from Impacts of\r\n the Kyoto Protocol on U.S. Energy Markets and Economic Activity ( Kyoto\r\n Protocol ) . 22 Table\r\n6. U.S. Regional Wind Generating Capacity in Various Cases, 2020 The cost adjustment factors have no effect on wind generating capacity\r\n builds in the reference case in AEO99 . In most regions, wind capacity though\r\n 2020 remains well below the limits of step 1, the first level of reserves,\r\n especially in regions where wind development is most likely (the Midwest,\r\n most of the West, and Texas). California, also a likely wind development\r\n area, approaches first-step reserves limits by 2020. The AEO99 high renewables case, in which EIA assumes that renewable energy\r\n technologies have lower costs than in the reference case, illustrates the\r\n effect of the cost adjustment factors on wind penetration. 23 In this case\r\n the cost adjustment factors appear to have no effect on most regions, including\r\n the Midwest, Northwest, and ERCOT. However, in California (CNV) and in\r\n RA, wind capacity is projected to be built despite the 20 percent higher\r\n costs imposed by the cost adjustment factors. In California wind capacity\r\n growth stops at the end of defined reserves (step 2), indicating that the\r\n higher costs assumed for step 3 prevent additional wind capacity growth\r\n in the CNV region. The Kyoto Protocol 1990-7% case, in which electricity producers choose\r\n large volumes of biomass and wind renewables in order to meet major U.S.\r\n carbon reduction requirements, can be seen as an “extreme” case. Results\r\n of the case show that the cost adjustment factors can have important effects\r\n in cases of high demand for renewables, both limiting wind power development\r\n and also contributing to higher electricity prices. Results suggest that\r\n very large increases in demand for wind power could exhaust economically\r\n accessible wind resources in some regions. Despite the technology cost\r\n reductions from expansion of wind power nationwide, resource constraints\r\n in some regions (ECAR, MAAC, and STV) result in installed wind costs approaching\r\n $1,800 per kilowatt by 2020. In California, all technically accessible\r\n resources (steps 1-4) are used and some step 5 resources are selected.\r\n In most regions, all least-cost reserves are exhausted. Nevertheless, even\r\n in this very demanding case, regions with large wind resources appear capable\r\n of complying without large cost increases. For such regions, the net result\r\n of learning effects and cost adjustment factors is to lower wind power\r\n costs. Issues in EIA Wind Capital Cost Adjustment Factors Given the limited information available, EIA’s wind capital cost adjustment\r\n factors appear to yield plausible portrayals of increased costs with very\r\n large increases in wind power demand. However, they also have important\r\n limitations, particularly when analyses involve major growth of wind power.\r\n Although EIA is confident that installed costs increase as wind resources\r\n are consumed, there is considerable uncertainty about the rate of cost\r\n increases, the extent of cost increases, and interregional differences in wind technology costs. The most serious issue affecting the wind capital\r\n cost adjustment factors is the lack of basic data about the magnitude of\r\n wind technology cost change as wind resources are used. Lack of basic cost\r\n information challenges every stage of wind capacity forecasting, including\r\n both reference case projections with relatively small capacity increases\r\n and cases of high renewable energy demand. Much more information is needed\r\n on the components of wind technology cost increases, distinguishing natural\r\n resource issues from transmission and distribution and from market issues.\r\n Features and costs of transmission and distribution networks, for example,\r\n may be particularly important and may be usefully distinguishable from\r\n other forces. Wind resource estimates for ERCOT and California are particularly problematic,\r\n especially because these regions are significant participants in wind energy\r\n markets. The challenge with ERCOT is in determining whether its vast wind\r\n supplies are really available in large quantities at constant costs, or\r\n whether and at what points limiting factors—such as transmission and distribution—exist.\r\n The challenge in California is in reconciling CEC resource estimates with\r\n amounts of already developed capacity, while retaining opportunities for\r\n additional wind power growth. EIA is working with analysts in both regions\r\n to determine improved factors. EIA’s current approach superimposes the cost adjustment factors onto the\r\n existing wind class and distance methodology in NEMS. In effect, EIA assumes\r\n that the best and closest winds are also those exempt from or least affected\r\n by natural resource, transmission access, and market forces. The higher\r\n costs are assigned to lower class, more distant, and less likely selected\r\n wind regimes. For example, in California, all 4.5 gigawatts in steps 1-4\r\n (Table 5) are from the State’s class 6 wind resource base (Table 3). In\r\n reality, the factors undoubtedly affect all wind classes at all distances.\r\n The result of this practice is to understate the costs of developing some\r\n portions of U.S. wind resources. EIA is considering measures to ameliorate\r\n these effects. Conclusion The issue of wind power opportunity is likely to become increasingly important\r\n in determining future U.S. electricity supply. Understanding wind prospects\r\n is important in expected “normal” energy futures as well as for possible\r\n exceptional ones. As wind turbine costs decline and their performance improves,\r\n the extent to which wind resources, transmission and distribution networks,\r\n and market forces complement or offset these improvements becomes all the\r\n more pertinent for near and mid-term electricity supply. If these additional\r\n factors have little influence, then improved wind technologies may enjoy\r\n fairly rapid penetration in normal U.S. electricity markets. To the extent\r\n that economically accessible wind resources are soon exhausted, networks\r\n are full, or markets are resistant, however, wind power may find itself\r\n still a marginal source of electric power supply. Understanding actual wind prospects becomes all the more important in assessing\r\n proposed changes in national policy that could dramatically increase the\r\n demand for wind power. Relatively generous wind resource supplies could\r\n make policy choices that favor renewable energy technologies more attractive\r\n and less costly. Restricted wind resource supplies, in contrast, could\r\n portend much higher electricity prices, greater demands and impacts on\r\n consumers, and greater impacts on overall U.S. economic growth. EIA’s use of wind cost adjustment factors formally recognizes the existence\r\n and importance of additional forces specific to wind technology in assessing\r\n U.S. wind energy supplies. Moreover, they appear to account in rough fashion\r\n for the scale of effects of such factors on U.S. wind power cost. Nevertheless,\r\n the importance of wind resource effects on overall U.S. electricity supply\r\n highlights the need for improved information about them. If you would like to received any information\r\n    relating to any of our reports via e-mail, click on the link labeled \" Projections ListServ \" to Join\r\n    by entering your e-mail address. File last modified:\r\n    September 9, 1999 URL: http://www.eia.doe.gov/oiaf/issues/wind_supply.html Need Help\r\n    Now? Call the National\r\n    Energy Information Center (NEIC) (202) 586-8800 9AM - 5PM eastern time If you are\r\n    having technical problems with this site, please contact the EIA Webmaster at wmaster@eia.doe.gov"
    }
  ]
}