{
  "url": "http://www.electricscotland.com/familytree/magazine/febmar2004/burns.htm",
  "file_number": "395",
  "content_hash": "c9ab8129506006965daf266955f7e5ae2197a2cea726fc50899ac021d3277819",
  "total_blocks": 207,
  "retained_blocks": 11,
  "ignored_blocks": 196,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation Clans Tartans Scottish Studies History Family Tree Nature The Flag Scottish Trivia Newsletter Accommodation Postcards Business Food & Drink Music Famous Scots Genealogy Lifestyle Scottish News Books Scots Language World Burns Poetry & Stories Games Events Calendar Highlands Castles Scots Regiments Haggis Forums Humour Desktop Domestic Annals Kids What's New Videos Scotland Picture Tours Gazetteer Help Religion Travel Historic Places Mini Bios Contact Us Search our site here! Web ElectricScotland .com ScotGenealogy.com ElectricScotland.net ScotSearch.org Order FREE Brochures! ScottishHampers Shop Scotland CorporateHampers GrowerFlowers Great Scot Celtic Journeys H-Bar Printing House of Tartan"
    },
    {
      "tag": "p",
      "text": "Things Scottish Genealogy Scottish Grocer CelticMusicStore Celtic Jewellery Scottish Kilts Holiday Scotland Jewelry & Gifts"
    },
    {
      "tag": "div",
      "text": "msnavigation msnavigation Join the \r\n          Genealogy Revolution. Search for your surname in the largest DNA database of its kind! My Surname Begins with Equals Contains Ends with Sounds like"
    },
    {
      "tag": "p",
      "text": "Order Birth and Death Records Online! Family & Local Histories Rootsweb Home Page Scotland Databases People Finder"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    },
    {
      "tag": "p",
      "text": "Robert Burns Lives!"
    },
    {
      "tag": "h1",
      "text": "Edited by Frank R. Shaw, FSA Scot, Atlanta, GA, USA"
    },
    {
      "tag": "p",
      "text": "One of the great pleasures of editing Robert Burns \r\n            Lives! is the opportunity to meet people throughout the global \r\n            Scottish community who love Robert Burns. In this issue, you will \r\n            hear from Peter Westwood, Castle Douglas, Scotland, the \r\n            distinguished Editor of the Burns Chronicle and author of \r\n            several books. Peter has taken time from finishing a new set of \r\n            books on Burns to furnish this article for our readers. It is \r\n            extremely rare that an author working on his or her next book will \r\n            stop to provide an article for Robert Burns Lives! In the \r\n            next issue, David Smith , Hon. Secretary of the Burns Howf \r\n            Club, will present our guest column. The Howf Club is located in the \r\n            building that houses The Globe Inn that was frequented by Burns. \r\n            David has been Hon. Secretary of the Club for 30 years! Gladly do we \r\n            sit at the feet of these men to learn more about Robert Burns. I \r\n            deeply appreciate the contributions they make to this column that \r\n            now receives as many emails as the book reviews or the Chats with \r\n            authors."
    },
    {
      "tag": "h2",
      "text": "Robert Burns  Country Dancer By Peter J. Westwood, Editor, \r\n            Burns Chronicle"
    },
    {
      "tag": "p",
      "text": "Over the years many questions have been asked about \r\n            the social life of Scotlands National Bard, Robert Burns. It is a \r\n            well-known fact that he was socially popular even as a teenager and \r\n            country dancing was early on his list of social activities to the \r\n            extent that he defied the wishes of his father by joining a local \r\n            country dancing class.  In his autobiographical letter to Dr. Moore, \r\n            he stated: In my 17 th year, to \r\n            give my manners a brush, I went to a country dancing school.  My \r\n            father had an unaccountable antipathy against these meetings; and my \r\n            doing was, what to this hour I spent, in absolute defiance of his \r\n            commands. His \r\n            brother Gilbert was later to say, Robert excelled in dancing, \r\n            and was for some time distractedly fond of it . It was \r\n            at a dance during April 1785 that Burns first met Jean Armour who \r\n            was eventually to become his wife. Many \r\n            stories have been repeated over the years about what the Poet may or \r\n            may not have said or been responsible for. One story on the subject \r\n            of dancing which originated from one of the Poets schoolmates, \r\n            William Niven, goes as follows: A \r\n            week before a local fair, Robert suggested to his friend William \r\n            that they should organise a dance on the evening prior to the fair, \r\n            and hold it in one of the public houses in the village and invite \r\n            their girlfriends to come along.  William consented and it was \r\n            agreed that some other young men should be asked to join in on this \r\n            undertaking. The \r\n            dance took place as planned, music being supplied by a hired band \r\n            (probably a local fiddler) and a dozen couples took part. At the \r\n            close of the dance they found that the cost of running the evening \r\n            amounted to eighteen shillings and fourpence.  Unfortunately, hardly \r\n            any of those attending had any money, except William, who possessed \r\n            about two shillings and sixpence.  However the problem was \r\n            eventually solved when William agreed to find the money to pay for \r\n            the dance. He did this by selling stationery to the school which he \r\n            acquired from his fathers warehouse in Maybole. He also sold pens \r\n            and paper to his friends. It is not known whether or not these items \r\n            were acquired officially! S ketch by John \r\n            Mackay Words associated with the many forms of dancing and singing crop up \r\n            from time to time, not only in the many songs and poems of Robert \r\n            Burns, but also in his correspondence, particularly in his letters \r\n            to James Johnston ( Scots Musical Museum ) and to George \r\n            Thomson ( Select Scottish Airs ). More \r\n            than anyone else Burns was responsible for the survival of hundreds \r\n            of Scottish tunes including those used for dancing, many of them \r\n            still in vogue today. Verses from the Poets tale, Tam oShanter \r\n            and his song The Deils awa wi th Exciseman provide excellent \r\n            examples on the theme of dancing. Warlocks and \r\n            witches in a dance: Nae Cotillion, brent new frae France, But hornpipes, jigs, strathspeys, and reels, Put life and mettle in their heels. Theres \r\n            threesome reels, theres foursome reels, Theres hornpipes and strathspeys, man, But the ae best dance eer cam to the land Was the Deils awa wi th Exciseman. The \r\n            Poets love of dancing was largely due to his fondness of the lasses \r\n            and this can be seen in a number of his songs.  In his Bonnie \r\n            Jean he remarks: He gaed wi \r\n            Jeanie to the Tryste (Cattle-Fair) He dancd wi Jeanie on the down, And, lang ere witless Jeanie wist, Her heart was tint, her peace was stown! The \r\n            subject of the song was not his wife Jean, but Jean McMurdo, \r\n            daughter of the Chamberlain of Drumlanrig Castle.  In his Fragment \r\n            on Maria he pays compliment to Maria Riddell, who could \r\n            possibly have been a dancing partner: How gracefully \r\n            Maria leads the dance! Shes life itself; I never saw a foot So nimble and so elegant.  It speaks And the sweet whispering Poetry it makes Shames the musician. During the Poets tour of the Highlands in 1787 he met Niel Gow, the \r\n            famous fiddler, equally well known in Scots song and dance. The \r\n            Poets song Amang the Trees was intended as a compliment to \r\n            Niel: Amang the trees, \r\n            where humming bees At buds and flowers were hinging, O, Auld Caledon drew out her drone, And to her pipe was singing, O. Twas pibroch, sang, strathspeys and reels She dirld them aff fu clearly, O, When there cam a yell o freign squeels, That dang her tapsalteerie, O! My \r\n            final quotation comes appropriately from The Ploughman which is a typical example of Burns reworking of a traditional \r\n            song: I hae been east, \r\n            I hae been west, I hae been at Saint Johnston, (Perth) The boniest sight that ere I saw Was th ploughman laddie dancin. Snaw-white stockins on his legs, And siller buckles glancing; A gude blue bonnet on his head, And O but he was handsome! Let \r\n            George Thomson have the final words: Mr. \r\n            Burns, whose enthusiasm for Caledonian Music and Song, was only \r\n            equaled by his poetical talents, no sooner heard of the Editors \r\n            plan, than he signified his warm approbation of it, and in the most \r\n            liberal and cordial manner undertook to contribute every aid in his \r\n            power for rendering the Collection as complete as possible. He has \r\n            performed what he promised in a manner that transcends the sanguine \r\n            expectations formed by the Editor, having enriched the Work with the \r\n            most exquisite Songs, both Scottish and English, that exist in any \r\n            language; they exhibit all the charms of the Poets genius in the \r\n            utmost variety both of serious and humorous composition; and every \r\n            intelligent reader will contemplate his luxuriant fancy, his ardent \r\n            feeling, and manly sentiment, and the impressive energy and \r\n            simplicity of his style, with equal wonder and delight. All his \r\n            tender and impassioned Songs breathe the genuine, glowing, \r\n            unaffected language of the heart; while the scenes, the manners, the \r\n            innocence, and the pleasures of rural life, are portrayed with a \r\n            pencil so true to nature, as to engage our warmest sympathies and \r\n            admiration.  (1/6/2004) Return to \r\nFebruary/March 2004 Index Page | See Robert \r\nBurns Lives!"
    },
    {
      "tag": "div",
      "text": "msnavigation msnavigation msnavigation Start ApplyTools code msnavigation"
    }
  ]
}