{
  "url": "http://www.emro.who.int/Publications/HealthEdReligion/AIDS/Chapter6.htm",
  "file_number": "397",
  "content_hash": "10b9d21e90367021498f3a113dc1aaa5c9b66e1b070e8170bdac7c74813a3b19",
  "total_blocks": 20,
  "retained_blocks": 1,
  "ignored_blocks": 19,
  "blocks": [
    {
      "tag": "p",
      "text": "Doing Away with Pretexts Justifying the Unlawful Behaviour Islam, and generally all other religions, are not content\r\nwith simple declarations or warnings with respect to unlawful or harmful activity and\r\nbehaviour. They are eager to prevent and eliminate the means leading to such activity and\r\nbehaviour. In this context, Muslim jurists formulated a legal principle known as\r\nSadd-u-Thara'ie, which means, in practical terms, closing the doors or removing the means\r\nwhich lead to what is unlawful. This principle entails the prohibition of certain\r\nsubstances or activities for the simple reason that they would lead to a forbidden action\r\nor behaviour. Some of these substances and activities might not be unlawful in themselves,\r\nbut they become subject to prohibition when they can lead to some other activity that is\r\nexpressly forbidden. The object of this ruling is to \"cleanse the social\r\natmosphere of all provocative agents of temptation and sensuality and causes of deviant\r\nbehaviour, as far as possible \" (26) . In\r\nthemselves, these agents may be prohibited, permissible or even recommended. There could not be a more appropriate approach in the area of\r\nsensual and sexual desires and gratification. Without it, the requirement to refrain from\r\nunlawful sexual activity would be onerous, and could be even self-defeating. Religious\r\nteachings are normally geared to alleviate hardship and facilitate a clean and chaste\r\nlife. The Quran emphasizes \" God does not wish to overburden you; He seeks only to\r\npurify you\" (5:6). Among the practices and types of behaviour to which the\r\nprinciple of Sadd-u-Thara`ie applies and which relate to the prohibition of sexual\r\nactivity outside proper marriage, are: 6.1 Entering people's houses without their permission.This is prohibited as the\r\nQuran says: \" Believers, do not enter homes other than your own until you have\r\npermission to do so and wish peace to their dwellers. That is best for you, if you would\r\nonly reflect. lf you find no one in them, do not enter them until you are given permission\r\nto do so. lf you are told to leave, then go away, for it is right for you so to do.\r\nGod is avware of 'what you do\" (Light: 27-28). 6.2 The directives to lower one's gaze and not look at those parts of the human\r\nbody that could arouse sensual feelings. This is clearly laid down in the Quran :\r\n\"Tell the believing men to turn their eyes away ( from carnal temptation ) and\r\npreserve their chastity. It would make them pure. God knows what they do . Tell the\r\nbelieving women to turn their eyes away (from carnal temptation) and preserve their\r\nchastity, to cover their adornment, except such as is normally visible of it, to draw\r\ntheir clothes properly over their bodies, not to reveal their beauty to anyone except to\r\ntheir husbands, their fathers, their husbands' father, their sons, step-sons, brothers,\r\nnephews, their women folk or slave-girls, their male-attendants lacking in sexual drive\r\nand children who have no appreciation of women's nakedness. Let them also not move their\r\nlegs when walking, so as to draw attention to their hidden charms. Believers, you should\r\nall repent to God, that you may prosper\" (Light: 30-31). Commentators on the Quran have indicated that, the above injunction is a command\r\nfrom God to His believing servants to turn their eyes away from what is not permissible\r\nfor them to look at and only enjoy looking at what they are allowed to see. If one's eyes\r\nfall inadvertently on something that is not permissible to look at one must immediately\r\nturn one's eyes away (27) , The Sunnah of the Prophet confirms this view. Muslim and others have\r\nreported that Jareer ibn Abdullah al-Bujali asked the Prophet ( peace be on him ) about\r\nthe inadvertent glance. The Prophet replied, \" Turn your eyes away \" (28) 6.3 The display of charms and adornments. This is forbidden under this heading.\r\nIt is not lawful for a woman to reveal too much or to deliberately try to attract men's\r\neyes and their admiration. Such behaviour nullifies the effect of the injunction not to\r\nlook at women lustfully and defeats the objectives of spreading virtue and cleansing\r\nsociety of all lewd and sinful practices. 6.4 The prohibition of sweet and sensual talk in women's conversation with men. 6.5 The encouragement of modesty, describing it as a branch of faith. The\r\nProphet said, \" Faith consists of some and sixty or some and seventy points the\r\nfirst of which is the testimony that there is no deity but God and the last of which is\r\npicking up litterfrom people's path. Modesty is one of these points of faith \" (29) . The concept of modesty refers to man's natural feeling of shame when leaning\r\ntowards committing something unlawful. This feeling acts as a deterrent against committing\r\nit. Whenever someone's instinctive desires have the best of him, one's inner sense of\r\nshame is revived, conscience awakened and ability to reflect, refrain or repent,\r\nhightened. All ethical teachings and instruction of Islam are aimed at invigorating\r\nand supporting this intrinsic quality of human nature, and making it stronger with\r\nknowledge, understanding and feeling. The purpose is to make it part of the moral fabric\r\nof man's personality, and to protect and guard man's moral well-being The Prophet says:\r\n\" Every religion has a basic code of morals, and the basic moral code of\r\nIslam is modesty \" (30) . Another Hadith says: \" Modesty can only bring about goodness \" (31) Modesty brings together all the characteristics of goodness in human nature and\r\nis an effective protection against all evil. The Prophet, ( peace be on him) was full of\r\nadmiration for those whose modesty was reflected in their behaviour. He always urged his\r\ncompanions to develop this precious moral quality. Christianity also teaches and advocates moral ideals similar to those espoused\r\nby Islam. We read in the Old Testament: \" You shall not covet your neighbour's wife \"\r\n(Exodus: 20,17; Deuteronomy: 5,21). According to the New Testament, \" Every one who\r\nlooks at a woman lustfully has already committed adultery with her in his heart\" (Matthew, 5: 28). Christian teachings are full of high moral directives that provide for a\r\nclean and chaste human life. One of the most powerful of such exhortations is found in St.\r\nPaul's Letter to the Thessalonians (4:3-8) in which he says to them, \" For this is\r\nthe will of God, your sanctification: that you abstain from immorality; . . .\r\nTherefore whoever disregards this, disregards not man but God, who gives his holy spirit\r\nto you\". St. Peter the Apostle confirms this in his First Letter when he says: 'Beloved,\r\nI beseech you as aliens and exriles to abstain from the passions of the flesh that wage\r\nwar against your soul. Maintain good conduct among the Gentiles . . .\"\r\n(Peter 1: 2,11) He also says in the same Letter, \". . . do not be conformed to the\r\npassions of your former ignorance, but as he who called you is holy, be holy yourselves in\r\nall your conduct; since it is written, 'You shall be holy' for I am holy\" (Peter\r\n1 :1, l 5). Thus we see that the teachings of both Islam and Christianity do not stop at\r\nadvocating virtue, extolling and praising all that lead to it, and condemning immorality\r\nand all sinful activity that lead to it. Both religions go further than that and condemn\r\nthe mere contemplation of sin or allowing oneself to be subject to its temptation. Adherence to religious moral injunctions in avoiding immoral and sinful\r\npractices is not portrayed simply as a way leading to happiness in the Hereafter only. it\r\nhas a role to play in the enhancement of the physical and moral purification of the human\r\npersonality in this world as well. The Quran encourages certain actions because they are\r\nmore \" wholesome\" and \" purer \", praises those wno obey as\r\nbeing \" goodly men and women \". Disobedient individuals are described as\r\n\" wicked men and women \". These distinctions are made on the basis that the\r\nformer have respected and observed God's messages and acted accordingly, while the latter\r\nhave succumbed to their desires, and strayed away. In trying to satisfy their natural\r\ndesires they have not been content with what is permissible and acceptable. They have let\r\nloose their desires and indulged in what is sinful and forbidden. Ii is sufficient as a\r\nmotivation to abide by the religious commandmen that one earns the quality of being \" goodly \"\r\nas a result. Similarly, being called \" wicked \" provides the incentive to\r\nsteer away from sin. Such descriptions in religious books provide the right motivation for\r\npeople with conscience and sincerity to bring their conduct in line with their beliefs."
    }
  ]
}