{
  "url": "http://acharya.iitm.ac.in/mirrors/vv/werlings.html",
  "content_hash": "7bb3c98f5d43cc6fde8b711164c5d61d96215d8ab74f27efdc4e542d1a92404d",
  "total_blocks": 32,
  "retained_blocks": 2,
  "ignored_blocks": 30,
  "blocks": [
    {
      "tag": "div",
      "text": "A DISABLED FRENCHMAN'S INTEREST\r\nIN THE IITM SOFTWARE by Guy\r\nWerlings (gi verli°gs) France nma¢m BgvÏpad\r\nSÄðr| laEkSÄðr| ¡"
    },
    {
      "tag": "p",
      "text": "[Preliminary remarks: I\r\nsincerely apologise for the fact that due to the prevailing circumstances,\r\nand the conditions under which this text has been composed, I have been\r\nunable: - to avoid some repetitions in its various\r\nparts, - to display a fully consistent transliteration,\r\nsome words or expressions appearing in the ITRANS 5.1 encoding scheme,\r\nwhile some others appear with the usual diacritics (but placed after the\r\nletter instead of above it, as impossible in a standard wordprocessor),\r\nand long vowels are shown with a circumflex (often used when gallicising\r\nor diplaying in French texts Sanskrit words in fonts with no macron available;\r\n(Hence what should be in strict ITRANS shrii may appear here as Srî.) \r\nI do hope these stylistic and typographic defects will no make the reading\r\ntoo tedious. I have been kindly requested\r\nto write an article about my experience and interest in the IITM Software.\r\nUpon receiving this suggestion I must confess I met with two contradictory\r\nfeelings. On the one hand, I was pleased and even also somewhat proud;\r\nI felt glad indeed if I could in any way bring a contribution to young\r\nIndian students, as being myself a Westerner with a very great moral and\r\nspiritual debt towards Mother India, at least and at last I could perhaps\r\ndo something useful towards Her and her children. On the other end, I felt\r\nsomewhat reluctant because writing such an article meant inevitably speaking\r\nat length about myself, which I do hate and find utterly repellent. Even\r\nin French we use to say: « le moi est haïssable », i.e.\r\n« The I is detestable ». And I was deeply aware of that long\r\nbefore I read the famous words from the Bhagavatpaada: manobuddhyaha.nkaarachittaani naahaM. But after pondering carefully over the subject\r\nthe first feeling overcame the second, and here follows my small article\r\n(at least I shall try to make it short in spite of an inborn tendency to\r\nbe often quite talkative and prone to unending comments). I shall make\r\nit in three parts: I. My condition as a heavily disabled person II. My interest in the Sanaatana Dharma III. My interest in the IITM software I. My condition as a heavily disabled\r\nperson I was fortunate enough not\r\nto be born disabled nor did it happen during my childhood, which thanks\r\nto the Gods was very healthy and happy, apart from the fact that my father\r\ndied when I was very young, only just more than 10 year old, which had\r\nvery crucial and long lasting consequences for the rest of my life. Now aged 55, my handicap\r\ncame totally unexpectedly a few days before my 49th birthday in the end\r\nof 1994, when all of a sudden as a result of overwork, strain and stress\r\n(I was the Managing Director of a medium-sized company and did not hesitate\r\nduring several years in very difficult business circumstances to work for\r\n14 and to 16 hour a day) I had a brain infarct, which resulted in a stroke\r\nof hemiplegia and I remained paralysed on the left side of my body. In\r\none way, I was rather fortunate and blessed by the Gods that, first I did\r\nnot die on the spot, or during the first three following days, which is\r\noften the case, and second that the accident took place in the right side\r\nof my brain, thus affecting the left side of my body; should had it been\r\nthe reverse, I should have lost speech and my hand-writing capability,\r\na full disaster for me who happen to be a right-handed person. After six\r\nmonths of highly dedicated rehabilitation in a physiotherapy clinic, with\r\na lot of will, endurance and determination I could recover pretty well\r\nbut not enough to be able to take up my old job again. I was dismissed\r\nby my company in 1995 and was declared an invalid by the French Social\r\nSecurity. Since then I am so to say a kind of person in early retirement. Unfortunately in 1995 and\r\n1997 I experienced some more health problems in my brain that more or less\r\nruined the good recovery I had reached before those complications. In any\r\ncase, I can walk just a little inside my home with the help of a walking\r\nstick and am not compelled to spend the whole day sitting on my wheelchair.\r\nThe biggest problem for me comes from my left hand that is now virtually\r\ndead. Prior to my accident I was very excellent indeed at typing on a keyboard,\r\nhaving learnt at school during my commercial studies, and using professionally\r\nand rapidly all my ten fingers from both hands. Now I can type with only\r\nthree fingers of my right hand. II. My interest in the Sanaatana Dharma Born in France, (in a family\r\nnative of Alsace near the German border, why my name does not sound typically\r\nFrench, like Dupont or Durand), just after Worl War II, in late November\r\n1945, I had always been a very religious boy, but when I reached 14, I\r\ncould no longer remain satisfied with the creeds, beliefs and practices\r\nof the Roman Catholic Church, in which I had been being born and educated.\r\nThese did not appear to me « catholic » enough, as this word\r\nshould originally mean « universal ». One day, about November\r\n1960 (i.e. aged more or less exactly 15), while looking at random at books\r\nin a bookshop that I used to visit quite often (in Paris where I was born\r\nand living at that time), I started to turn over, just by a stroke of luck,\r\nthe pages of the French translation of « Jñâna Yoga\r\n» of Svâmî Vivekânanda, and was seized with wonder\r\nseeing that the book included two chapters on a universal religion. I felt\r\nthis was exactly what I was longing for, and I bought the book immediately\r\nand read it eagerly from cover to cover: I was overwhelmed with joy and\r\nwanted to know more. After reading « Jñâna Yoga \r\n» several times, I wanted to know also about S'rî Râmakrishna.\r\nI started to look for further literature on the Paramahamsa, and in a rather\r\nsmall booklet learnt at last that there existed one Râmakrishna Vedânta\r\nCentre in France. I got the address from the Indian Embassy in Paris. All\r\nthese investigations had of course taken some time, and it was only in\r\nearly May 1961 (it was thus exactly 40 years on the 4th of May 2001), aged\r\n15 year and a half, that I first visited the French Râmakrishna Vedânta\r\nCentre in Gretz.There, I came fortunately very rapidly into a tight and\r\nfriendly relationship with a brahmâcâri, disciple of the late\r\nSvâmî Siddhes'varânanda, who had founded the Centre in\r\n1937 in Paris, and had then established it in Gretz in 1947. Unfortunately\r\nhe had passed away 4 years earlier, in beginning April 1957 and I could\r\nnot meet him personally. Svâmî Siddhes'varânanda was\r\nhimself a disciple of Svâmî Brahmânanda, a direct disciple\r\nof S'rî Râmakrishna, appearing often in the so-called «\r\nGospel » (I do not like the use of this Christian name and prefer\r\nto stick to the original tittle « Kathâmrita »: Svâmî\r\nBrahmânanda was Râkhâl, in the inner circle of young\r\ndisciples, and later he became the President of the Math and Mission).\r\nI became fortunately very rapidly an enthusiastic student of the above-mentioned\r\nbrahmâcâri. My main subject of study with my Vedânta\r\nteacher (apart from the teachings of Paramahamsa S'rî Râmakrishna)\r\nwas avasthâtraya vicâra as taught to Svâmî Siddhes'varânanda\r\nby his own teacher in philosophy S'rî V. Subrahmania Iyer, a prominent\r\nphilosopher of the XXth century (reader in Philosophy of the Mahârâja\r\nof Mysore) and himself (S'rî Iyer) a disciple of His Holiness S'rî\r\nSaccidânanda S'ivâbhinava Narasimha Bharatî Mahasvâmî,\r\nJagadguru of S'ringeri from 1878 to 1912. Svâmî Siddhes'varânanda\r\nalways insisted on the fact that exactly as one needs two legs for walking\r\nor two hands for working (I experience myself this point every day more\r\npainfully than anybody else), we need, in this age, for our spiritual life\r\nto harmonise the teachings of S'rî Râmakrishna and the pure\r\nVedânta of S'ankara as taught by the above-mentioned Jagadguru of\r\nS'ringeri to S'rî Subrahmania Iyer, and mainly emphasizing avasthâtraya\r\nvicâra, the major and unique contribution of the Indian philosophy\r\nto the universal philosophy, most of the other aspects of the Indian philosophy\r\nor theology having already more or less their equivalent or counterpart\r\nin the Western thought. That is what I dedicated my life to. Apart from a repeated study\r\nof the Bhagavad Gîtâ and of course all major Upanishads I had\r\na special interest for the mANDUkyakArikA of GauDaPAda, which deals only\r\nwith the avastha-s. Also, I read again and again\r\nand studied very carefully, and even translated in parts « VEDÂNTA,\r\nOR THE SCIENCE OF REALITY » of S'rî K.A. Krishnasvami Iyer. Having also studied all\r\nfour volumes of THE CULTURAL HERITAGE OF INDIA, published by the RAMAKRISHNA\r\nINSTITUTE OF CULTURE, I translated into French the two articles from volume\r\nIII: THE ESSENTIALS OF VEDANTA by S'rî V.\r\nSubrahmania Iyer and PHILOSOPHY OF ADVAITA by S'rî K.A. Krishnasvami\r\nIyer I also translated into French MAN'S INTEREST IN PHILOSOPHY by S'rî\r\nV. Subrahmania Iyer first published in 1936 by Messrs Allen and Unwin in\r\n« CONTEMPORARY INDIAN PHILOSOPHY » edited by S. Radhakrishnan\r\nand J.H. Muirhead in the Muirhead Library of Philosophy and also later\r\nincluded in « THE PHILOSOPHY OF TRUTH OR TATTVAGNANA » a collection\r\nof speeches and writings by Sri V. Subrahmania Iyer edited by Dr T.M.P.\r\nMAHADEVAN, Department of Philosophy, University of Madras, 1955, upon request\r\nof S'rî Iyer's family. But none of these translations\r\nhave been published so far. I shall hand them to my sons who shall make\r\na good use of it, I feel sure. (more in § III.) As my father had passed\r\naway when I was only a little more than 10 year old, and that we were not\r\nrich people, I could not afford long academic studies (quite attracted\r\nby languages, I should have felt inclined to study Sanskrit at the University,\r\nalong with Bengali, to be able to read the S'rî Râmakrishna\r\nKathâmrita in the original language, and possibly translate it into\r\nFrench), but instead I had to start earning my living just after finishing\r\nmy military training. Thus, slightly over 20 equipped\r\nonly with basic occupational commercial studies acquired before my military\r\ntraining (from 15 to 19), I started a nearly 30-year long career with the\r\nSwedish Paper Industry, first as a local salesman, then as the Managing\r\nDirector of 3 different Sales Companies. Instead of Sanskrit and Bengali,\r\nI learnt Swedish, which I talk and write just about as fluently as French. Although not properly a\r\ntranslator, I had to do a lot of translations from Swedish and English\r\ninto French, and hence also devoted much of my vacant time to « translation\r\nstudies » to become as proficient as ever possible on the subject,\r\nwhich also helped me to a large extent for my subsequent Vedantic translations. From 1970 to 1981, then\r\nstill living in Paris, I delivered 104 lectures, mostly on Indian philosophy\r\nand other aspects of the Sanâtana Dharma. I am extremely afflicted\r\nnot to have been blessed by the DIVINE MOTHER to reach the sacred number\r\nof 108, but with HER help and blessings I shall try again to make it in\r\nmy next life! My professional life was\r\nvery successful but in 1994, there were a many problems in my Mother Company\r\nin Sweden, because of mergers. I was chosen as the Manager for the new\r\nFrench Sales Company resulting from the merger, but this meant a lot of\r\noverwork and additional strain, which resulted in the stroke of hemiplegia\r\nmentioned in the § I, which left me paralysed on my left side (in\r\nthe beginning of November 1994, 3 weeks exactly before my 49th birthday).\r\nIn my medical ignorance, I felt pretty sure that problems with brain arteries\r\nwere always more or less related to cholesterol and arteriosclerosis, and\r\nas I had never had any of these, and although a businessman had tried to\r\nhave a very hygienic way of life, I felt myself somewhat well protected\r\nor immune against such problems and I did not hesitate to work more than\r\nI should have done. I really had even become what is termed in the U.S.,\r\nI have heard, a « workaholic ». It was only in the hospital\r\nthat the doctors explained to me that overwork, overtax and stress may\r\nas well provoke a « brain infarct » as the most commonly known\r\n« heart infarct », all the more as in my case, the «\r\ninfarct » was not a thrombosis (but I do not want to indulge into\r\ntoo many medical details, out of the subject, and for which I do not know\r\nall the necessary technical vocabulary in English). Besides, I may have\r\nbeen suffering, without knowing it, of a kind of hereditary weakness of\r\nthe brain arteries' walls. As already said, prior to\r\nmy stroke, I had quite an excellent typing, very rapid too and highly qualified.\r\nBut it's now all gone, my left hand being almost dead, and I type with\r\nonly one or two fingers of my right hand. This is why my e-mail postings\r\ntake (or at least used to take?) such a long time and are (were?) often\r\nfull of typing errors. Normally, I try to read\r\nand read again chasing for these typos prior to sending e-mails. But first,\r\nthere are always some typos that escape and second, it always gives me\r\nthe occasion for a further digression, as new ideas are coming while reading\r\nand my messages, letters or texts use to become longer and longer with\r\nevery attempt to get rid of typing errors. But in March 2001 I bought\r\na new computer and at the same time I invested in a speech recognition\r\nsoftware, which works in French as well as in English and with the help\r\nof which I can now dictate my correspondence in both languages, as well\r\nas do my captivating translation work. The system runs very well and it\r\nis indeed one of the very good achievements of the information technology.\r\nAnd as a consequence, I do hope that a part of the above problems with\r\ntypos will be eradicated in the future. Moreover, instead of typing\r\nI can now dictate my translations or the articles I intend to write, which\r\nis quite comfortable. Now if the voice recognition software normally does\r\nnot make typos, it only recognises the sounds that reach the microphone\r\nand not the words nor their meaning; the machine does not understand you\r\nbut only transfers on the screen the sounds it has received, including\r\nnoises from the environment, which sometimes results in other types of\r\nerrors very often quite unexpected and sometimes jocular. But this is quite\r\nanother story. Anyway this digression leads me smoothly to the third part\r\nof my article. III. My interest in the IITM software : As soon as it became obvious\r\nto me that my professional life was over and that in this respect I had\r\nbecome socially an invalid or an early retired person, I decided to devote\r\nall my time and efforts to the topics that had been in the centre of all\r\nmy life (even if at times in the background because of my job) Sanskrit\r\nand Vedânta. If I had started to learn\r\nsome Sanskrit already when I was 15, as a fact I never went farther than\r\nsome rudiments or basics and always remained a kind of eternal beginner.\r\nTo be frank I had strictly no interest in learning such enlightening phrases\r\nlike \"Râma sees the two elephants\". What I wanted was to be able\r\nto translate very accurately the few verses from the Bhagavad Gîtâ\r\nor the texts from S'rî S'ankarâcarya that I was quoting and\r\ncommenting in my own lectures. Thus I decided to start\r\nafresh my studies of the Sanskrit language in a very serious way this time;\r\nand with the development of the information technology and the Internet,\r\nthere now exists very fascinating and facilitative possibilities that did\r\nnot exist when I was only 15. Moreover I have not the\r\npretence, ambition nor conceitedness to write my Complete Works. But when\r\npreparing the already mentioned 104 lectures that I delivered in Paris,\r\nI have accumulated such a huge documentation that I have a lot of material\r\navailable for writing articles on several aspects of the Sanâtana\r\nDharma and quite especially on Vedânta and my favourite subject viz\r\navasthâtraya vicâra. Married in 1974, my wife\r\nand I have two sons now aged 25 and 23 who are studying and preparing themselves\r\nfor the highest posts in the University. The eldest one is studying History\r\nand the youngest one Philosophy. When they have finished their studies,\r\nif my health is still permitting, and with the blessings of the DIVINE\r\nMOTHER, we intend to write all three of us a book on \"some aspects of Vedânta\r\nin the XXth-century\". In the meantime as they have of course quite a lot\r\nof other subjects to prioritise, I have started writing some articles based\r\non the archives I have available here. And this is where the IITM software\r\nis proving extremely useful to me. Although I try not to overdo it with\r\nthem, those articles (or a few other translations I am continuing to do\r\non the subject and some of which might have their place in the main dissertation)\r\noften include quotations or footnotes with Sanskrit words or sloka-s.\r\nIt is obvious that most Westerners cannot the Sanskrit language, but I\r\nprefer in any case to supply the Sanskrit text for some translated sloka-s\r\nso that the readers can at least recognise the words. This being the case,\r\nit is of utmost importance to cite the aforesaid quotations in diacriticised\r\nRoman transliteration. But I have decided as a personal discipline as a\r\nwell as an introduction to the Sanskrit language for my sons to show the\r\ntext also in devanâgarî. And in this respect the IITM software\r\nis really unparalleled. Of course in the beginning things were not very\r\neasy for me, all the more as -as far as computers are concerned- I am only\r\nan average user and not at all a specialist of the information technology.\r\nBut Dr R. Kalyanakrishnan spared no effort to help me and to facilitate\r\nthings for me (even at the expense of explaining very basic details that\r\nI should have known, or reminding me some other ones I had known (when\r\nstarting the computerisation of my firm) but had later forgotten), and\r\nI really feel very indebted and grateful to him for all what he has done\r\nin this respect. I came into contact with\r\nDr Kalyanakrishnan upon suggestion of S'rî N. Krishnaswamy of Vidya\r\nVrikshah whom I had got in touch with as to a translation of the maaNDuukyakarikaa,\r\nwhich is as the reader will have understood of the highest importance for\r\nme. Thus the parts of the IITM\r\nsoftware that are of special and main interest to me are the ones that\r\nrefer to Sanskrit and I.P.A. transliteration. The transliteration into\r\nother Indian languages is less primary to me although useful at times for\r\nother purposes. As a fact I have some Hindu friends in what was until recently\r\nWest Bengal, in Kerala and also in Karnataka, and when writing to them\r\nby now I always try to write their first names in their own languages,\r\nBangla, Kannada or Malayâlam. This is only a small sign of friendship:\r\nthey know I cannot their language and do not intend to learn it either.\r\nBut I shall never speak Sanskrit with anybody either at least in this life!\r\nMy purpose is not to be able to buy milk in Sanskrit (as the CD-ROMs released\r\nlast year by Samskrita Bhârati would like me to be able to do). My\r\nvery limited and egoistic aim is nothing but to try to read, understand\r\ncorrectly and if possible translate accurately into French just a few jewels\r\nof the Scriptures, of S'rî S'a.nkara's bhâshya-s and of the\r\nKârikâ-s. Should I succeed in doing that, it should actually\r\nbe quite enough for this life.· mailto:guy.werlings@wanadoo.fr RETURN TO PREVIOUS\r\nPAGE"
    }
  ]
}