{
  "url": "http://www.essent-finance.nl/knowledge/bg4.jsp",
  "file_number": "407",
  "content_hash": "4264f89b4849cbddc904d5eb96f0029b08cca1990a92728b78f1f5d0ada09971",
  "total_blocks": 102,
  "retained_blocks": 1,
  "ignored_blocks": 101,
  "blocks": [
    {
      "tag": "div",
      "text": "DWLayoutTable Home > Knowledge > Background information > Manoeuvring between ... Background\r\n            information Manoeuvring between supply and demand Competition is what the free market \r\n                  is all about, and the supply and trading of energy have gone \r\n                  through turbulent times. Meanwhile, more than 10% of electricity \r\n                  use is traded on the APX every year, and the trading floor has \r\n                  made its energy company debut. Supply and trading are two entirely different disciplines within \r\n                  the energy market, yet they are often mentioned in the same \r\n                  breath. This is hardly surprising, since they have many similarities. \r\n                  Whoever supplies energy to the end user wants to buy and resell \r\n                  his product as cheaply as possible. Aflourishing trade in electricity \r\n                  and gas has come about as a result of increased energy liberalisation, \r\n                  which has caused prices to be determined according to the law \r\n                  of supply and demand. The shrewdest market player can offer \r\n                  the lowest prices to the client, and is thus a step ahead of \r\n                  the competition. As the grid-administration function was split further within \r\n                  the traditional energy companies, the difference between the \r\n                  trading and supply divisions became more marked. The supplying \r\n                  company, originally little more than the client administration \r\n                  responsible for sending and collecting periodic energy bills, \r\n                  is now the commercial heart of the organisation. It has become \r\n                  the most important point of reference for the client, the sales \r\n                  and marketing office and the information counter. Client friendliness, \r\n                  efficiency and service orientation are now central to this branch. \r\n                  The three largest electricity-generating companies, Reliant, \r\n                  Electrabel and E.ON Benelux all have their own supply and trading \r\n                  company. Customise Particularly with the opening of \r\n                  the market for medium-sized users from January 1st 2002, this \r\n                  new supply company identity has come clearly to the fore. Suppliers \r\n                  attempt to entice each other's clients with favourable, customised \r\n                  contracts. In addition to energy, they offer a series of other \r\n                  services, like advice on energy saving and the installation \r\n                  of heating and cooling systems. Renewable energy has also become \r\n                  an important product in its own right. The market for green \r\n                  power has been entirely free since July 1st 2001, and consumers \r\n                  now have the freedom to switch to another supplier. Any company is free to offer energy in a liberalised energy \r\n                  market. The opening-up of the market for medium-sized customers \r\n                  therefore has attracted a series of newcomers to the market. \r\n                  These are existing foreign companies, such as the German EnBW \r\n                  and the Swedish Vattenfall, who supply commercial clients. Several \r\n                  new companies are also active in the market, such as Spark Energy \r\n                  (subsequently taken over by the generator Electrabel Nederland), \r\n                  Energiebedrijf.com and Anode. Practising In anticipation of the opening-up \r\n                  of the consumer market (expected on July 1st 2004), suppliers \r\n                  may already 'practise' on the green-power market. However, a \r\n                  permit is required from the Ministry of Economic Affairs in \r\n                  order to supply consumers; the permit is issued by the regulator \r\n                  DTe. Among the newcomers to the green power market are Echte \r\n                  Energie, Greenchoice and Shell Stroom. The supply of regular \r\n                  'grey' electricity and gas to small users is still reserved \r\n                  for the traditional energy companies. Their tariffs for these \r\n                  clients will be regulated by the DTe until the opening-up of \r\n                  the market in 2004. Anew discipline in this arena is the trade in electricity and \r\n                  gas. Although raw materials for energy generation were indeed \r\n                  traded in the traditional, centrally-led energy market, trade \r\n                  in the end product was unnecessary because tariffs were set \r\n                  by the government and levelled out in a pooling system. There is increasing competition in generation within the free \r\n                  market, mutually between the Dutch generators but also with \r\n                  imported gas or electricity. Suppliers also look for the most \r\n                  favourable contract to meet their requirements. These are partly \r\n                  long-term contracts, but a short-term market has come into existence \r\n                  alongside these. The majority of this trade still takes place \r\n                  via bilateral 'Over the Counter' (OTC) contracts, which have \r\n                  a great degree of flexibility. In addition, the Amsterdam Power \r\n                  Exchange (APX), established in 1999, is an exchange where electricity \r\n                  for the following day is traded. Market parties can also make \r\n                  use of a broker, an intermediary who mediates on behalf of a \r\n                  client or other dealer. The energy market is increasingly looking for opportunities \r\n                  to apply the kind of derivatives generally accepted in the financial \r\n                  world. The APX is also investigating the possibilities with \r\n                  regard to a marketplace for financial derivates, such as futures \r\n                  and forwards. In this way, parties can cover their market position \r\n                  by 'insuring' themselves against ups and downs. For the time \r\n                  being, the trade in such energy derivates takes place along \r\n                  the bilateral route. New gas-dealing opportunities arise when \r\n                  market parties can meet. An example is the Eurohub set up by \r\n                  Gasunie on the German border. At this 'transfer centre' parties \r\n                  from Germany, Norway and the Netherlands can deal in gas. The largest Dutch energy companies now have their own trading \r\n                  floors. This is not only the case for generation companies, \r\n                  but also for major suppliers, such as Essent, Nuon and ENECO \r\n                  Energie. Since the latter two hardly have any generation resources \r\n                  to supply their own client base with energy, to a large extent \r\n                  they are dependent on purchasing. NUON has announced its intention \r\n                  to take over the Dutch power stations belonging to Reliant Energy, \r\n                  an American company. In addition, over the years various foreign \r\n                  companies have become active in Dutch energy trading, including \r\n                  some from the United States, Great Britain and Germany. For \r\n                  the time being, most confine themselves to the industrial market, \r\n                  while a few have turned their attention to the market for medium-sized \r\n                  clients. Knowledge Related content Click \r\n      here for the FAQ's Click \r\n      here for our feature articles Click \r\n      here for our strategy Downloads NEW ITEMS 2006 Interim Results 2006 Interim Results presentation 2006 Interim Results Additional Graphics 2005 Annual Report Full 2005 Annual Results German version of the 2005 Annual Report Investor Presentation March 2006 Press release 2005 Annual Results German version of the press release 2005 Annual Results 2005 Annual Results Additional Graphics 2005 Annual Results presentation NEW ITEMS 2005 Interim Results German version of the 2005 Interim Results 2005 Interim Results Additional Graphics 2004 Annual Report German version of the 2004 Annual Report <tr>\r\n    <td class=\"contentDownloads\"><img src=\"../images/gif/iconPdf.gif\" width=\"22\" height=\"22\" align=\"absmiddle\"><a href=\"../downloads/2004_press_release_annual_results_uk.pdf\" class=\"NavigatieDownLoads\" target=\"_blank\">Press Release 2004 Annual Results</a></td>\r\n  </tr>\r\n  <tr>\r\n    <td class=\"contentDownloads\"><img src=\"../images/gif/iconPdf.gif\" width=\"22\" height=\"22\" align=\"absmiddle\"><a href=\"../downloads/2004_annual_results_additional_graphics.pdf\" class=\"NavigatieDownLoads\" target=\"_blank\">2004 Annual Results Additional Graphics</a></td>\r\n  </tr>\r\n  <tr>\r\n    <td class=\"contentDownloads\"><img src=\"../images/gif/iconPdf.gif\" width=\"22\" height=\"22\" align=\"absmiddle\"><a href=\"../downloads/2004_annual_results_presentation.pdf\" class=\"NavigatieDownLoads\" target=\"_blank\">2004 Annual Results Presentation</a></td>\r\n  </tr> Print this page Back to top Essent's | Press | Events | Publications | Knowledge | Contacts © 2003 copyright Essent. All rights reserved. Notices for website use ONESTAT SCRIPTCODE START ONESTAT SCRIPTCODE END"
    }
  ]
}