{
  "url": "http://www.euroeducation.net/prof/ukrco.htm",
  "content_hash": "d3286ee4cda24ff3e4781fb6b6fbad5c8525b1fd064c73aac86e2bc458762362",
  "total_blocks": 295,
  "retained_blocks": 4,
  "ignored_blocks": 291,
  "blocks": [
    {
      "tag": "div",
      "text": "EuroEducation. net The European Education Directory A Guide to Graduate Programmes Programs in \nArts,\nBusiness,\nEconomics,\nEngineering,\nHumanities,\nManagement,\nMBA,\nScience Match All Any term in Index: Study Europe Study USA Study Canada Ukraine Structure of Educational System Admissions to Higher Education and Recognition \nof Foreign Credentials Student Life International Cooperation and Exchanges"
    },
    {
      "tag": "p",
      "text": "INSTITUTION TYPES & CREDENTIALS Types of higher education\ninstitutions: Uniwersytet\n(University) Akademia (Academy) Instytut (Istitute) Konservatoria\n(Conservatoire) Koledge (College) if !supportEmptyParas endif School leaving and higher education\ncredentials: Atestat/Matriculation\nSchool Certificate Dyplom Molodshogo\nSpetsialista Dyplom Bakalavra Dyplom Spetsialista Master Dyplom Magistra Internatura Kandydat Nauk Doktor Nauk if !supportEmptyParas endif if !supportEmptyParas endif STRUCTURE OF EDUCATION SYSTEM Pre-higher\neducation: Duration\nof compulsory education: Age of\nentry: 6 Age of\nexit: 15 Structure of school system: Elementary Type of\nschool providing this education: Elementary School Length\nof program in years: 4 Age level from: 6 to: 10 Lower Secondary Type of\nschool providing this education: Lower Secondary (Osnowna Serednia Shkola) Length\nof program in years: 5 Age\nlevel from: 10 to: 15 Certificate/diploma awarded: Swidoctwo Pro Nepownu\nSeredniu Oswitu/Lower Secondary School Leaving Certificate Upper Secondary Type of\nschool providing this education: Upper Secondary Special School (Licei) Length\nof program in years: 3 Age\nlevel from: 15 to: 18 Certificate/diploma awarded: Atestat/Matriculation\nSchool Certificate Upper Secondary Type of\nschool providing this education: Upper Secondary School (Starsha Serednia Shkola) Length\nof program in years: 2 Age\nlevel from: 15 to: 17 Certificate/diploma awarded: Atestat/Matriculation\nSchool Certificate Special Education Type of\nschool providing this education: Upper Secondary Special School (Gimnazia) Length\nof program in years: 3 Age\nlevel from: 15 to: 18 Certificate/diploma awarded: Atestat/Matriculation\nSchool Certificate Vocational Type of\nschool providing this education: Vocational Secondary School (Technikum) Length\nof program in years: 5 Age\nlevel from: 15 to: 20 Certificate/diploma awarded: Atestat, Diplom\nTechnika/Matriculation School Certificate, Professional Secondary School\nLeaving Diploma, Junior Specialist Vocational Type of\nschool providing this education: Vocational School (Profesijno-Tecnichne\nUchylyshche) Length\nof program in years: 4 Age\nlevel from: 15 to: 20 Certificate/diploma\nawarded: Atestat, Swidoctwo Pro Zakinchennia Uchylyshcha/Matriculation School\nCertificate, Vocational School Leaving Certificate School\neducation: All children 7 to 15 years old\nattend the nine year compulsory school. If parents so wish, the child may start\nfrom the age of six. Options after the comprehensive school are upper secondary\nschool or vocational education. Upper secondary school: 2-year general school\nleading to the Matriculation Examination, giving successful students access to\nuniversity and other higher education schools. The present vocational education\nsystem covers both general secondary and vocational programmes, with separate\ntracks for comprehensive school leavers and matriculated students. The system\nis being reformed. Higher\neducation: Higher education in Ukraine is\nadministered by the Ministry of Education which coordinates the activities of higher schools and supervises the\nhigher schools which are under other ministries. According to the \"Law on\nEducation\", higher education includes the following levels and categories\nof establishment: level I - vocational\nschools and other HEIs of a corresponding level; level II - colleges and other HEIs\nof a corresponding level which teach Bachelor and junior specialist courses;\nlevel III - institutes, conservatories,academies and universities that teach\nBachelor's and Specialist, as well as junior specialist courses and ; level IV\n- institutes, conservatories, academies and universities which teach Bachelor's,\nMaster's and Specialist courses. The degree system is under reform: The old\nsystem had only one stage of undergraduate studies, the degree of\n\"Specialist\", awarded after 5 years of study. The new system\ncomprises two stages: undergraduate and graduate, with several degree levels. A\nUnion of Rectors was created in 1993. Main\nlaws/decrees governing higher education: Decree: Decree on autonomy Year: 1990 Concerns: higher education institutions Decree: Law on Education Year: 1996 Concerns: state\nand private system of education Academic\nyear: Classes\nfrom: Sep to: Jun Long\nvacation from: 1 Jul to: 31 Aug Languages\nof instruction: English, Russian, Ukrainian Stages\nof studies: Post-secondary studies (technical/vocational\ntype): Non-university\nlevel : Since 1992 the whole\nsystem of Ukrainian postsecondary education is considered \"higher\neducation\". According to the \"Law on Education\", the following\nlevels and categories of establishments offer higher vocational education:\nlevel I - technical and vocational schools; level II - technicums and colleges.\nThey award the qualification of Junior Specialist. Level III institutes are\nuniversity-level institutions. Graduates from post-secondary vocational schools\nmust sit for final examinations and defend a graduation thesis/work. The\nDiploma confers a right to employement at a pre-set level or the right to\ncontinue training in institutions of a higher level. if !supportEmptyParas endif University level studies: University\nlevel first stage : Bakalavr, Specialist: The academic and professional diploma of Bakalavr\n(BA, BEd., BMed.) is generally awarded after four years of successful study\n(six years for Medicine). The Bakalavr programme comprises basic higher\neducation and professional training in a given professional field. It is an\nintermediate degree. The degree (Diplom) of Specialist is awarded after five or\nsix years of study, depending on the type of institution. University\nlevel second stage : Magister: The Magister (Master's Degree) is awarded on the\nbasis of a Bachelor's Degree or Specialist's qualification generally one to two\nyears after the first degree. Students must pass final examinations and defend\na thesis. University\nlevel third stage : Doctoral Degree-1: Ukraine keeps a two-degree system at doctoral\nlevel: Kandydat nauk (Candidate of Sciences, comparable to the Ph.D.), and\nDoctor nauk. The first qualification is obtained after three or four years of\nstudy by submitting and publicly defending a thesis and passing the required\nexaminations. The candidate's thesis can be prepared while following various\nforms of post-graduate studies. University\nlevel fourth stage : Doctoral Degree-2: The \"Doctor nauk\" is the highest\nscientific degree in Ukraine, comparable to \"Habilitation\" in some\nWestern countries. It is awarded to candidates already holding a \"Kandidat\nnauk\", on the successful presentation and defence of the \"Doctor\nnauk\" (habilitation) dissertation. The Habilitation dissertation should\nrepresent a major contribution to the development of a given field or branch of\nlearning, and has to be published entirely or at least its main parts. if !supportEmptyParas endif Teacher education: Training\nof pre-primary and primary/basic school teachers Pre-primary and and primary school teachers are\ntrained in teacher-training institutions of Levels I, II, and III of\naccreditation (vocational schools, technikums, and colleges). Practical\ntraining at kindergarten and primary schools are part of the teacher training\nprogramme. Training\nof secondary school teachers Training is provided by higher education\ninstitutions of Levels III and IV of\naccreditation (institutes and universities), in different faculties (Education,\nMathematics and Natural Sciences, Physical Education, etc.). The programme for\nteachers includes standard topics of education and psychology. Teachers of\npractical/vocational courses are trained in the technical education institutes. Training\nof higher education teachers There are no special\nforms of training for higher education teachers. Teachers of higher education\nare recruited among university graduates holding a Magister or Kandidat Nauk\nDegree who have followed special education courses through various types of\nassistance. if !supportEmptyParas endif Non-traditional studies: Distance\nhigher education A network of correspondence and evening courses is\nintended for persons who are already employed. Candidates for such courses must\nnot only pass an entrance examination, but also prove they effectively worked\nfor a certain time. Lifelong\nhigher education Some institutions of higher education (mostly\nprivate) have departments of continuing education providing teaching based on\nthe principles of general higher education. Obtaining Diplomas depends on\ncredits obtained in required topics, as well as on the presentation of a\nmemoire. Higher\neducation training in industry A certain number of higher education institutions\norganize evening classes in industry which are of the same level as full-time\nstudies. Other\nforms of non-formal higher education The television of\nUkraine broadcasts educational programmes of different levels for students and\nteachers in schools ranging from primary to upper secondary. These programmes\nare desiged to introduce teachers to new pedagogical methods. if !supportEmptyParas endif if !supportEmptyParas endif NATIONAL BODIES Administration\n& co-ordination: Responsible\nauthorities: Ministry of\nEducation Minister: Vasyl Kremen Prosp.\nPeremohi 10 252135 Kyiv Kyiv Region Ukraine Tel: +38(44) 226-24-42 Fax: +38(44) 274-10-49 EMail: vvv@minosvit.niit.kiev.ua WWW: http://www.education.gov.ua if !supportEmptyParas endif if !supportEmptyParas endif Council of Rectors\nof Ukrainian Institutions of Higher Education President: Viktor Skopenko T.\nShevchenko Kyiv National University, 60 Volodymyrska St 01017 Kyiv Ukraine if !supportEmptyParas endif if !supportEmptyParas endif Association\nof Non-State-owned Educational Institutions of Ukraine 16-v Vernadsky\nAvenue Kyiv 252115 Ukraine Tel: +38(44) 452-7655 EMail: assoc@ufimb.kiev.ua if !supportEmptyParas endif if !supportEmptyParas endif if !supportEmptyParas endif ADMISSIONS TO HIGHER EDUCATION Admission\nto non university higher education studies Name of\nsecondary school credential required: Atestat/Matriculation School Certificate Minimum\nscore/requirement: satisfactory For\nentry to: all higher technical/vocational and professional non-university studies Alternatives\nto credentials: none Numerus\nclausus/restrictions: These studies are intended for\ngraduates of general secondary schools holding the Matriculation School\nCertificate. However, graduates with other secondary school certificates may be\naccepted. Admission\nto university-level studies Name of\nsecondary school credential required: Atestat/Matriculation School Certificate Minimum\nscore/requirement: satisfactory For\nentry to: all institutions of higher education Alternatives\nto credentials: none Entrance\nexams required: Entrance examination, qualification test or qualifying interview for some\nuniversity level studies. The marks are determined by each institution or\ndepartment. Numerus\nclausus/restrictions: Specific ability requirements are set for artistic\nstudies, physical education and architectural preservation studies. A certain\nage limit is also set. Other\nadmission requirements: Physical and mental predisposition of candidates to work\nin a certain professional field must first be ascertained Foreign\nstudents admission Definition\nof foreign student: A person not having Ukrainian citizenship. Admission\nrequirements: Students must hold a secondary school leaving certificate giving access\nto higher education. Entry\nregulations: The possession of a student visa is necessary. Students must be\nofficially admitted by the Rector of the chosen institution. Health\nrequirements: Candidates seeking admission to higher studies should submit a health\ncertificate. Language\nrequirements: Students must be proficient in Ukrainian or Russian. A 9 to 10 month\ncourse is offered in each university or institution.They then sit for an examination which gives\nentry to the institution. Application\nprocedures: Apply to\nindividual institution for entry to: Institution selected (for addresses see List of\ninstitutions) and all academic programmes of this institution. Apply to\nnational body for entry to: All institutions of higher education and to all academic\nprogrammes. Apply\nto: Ministry of\nEducation and Science,Office of Foreign Education via Embassies. Peremohy prosp., 10 252135 Kiev Ukraine Tel: +380(44) 226-2661 Fax: +380(44) 274-1049 if !supportEmptyParas endif Application\nclosing dates: For\nnon-university level (technical/vocational type) studies: 1 Mar For\nuniversity level studies: 1 Mar For\nadvanced/doctoral studies: 1 Mar Recognition\nof studies & qualifications: Studies\npursued in home country (System of recognition/accreditation): Institutions award\ndegrees according to the decision of the authority appointed by the Ministry of\nEducation Studies\npursued in foreign countries (bodies dealing with recognition of foreign\ncredentials): Department for\nInternational Co-operation, Ministry of Education Head of Staff Department: Vitaly\nPogrebnyak Prosp.\nPeremohi 10 252135 Kyiv Kyiv Region Ukraine Tel: +380(44) 226-29-93 Fax: +380(44) 274-10-49 if !supportEmptyParas endif Deals\nwith credential recognition for entry to: University and Profession Services\nprovided & students dealt with: Information and guidance. if !supportEmptyParas endif Other\ninformation sources on recognition of foreign studies: Ministry of Agriculture and\nFood, Ministry of Transport/Division of Education, The Vice-Rector for\nInternational Affairs of the higher education institutions Special\nprovisions for recognition: For\naccess to non-university post-secondary studies: Applicants must submit complete\nofficial academic documents together with their application form to this\nspecific institution. For\naccess to university level studies: Applicants must submit complete official academic\ndocuments together with their application form to a specific institution. For\naccess to advanced studies and research: All applicants must submit\ncomplete official documents together with their application form to a specific\nuniversity or research institute. For the\nexercise of a profession: Applicants must present relevant documents to the\nappropriate ministry. Multilateral\nagreements concerning recognition of foreign studies Name of\nagreement: Paris Convention. Convention For the Recognition of Studies, Diplomas and\nDegrees Concerning Higher Education in the States Belonging To the European\nRegion. Year of signature: 1979 Name of\nagreement: Prague Convention. Convention of Socialist Countries For the Mutual\nRecognition Or Equivalence of Education Documents, Scientific Degrees and\nTitles. Year of\nsignature: 1972 References\nto further information on foreign student admissions and recognition of studies Title: Study Abroad\n2000-2001 Publisher: UNESCO/BIE Year of\npublication: 1999 if !supportEmptyParas endif STUDENT LIFE Main\nstudent services as national level Office of Social\nService for Students, Ministry of Education and Science Peremoha prosp. 10 252135 Kyiv Ukraine Tel: +380(44) 226-26-61 Fax: +380(44) 274-10-79 if !supportEmptyParas endif Category\nof services provided: Social and welfare services; Special services/Centre for\nforeign students Services\navailable to foreign Students: Yes if !supportEmptyParas endif Office of Students\nAffairs, Ministry of Education and Science Peremohy prosp., 10 252135 Kyiv Ukraine Tel: +380(44) 216-22-88 Fax: +380(44) 274-10-49 if !supportEmptyParas endif Category\nof services provided: Academic and career counselling services; Special\nservices/Centre for foreign students Services\navailable to foreign Students: Yes if !supportEmptyParas endif Ukrainian\nInternational Centre \"Osvita\" 27 Shevchenko\nBoulevard 25032 Kiev Ukraine Tel: +380(44) 226-29-16 Fax: +380(44) 274-60-20 EMail: v\nvs@minosvit.niiit.kiev.ua if !supportEmptyParas endif Category\nof services provided: Academic and career counselling services if !supportEmptyParas endif Special\nstudent travel fares: By road: Yes By rail: Yes By air: Yes Available\nto foreign students: Yes Student\nexpenses and financial aid Student\ncosts: Average\nliving costs: 1000 (US Dollar) Home\nstudents tuition fees: Minimum: 0 (Hryvna) Maximum: 19250\n(Hryvna) Foreign\nstudents tuition fees: Minimum: 450 (US Dollar) Maximum: 2000\n(US Dollar) Bodies\nproviding information on student financial aid: Office of Foreign\nEducation, Ministry of Education Peremohy prosp., 10 252135 Kyiv Ukraine Tel: +380(44) 216-22-88 Fax: +380(44) 274-10-49 if !supportEmptyParas endif Deals\nwith: Grants Publications\non student services and financial aid: Title: Study Abroad\n2000-2001 Publisher: UNESCO/IBE Year of\npublication: 1999 if !supportEmptyParas endif INTERNATIONAL COOPERATION & EXCHANGES Participation\nof country in multilateral or bilateral higher education programmes Name of\nexchange programme: Tempus if !supportEmptyParas endif GRADING SYSTEM Usual\ngrading system in secondary school Full\nDescription: Numerical grading system from 2 to 5 is used: 2 - unsatisfactory; 3 -\nsatisfactory; 4 - good; 5 - excellent. Highest\non scale: 5 Pass/fail\nlevel: 3/2 Lowest\non scale: 2 Main\ngrading system used by higher education institutions Full\nDescription: 5-2 (very good, good, satisfactory, unsatisfactory; sometimes the marks\n'+' and '-' are added to the principal grades). Highest\non scale: 5(very good) Pass/fail\nlevel: 3(satisfactory) Lowest\non scale: 2(unsatisfactory) if !supportEmptyParas endif NOTES ON HIGHER EDUCATION SYSTEM if !supportEmptyParas endif if !supportEmptyParas endif Data for\nacademic year: 2000-2001 Source: Ministry of\nEducation, Kiev, 1998, updated from Ukraine's Website, EDNU, 2001"
    },
    {
      "tag": "div",
      "text": "Copyright International Associations of Universities Back to EuroEducation Net"
    },
    {
      "tag": "p",
      "text": "<a href=\"http://www.euroeducation.net/list/ukrlist.htm\">Universities</a>"
    }
  ]
}