{
  "url": "http://www.event-solutions.com/halloffame/2002halloffamers.html",
  "file_number": "411",
  "content_hash": "b5c0ab2199fe37c1500ccff48ab10c7adaae6636a023d3d70be9223c634ad861",
  "total_blocks": 224,
  "retained_blocks": 18,
  "ignored_blocks": 206,
  "blocks": [
    {
      "tag": "div",
      "text": "saved from url=(0042)http://www.event-solutions.com/toc261.html HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "p",
      "text": "November 2002 Andrea\n                Michaels President Extraordinary\n                Events In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the first in a series profiling each of\n        the inductees. T he\n        Awards and Recognitions page of Andrea Michaels’ bio\n        sheet reads like that of any legendary athlete or\n        thespian. To say she has left an indelible mark on the\n        event industry would be an understatement. Entering her\n        third decade as an event planner and producer, Michaels\n        has climbed to the top of her profession armed with a\n        clear sense of purpose and an unwavering event philosophy\n        that says if you take the time to truly understand the\n        client’s intent, then you hold the key to creating a\n        successful and memorable event. \"I’m\n        famous for saying, ‘Sell the client what they want\n        to buy and not what you want to sell them,’\"\n        she says. \"Every event has a purpose, even if\n        it’s not an obvious one. And delivering that purpose\n        successfully is the one and only true key.\" Michaels’\n        ability to conceptualize an event and then exceed\n        customer expectations has been her hallmark and a primary\n        reason why she has produced events around the world and\n        coveted accounts, such as 20th Century Fox, NASA, Pepsi,\n        Eastman Kodak, Mercedes-Benz and Microsoft, continue to\n        contract her services. Besides her\n        proven track record, Michaels has a background in\n        entertainment and holds a master’s degree in\n        psychology—both of which play important roles when\n        dealing with customers and planning events. Michaels has\n        said that she approaches each function as if it were a\n        play, complete with an overture, acts and a finale. Like\n        a theatrical production, a Michaels-produced event is\n        designed to provide its audience with a sense of\n        anticipation, building in excitement and enjoyment before\n        finally ending with a distinct and satisfying conclusion. \"I want\n        each and every element of any project I’m involved\n        in to have content and meaning and a personal experience\n        for everyone in the audience,\" comments Michaels.\n        \"In Vancouver (for the opening of GM Place), when\n        the owners and managers of the arena said, ‘I want\n        the audience to cry,’ I remembered that in each and\n        every element. The orchestration of what we did was so\n        emotional and impactful that you could watch 22,000\n        people weeping as they stood and applauded. It was about\n        how the entire event was constructed, flowing and\n        building continuously until you could almost see hearts\n        pounding with energy, excitement and, best of all,\n        emotional investment. Just thinking about it still gives\n        me chills.\" Although she\n        is admittedly her own worst critic, which is enough of a\n        barometer to judge the relative success of any event with\n        which she is involved, Michaels does have a simple\n        formula for measuring achievement. \"Success is when\n        the audience smiles, applauds and, best of all, years\n        later…remembers.\" The same can\n        be applied to an extraordinary Hall of Fame career."
    },
    {
      "tag": "div",
      "text": "First\n                Year in the Industry: 1973"
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: An attorney. I\n                got into the business because: I was a single parent and, at age 28,\n                went back to school to get my degree. I needed\n                money and flexibility. I answered an ad that\n                read, \"West Side Entertainment Agency Needs\n                Part Time Help,\" with this image in mind\n                that I would be applying with William Morris and\n                casting Sean Connery in his next role. Surprise!\n                It was a band leader working out of his\n                apartment. Biggest\n                event success: Do I have to give you only one? The opening of\n                Vancouver’s GM Place sports arena, which\n                featured four major events in four days, with the\n                largest being for 100,000 people. The most\n                innovative was the 3 1/2-hour show, which was\n                broadcast live on BCTV and featured more than 750\n                entertainers. Worst\n                event disaster: Only one I can remember. The sound\n                company providing sound for a major show just\n                didn’t deliver. We had a major comic\n                perform, and the audience booed. The entertainer\n                walked off the stage. We salvaged it, but it was\n                not a pretty moment in my career. Most\n                valuable lesson learned: Stay calm. Be flexible. Don’t let\n                creativity stop when the proposal is written;\n                keep it infused every step of the way. Take\n                risks. The\n                best piece of advice I ever received: When you start your own business, get\n                the best legal and accounting advice you can,\n                follow the letter of the law, get insurance and\n                surround yourself with the very best people money\n                can buy. Treat your business like a business. . December 2002 I.L.\n                \"Jack\" Morton Founder Jack\n                Morton Worldwide In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the second in a series profiling each of\n        the inductees. T here's\n        something about a live audience. Street performers,\n        stand-up comedians and stage actors are all drawn to the\n        immediacy and intimacy a captive audience provides. They\n        thrive on crowd-generated electricity and will sink or\n        swim depending on people's instantaneous reactions. The\n        same can be said for those involved in event planning and\n        production. The hint of danger that every live event\n        carries provides an adrenaline rush that would be the\n        envy of Evel Knievel or any death-defying X-Gamer. Once\n        they taste it, many can't shake it. They're inexplicably\n        hooked. Jack Morton\n        caught the bug at an early age and, 80 years later, still\n        hasn't got it out of his system. Born the son of a\n        sharecropper in North Carolina, Morton quickly developed\n        a love for theater and stepped into show business as a\n        12-year-old, working as an usher, ticket taker, bill\n        poster and sometime janitor in a small-town, silent-movie\n        house. At 18, he was managing an 850-seat theater and\n        helped usher in talking pictures for his loyal clientele. The\n        Depression years took Morton to Washington, D.C., where\n        he worked his way through George Washington University.\n        Before long, he was organizing and booking dance bands\n        for school dances, society affairs and even presidents. His\n        experience in theater and music allowed him to begin\n        producing shows for the burgeoning convention industry,\n        and in 1939, Morton founded Jack Morton Productions as\n        primarily an entertainment production company. Today,\n        known as Jack Morton Worldwide, the company has grown\n        into a 25-office, worldwide agency, boasting 800\n        employees working on four continents. The company\n        has been a rousing success, in part, because it has never\n        lost sight of the original ideals Morton instilled back\n        in 1939. Then and now, the live experience is the very\n        essence of any work the company performs for its clients. \"In\n        whatever form it comes-be it theater, a meeting, Webcast,\n        or one-on-one conversation-a live experience creates the\n        best learning environment,\" says Morton, who also\n        credits his company's longevity and growth to its ability\n        to continually adapt and expand capabilities to meet\n        customer needs. Jack Morton\n        Worldwide has grown to be a leader in experiential brand\n        communications and continues to evolve by utilizing new\n        areas such as mobile marketing and Webcasts. Regardless\n        of the medium, whether coordinating broadcasts via the\n        Internet or selecting music rolls for a player piano, the\n        keys to creating a memorable event have remained\n        remarkably similar to when Morton first started in that\n        North Carolina theater: set measurable objectives,\n        respect the brand and engage the audience. Morton\n        continues to champion the latter as the ultimate\n        measuring stick for an event's success. At 92, the live\n        experience still holds a powerful allure. \"The\n        reaction of a live audience is real,\" he says.\n        \"There's no better measurement than what you can see\n        or hear from a live participant.\" With an\n        80-year, Hall of Fame track record to back him up, who's\n        going to argue?"
    },
    {
      "tag": "div",
      "text": "First\n                Year in the Industry: I started when I was 12 years old! I began\n                working in a movie theater and later founded Jack\n                Morton Productions in 1939. What I thought I was going to be when I\n                grew up: I wanted to be a theater manager, and I became\n                one at age 18. I got into the business because: I had a great fascination with the theater, and I\n                loved giving the audience a true, live\n                experience. Biggest event success: Winning the business again for the following\n                year. Worst event disaster: Nothing is a disaster if you can learn from it. Most valuable lesson learned: To observe everything and then use what you see\n                to improve yourself and your work. The best piece of advice I ever received: If you're honest and hard-working, you can't\n                avoid success."
    },
    {
      "tag": "p",
      "text": "February 2003 Raymond\n                Thompson President,\n                Owner Images\n                by Lighting In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the third in a series profiling each of\n        the inductees . R ay\n        Thompson grew up in a family of eight children. As a\n        child, he loved to tinker with the parts from discarded\n        vending machines from his father's business. By the time\n        he was in the fifth grade, he had created and installed a\n        bank of 15 colored spotlights in the wall of his room and\n        built a system to play the lights with music, shooting\n        color out into the room. As a sophomore in, he designed\n        and built a complete lighting system for the stage at his\n        high school. Clearly, he had found his destiny early in\n        life. Thompson\n        founded Images By Lighting in 1983, and was truly one of\n        the industry pioneers in the ways he has used lighting to\n        enhance, accentuate and add excitement to the world of\n        events. \"It was always about lighting to me. I loved\n        it. It was in my heart,\" says Thompson. When\n        Thompson graduated from the University of Central Florida\n        with an electrical engineering degree, he says, \"I\n        decided if I was going to find my destiny, it would be in\n        Los Angeles, and I accepted a job offer from Hughes\n        Aircraft.\" While\n        working in Los Angeles, he designed a lighting project\n        for a friend in Beverly Hills. His friend's friends\n        quickly discovered his talent for lighting, leading to a\n        variety of home and commercial lighting projects. Movie\n        producer Allen Carr was so impressed with Thompson's work\n        in his (Carr's) home that in 1984 he asked Thompson to\n        design the lighting for one of his premiers. The success\n        of the premier led Thompson to team up with the some of\n        the top designers, planners and companies, whose visions\n        gave birth to the event industry as we know it today. Along this\n        storied journey to his Hall of Fame inauguration,\n        Thompson's projects have taken him to countries all over\n        the globe, and across the United States and Canada. His\n        expertise, creativity and easy conversational style have\n        made him a valued speaker, presenter and lecturer on the\n        subject of lighting. More\n        importantly, many top designers and producers look to\n        Thompson when they need their event to be edgy or\n        over-the-top! \"I work with designers, decorators and\n        scenic designers who are creating worlds,\" he\n        explains. \"I am there to support them. I want people\n        to see the magic.\" Thompson and\n        Images by Lighting's excellence has earned numerous\n        prestigious honors and awards. When asked for advice, he\n        says, \"I never take so much business that it\n        compromises the quality. I always give something extra to\n        the client that they did not expect. I do that with\n        lighting some aspect of the event that I find is special\n        to me. It is my passion to be able to create with\n        light.\" First\n                Year in the Industry: I created Images by Lighting in 1983,\n                but when I was a sophomore in high school, I\n                designed and built the complete lighting system\n                for my school's stage. What\n                I thought I was going to be when I grew up: The first thing I remember wanting to be was a\n                chicken egg farmer. I\n                got into the business because: Even in my senior year at the UCF, I wasn't sure\n                if that [electrical engineering] was what I was\n                going to do. I knew it was going to be something\n                with lighting. Lighting was always in my heart.\n                Later, in Los Angeles, a friend admired the\n                lighting design I had created for my home. She\n                asked me to do her home, and that was the first\n                step. Biggest\n                event success: I think I have successes every day that a client is just blown away by one of my\n                projects. However, working with John Daly on the\n                Korean Olympics was one of my biggest successes. Biggest\n                disaster: My biggest disaster was also my biggest save. We\n                loaded and rigged all the lighting for a tent\n                party on a hill in Thousand Oaks, Calif. That\n                night the Santa Ana winds blew the tent from its\n                stakes and rolled it with all my lighting into\n                the yard. We climbed through the rolled\n                structure, took out the lighting and reinstalled\n                it in the new tent. Most\n                valuable lesson learned: Knowing how color affects people…and why.\n                Color plays into events on both a conscious and\n                subconscious level. The\n                best piece of advice I ever received: From Think and Grow Rich by Napoleon Hill,\n                who wrote that we should find what we love and\n                the money will come. March 2003 Dr.\n                Joe Goldblatt, CSEP Dean,\n                Alan Shawn Feinstein Graduate School Johnson\n                and Wales University, Providence, R.I. In\n        August 2002, Event Solutions proudly inducted an\n        inaugural class of 10 industry legends into the Event\n        Industry Hall of Fame. This is the fourth in a series\n        profiling each of the inductees. D r.\n        Joe Goldblatt graduated from college in 1975 with a\n        Bachelor of Fine Arts degree in theater and business.\n        \"I wanted to pursue events as a profession, but\n        there was nothing... no official college program... in\n        events,\" Goldblatt recollects. He moved to\n        Washington, D.C. to work as a \"nanny,\" and in\n        his off time dressed as a mime, performing magic tricks\n        for the people waiting to tour the FBI building. Through\n        this, Goldblatt met his wife, Nancy, who taught clowning\n        and was a performing artist. He reminisces, \"We fell\n        in love, got married and started performing as mimes as\n        part of the Artists in our Schools program.\" For two\n        years, they traveled to schools nationwide, but when\n        Nancy became pregnant, they decided, \" ... it was\n        best if we did not travel with our son.\" The\n        Goldblatt's began entertaining at special events held by\n        Washington area shopping centers. Their successful\n        performances evolved into producing shopping center\n        events and starting their own company: The Wonder\n        Company, Inc. \"Our real motivation was to stay home\n        with our child; to have as normal a family life as\n        possible.\" As The\n        Wonder Company grew, they added staff. Goldblatt\n        developed training procedures for their staff and\n        freelancers. \"I developed a training program, so\n        that I could manage the business and send trained\n        staffers out to produce events while I stayed in\n        Washington with my family.\" The Wonder\n        Company grew in size and reputation. Goldblatt again\n        found himself on the road, away from his family. So, he\n        sold The Wonder Company to a decorating firm in\n        Nashville, relocated there and worked for the new owner a\n        year. With the downturn of the economy, the new owner\n        defaulted and The Wonder Company returned to Goldblatt. Simultaneously,\n        Goldblatt began his career as an expert witness in the\n        field of events. As he researched cases, the quantity of\n        information available inspired him to develop a\n        curriculum for professional event planners, including\n        writing the necessary texts for instruction. In 1992, he\n        began exploring colleges and universities as possible\n        sites for this curriculum. The George Washington\n        University (GW) deservedly offered Goldblatt a full\n        scholarship to earn his master's degree and doctorate,\n        plus resources to develop his program, office space and\n        library support. From 1993 to\n        2001, the GW program grew from 25 students to 4000.\n        Goldblatt then licensed it as the Event Management\n        Certificate Program to 20 other universities around the\n        world. When asked\n        why he felt so passionately about creating this Event\n        Management Certificate Program and the ISES Certified\n        Special Events Professional (CSEP) professional\n        designation, Goldblatt responded, \"I knew that every\n        industry, in order to be taken seriously, needs a\n        certification program.\" In 2001,\n        Johnson and Wales University, with 15,000 students of\n        hospitality, recruited Goldblatt. \"They wanted to\n        draw on my expertise in events to develop their\n        program,\" he comments. Johnson and\n        Wales also made Goldblatt the Dean of the Alan Shawn\n        Feinstein Graduate School, and today, Goldblatt,\n        affectionately known as Dr. Joe, continues to inspire\n        hospitality students and faculty alike. Goldblatt is also\n        an internationally recognized speaker and has received\n        numerous awards for his work, including his induction\n        into the 2002 Event Industry Hall of Fame. by\n        Carolyn S. Baragona"
    },
    {
      "tag": "div",
      "text": "First\n                Year in the industry: 1976\n                was my first year as a professional; however, I\n                produced events when I was in college."
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: I thought I would be a producer of the Olympics,\n                the Superbowl or the World's Fair. I\n                got into the business because: I liked engaging people, bringing them together\n                and creating mutually beneficial outcomes. Biggest\n                event success: I produced the Opening of the Nashville\n                Convention Center and the series of events that\n                preceded the opening ceremonies. I started by\n                designing a series of pre-opening events that\n                brought people to the area and revitalized it.\n                Because of this renewal, the opening event was\n                well attended! I like to produce events that\n                leave a legacy. Worst\n                event disaster: In Denver, I once used fog during a gala.\n                Twenty-nine Denver firefighters rushed into the\n                room, carrying axes. The audience stood and\n                applauded because they thought this was part of\n                the show, that these were actors! The fire\n                department ordered the room evacuated, but no one\n                would leave. Everyone was so certain it was an\n                act! Most\n                valuable lesson learned: My most valuable lesson is the importance of\n                communication and risk assessment. The\n                best piece of advice I ever received: Fellow Hall of Fame inductee Jack Morton advised\n                me, \"Create things that endure. Whether it\n                is a friendship or an event, do it so well that\n                it will last.\" July 2003 John\n                Daly John\n                Daly International In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the fifth in a series profiling each of\n        the inductees. I n\n        John Daly’s 37-year career, he has created events\n        around the world: Paris, Korea, Japan and other worldwide\n        sites have been treated to his creative style and\n        humanistic appeal. Daly\n        reflects upon his global body of work. “Overseas,\n        they don’t do events the same way we do, because\n        they haven’t seen it,” he says. “But once\n        they see what we are doing…it’s amazing. They\n        really get on board once they understand it. You\n        can’t translate a feeling, but you can translate\n        art. Art has a language of its own.” Daly thrives on\n        the interaction with artists of different cultures and\n        languages. He thrills at developing the common\n        communication between himself and the artists, and\n        realizing the vision together. Who would\n        believe that he started as a part-time florist’s\n        delivery boy working his way through college? “I\n        happened to be at the right place at the right time. From\n        delivering, I began to freelance in floral design. I also\n        worked for what they called at that time a ‘party\n        shop’ that did a lot of weddings and parties.” In the early\n        to mid ‘70s, at a time when no such thing existed,\n        Daly decided to open his own company, strictly an event\n        company. “Everybody thought I was absolutely crazy\n        to consider such a thing!” He started with 300\n        square feet of workspace. Within four years, he took over\n        the whole building, ran a fleet of trucks, and had built\n        his team to 35 people. Daly’s\n        team continuously took events to new levels. There were\n        no specialty linen companies then; they made their own\n        linens. There were no prop houses; they made their own\n        props. “People were stunned, totally stunned.\n        That’s why it worked,” Daly mused while\n        considering the early days. The Beverly\n        Hilton, The Bonaventure, The Armitage all welcomed him as\n        their florist, while he still had his own special events\n        company and warehouse. From his initial venture as one of\n        the original event production companies, Daly’s work\n        has provided extraordinary experiences: Los Angeles’\n        area great events, the State Department, corporate events\n        around the world, creating the Papal Altars, and most\n        recently, being selected to give roses to the loved ones\n        of those lost at the World Trade Center during the\n        memorial service. John Daly\n        has not only created a Hall of Fame career, he has\n        created the prototype of a Hall of Fame person:\n        thoughtful, creative, energetic and good."
    },
    {
      "tag": "div",
      "text": "First\n                Year in the industry: 1966."
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: A psychiatrist. Biggest\n                event success: I worked with Ray Thompson on an event for\n                Gillette during the World Cup in 1998. We were in\n                Paris, at Chantilly, a place like a miniature\n                Versailles. We created Chantilly as it would have\n                looked during the reign of Louis XIV. We\n                re-landscaped the gardens, installed fountains in\n                the lakes, and filled all the urns with floral\n                arrangements. The guests swept down on an 80-foot\n                by 150-foot long staircase to the sounds of\n                baroque music and a water show. The event was two\n                years in the making. Then all of a sudden, it was\n                there, and it was exactly as we had pictured it. Worst\n                event disaster: The “worst” began as we were\n                leaving for an event in Hawaii. I locked my keys\n                and the tickets for a crew of 15 in my car, while\n                it was still running. Then, on the island, a\n                hurricane blew in and tore down every single\n                thing we had put up. The rains came. We had roofs\n                blown into the tent. I had ordered thousands of\n                dollars of foliage for the ceiling. It arrived in\n                one small box. So my crew went into the jungle\n                with machetes to chop greens. Two minutes before\n                the guests were to enter, the power was\n                disconnected, and we had to rewire the tent.\n                Finally, as we were packing up the boxes to\n                leave, a bellman was helping with his box cutter.\n                He cut one of my guy’s fingers nearly off.\n                We don’t talk about that event. Most\n                valuable lesson learned: Attitude is absolutely everything. How\n                you approach people can make or break an event.\n                Be flexible. I believe that nothing is\n                impossible. August 2003 Michael\n                Roman President Catersource,\n                Inc. In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the sixth in a series profiling each of\n        the inductees. M ichael Roman\n        has become the nation’s leading educator for the\n        “art” and “science” of catering.\n        During an average year, Roman travels more than 70,000\n        air miles providing marketing assistance and business\n        consulting to food service companies who offer catering\n        to their marketplace. In addition, each year he teaches\n        over 100 days of public or private educational seminars\n        on all aspects of catering. Besides\n        having over fifteen years of “hands-on”\n        experience managing his family’s catering business\n        in Chicago, Roman is also a college level instructor with\n        a Masters Degree in Education. While a caterer, Roman\n        produced everything from simple box lunches to corporate\n        galas serving thousands! In 1986, after the family\n        catering business was sold, Roman began to teach and\n        consult on a full-time basis. Roman has assisted some of\n        the nation’s largest hospitality businesses as well\n        as hundreds of entrepreneurial catering businesses to\n        accelerate their catering successes! Roman’s\n        greatest strength is to teach proven, useful and daring\n        skills to existing sales teams. Roman is\n        President of catersource , which is a consulting,\n        seminar, and publishing business helping all types of\n        food service business achieve better profitability. The\n        new catersource Magazine, which is being\n        launched in October, 2003, will add greatly to\n        Roman’s ability to bring education, products and\n        news to professional caterers. Roman has\n        worked hard to earn the trust of caterers. He has\n        personally visited more catering operations and met with\n        more caterers than anyone else in the food service\n        industry. His mission is to continue to be the most aware\n        educator/consultant to the catering segment of the\n        hospitality industry. One of\n        Roman’s proudest accomplishments was the writing and\n        publishing of his book CATERING: The Art, Science\n        & Mystery . And caterers like to listen to Mike\n        Roman because he has experienced first hand the\n        “good” and “not so good” of catering!\n        He is the caterer’s caterer."
    },
    {
      "tag": "div",
      "text": "First\n                year in the event industry: My mother was a great Chicago caterer.\n                So, I began working in 1958 for our family-owned\n                catering company, The Mixing Bowl. I left to\n                pursue my own career and returned to manage The\n                Mixing Bowl in 1974 after my parents retired. In\n                1980, I began to teach national catering seminars\n                for the National Restaurant Association, which\n                led me to where I am today."
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: No question about it ... an actor! In many ways,\n                I’ve made it happen. Teaching, which is my\n                first love, is filled with opportunities to act. I\n                got into the business because: In the 1980s, there just wasn’t\n                much happening with respect to education or\n                sharing for caterers. I was a caterer who also\n                happened to be an educator, so I saw a niche and\n                went for it. Biggest\n                event success: As a caterer, it was an off-premise\n                sitdown dinner served in the foyer of the\n                University of Chicago for Supreme Court Chief\n                Justice Warren E. Burger in 1983 for 700 guests.\n                It was one of those wonderful catering nights\n                where everything went as planned. We got the\n                entree served in less than 9 minutes! Biggest\n                disaster: Simple. When I was a young caterer, I\n                forgot a client’s event date. Blew it\n                totally. Learned my lesson. Apologized. Gave her\n                next party for free. She stayed a client! Most\n                valuable lesson learned: It’s easier to find new clients\n                then it is to lose contact with family and\n                friends. Business is truly important, but friends\n                and family are our real assets. Learning to keep\n                the proper balance is essential! The\n                best piece of advice I ever received: In 1984, a close friend gave me a framed\n                hand-written sign that reads, “Enthusiasm is\n                a catalyst: when added to wisdom and experience,\n                it can form small miracles.” This sign still\n                hangs in my office. I’ve always loved the\n                concept of “small miracles.” September 2003 Tom\n                Shapiro Founder Academy\n                Tent & Canvas In\n        August, Event Solutions proudly inducted an inaugural\n        class of 10 industry legends into the Event Industry Hall\n        of Fame. This is the seventh in a series profiling each\n        of the inductees. B orn and\n        raised in California, Tom Shapiro began his college\n        career in Tucson at the University of Arizona.\n        “Initially I was a veterinary medicine major at the\n        U of A. But I transferred to USC after creating an\n        explosion in a chemistry class that required a building\n        to be evacuated. I did much better at USC because I only\n        started a fire in the lab there. A woman dropped\n        something on my shoe which caught on fire,” says\n        Shapiro. With his\n        plans for a career in veterinary medicine gone up in\n        smoke, Shapiro changed his major to business. Upon\n        graduation, Shapiro worked operations, production and\n        sales for his family’s garment business. He then\n        started work for a tent company as a purchasing agent,\n        later to become assistant to the owner. Says Shapiro,\n        “This was probably just before tents became a major\n        event venue. They were still pretty much a ‘Mom and\n        Pop’ garage industry.” About three\n        and a half years later, he started Academy Tent &\n        Canvas with his friend and partner Maury Rice. “We\n        started on a shoestring,” Shapiro recalls.\n        “Maury’s father-in-law donated an old truck to\n        the cause. It was so old that it didn’t have any\n        paint on it.” Says\n        Shapiro, “One of our first customers was a caterer\n        who was doing a rock star’s wedding. Our truck\n        chugged into the driveway, and just like in a cartoon, it\n        collapsed. Smoke started billowing out, the tires went\n        flat, the crew jumped off the back. The caterer ran up to\n        me and said, ‘Tom, Tom, promise me everything’s\n        going to be OK.’ “We put\n        the tent up and the rock star was so pleased she invited\n        us all to attend the wedding.” Progressing\n        from this humble start-up, the 1984 Olympics created a\n        major “tipping point,” at which Shapiro and\n        Academy provided a lot of tenting. Since then, they have\n        done work at three different Olympics, at Super Bowls,\n        and in foreign destinations. “What I\n        am most fond about in our success would be the company\n        reputation, where people have enough confidence in us\n        that they take us with them,” says Shapiro. Regarding\n        the work that produced the growth and success of Academy,\n        and the high esteem with which event professionals regard\n        him, Shapiro says with a smile, “I don’t\n        deserve any credit...because you know what? It’s the\n        people who work with us that deserve the credit. As an\n        owner, I get the credit because I have the title. But the\n        reality is, it’s really those people who make it\n        happen.”"
    },
    {
      "tag": "div",
      "text": "First\n                year in the event industry: The start of time. I remember it\n                clearly. Mel Brooks was there. He was the other\n                guy who started in the tent business. But he got\n                out and went into entertainment."
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: I don’t know...successful. I just\n                knew I wanted to be good at whatever I did. Biggest\n                event success: I think that the biggest success would\n                be more on a global level. And that (success)\n                would be the reputation that the company has\n                achieved in particular for large, high-profile\n                projects, like the Olympics. Worst\n                event disaster: One year we provided a bunch of tents\n                for a Super Bowl project. A squall went through\n                town and destroyed a lot of property and in the\n                process about half a dozen of our tents. We\n                provided replacement tents and actually set up\n                sewing machines in the parking lot to make\n                repairs. And two or three days later everything\n                was back up and fine...we now have structures\n                engineered to withstand 70 mph\n                ‘squalls.’ Most\n                valuable lesson learned: I don’t know that I could isolate\n                one particular lesson. I guess they all add up to\n                our clients having confidence that we are going\n                to do what we say we will do. We cannot let\n                people down. Best\n                piece of advice I ever received: My father always told me that the most\n                important thing is your reputation, because that\n                is the only thing that you take with you. October 2003 Jim\n                Steeg Senior\n                Vice-President of Special Events NFL In\n        August 2002, Event Solutions proudly inducted an\n        inaugural class of 10 industry legends into the Event\n        Industry Hall of Fame. This is the eighth in a series\n        profiling each of the inductees. A fter\n        25 years, Jim Steeg, NFL senior vice president of special\n        events, says, “You only need four things to put on a\n        Super Bowl. Two teams, a box of footballs, keys to the\n        stadium, and a paid power bill.” Steeg is\n        considered the sports world’s special events guru,\n        the visionary who has made the Super Bowl the\n        extravaganza it is today. His secret? Steeg believes\n        he’s the conscience of the fans. “Jim\n        understands what the Super Bowl means…how it feels\n        to pay $400 for a ticket, and what kind of show you\n        should get,” says Jerry Anderson, a member of\n        Steeg’s Super Bowl team for two decades. Born in\n        Boston, raised during his teen years in Fort Wayne, Ind.,\n        Steeg, the son of an engineering professor at Purdue,\n        grew up a sports fanatic. His favorite memory? At age 9\n        in 1960, he skipped a day of fifth grade so he could sit\n        in right field at Fenway Park for Ted Williams’\n        final game. After\n        receiving a bachelor’s degree in political science\n        from Miami University in 1972, followed by an MBA in\n        finance from Wake Forest in 1975, Steeg was unexcited at\n        the prospect of working for an accounting firm. He wrote\n        to every professional sports team in the country, except\n        those in New York. In July ‘75, the Miami Dolphins\n        hired him as an accountant. Within four years, Steeg was\n        the team’s business manager. On Jan. 2,\n        1979, then-Commissioner Pete Rozelle handed Steeg the\n        newly created position of NFL director of administration.\n        Only 28, Steeg took charge of the league’s events\n        outside of its New York City headquarters, including the\n        Super Bowl, Pro Bowl, AFC and NFC Championships, and NFL\n        Draft. Over the\n        years, he has added others, including running American\n        Bowl games; managing the Pro Football Hall of Fame\n        reunions; overseeing the NFL 75th Anniversary\n        Celebration; coordinating the NFL’s made-for-TV\n        shows, and handling the NFL Owners’ and other league\n        meetings. Steeg is\n        responsible for all aspects of the Super Bowl, both\n        inside the stadium and out, and before, during and after\n        the game. Throughout his tenure, Steeg has implemented\n        many Super Bowl-related elements and activities that have\n        become staples throughout professional and Olympic\n        sports: Jumbotron screens; audio TV broadcasts throughout\n        the stadium; individual radios featuring broadcasts at\n        every seat; TV access at all concession stands; outside\n        entertainment plazas and a corporate hospitality village.\n        Also, Steeg directs league-sponsored Super Bowl\n        charitable events, raising millions of dollars for\n        programs in local host communities. There’s\n        no problem Steeg can’t solve, no crisis he\n        can’t handle, no stone he leaves unturned.\n        “It’s supposed to be fun,” he says.\n        “For players and coaches, it’s life or death.\n        But we’re not electing a president, and this\n        isn’t the end of the Earth. It’s a football\n        game. If things don’t go right, we’ll play\n        again next year.”."
    },
    {
      "tag": "div",
      "text": "First\n                Year in the industry: 1975, back when a Dolphins game was\n                considered “an event.” First, I brought\n                back the team’s cheerleaders, then I added\n                Flipper, a live dolphin, in a tank in the end\n                zone."
    },
    {
      "tag": "p",
      "text": "What\n                I thought I was going to be when I grew up: I figured I’d get into finance or\n                accounting, leading into management in business. I\n                got into the business because: I’ve always loved sports. Also, my\n                father challenged me to find a job that would\n                combine my love for sports and my skills in\n                finance and accounting. Biggest\n                event success: Super Bowl XXXVI in New Orleans. 9/11\n                forced the NFL to change the date of the game,\n                and all the plans we’d been making the\n                previous 2 1/2 years. Americans feared flying,\n                attending major events, gathering in crowds. It\n                was imperative for the psyche of the country that\n                Super Bowl XXXVI be safe. It came off without a\n                hitch. Worst\n                event disaster: Knock on wood, nothing major. Carrie\n                Rozelle, the wife of Pete Rozelle, once told me:\n                “All sorts of little things might not be\n                what you thought they should be. But only you\n                will notice.” Most\n                valuable lesson learned: Communication is the key to success in\n                anything you do. The best-laid plans don’t\n                mean anything if you haven’t talked to the ushers, security guards, halftime performers,\n                etc., ensuring they know their responsibilities\n                and what you’re trying to accomplish. The\n                best piece of advice I ever received: Pete Rozelle told me: “Do things\n                with class and style. If you do the right thing,\n                the events will evolve to the point where\n                they’re worth more in the long term.” November 2003 David\n                L. Wolper Producer In\n        August 2002, Event Solutions proudly inducted an\n        inaugural class of 10 industry legends into the Event\n        Industry Hall of Fame. This is the ninth in a series\n        profiling each of the inductees. W hen\n        you stop everything to watch the Super Bowl halftime\n        show, spectacular Olympics Opening and Closing\n        Ceremonies, or are thrilled by a live event production,\n        you experience the legacy of David L. Wolper. In addition\n        to raising the bar and setting the standard for live\n        event extravaganzas, Wolper’s impressive list of\n        credits includes documentaries, sit-coms, docudramas, and\n        films ranging from Willie Wonka and the Chocolate Factory\n        to The Rise and Fall of the Third Reich, recreating each\n        genre in the process. At the 1939 World’s Fair in New York, Wolper’s\n        life changed when he witnessed his first television\n        broadcast at the RCA exhibit. TV would shape his future,\n        and he would ultimately shape the future of the medium,\n        raising the world’s expectations of entertainment. Wolper was born in New York in 1928, roughly four months\n        after television was first demonstrated. While growing\n        up, he earned money selling radishes, delivering flowers,\n        and bussing tables. Even then his flair for show business\n        manifested itself, as he promoted local big bands and\n        held entertainment-connected odd jobs, such as Arthur\n        Murray dance instructor, usher at a Broadway theater, and\n        seating guests at a stylish canteen. Although Wolper began college at Drake University in\n        Iowa, he transferred to the University of Southern\n        California, which at the time housed the nation’s\n        only film school. Wolper also played baseball, wrote for\n        the university humor magazine and shot photos for the USC\n        newspaper. He showed his inventive humor by showing up uninvited to\n        the Academy Awards with a friend who was dressed in a\n        gorilla suit. The stunt was part of a publicity campaign\n        in which he also produced several theatrical scenarios to\n        get students to attend a play written by a friend. In 1949, Wolper decided to leave school to develop his\n        vision for TV. His first entrepreneurial adventure\n        involved buying and reinventing documentaries for the\n        small screen. These were Wolper’s first steps in\n        presenting information as entertainment. His list of credits is a virtual stroll through history.\n        He brought imagination to history and reality to\n        imagination. Throughout his career, Wolper has\n        implemented new techniques, mixing a variety of media\n        into film to properly convey a story. This year, USC opened The David Wolper Center in\n        celebration of his 50th anniversary in entertainment. The\n        center contains many of Wolper’s personal and\n        professional archives, including scripts, awards,\n        business records and physical documentation of events\n        that transformed the nation’s psyche. Throughout his career, Wolper’s vision, energy and\n        innovative spirit have impacted people’s perspective\n        and perception of what it means to be entertained. His\n        lifetime of creativity has rewarded him with more than 90\n        prestigious awards, including three Oscars and 50 Emmys.\n        As one of the original visionaries in the industry, his\n        legacy is the gift of joy, fascination and wonder."
    },
    {
      "tag": "div",
      "text": "Career Event Highlights American Revolution Bicentennial Administration: Staging live events is a prominent part of\n                Wolper’s body of work. He was appointed by\n                President Gerald Ford to the Council for the\n                American Revolution Bicentennial Administration\n                in January 1975 to help celebrate the United\n                States’ 200th birthday. He was elected\n                chairman by the organization’s 25-member\n                council. Olympic Organizing Committee: Wolper was appointed vice chairman of the Olympic\n                Organizing Committee that brought the 1984 Summer\n                Olympics to Los Angeles. He transitioned from\n                that position to producer of the Games’\n                Opening and Closing Ceremonies. 1984 Los Angeles Summer Olympics: His ambitious, precisely planned and delivered\n                production enthralled the 85,000 spectators as\n                well as a worldwide TV audience. Wolper set a new\n                standard for participation with 84,000 attendees\n                raising their mosaic cards on cue. The 84 baby\n                grand pianos thundering the refrains of\n                Gershwin’s “Rhapsody in Blue,” the\n                soaring flight of doves, the startlingly new\n                details, created the biggest show of the century.\n                Later, the Academy of Motion Picture Arts and\n                Sciences awarded Wolper the Jean Hersholt\n                Humanitarian Oscar for this amazing production. 1986 Liberty Weekend: He then produced the 1986 Liberty Weekend to\n                celebrate the unveiling of the renovated Statue\n                of Liberty and its 100th anniversary. Wolper and\n                other top producers and directors created a\n                four-day commemoration that included a parade of\n                300 ships, a Boston Pops concert, a political\n                summit, a concert in Central Park, a salute to\n                sports and an extravagant closing ceremony at\n                Giants Stadium. The event was viewed by 1.5\n                billion people worldwide."
    },
    {
      "tag": "p",
      "text": "December 2003 Martha\n        Stewart Chairman and CEO Martha Stewart Living Omnimedia Inc."
    }
  ]
}