{
  "url": "http://www.fermanaghtabletennis.com/",
  "file_number": "419",
  "content_hash": "b4c6b3d5b1abcb6ab8a41c35631741b9bd855919c4a325c1f7b06184d87b3c37",
  "total_blocks": 139,
  "retained_blocks": 11,
  "ignored_blocks": 128,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" DWLayoutTable DWLayoutTable DWLayoutTable Start of StatCounter Code"
    },
    {
      "tag": "p",
      "text": "End of StatCounter Code View \n                Web Stats Ping \n                Pong Tables"
    },
    {
      "tag": "div",
      "text": "Accommodation-NI.com DVDZSHOP.COM Cheap uk dvd shop DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "Welcome to Fermanagh Table Tennis \n              League based in Co.Fermanagh Northern Ireland. Fermanagh is one \n              of the largest leagues in Northern Ireland with six divisions and \n              has special youth division. Our website offers a vast range of useful \n              information from news to nutrition, so please feel free to browse \n              our entire website. Thanks for visiting our website and please return \n              soon."
    },
    {
      "tag": "div",
      "text": "DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "Munster \n                Open West \n                Of Scotland More \n                Tornaments"
    },
    {
      "tag": "div",
      "text": "DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "STRONG PERFORMS THE \n              GREAT ESCAPE After performing the great escape Newry teacher Daryl Strong went \n              on to win the Ulster senior championships in style at the Valley \n              Leisure Centre on Saturday as teenage hotshots Paul McCreery, Claire \n              Nelson and Gervis Knox also made a huge impact with all three claiming \n              a brace of titles on a day when the silverware was shared throughout \n              the province. Read \n              More Sligo \n              Debut with a narrow victory.. Read More FERMANAGH LEAGUE PLAYERS \n              TAKE DUBLIN BY STORM The Stiga Irish Open Junior Classification table \n              tennis tournament took place in Dublin at the weekend and as usual \n              this prestigious event attracted all the top players from the four \n              provinces. The Fermanagh Table Tennis Association were well represented \n              by players from several of the top local clubs; Andrew Nevin – \n              Kesh Club, Stephen Slater & Ashley Givan – Letterbreen \n              Club, Ashley, Haley and Amy Robinson, Judith Atwell, Catherine & \n              Ruth Trimble, Roslyn Blackburn, Jonathan Porter and Mark & Andrew \n              Gordon from the Clogher Club. The Irwin family, Rebecca, Laura and \n              Neil from Oonacream represented the Greystone league from the Dungannon \n              area. Read \n              More SWEDES RULE THE ROOST \n              IN BANGOR The Swedish topspin masters took table tennis to a \n              new level at the OK Marine 21st Bangor Open played at the town's \n              leisure centre at the weekend. The two day spectacular which was \n              also supported by the Northern Ireland events company and North \n              Down Borough council proved to be a showcase event for the silky \n              skills of Fredrick Hakinsson and compatriot Magnus Mansson who dominated \n              the main event while their was some local success with teenage sensation \n              Claire Nelson and former Irish international Tom Heasley claiming \n              titles for the province Read More"
    },
    {
      "tag": "div",
      "text": "DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "December 2006"
    },
    {
      "tag": "div",
      "text": "DWLayoutTable 9-10 Stiga \n                      Irish Senior Top 8 (Class 1) 16-17 National \n                      Training & Prov.Training Camps 27 Irish \n                      National Vets Champ. DWLayoutEmptyCell Fermanagh Table Tennis © 2006 - Designed By Gervis \n        Knox text below generated by server. PLEASE REMOVE Counter/Statistics data collection code"
    }
  ]
}