{
  "url": "http://www.filmsite.org/crow.html",
  "content_hash": "571b35096d3abaf75ec05b48e1cc00f1b03996be5c534e3c7f064523a038c08a",
  "total_blocks": 96,
  "retained_blocks": 42,
  "ignored_blocks": 54,
  "blocks": [
    {
      "tag": "div",
      "text": "BEGIN STANDARD TAG CPX - 468 x 60 TOP - filmsite.org: Run-of-site - DO NOT MODIFY END 468x60 TOP TAG"
    },
    {
      "tag": "h1",
      "text": "The Crowd (1928)"
    },
    {
      "tag": "p",
      "text": "Greatest Films ( www.filmsite.org and www.greatestfilms.org ) With descriptive review commentaries and background history on many classic, \n      landmark films in cinematic history, especially American/Hollywood films. \n      Including posters, Academy Awards history, film genres, film terms, film \n      history by decade, trivia, and lots of lists of 'best' films, stars, scenes, \n      quotes, resources, etc."
    },
    {
      "tag": "div",
      "text": "Buy \n        This Film"
    },
    {
      "tag": "p",
      "text": "The Crowd (1928) is a genuine, immortal, timeless American silent film \n    masterpiece from director King Vidor, whose earlier big WWI epic The \n    Big Parade (1925) had been a major box-office hit for MGM studios. \n    This experimental, social commentary film, with a screenplay by King Vidor \n    and John V.A. Weaver, was remarkably different from other feature films of \n    its time because of its non-Hollywoodish reflection of daily life. [A record \n    of sorts, it was the first US feature film to show a bathroom with \n    a toilet bowl.] With a novice actor (James Murray) in the lead role, the film \n    was simply a realistic, bittersweet drama of the existence of an ordinary \n    common and average American (an Everyman prototype embodied in a white-collar \n    worker) trying to make it with his wife in the monolithic big city - but without \n    any maudlin sentimentality, extreme passion, exploitation of romance, or escapist \n    melodrama. Reality intrudes as he experiences cramped living conditions, a \n    boring job, and a limited life with regret and bitterness, rather than what \n    he had expected. Vidor's natural and uncompromising film tells the episodic, poignant story \n    of the working and domestic life of an average, commonplace man in 'the crowd' \n    - John - with his wife Mary (played exquisitely by the director's real-life \n    wife), chronicling their meeting, courtship, marriage, and family life. The \n    director also cast a virtual unknown newcomer to the role of the husband in \n    his candid view of the average man - a character lost in the midst of the \n    faceless masses. The film's director refused to pass judgment on the harsh \n    realities of life for the workaday couple, either by condemning or celebrating \n    the gloom of the bleak tragedy befalling them. Instead, he visually and eloquently \n    captured their believable human struggle as they lived their unidealized lives \n    and confronted disappointing setbacks, the tragic death of their daughter, \n    dashed hopes and brief triumphs, and eventually found comfort in the anonymity \n    of the masses, watching an unfunny theatrical clown act. To capture the authenticity of the city, the director sometimes used a 'hidden \n    camera' in his on-location shoots in New York. Stylistically, the film, in \n    various places, resembles the German expressionist films of F. W. Murnau and \n    Fritz Lang, although it also uses fluid and natural camera movements. King \n    Vidor received an Academy Award nomination as Best Director, and the film \n    itself was nominated as Best Unique and Artistic Picture in a short-lived \n    award category. Six years later, Vidor independently produced and directed \n    a 'talkie' sequel to The Crowd (intended as part of a film trilogy) \n    titled Our Daily Bread (1934) - it was a Depression-Era, hard-times \n    social drama about an idealistic man who was running a farm cooperative organized \n    as a socialistic society - in the country away from the crowd. The film's opening title heralds the celebration of July 4th in an anonymous \n    town in the year 1900:"
    },
    {
      "tag": "blockquote",
      "text": "The nation on holiday! Fireworks! Parades! Picnics! Celebrating \n    America's 124th birthday! - but what was a little thing like the Declaration \n    of Independence compared to the great event happening in the Sims household?"
    },
    {
      "tag": "p",
      "text": "In an upstairs bedroom where a midwife and family doctor attend the hero's \n    birth - a startlingly-realistic scene - the doctor lifts (feet-first) a naked \n    baby boy from its mother's bed and slaps it twice on its bottom. The infant \n    is wrapped in a blanket and brought to the arms of its proud, elated father:"
    },
    {
      "tag": "blockquote",
      "text": "There's a little man the world is going to hear from all right, \n    Doctor. I'm going to give him every opportunity."
    },
    {
      "tag": "p",
      "text": "To illustrate time passing, a row of dominoes - each marked with a year \n    - are toppled over, from 1900 to 1912."
    },
    {
      "tag": "blockquote",
      "text": "Johnny Sims reached the age of twelve. He recited poetry, played \n    piano and sang in a choir...so did Lincoln and Washington!"
    },
    {
      "tag": "p",
      "text": "Eight male school friends sit perched on a fencepost and talk about their \n    futures, many of which are already mapped out for them - even so, young twelve \n    year old Johnny is confident of his prospects:"
    },
    {
      "tag": "blockquote",
      "text": "White boy: What are you gonna be when you grow up, Whitey? Black boy: I detend to be a preacher man! Hallelujah! Nerdy-looking boy: I purpose to seek occupation as a cowboy. White boy: How 'bout you, Johnny Sims? Johnny: (Me?) My Dad says I'm goin' to be somebody big!"
    },
    {
      "tag": "p",
      "text": "A horse-drawn white ambulance wagon pulls up in front of the Sims house, \n    bringing an abrupt catastrophe to the boy's youth:"
    },
    {
      "tag": "blockquote",
      "text": "Jimminy crickets! It's stoppin' at your house, Johnny!"
    },
    {
      "tag": "p",
      "text": "An inquisitive crowd gathers outside as men carry a stretcher up to the \n    second floor. To accentuate the claustrophobic, narrow corridor of the home's \n    staircase, the camera is placed in a fixed position at the top of the stairs \n    for the sustained shot. No longer confident, Johnny is a tiny figure in the \n    long, tapering confines of the boxy entryway with walls that stretch away \n    - he is painfully overwhelmed by the funnelling void of his familiar flight \n    of stairs. He leaves the people crowded and huddled at the doorway and tentatively \n    starts the long climb up the steep steps to the top - to his questionable \n    future. At three-quarters of the way up, he pauses - a female relative from \n    above comes down to him, cradles him, and tells the newly-orphaned boy of \n    his father's premature death:"
    },
    {
      "tag": "blockquote",
      "text": "You must be brave now, little man...like your father would want \n    you to be."
    },
    {
      "tag": "p",
      "text": "\"When John was twenty-one he became one of the seven million that believe \n    New York depends on them.\" To bravely face his future, claim his birthright \n    and seek the dream his father always wanted for him, 21 year old John rides \n    the ferry to New York (Manhattan) with his name-labeled suitcase under his \n    arm - at the ferry railing while looking at the skyline, a gaunt passenger \n    cynically and ominously warns the naive yet ambitious young man of the depersonalized \n    metropolis and the myth of advancement there:"
    },
    {
      "tag": "blockquote",
      "text": "Passenger: You've gotta be good in that town if you want to beat \n    the crowd. Johnny: Maybe...but all I want is an opportunity."
    },
    {
      "tag": "p",
      "text": "In his sobering search for fame and fortune, John is immediately submerged \n    in the new capitalistic, uncaring environment - with its massive confusion \n    and overpowering size. The montage of the hustle and bustle of the city symbolizes \n    how engulfed, surrounded, isolated and insignificant he is - everything is \n    shot from his point of view. [High skyscrapers and traffic in a bustling, \n    crowded city was a novelty in 1928.] From a high angle, crowds of scurrying \n    pedestrians cross the city block at W 45th. Cars and bus traffic overwhelm \n    the thoroughfare. An endless movement of people, cars, vehicles, and elevated \n    trains speed by. Smokestacks spew plumes of white smoke from skyscraper tops \n    and from tugboats in the harbor. The camera moves further and further back \n    to encompass the exhilarating scope and vastness of the city, filled with \n    beehives of workers. Then, aimed at the top of a tall office building, it \n    rotates in a dizzying clockwise turn. One of the greatest impressionistic tracking shots in all of cinematic history \n    begins at the street level. The majestic shot tilts upward and smoothly travels \n    up the flat outside surface of a stone wall of a multi-windowed skyscraper \n    - one of many in the city. Suddenly, the office building rises and straightens \n    up outside one floor, and transports the viewer directly into one of its windows. \n    In a dissolve, the camera slides through the window into a large room filled \n    with a monotonous criss-crossing of hundreds of rows of identical office desks \n    and workers. The camera sweeps across the infinite sea of anonymous, business-attired \n    insurance company paper-pushers until it zooms in on our hero - one of many \n    wage-slaves seated amidst hundreds of other obedient and cowed clerks. Another \n    faceless victim of the city, John Sims' (James Murray) desk is labeled (in \n    closeup): \"John Sims 137.\" [In The Apartment (1960) , \n    director Billy Wilder paid homage to this image of a sea of desks for anonymous \n    workers.] He has in his hand a torn newspaper ad with an offer for \"One Hundred Dollars \n    Cash Prize\" if he can win the product-naming contest for the Sylvanian Oil \n    Company in New York: \"GIVE US A NAME FOR OUR NEW MOTOR FUEL.\" A few of his \n    clever, inventive ideas are 'Petrol-Pep' and 'Jazz-o-lene.' Impatiently, he \n    watches the wall clock - it is a few minutes before 5 pm. His life's comings \n    and goings are dictated by the giant time-piece. When the minute hand moves \n    to 5, the automaton workers leap up and scurry away from their desks for the \n    exit and swarm through office doors. In the washroom, the likeable young office \n    worker freshens up and combs his hair, and is aggravated when told identical \n    things by four different colleagues: \"Washin' 'em up, Sims?\", \"Takin' a wash, \n    Sims?\", \"Scrubbin' 'em up, Sims?\", and \"Chasin' the dirt, Sims?\""
    },
    {
      "tag": "blockquote",
      "text": "You birds have been working here so long that you all talk alike!"
    },
    {
      "tag": "p",
      "text": "His buddy Bert (Bert Roach) proposes a double date to Coney Island:"
    },
    {
      "tag": "blockquote",
      "text": "Bert: I've got a pair of wrens dated up for Coney Island. Want to \n    make it a four-some? John: Nothin' doin', Bert! I'm studying nights! Bert: Aw, come on! These babies have got what ain't in books! John: Well, I'll try anything once...but I ought to study."
    },
    {
      "tag": "p",
      "text": "They join the steady stream of regimented office workers in the hallway \n    who descend in a packed elevator to the lobby and eventually to the stream \n    of humanity swarming from the building into the street."
    },
    {
      "tag": "blockquote",
      "text": "John: You know, Bert...forgetting studies once in a while is good \n    for us business men. Elevator operator: Say, You! Face the front! John: This night-life is my speed, Bert Old Bean! We gotta do it often!"
    },
    {
      "tag": "p",
      "text": "Revolving doors from another office building spit out 20's flappers to awaiting \n  gentlemen. John's blind date, who is a friend of Bert's girl friend Jane (Estelle \n  Clark), is named Mary (Eleanor Boardman) - she is a plain-dressed, no-makeup, \n  dowdy, gum-chewing stenographer:"
    },
    {
      "tag": "blockquote",
      "text": "Jane...John! John...Jane! Mary...John! John...Mary!...Come on, Romeo! \n    Save something for the moonlight!"
    },
    {
      "tag": "p",
      "text": "To escape the confines of the city, they ride on the top of a double-decker \n    bus, taking the spiraling accessway up the back of the bus to get there (with \n    a few tasteless gags about peering up their dates' dresses). There, John has \n    a new perspective of himself from the bus' lofty heights:"
    },
    {
      "tag": "blockquote",
      "text": "John: Look at that crowd! The poor boobs...all in the same rut! Bert: Cut out the high-hat, John! Do your stuff! John: (to Mary, after putting his arm around her) I get a pain in the neck \n    from most people...but you're different."
    },
    {
      "tag": "p",
      "text": "They pass a down-and-out juggling clown on the busy street, with a sandwich \n    board sign plastered on his front: \"MAKE YOUR FEET HAPPY - Buy Your Shoes \n    at Brockton's\" - John, a cocky showoff, mocks the job of the man - a foreshadowing \n    of his own decline:"
    },
    {
      "tag": "blockquote",
      "text": "The poor sap! And I bet his father thought he would be President!"
    },
    {
      "tag": "p",
      "text": "John is well-suited for his date, and their relationship begins on a positive \n    note. The foursome reach the Coney Island amusement park where they joyously \n    ride the roller coaster, the barrel roll, the spinning wheel, the slide, the \n    merry-go-round, and the dark tunnel of love - where the men are expected to \n    make romantic moves on their dates:"
    },
    {
      "tag": "blockquote",
      "text": "Jane: (to Bert) Say, am I ridin' with you...or wrestlin'? Mary: (after John overwhelms her with many kisses) Gee...I oughtn't to let \n    you kiss me."
    },
    {
      "tag": "p",
      "text": "On the crowded subway ride home, Bert hasn't fared well with Jane, but Mary \n    is sleepily curled up in John's arms. A subway advertisement for a furniture \n    company in Newark, N.J. sparks an idea in John's head: \"YOU FURNISH THE GIRL \n    - We'll Furnish the Home!\""
    },
    {
      "tag": "blockquote",
      "text": "Mary, let's you and me get married. (She wakes up and stares back \n    at him.)"
    },
    {
      "tag": "p",
      "text": "The next scene opens with a fade-in on a pan down a railroad sign for \"The \n    Niagara,\" a special train which departs at 8:30 pm for the destinations of: \n    \"POUGHKEEPSIE, HUDSON, ALBANY, SCHNECTADY, UTICA, SYRACUSE, ROCHESTER, BUFFALO, \n    NIAGARA FALLS.\" Well-wishers throw rice and carry a \"Just Married\" sign. John \n    and Mary are leaving Grand Central Station on a sleeper train bound for Niagara \n    Falls for their honeymoon."
    },
    {
      "tag": "blockquote",
      "text": "Bert: (to John) Don't forget to pull down the shades! Mary: (to her mother - played by Lucy Beaumont) Don't cry, Mother! This isn't \n    my funeral! (to her brothers Jim (Daniel G. Tomlinson) and Dick (Dell Henderson)) \n    Jimmy, you and Dick stay home nights with Mom...like good brothers, won't \n    you? Bert: (cynically and non-chalantly, after they have left) Well, I'll give \n    them a year...maybe two."
    },
    {
      "tag": "p",
      "text": "In their sleeper compartment, the two newlyweds discuss their dream Model \n    Home as they view a magazine ad. Idealistic and confident, John boasts enthusiastically \n    that he will work his way to the top:"
    },
    {
      "tag": "blockquote",
      "text": "That's the home we're going to have, Honey...when my ship comes \n    in."
    },
    {
      "tag": "p",
      "text": "The sequence in the sleeper accentuates, in a tawdry, predictable way, their \n    embarrassment and reluctance about retiring together on their wedding night. \n    Eventually, they find their way into the same berth for the night. The next scene is a full panoramic shot of Niagara Falls where the roaring \n    water cascades over. The happy couple breathlessly climb up the edge of the \n    precipitous cliff in front of the plunging, relentless flow of water - there \n    on a tiny plot of grass, he spreads out a blanket for a picnic lunch and takes \n    a few snapshots of her posing in front of the raging falls. Rapturous, Mary \n    lies back in the grass - John joins her and they lie together in a tender \n    moment of embrace and promise:"
    },
    {
      "tag": "blockquote",
      "text": "John: You're the most beautiful girl in all the world! My love will \n    never stop, Mary. It's like these falls."
    },
    {
      "tag": "p",
      "text": "Created in 1996-2006 © by Tim Dirks. All rights reserved."
    },
    {
      "tag": "blockquote",
      "text": "BEGIN STANDARD TAG CPX - 468 x 60 BOTTOM - greatestfilms.org: Run-of-site - DO NOT MODIFY END 468x60 BOTTOM TAG"
    }
  ]
}