{
  "url": "http://www.findarticles.com/p/articles/mi_m0FKX/is_1-2_39/ai_n6146847/pg_7",
  "content_hash": "fdd665e103b3af20d75ab5020cd9b02c4891bd3c170bb8af755b21245fbc825a",
  "total_blocks": 138,
  "retained_blocks": 11,
  "ignored_blocks": 127,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd \" Home Advanced Search IN free and premium articles free articles only premium articles only this publication Reference & Education Arts & Entertainment Automotive Business & Finance Computers & Technology Health & Fitness Home & Garden News & Society Reference & Education Sports"
    },
    {
      "tag": "p",
      "text": "FindArticles > Publications > Free > Reference & Education > Eire-Ireland:Journal of Irish Studies > Spring-Summer, 2004 > Article"
    },
    {
      "tag": "div",
      "text": "BEGIN Insight XE END Insight XE WEBSIDESTORY CODE HBX1.0 (Universal) COPYRIGHT 1997-2004 WEBSIDESTORY,INC. ALL RIGHTS RESERVED. U.S.PATENT No. 6,393,479B1. MORE INFO:http://websidestory.com/privacy END WEBSIDESTORY CODE"
    },
    {
      "tag": "p",
      "text": "Content provided in partnership with"
    },
    {
      "tag": "div",
      "text": "FIND IN free and premium articles free articles only premium articles only this publication Reference & Education Arts & Entertainment Automotive Business & Finance Computers & Technology Health & Fitness Home & Garden News & Society Reference & Education Sports Advanced Search Find Magazines by Topic Arts & Entertainment Automotive Business & Finance Computers & Technology Health & Fitness Home & Garden News & Society Reference & Education Sports"
    },
    {
      "tag": "h1",
      "text": "Standish James O'Grady: between imperial romance and Irish Revival"
    },
    {
      "tag": "div",
      "text": "Eire-Ireland:Journal of Irish Studies , Spring-Summer, 2004 by Patrick Maume google_ad_section_start << Page 1 Continued from page 6. Previous | Next"
    },
    {
      "tag": "p",
      "text": "The Elizabethan parallel reflects a longstanding interest, awakened by childhood encounters with Beara traditions of the 1601 siege of Dunboy and the chieftain Donal O'Sullivan Beare. O'Grady claimed that as a boy he asked an old man about the Gaelic chieftains, expecting tales of heroic valor, and was shocked to hear them called tyrants. (39) From the late 1880s O'Grady published on the subject. His arguments provoked unionists and nationalists alike. O'Grady attacked the view, deriving from seventeenth-century historians such as Philip O'Sullivan Beare and the Four Masters and taken up by contemporary nationalists such as the Sullivan brothers (proud natives of Beara), that the chieftains who opposed Elizabeth led the Irish people in a fight for faith and fatherland against alien tyranny. O'Grady argued that they sought dynastic interests against a centralizing state. Chieftains represented as nationalist heroes pledged loyalty to the crown in the State Papers; he professed dismay that even Brian \"of the Battleaxes\" O'Rourke, whom O'Grady initially regarded as one of the few disinterested patriots involved, insincerely proffered loyalty to the crown, which executed his father, betraying associates as occasion suited. (40) Many rebellions were negotiating gambits \"like a petition to parliament in our own day,\" recognized as such by the crown if the rebels did not seek foreign aid. (41) O'Grady claimed the majority of the Irish people supported the crown. Trading towns preferred peace and security from a strong state; the common people found it less exacting than warring chieftains; many chieftains supported the crown from hostility to a tyrannical superior or usurping rival. (42) The rebel chieftains lost because they were united by no principle and betrayed one another from opportunism. (43) Hugh O'Neill was their only statesman, no better than his royalist counterparts; (44) Red Hugh O'Donnell (at least in his youthful escapes from captivity) their only hero--and O'Grady pointed out that Red Hugh's title was uncertain and that Nial Garbh O'Donnell, denounced by nationalists as a traitor, might legitimately claim a better right. (45) The priests and Jesuits who sided with the rebels were indeed heroes inspired by an ideal; their histories projected that ideal onto their unworthy allies. (46) Nationalists found this interpretation disturbing. O'Grady's lecture on Elizabethan Ireland at Alexandra College in 1895 stirred up a lengthy correspondence in the Parnellite Irish Independent. Many participants denied that an Irish majority supported Elizabeth; others retorted that a majority supported Gladstone against Parnell. (47) As late as 1938, Michael Tierney protested that Sean O'Faolain's view of the Gaelic tradition as incompatible with modern statecraft revived O'Grady's apologia for conquest."
    },
    {
      "tag": "div",
      "text": "Advertisement"
    },
    {
      "tag": "p",
      "text": "O'Grady's work could be used in the unionist case that the Irish had not created a state until the British imposed one that only unionists were competent to maintain, and that nationalist political incompetence nullified numerical superiority. In April 1889, when Ireland was convulsed by the Plan of Campaign, O'Grady wrote in the English Historical Review on \"the Last Kings of Ireland,\" offering a similar interpretation of Irish dynastic conflicts in the eleventh and twelfth centuries. The Weekly Mail commented that the last High King, Roderick O'Connor, subdued Connacht \"in a perfectly Balfourian manner,\" resembling the law enforcement activities of the contemporary RIC in the same province \"while hot water and pitchforks are freely allowed to the defenders of 'humble homes'.\" The editorialist noted how after the Battle of Clontarf Brian Boru's army was ambushed by"
    },
    {
      "tag": "div",
      "text": "Previous - 1 - 2 - 3 - 4 - 5 - 6 -\n 7 - 8 - 9 - 10 - 11 - 12 - 13 - 14 - 15 - 16 - 17 - 18 - Next google_ad_section_end Find Featured Titles for:\nNews & Society <table width=\"320\" border=\"0\" align=\"right\" cellpadding=\"0\" cellspacing=\"0\" style=\"margin-top:-8px;\">\n  <tr>\n    <td width=\"75\" align=\"right\" style=\"padding-left:3px;\">&nbsp; </td>\n    <td width=\"75\" align=\"right\">&nbsp; </td>\n    <td width=\"75\" align=\"right\">&nbsp; </td>\n    <td width=\"60\" align=\"right\">&nbsp; </td>\n  </tr>\n</table> Advocate, The Air & Space Power Journal Air Force Journal of Logistics Air Force Law Review Air Force Speeches Airman All Hands American Forests American Journal of Economics and Sociology, The Approach Ebony Mother Jones National Review New Statesman Reason Washington Monthly Find Research Guides for: Abortion ADHD AIDS Alternative Energy Alternative Medicine Cancer Capital Punishment Cloning Hate Crime Cryonics Drug Abuse Eating Disorders Gay Issues Global Warming Holidays Immigration Medical Mental Health Real Estate Stem Cells Women's Health Men's Health <div id=\"leaderboard\">\n<span>Advertisement</span><br />\n</div> <div id=\"bottomSearch\">\n<form action=\"/p/search\" name=\"searchBottom\" onsubmit=\"return isImageQuery(document.searchBottom.qf[document.searchBottom.qf.selectedIndex].value, document.searchBottom.qt.value);\">\n<table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" align=\"center\">\n<tr>\n<td><input type=\"search\" name=\"qt\" value=\"\" size=\"25\" maxlength=\"100\"/><input type=\"hidden\" name=\"tb\" value=\"art\" />&nbsp;</td><td><strong>IN</strong>&nbsp;</td><td></td>\n<td><input style=\"margin-left:4px;margin-top:2px;\" type=\"image\" src=\"/i/us/btn-look.gif\" value=\"Search\" />\n</td></tr></table></form>\n</div> © 2006 FindArticles™ - LookSmart, Ltd. · About Us · Privacy Policy · Terms of Service · Advertise with Us · Site Map · RSS Site Map"
    }
  ]
}