{
  "url": "http://www.foe.co.uk/pubsinfo/infoteam/pressrel/1997/19970403134300.html",
  "file_number": "427",
  "content_hash": "48ecad7268c343d7d243e44af27ed2826f47d5e44be11321be39bb57334231f8",
  "total_blocks": 52,
  "retained_blocks": 20,
  "ignored_blocks": 32,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\"\r\n    \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" #BeginTemplate \"/Templates/press_release.dwt\" DW6 Skip navigation and title"
    },
    {
      "tag": "p",
      "text": "Home: Press \r\n            releases: #BeginEditable \"year\" year begin 1997 year end #EndEditable"
    },
    {
      "tag": "div",
      "text": "#BeginLibraryItem \"/Library/top_links.lbi\""
    },
    {
      "tag": "p",
      "text": "Search | Sitemap | Contact"
    },
    {
      "tag": "div",
      "text": "#EndLibraryItem #BeginLibraryItem \"/Library/main_drop_menu.lbi\" Home ---------------- Join ---------------- Campaigns: Biodiversity Climate Corporates Global Trade Policy & Research Real Food Transport Waste ---------------- Local campaigns ---------------- Press for change: Jobs Volunteering ---------------- Publications ---------------- Press Releases ---------------- About Us ---------------- Links ---------------- Contact Us #EndLibraryItem"
    },
    {
      "tag": "h2",
      "text": "#BeginEditable \"title\" Press release title no tags begin LABOUR MANIFESTO 'GREENER THAN TORIES' SAY FOE Press release title no tags end #EndEditable"
    },
    {
      "tag": "p",
      "text": "#BeginEditable \"date\" Date of press release begin Date of press release end #EndEditable"
    },
    {
      "tag": "div",
      "text": "#BeginEditable \"body\" $documentbodystart"
    },
    {
      "tag": "p",
      "text": "Friends of the Earth today (3/4/97)  welcomed the publication of the Labour Party manifesto as stronger on environmental programmes than the Conservatives. Charles Secrett, Executive Director of Friends of the Earth, said: \"This is the greenest general election manifesto ever produced by the Labour Party,although there are significant omissions.  It is much stronger on environmental programmes, and reveals a deeper understanding of environmental priorities, than the Conservative manifesto published yesterday.  It is full of general policy commitments to green energy, industry, agriculture, and international institutions that should be sweet music to the ears of  environmentalists all over the country. Friends of the Earth warmly welcomes Labour's recognition that environmental priorities must be fully integrated with all other policy areas, and the environmental agenda must be delivered across Westminster and Whitehall.  We are pleased that the public health, jobs and export opportunities of cutting pollution and conserving resources are clearly spelled out and that Labour will regulate to clean up the environment. But it is not all good news.  There are significant omissions, a worrying lack of detail and a weasly choice of words in some areas, notably over transport priorities and green tax reform. It is a big mistake not to have set goals to reduce traffic levels or guarantee environmental rights for all citizens.  We do not understand how Labour can meet its strong CO2 reduction target, while lowering energy prices by reducing VAT on fuel use to 5%. FOE also regrets the lack of more specific targets and timetables to cut pollution and waste,similar to its welcome commitment to cut CO2 emissions by 20% by 2010.  For Labour to fulfill its promise to be 'the greenest Government yet' it must set out detailed policy goals,backed up by specific tax, expenditure and regulatory action programmes. At long last, Labour has thrown down a green gauntlet to the Liberal Democrats.  Overall,Labour's manifesto challenges the Liberal Democrats' record as the greenest of the mainstream Parties in the UK.\" ENDS"
    },
    {
      "tag": "div",
      "text": "[Index]"
    },
    {
      "tag": "p",
      "text": "$documentbodyend"
    },
    {
      "tag": "div",
      "text": "#EndEditable"
    },
    {
      "tag": "p",
      "text": "2006 , 2005 , 2004 , 2003 , 2002 , 2001 , 2000 , 1999 , 1998 , 1997 , 1996 , 1995 , 1994 Press releases delivered direct to your inbox Your email address: News by RSS ?"
    },
    {
      "tag": "div",
      "text": "#BeginLibraryItem \"/library/send_page.lbi\" #EndLibraryItem #BeginLibraryItem \"/library/contact details.lbi\""
    },
    {
      "tag": "p",
      "text": "Contact details: Friends of the Earth 26-28 Underwood St. LONDON N1  7JQ Tel: 020 7490 1555 Fax: 020 7490 0881 Email: info@foe.co.uk Website: www.foe.co.uk"
    },
    {
      "tag": "div",
      "text": "#EndLibraryItem"
    },
    {
      "tag": "p",
      "text": "#BeginEditable \"Author\" Media team #EndEditable"
    },
    {
      "tag": "div",
      "text": "#BeginLibraryItem \"/Library/foot.lbi\""
    },
    {
      "tag": "p",
      "text": "Copyright © Friends of the Earth | Contact Us | Support Friends of the Earth"
    },
    {
      "tag": "div",
      "text": "#EndLibraryItem #EndTemplate"
    }
  ]
}