{
  "url": "http://www.foejapan.org/en/aid/jbic02/sondu-miriu/letter-pm01082001.htm",
  "file_number": "429",
  "content_hash": "8dd5fb47e21af1694f21bb8a16f53a54908e5bccff2d6945ea874a003186c609",
  "total_blocks": 179,
  "retained_blocks": 3,
  "ignored_blocks": 176,
  "blocks": [
    {
      "tag": "div",
      "text": "^Cgoi[Jn ^Cgoi[I {fB[Jn Kenya;the \n          Sondu-Miriu Hydropower Project Letter from Argwings Odera to Prime Minister Mori \n          (January 08,2001)"
    },
    {
      "tag": "p",
      "text": "Dear Mr Prime Minister, This is the most painful letter Ihave ever written. Painful because the middle finger of my left hand \n            is fractured. Broken on December 26 by Konoike security guards near \n            the Sondu-Miriu Hydropower Project in Nyanza, Kenya. This fracture \n            was made worse by Kenya police who tortured me. It was then aggravated \n            by fellow hardcore inmates who beat me on orders from the police. My left shoulder aches. The outcome \n            of a bullet graze that was aimed for my head by Kenya police on the \n            same date. It was meant to be fatal, Iwas told by police commander \n            Kola of Ahero police station. He told me: gMy orders were to shoot \n            you dead. Iwould have been charged with murder. Then Iwould have \n            spent seven years in prison. Iwas going to come out definitely. But \n            when do you think you would have come out of your grave?h What am Italking about? Perhaps Ihave put the proverbial cart before the horse. Iintroduce myself. My name is Argwings Odera. Iam the \n            person co-ordinating the human rights campaign in Nyanza and efforts \n            to save the Sondu-Miriu river from the overwhelming negative impacts \n            of a 80 MW hydropower project initiated in 1999. This is a project \n            funded by the Japanese government. Over 200,000 people are affected \n            negatively. This is the third time Iam being \n            arrested because of our activities at the project. We were first arrested \n            and detained for two days sometimes in November 1999. Then we were \n            arrested again, with about 20 others, on February 28, 2000, detained \n            for a day at Ahero police station and released without charge. What did Ido this time round? Mine \n            was a case of shoot the messenger before he delivers the news. My \n            colleagues and Ihad held a meeting on December 19 with the country \n            representative of JBIC in his Nairobi offices. We outlined the problems \n            of Sondu-Miriu. The representative listened to us for two hours. Then \n            he spoke for thirty minutes. Among the things he said was that \n            we go to Sondu and inform the affected community of an impending meeting \n            with top Japanese officials. We told him of our fears. He guaranteed \n            that he would end the harassment in the project area and protect us \n            from further arrests. Thus it was with joy that Iset out \n            December 26 to be the bidder of good news to members of the community. \n            Idid not have any foreboding as Idrove from Nairobi for 500 kilometres \n            to the project area. At around midday, Iwas snaking up \n            the dusty road towards a nearby shopping centre called Apoko. Ioffered \n            a lift to three villagers who were walking up the hilly and windy \n            15 kilometres to the shopping centre. At the centre, one of them informedf \n            he was going acrossd the river, another four kilometres, over the \n            bridge built by Konoike. This bridge, according to project documents, \n            was meant to benefit members of the local community who did not have \n            to spend any more money on the ferry operators. Iwas stopped at the bridge by security \n            guards who told me Iwas unwanted in that area and that our project \n            vehicle had been banned from using the road. Ileft the villager to \n            walk across the bridge. Iturned the vehicle and was flagged down \n            by another villager who requested Itake him to the shopping district. \n            Iobliged. The time was 12.30 pm, December 26. \n            As Idrove back towards the shopping district, about a kilometre from \n            the bridge, a big green gravel mixing truck came thundering towards \n            me. On my left was deep depression. We drive keeping left. On my right \n            was a mountain wall. The vehicle was steered directly towards me. \n            Isteered right. The left side of my car was hit, the side mirror \n            cluttered into the deep ravine. There was dust all over. Another vehicle, a van, came behind \n            me and blocked my path. Two Konoike security guards emerged \n            from the haze. They were waving their walkie-talkies menacingly. Iidentify one as Charles O. Ogutu and another as Mike Gundo. Ican \n            identify the rest by sight. All Icould hear them say was: gYou are \n            the inciters. Today you will see fire ch That was before Ispat out blood when \n            the guards punched me, secifically Ogutu, in the mouth. The villager \n            was shocked. He was yanked out of the car, beaten and kicked into \n            the depression. Ionly saw his white shirt disappearing beneath me \n            as he rolled over and over. It was at that moment that Ilocked myself \n            in the car and rolled up the windows. The Konoike guards stoned the \n            car in a bid to break in. They only stopped when they saw villagers \n            appearing over the hills with machetes. They radioed for reinforcement. At 1.30 pm, five armed policemen appeared \n            with a vehicle. Iwas still sandwiched between the two cars. The police \n            leader ordered me to open the doors of the vehicle. Instead, Iopened \n            a small section of the window. Iheard Ogutu urge him to shoot me \n            dead in the car. gShoot him c shoot him. Kill him. \n            He has stopped our money from coming. Kill him!h That is all Iremember \n            hearing. Itold the policemen to let me know \n            if Iwas under arrest and to show me the arrest warrant. Itold him \n            Iwas afraid to open the window further because the Konoike guards \n            had just broken my finger, and Idid not want them to break another \n            finger. The policeman stepped back and talked over his walkie-talkie. \n            Four policemen had surrounded the vehicle with their guns cocked. Iwas dehydrating fast because Iwas \n            confined in the car under the sweltering tropical heat. At 3.30 pm, more policemen, all armed \n            came. The number Icounted rose to about 30. The number of villagers \n            was also swelling as word spread across the villages about what was \n            happening to me. One policeman identified himself as \n            Kola, the Ahero police commander. He ordered me to open the doors \n            to the vehicle. Iasked him if Iwas under arrest. He said he just \n            wanted to have a word with me. Itold him we could speak through the \n            small crack because my finger had been broken and Iwas afraid the \n            Konoike guards, who were hovering around, would break the other fingers. He got angry and declared Iwas under \n            arrest. He ordered me to open the door of the vehicle. Itold Iwould \n            gladly follow the policemen to the station but no armed policeman \n            would be allowed to enter inside the vehicle as per office regulations. Iremember him saying: gWho do you \n            think you are? You think you are gold? Iwill call a towing vehicle \n            at your own expense!h The number of armed policemen, machine \n            guns, rifles and pistols, had swelled to about 50. The number of villagers \n            had also increased to more than 500 people. At 6.45 pm the angry villagers started \n            throwing stones towards the policemen who fled the scene. Iwas later \n            told the recovery vehicle had just come and was preparing to tow my \n            vehicle. Icould not see it because Iwas sandwiched between the two \n            big vehicles. Apparently the villagers had vowed that the police would \n            not take me anywhere. At 7.15, darkness crept. Iam told \n            the villagers were afraid the police would use the cover of darkness \n            to harm me. The villagers lit three pressure lanterns which illuminated \n            the area very well. They settled for a night-long vigil. At around 8.30 pm, Iheard movement \n            on the left side of my car. Then Iheard instructions being given. \n            Iheard something like gFire in the car c if it gets him, too bad! \n            Fire three shots that side and you fire twa c twa c twa the other \n            side.h Horrified, Iopened the passenger \n            side window to tell the police not to shoot at the villagers because \n            Isurrender. The next thing Isaw was a black figure with an AK-47 \n            aimed at me. Everything else happened in slow motion. Icould see myself laughing and telling \n            myself Iwas not meant to die this way. Meanwhile, Istarted dropping \n            down. The floor of the car was so far way. And there was a lot of \n            heat on the left side of my body. My eyes were clogged with glass. My \n            nose was bleeding, also clogged with glass. There was strong smell \n            of metal, Iguess gunpowder. Icould see my head rushing towards one \n            of the Konoike vehicles that had blocked my path, the door opened. Icould see fire flies all over. Except \n            this time the flames were ugly. They were red and Sparking instead of the beautiful \n            light yellow. Iremember assuring myself that the villagers would \n            be safe. But Iwas having difficulty breathing because Ihad been \n            kicked into the floor of the Konoike van which was still carrying \n            Mr Ogutu, the Konoike security man. The vehicle was being driven too \n            fast and somebody kept punching my ribs from the back. The police later said they had fired \n            over 100 bullets which Iwas to pay for. The Konoike vehicle was stopped 15 \n            kilometres from the site of my arrest. Ogutu said he had to kick in \n            two of my teeth. The policemen escorting me pleaded with him not to \n            do that because their boss knew the condition Iwas in when Iwas \n            arrested and they would lose their jobs if Iarrived in a different \n            condition. He was promised there will be enough room to beat me when \n            we reached the Ahero police station. Ilost track of time at that moment. Iwas kicked into the police station \n            from the van. There Iwas received with blows and kicks by a Mr Otieno, \n            the district criminal investigation officer. Iwas immune to pain \n            at that time. Icould not see. My hearing was bad. Iheard him say \n            Iwas going to die from my bullet wound. That is when Irealisedf \n            my T-shirt was glued on the left side of my body. It was wet and cold. \n            But Icould not see, rolling my eyeballs would cause a great deal \n            of pain. Iwas stripped naked and taken to \n            a room where Iwas told the police would plant a letter on me that \n            Iwas planning to bomb the construction site. Otieno and other policemen \n            asked me if Iwas ready to confess that Iwas the Sondu bomber. Isad no. Iwas lashed but felt no pain because my whole body was throbbing. That is when they noticed my broken \n            finger. Somebody grabbed the finger and twisted it demanding Iconfess. \n            Now there was real pain. Iscreamed. The police said as a journalist, \n            Iwill never type again. Somebody punched my wounded shoulder. Iscreamed \n            again. Somebody ordered Istop screaming and start singing a popular \n            local song titled Malo! Malo! (Higher! Higher!). Iknew the song that \n            night. Isang with every stab of pain on my shoulder or finger. Iwished they could just go on kicking me and punching me and leave \n            the shoulder and finger alone. Iheard Ogutu saying my future was \n            ruined because he was going back with a group of police officers to \n            shoot at the men and rape their women. Their blood would be in my \n            hands. Ithink at around 1 am, Iwas thrown \n            in jail. The inmates had been ordered to beat me up because Iwas \n            bringing trouble to the government. Ilanded into more fists and clawing \n            hands the moment Iwas thrown in jail. It was at that moment the inmates \n            noticed my dislocated and broken finger. Afraid they had broken the \n            finger, five of them pinned me down as one yanked the digit back into \n            place. Iscreamed. Adirty rag was shoved in my mouth to muffle the \n            scream. Then they noticed my eyeful of glassses. \n            Iwas pinned down again and another licked the eyeballs, spitting \n            in the sloth bucket all the time. Because Idid not want the rag shoved \n            in my mouth, Iscreamed inwardly. Iam nursing horrible thrashes and \n            wounds on the lips. But Iwas glad for what they did. \n            They then peeled off my shirt to inspect the bullet wound. One of \n            them produced a colgate toothpaste which was smeared over the wound \n            so that it dries over the wound. Then they demanded to be told what \n            Ihad done. The next day, Iwas ordered to empty \n            the full sloth bucket. Naked, bare feet, Iwalked into a filthy toilet, \n            now half blind, where Iemptied the sloth bucket. Later in the day, \n            Iwas summoned from the cell block. Iwas informed Iwas going to \n            sing again. Isang amid pain and torture. This \n            time Isaw Otieno, the investigating officer, making orders for my \n            beating. Suddenly, all the police stopped beating me and saluted. \n            At the door was a senior intelligence officer ? the people who report \n            directly to State House and the president. Iwas taken to another \n            room where this man, he is kind, interrogated me for four hours. He \n            did not beat me. He asked such questions like preferred sex position. This is also the day the beating officially \n            stopped. The station commander, Kola, however kept on reminding me \n            that he was yet to give me 10 strokes of the cane. My request to be \n            seen by a doctor were turned down. My request for my clothes were \n            turned down. Iwas only given my jeans trouser. Came December 28 and we were close \n            to 100 people in the cell. Water was brought in a bucket to wipe the \n            floor. The hardcore inmates used it to bath before assigning people \n            duty to wipe the floor of the lice infested jail. Came the 29 th and Iwas \n            in the privileged circle. Iwas allowed to bath with the dirty water \n            and wipe myself with soap. Other prisoners merely looked on enviously. This was the same day Iwas removed \n            from Ahero in a hide and seek game between the police and my lawyer. \n            Iwas moved 30 kilometeres away to the Kisumu jail, kept incomunicado \n            before being transferred 50 kilometres away to Maseno. Again Iwas denied the opportunity \n            to see a doctor, to bath or to sit in the sun. Ispent 30 th , \n            31 st and January 1, 2000 with nobody knowing my whereabouts. \n            Iwas not tortured at Maseno. Iwould just drift into sleep, back \n            into wakefulness and back into sleep. Ilost a lot of weight for lack \n            of water. It was then on December 2, that Iwas produced in court, injured, wounded and beaten, charged with resisting \n            arrest, incitement to violence, tresspass and taking photographs and \n            publishing false information to Japan. What lesson did Ilearn from all this \n            punishment as Ipainfully reflect on what happened to me? That the \n            will of the people of Sondu-Miriu shall prevail! @"
    },
    {
      "tag": "div",
      "text": "@ @ Go \n                to the Index on this Project {fB[Ij[Jn FoEJ \n        HOME PROGRAM \n        HOME SITEMAP LINK EMAIL j[I"
    }
  ]
}