{
  "url": "http://www.foodproductdesign.com/current/0505CON.html",
  "content_hash": "6fef5c23f53310b050b60cb2082083ef4177210b062c11ec8ed9a4651fdcbbad",
  "total_blocks": 205,
  "retained_blocks": 23,
  "ignored_blocks": 182,
  "blocks": [
    {
      "tag": "div",
      "text": "[if IE]>\r\n<LINK REL=\"stylesheet\" href=\"/ie_styles.css\">\r\n</style>\r\n<![endif] start content Home | Blog | Buyer's Guide | Webinars | Media Kit | Subscribe | Free Newsletter | Contact Us body start"
    },
    {
      "tag": "p",
      "text": "left nav bar Navigation"
    },
    {
      "tag": "div",
      "text": "Home Article Categories Food Product Categories Ingredient Types Industry Insights Functionalities-Functions Company and Consumer Issues Blog Buyers Guide Search Get Listed Webinars Media Kit Print Media Kit Online Media Kit E-Book Series Subscribe Contact Us"
    },
    {
      "tag": "h3",
      "text": "Food Product Categories"
    },
    {
      "tag": "div",
      "text": "Bakery Products Beverage Products Breakfast Foods Confectionery Products Dairy Products Demographic Foods-Focus Dessert Products Fried Foods Grain, Pasta, Legume and Tuber Products Meat and Meat-Related Products Miscellaneous Products Nutraceuticals-Healthful Foods Prepared-Frozen Foods Sauces, Gravies, Dressings, Soups Snack Foods"
    },
    {
      "tag": "h3",
      "text": "Ingredient Types"
    },
    {
      "tag": "div",
      "text": "Acidulants Colors Dairy-Based Ingredients Emulsifiers Enzymes Fats and Oils Fiber Flavoring Agents-Enhancers Flavors Fruit-Fruit Preps Grains, Pasta and Legumes Gums and Starches Miscellaneous Ingredients Nuts Proteins Spices and Seasonings Sweeteners Vegetables Vitamins and Minerals"
    },
    {
      "tag": "h3",
      "text": "Industry Insights"
    },
    {
      "tag": "div",
      "text": "Culinary Connection Design Applications Flavor Prints Focus on Foodservice Food-Industry Perspectives Foodservice-Agribusiness Front Ingredient Insight Nutrition Notes World Fare"
    },
    {
      "tag": "h3",
      "text": "Functionalities-Functions"
    },
    {
      "tag": "div",
      "text": "Dry Mixing-Spray Drying Fat-Calorie Reduction Flavor Enhancement Flavoring Fortification-Nutrition Manufacturing-Processing Aids and Issues Microwave Issues-Applications Mouthfeel Packaging Issues Stability Viscosity-Water Control"
    },
    {
      "tag": "h3",
      "text": "Company and Consumer Issues"
    },
    {
      "tag": "div",
      "text": "Computerization Food Safety General Product Development Issues QA-QC R&D Management Regulatory-Labeling Issues Sensory Testing-Evaluation Supplier Partnering Technology"
    },
    {
      "tag": "p",
      "text": "end left nav bar"
    },
    {
      "tag": "h2",
      "text": "Page cannot be found"
    },
    {
      "tag": "p",
      "text": "The page you requested cannot be found. The page you are looking for might have been removed, had its name changed, or is temporarily unavailable."
    },
    {
      "tag": "div",
      "text": "Please try the following: If you typed the page address in the Address bar, make sure that it is spelled correctly. Open the www.foodproductdesign.com home page and look for links to the information you want. Use the navigation bar on the left to find the link you are looking for. Click the Back button to try another link."
    },
    {
      "tag": "p",
      "text": "Still cant find what you are looking for? Please use the search bar to find the topics you are looking for."
    },
    {
      "tag": "div",
      "text": "Search for: Sort By : Relevance Date left nav bar Search FPD"
    },
    {
      "tag": "h2",
      "text": "Current Issue Functional Foods Annual E-Book Series"
    },
    {
      "tag": "div",
      "text": "Formulating Glycemic Strategies Email Newsletter Email Address: Manage \r\n\t\t\t\t\t\t\t\t\t\t\tSubscriptions Begin Poll Pro Poll Monthly Poll Begin Poll Pro Poll"
    },
    {
      "tag": "p",
      "text": "Are you satisfied with the current FDA qualified claim system? Yes No"
    },
    {
      "tag": "div",
      "text": "View Results End Poll Pro Poll End Poll Pro Poll Advertiser Links end left nav bar END body Food Product Categories Ingredient Types Industry Insights Functionalities-Functions Company and Consumer Issues copyright info Copyright 2006 Virgo Publishing . Please read our legal page before using this site. END copyright info END content Begin Google Script End Google Script"
    }
  ]
}