{
  "url": "http://www.geocities.com/CollegePark/6174/eat-dog-groak.htm",
  "content_hash": "b20c3185703119e8156e98bd2586921f128ccace2431f66d78e7d0d253515d78",
  "total_blocks": 7,
  "retained_blocks": 4,
  "ignored_blocks": 3,
  "blocks": [
    {
      "tag": "h1",
      "text": "Trying to Eat While a Dog Groaks You"
    },
    {
      "tag": "h3",
      "text": "by Bill Hall, Lewiston, Idaho Tribune, December 9, 1992"
    },
    {
      "tag": "pre",
      "text": "If you own a dog, you know what it's like to be groaked.\r\n\r\n\t\"Groak\" is an old word meaning to stare at somebody longingly while he\r\n\tis eating.\r\n\r\n\tDogs are the champion groakers of all time, and the most obnoxious.  But\r\n\tthe season, rather than the dog, reminds me of the word.  There is an\r\n\telement of groaking in keeping up with the Joneses, which is a lot of\r\n\twhat decides Christmas shopping purchases in any given year.\r\n\r\n\tThe neighbor's kid is going to get a little rubber troll with wild\r\n\thair.  And so if your kid doesn't get one, she'll be sitting outside the\r\n\tneighbor's picture window for days on end groaking the kid who did get\r\n\tone.  Similarly, you buy your wife a pair of those elegant slippers with\r\n\tthe flashlights built into the toes because you don't want her groaking\r\n\tall the other women in the neighborhood who will be getting them.\r\n\r\n\tAnd more in keeping with the traditional meaning of the word, if I don't\r\n\tget at least a couple of chocolate chip cookies for Christmas I'm going\r\n\tto come over to your house and groak you while you eat yours.  Anybody\r\n\twho would sit and stuff chocolate chip cookies into her face without\r\n\tsharing deserves to be groaked.\r\n\r\n\tThat is classic groaking in the canine manner.  But in sad truth, I\r\n\tsuppose the word groak may have come originally from heartfelt scenes of\r\n\thungry children staring through the windows of restaurants watching\r\n\tothers eat.  But that has nothing to do with the groaking of dogs in\r\n\tthis fortunate society.  The sort of dog who groaks is the sort of dog\r\n\twho doesn't need the food.  A truly hungry dog will go out and kill a\r\n\tgarbage can.  But a groaking dog doesn't do it to eat.  He does it to\r\n\tirritate.\r\n\r\n\tI have had several dogs who understood full well how difficult it is to\r\n\teat while some slobbering simpleton stares earnestly at you with the\r\n\tlook of a waif losing a fight with malnutrition.\r\n\r\n\tI have had dogs so consistently inconsiderate about that sort of thing\r\n\tthat I made it a point to feed them first before sitting down to consume\r\n\tmy own dinner.  And of course, you know how much good that did.\r\n\r\n\tIt wasn't the food they wanted; it was the exasperation.  It is not easy\r\n\tto eat with two pathetic, unblinking eyes focused on your every move.\r\n\tIt isn't easy doing anything in that situation.\r\n\r\n\tI have had dogs groak me while I was reading.  And it wasn't the book\r\n\tthey wanted.  Dogs can't read.  And they can't learn to read though I\r\n\thave heard otherwise sensible people talk about how smart dogs are\r\n\twithout reflecting on the unassailable fact a dog can't read.\r\n\r\n\tA dog groaks you while you are reading, not because it wants the words\r\n\tyou  are consuming, but because it wants the attention you are wasting\r\n\ton a book.\r\n\r\n\tAnd it succeeds.  Have you ever tried to read with two hot eyes a few\r\n\tinches from your face and a ripe breath in your face?\r\n\r\n\tBut the worst is food.  A champion groaker will not only sit aimed\r\n\tstraight at you in rapt attention as you eat, but it will follow the\r\n\tfood with its eyes and the tilt of its head.\r\n\r\n\tAs you prepare to lift the food from the plate, the dog stares at the\r\n\tfood on the plate.\r\n\r\n\tAs you lift a morsel toward your mouth, the tilt of the mutt's head\r\n\tfollows, its eyes in unison with your every move.\r\n\r\n\tAs the food reaches your mouth and you pop it in, the dog focuses on\r\n\tyour chewing mouth.  And it isn't easy eating with a dog staring at your\r\n\tlips.  As you swallow, the dog's gaze meets your own with a\r\n\thow-could-you look, the dog's eyes water, the dog's mouth slobbers and\r\n\tthe dog softly whines.  And of course, any decent person will do\r\n\tsomething about that.  You must take the dog by the collar and walk it\r\n\tto the closet, locking it in there until dinner is over so the poor\r\n\tthing won't suffer so much.\r\n\r\n\tThe only other choice is to get up, give the dog your place at the table\r\n\tand go whine in the closet yourself.\r\n\r\n\tAnd you might as well do that if you don't remove the dog from the room\r\n\tbecause nobody can enjoy his dinner with dog eyes following his every\r\n\tmove.  The best sauce is hunger.  The worst sauce is groaking."
    },
    {
      "tag": "h3",
      "text": "Back to Lori's Humor Page following code added by server. PLEASE REMOVE preceding code added by server. PLEASE REMOVE text below generated by server. PLEASE REMOVE"
    }
  ]
}