{
  "url": "http://www.gidesigns.net/clearance.html",
  "content_hash": "ef9ffc8f8a9614d8b679ea5d86ee4e6f233428b510e4b7f05d48a5633d0ef747",
  "total_blocks": 258,
  "retained_blocks": 19,
  "ignored_blocks": 239,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" #BeginTemplate \"/Templates/index.dwt\" #BeginEditable \"text_left_top\" home & garden decor clearance \n            sale pages, page 1 #EndEditable"
    },
    {
      "tag": "p",
      "text": "Gift \n        Certificates! 2006 \n        Sale Pages! What's New? Coming Attractions Ordering \n        Information (Unless noted with \"Free Shipping\" all items are shipped at \n        an additional packing and shipping fee of 12-14% of the order total for \n        shipping inside the Continental US) Privacy \n        Notice Why Copper? Links begin spiderline search engine code end spiderline search engine code Dining \n        Tables Coffee \n        Tables Sofa \n        & Console Tables Side \n        Tables Benches Room \n        Divider Screens Custom \n        Furniture Copper \n        Table Care Copper \n        & Cherry Tables Custom Business & \n        Address Signs Fence Post Caps & \n        Finials Garden Decor Garden \n        Ornaments & Plant Hangers Outdoor \n        Faucets Outdoor \n        Fireplaces Outdoor \n        Fountains Torches Wind \n        Chimes & Windbells Yard Art & Copper Critters Custom \n        Projects Arbors & \n        Gazebos Fencing \n        & Edging Garden \n        Trellis NEW! Iron Structures Windowboxes \n        & Planters Tips \n        on Growing Vines Custom \n        Garden Structures Bowls \n        & Vases Candleholders Custom Business & \n        Address Signs Doorbells \n        & Door Knockers Home \n        Decorative Hardware Indoor \n        Fountains Mailboxes Mirrors \n        (NEW!) Paper \n        Towel Holders Windowsill \n        Trays and Copper Trays USA Artist Created Path Lighting Brass Lighting Copper Lighting Outdoor Lighting Transformers \n        & Cables Chimney Caps Full \n        Size Weathervanes Wood \n        Cupolas Copper \n        Cupolas Copper \n        Finials Weathervane Mounting Hardware Patriotic Gifts INFORMATION PAGES Modifying \n        a Cupola to Accept a Weathervane Selecting \n        the Right Size Cupola Tips \n        on Growing Vines Wedding Anniversary \n        Symbols Home \n        & Garden Decor Industry News American \n        Red Cross Annual Warehouse \n        Sale"
    },
    {
      "tag": "h1",
      "text": "#BeginEditable \"h1\" clearance page, trellis, arbors, weathervanes, \n          cupolas, home & garden accessories #EndEditable"
    },
    {
      "tag": "p",
      "text": "PLEASE NOTE : You \n        have reached an outdated page of our website. GI \n        Designs Home and Garden Decor website has been completely redesigned \n        with hundreds of new home and garden products added to our inventory. Click on GI Designs Unique \n        Home and Garden Decor to view our new look and new products!"
    },
    {
      "tag": "div",
      "text": "#BeginEditable \"main\""
    },
    {
      "tag": "p",
      "text": "Page \n        1 of 3 You are currently viewing \n              an older page version of our website for GI \n              Designs Clearance Sale Pages . Click GI \n              Designs Clearance Sale Pages to see all the new home \n              & garden decor clearance sale products we have to offer!"
    },
    {
      "tag": "div",
      "text": "Click \"More Info\" button below to find out all pricing and discounts. \n      Thank you."
    },
    {
      "tag": "p",
      "text": "Special prices for our special customers! Additional discounts just recently \n        added on all unique products below. Free Ground Shipping on many (not \n        all) items on these three sales pages only (Inside the Continental US \n        only). You may call us toll free at 1-877-442-6773 if your prefer not to order \n        online. All items on these three sales pages ship from Denver, CO. All \n        of the below items are in-stock and ready to ship within two business \n        days via Ground Delivery Service (Extra charges will apply for any required \n        Air Delivery). New percentage discounts just added. Remember, \n        many items below with Free Shipping! Check back frequently to find clearance sale prices \n            on weathervanes, cupolas, garden structures, garden accessories, furniture \n            and outdoor lighting. Many of these items are first-come first-served, \n            and the discounts only apply to stock on hand. Thank you. Cranes \n          Fountain One Pair Left On Sale Now! This pair of Cranes Fountain makes a lovely statement \n          placed anywhere near a pool or pond. Connect a water tube to a fitting \n          on each cast brass base and then connect to a water source. Of course \n          you do not have to use them as fountain statues to enjoy this pair's \n          beauty! 48.75\"H x 20\"W x 12\"D & 40\"H x 20\"W x \n          12\"D (pump not included) Item #: 30605 Another stunning combination of burnished and patinaed brass with a \n          marble base will make this unique coffee/cocktail table (above left) \n          the focal point of your room. Expertly crafted, this School of \n          Dolphins supports an oval 42-inch glass tabletop, with one dolphin \n          piercing the glass top! We are offering free shipping on this beautiful \n          table too for a limited time only. Complimentary side table is available \n          too, it can be seen here . 42\"W x 24\"D x 21\"H Item #: BP-30306 Canterbury \n          Copper Pilaster Lantern What a beautiful accent to mount to a brick or stone column or pilaster \n          to welcome your guests and to cast a warm glow over your landscape and \n          outdoor decor! Hardwired for 110V with 75W max. bulb (not included). \n          Soft verdigris patina finish only. Only two remaining at special price! Size: 15\"H x 7.5\" Hexagon Base Item #: LLCantp Please Note: Larger sizes available by special order only. Wall mount \n          lanterns and hanging lanterns available too by special order only. Please \n          call or e-mail for pricing. Branches Table with Glass Top Beautiful new introduction, copper coffee table with a \"branches\" \n          design and bottom shelf. The 3/4\"D glass tabletop makes this coffee \n          table a very elegant work of art for any room. Ample top that measures \n          40\" x 20\" x .75\". Table is 17.5\"H to glass top. \n          Exquisite and won't last long! Substantial savings with % off on one \n          table only! Item #Tbranches Copper \n          Dog Weathervane Great for the dog lover on your list! Roof Mount Sold Separately for \n          this weathervane Overall Height: 24\" with rod, directionals and spacer balls 32\"L x 14.5\"H x 3\"D (figure only) Model #W133P Polished (shown at left) ONLY 1 \n          POLISHED ON SALE Model #W133 Antique (not pictured) At Regular Price © Copyright Wildlife Console Table Proudly fabricated in AZ by the artist, this ample size \n          copper plated steel console table will be the hit in your home! The copper has a hand rubbed patina that is similar to \n          a medium, slightly aged penny and then three coats of lacquer applied. The top of the table, under the 3/8\"D glass, is a \n          cut out in solid metal sheet of an elk and mountain lion in a natural \n          outdoor setting beneath a tree (shown below left). Table measures 52\"L x 16\"D x 29\"H. Item # SCmconsole Proudly \n          made in America (right here in Colorado) with a Lifetime Guarantee! Grandfather's Garden Hose Nozzles are 100% brass and are made \n          to satisfy the most demanding customers -- professional wildland firefighters \n          and the Forest Service who need products they can rely on. No more big \n          box retailers' hose nozzles that have to be constantly replaced, if \n          this hose nozzle ever breaks, send it back & we will replace it \n          at no charge! This all brass hose nozzle adjusts from a fine mist to \n          a strong stream and can handle up to a 250 pound water pressure. The \n          thread design and superior seal make connection to your garden hose \n          easy and secure! M easures 4\"L Lifetime Guarantee! Item no. NZmop Copper \n          Deer Candleholder Great decorative accent for your home for the Holidays or year round! \n          Copper plated brass that holds ten tea light candles (candles not included). \n          Penny patina. Quantities are Limited. 14\"W x 8\"D x 20\"H Item #Sampdeerch GI Designs Price Includes Shipping Use Copper Yard Art to add a little whimsy to that special place \n          in your garden! Each handcrafted piece comes with a 24\"H black \n          aluminum stake for easy insertion into the ground (as shown on the dragonfly \n          above, top left). Choose from a verdigris dragonfly (9\"H x 9.5\"W, \n          figure only), a praying mantis (5.5\"H x 9\"L x 4\"D), a \n          yellow jacket (4\"H x 5\"L), a lady bug (6\"H x 5.5\"W), \n          a snail (3.25\"H x 5\"L), a butterfly (6.5\"H x 7\"W), \n          a bee (3\"H x 9\"L x 4\"W) or an ant (7.5\"H x 5\"W). \n          Indicate selection on ordering page. Only a few models left of each. \n          Another style is shown on page 3 of these Clearance Pages. #Cyardart"
    },
    {
      "tag": "div",
      "text": "top"
    },
    {
      "tag": "p",
      "text": "The Flowering Copper Vine with Bronze Buttercup is the most versatile landscape light that there is (not to mention \n            its beauty!). It comes with 5-feet of soft tube and 5 clip on copper \n            leaves so that you can arrange the \"vine\" to suit your chosen \n            location. This low voltage 12 watt light can be twisted \n            around a tree trunk, as shown, or around one of the support posts \n            to our trellises or arbors to direct its light to highlight a special \n            spot in your garden landscape or one of our flagstone or copper signs. \n            Absolutely Beautiful! 12V with 12W bulb, Buttercup is 3\"W x 3.5\"L \n            x 5' of copper tube Flowering Copper Vine with Buttercup © Copyright #LLVineb 25\"H Wall \n            Mount Double Calla Light SIZE: 18\"H x 14\"W x 9\"D A Beautiful and unusual lighting accent! Decorative cast brass of leaf and vines with a burnished \n            patina (bulbs not included). Requires two 15W candelabra bulbs. Comes \n            ready to wire into box. #sc3812 Decorative \n            Copper Windowsill Trays SIZES AVAILABLE: 18.5\"L x 5.5\"W or 12.5\"L \n            x 4.75\"W A functional decorative accent for your home. Great \n            and useful with pebbles and water in the bottom to provide extra humidity \n            for your orchids! (candles/plants not included). #43002 Great Gift!"
    },
    {
      "tag": "div",
      "text": "top"
    },
    {
      "tag": "p",
      "text": "Solid \n                      Brass Dragonfly Coasters Your tables will thank you for using these beautiful drink \n                      coasters! Keep the moisture off of your fine furniture in \n                      style. 3.5\" Square, Nonskid base BP25690 Set of Four Solid Brass Leaf Coasters You will love these leaf coasters as a decorative accessory! \n                      Keep the moisture off of your fine furniture too. 3.5\" Square, Nonskid base 30053 Set of Four Our Frog Hose Guides are incredibly lifelike and the \n                      figures are solid brass on top of an aluminum stake for \n                      easy insertion into the ground. Protect your flower beds \n                      in style while you are watering! The Frog Hose Guide measures 22\"H x 9\"W. \n                      There are only three remaining that are on sale. Item #: 30336 Large \n                      Copper Bowls are just hard to find. Use it as a focal \n                      point in the garden, plant it with your favorite annuals \n                      or great for use as part of a fountain! We can even cut \n                      a spillway into this bowl or hammer this bowl to suit your \n                      particular needs. Click our Fountains page for additional ideas. The copper will develop a rich \n                      natural patina over time. Beautifully drop forged and measures \n                      40\"W x 7\"D Item #: cbowl40 Two Dolphins frolic around the base \n                      of this beautiful Tabletop Mirror. One side is normal magnification, \n                      other side is 2X. Brass and marble base. 15.75\"H Item #: BP-25406 To view more vanity mirrors available, Click \n                      Here ."
    },
    {
      "tag": "div",
      "text": "Top"
    },
    {
      "tag": "p",
      "text": "This Branches Fireplace Scene is a beautiful work of art \n                      to place in front of your fireplace in winter or summer. \n                      It can also be used as a wall hanging Each individually hand-crafted, so no two are exactly alike. \n                      Fabricated of brass and iron and includes glass votive candleholders. \n                      Candles not included. Approximately 30\"H x 35\"W \n                      Item #: 30194 The Gaudette Trellis is based on the porch detailing \n                      of a 1920s' Craftsman bungalow. With its classic detailing \n                      it helps integrate the landscaping with the homes' architecture. \n                      However, this trellis would be the perfect landscape accent \n                      for any style of home. The Gaudette is 5.5-foot tall x 40 inches \n                      wide Only One left at this price. Gaudette Trellis Item #: Tgaudette \n                      -- SOLD OUT! Check our Trellises page for more please. Hand Blown Glass Flowers by Artist \n                      Donna Gordon Light up any room and don't worry about these beautiful \n                      flowers wilting! Each piece is a work of art. Choose color(s) \n                      on ordering page. Only one left of each color, order early \n                      these will be gone fast. 4-5\"W x 20\"H Burnished Brass Pineapple Mini Lamp Welcome all your guests with this symbol of hospitality \n                      used throughout America. Accepts up to a 15W candelabra \n                      socket bulb (included). Great night light. Item # 30562 5\"W x 5\"D x 11.5\"H COPPER \n                        WALL CLOCK Fabricated from cast aluminum with a large copper face \n                        this large clock is ideal for outdoor use. Battery operated. (Only one remaining) 12\" Diameter x 3\"D Item #01841 COPPER \n                        WALL THERMOMETER Fabricated from cast aluminum with a large copper face \n                        this large thermometer is ideal too for outdoor use. Battery \n                        operated. (Only one remaining) 12\" Diameter x 3\"D Item #01856"
    },
    {
      "tag": "div",
      "text": "Top"
    },
    {
      "tag": "p",
      "text": "Copper Rectangular Planter, 2 Sizes! Two sizes to choose from as seen at the \n                        Philadelphia Flower Show! Nice folded over edges will \n                        make a nice statement wherever they are planted and placed. LARGE SIZE (above left): 7.75\"H \n                        x 8.5\"W x 24\"L, Item#wb424 SMALLER SIZE (above right): 5.75\"H \n                        x 6.5\"W x 16.25\"L, Item#wb423 Great Gift! Only one left on this beautiful all Copper Birdbath and pedestal Special Sale Now 30\"H x 21\"D Item #bb431 SEE MORE ON PAGE \n            2 OF CLEARANCE SALE PAGES EVEN M ORE \n            ON PAGE \n            3 OF CLEARANCE SALE PAGES Click on the Gift \n          Certificate image to the left to solve your gift giving dilemma! Home | Garden \n          Structures | Outdoor Furniture | Garden Accessories | Weathervanes | Outdoor \n          Lighting #EndEditable top To \n        view a number of new and unique arbors, click on this line or on the image \n        above. Custom Commissioned Copper Repousse Now Available! E-mail \n        us your details at Cs@gidesigns.net If there is anything we can do to help you, \n          please do not hesitate to ask. E-mail or call us toll-free at 1-877-442-6773 . Note: All data gathered by G.I. Designs is kept private, to view our Privacy Policy click here. As \n          a web site which is concerned with your security when shopping online, \n          GI Designs invites you to click on the \"Lock\" on your browser \n          when you place your order to check our SSL Certificate issued from Thawte. \n          Thank you! Home | Garden \n          Structures | Mission Style \n          Furniture | Garden Accessories | Weathervanes | Outdoor \n          Lighting | Links | Top Garden Deco r | Cupolas | Landscape Lighting | Fence \n        Post Caps & Finials | Copper \n        Trellis | Copper Arbors | Windowboxes Designer Copper Tables © 1999- G.I. Designs - trellis - arbors - weathervanes - cupolas - landscape \n          lighting outdoor lighting - finials - vase - windowboxes - garden trellis - gazebos Some products are Design Patent Pending. PayPal Logo PayPal Logo"
    },
    {
      "tag": "div",
      "text": "Now Accepting PayPal as a Payment Option for Your Shopping \n          Convenience!"
    },
    {
      "tag": "p",
      "text": "Please contact us at Cs@gidesigns.net with any of your questions or comments. If you would feel more comfortable talking with a person concerning an \n        order, please e-mail us with your phone number and a convenient time to \n        return your call. We will return your call as soon as we can. Call between the hours of: 9:00 AM - 5:00 PM Mountain Time Monday through \n        Friday, Saturday we are open from 10:00 AM - 4:00 PM Mountain Time. Closed \n        Sunday. Please feel free to leave a message on Sundays or at any time \n        we are on the phone with another client and we will return your call just \n        as soon as possible. Thank you. Phone: Call us Toll-Free at 1-877-442-6773 or, if you are in Denver, \n        CO: (303) 377-5323 Appointments: 24 Hour Advance Appointments are Required at our \n        Office/Warehouse in NE Denver E-mail: Cs@gidesigns.net Mail Only: G.I. Designs, 700 Colorado Blvd., #120, Denver, CO 80206 Fax: (303) 380-7000 Note: All data gathered by G.I. Designs is kept private, to view \n        our Privacy Policy click here . &copy; 1999-2003 GIDesigns - trellis - arbors - weathervanes - cupolas \n\n        - landscape lighting - outdoor lighting - finials Web \n        Design by Pacomasys"
    },
    {
      "tag": "div",
      "text": "#EndTemplate"
    }
  ]
}