{
  "url": "http://www.gnu.org/gnu/manifesto.html",
  "file_number": "462",
  "content_hash": "5d149c9817f6ec4539464da5056f901f200e61b851f012074b189388d4b8d6d3",
  "total_blocks": 117,
  "retained_blocks": 26,
  "ignored_blocks": 91,
  "blocks": [
    {
      "tag": "p",
      "text": "Translations of this page"
    },
    {
      "tag": "h3",
      "text": "The GNU Manifesto"
    },
    {
      "tag": "pre",
      "text": "The GNU Manifesto (which appears below) was written by Richard Stallman at the beginning of the GNU Project, to ask for\n     participation and support.  For the first few years, it was\n     updated in minor ways to account for developments, but now it\n     seems best to leave it unchanged as most people have seen it.\n\n     Since that time, we have learned about certain common\n     misunderstandings that different wording could help avoid.\n     Footnotes added in 1993 help clarify these points.\n\n     For up-to-date information about the available GNU software,\n     please see the information available on\n     our web server , in particular\n     our list of software .  For\n     how to contribute, see http://www.gnu.org/help ."
    },
    {
      "tag": "h3",
      "text": "What's GNU?  Gnu's Not Unix!"
    },
    {
      "tag": "p",
      "text": "GNU, which stands for Gnu's Not Unix, is the name for the complete\nUnix-compatible software system which Iam writing so that Ican give\nit away free to everyone who can use it. (1) Several other volunteers are helping me.\nContributions of time, money, programs and equipment are greatly\nneeded. So far we have an Emacs text editor with Lisp for writing editor\ncommands, a source level debugger, a yacc-compatible parser generator,\na linker, and around 35 utilities.  Ashell (command interpreter) is\nnearly completed.  Anew portable optimizing Ccompiler has compiled\nitself and may be released this year.  An initial kernel exists but\nmany more features are needed to emulate Unix.  When the kernel and\ncompiler are finished, it will be possible to distribute a GNU system\nsuitable for program development.  We will use TeX as our text\nformatter, but an nroff is being worked on.  We will use the free,\nportable Xwindow system as well.  After this we will add a portable\nCommon Lisp, an Empire game, a spreadsheet, and hundreds of other\nthings, plus on-line documentation.  We hope to supply, eventually,\neverything useful that normally comes with a Unix system, and more. GNU will be able to run Unix programs, but will not be identical to\nUnix.  We will make all improvements that are convenient, based on our\nexperience with other operating systems.  In particular, we plan to\nhave longer file names, file version numbers, a crashproof file system,\nfile name completion perhaps, terminal-independent display support, and\nperhaps eventually a Lisp-based window system through which several\nLisp programs and ordinary Unix programs can share a screen.  Both Cand Lisp will be available as system programming languages.  We will\ntry to support UUCP, MIT Chaosnet, and Internet protocols for\ncommunication. GNU is aimed initially at machines in the 68000/16000 class with\nvirtual memory, because they are the easiest machines to make it run\non.  The extra effort to make it run on smaller machines will be left\nto someone who wants to use it on them. To avoid horrible confusion, please pronounce the `G' in the word\n`GNU' when it is the name of this project."
    },
    {
      "tag": "h3",
      "text": "Why I Must Write GNU"
    },
    {
      "tag": "p",
      "text": "Iconsider that the golden rule requires that if Ilike a program Imust share it with other people who like it.  Software sellers want to\ndivide the users and conquer them, making each user agree not to share\nwith others.  Irefuse to break solidarity with other users in this\nway.  Icannot in good conscience sign a nondisclosure agreement or a\nsoftware license agreement.  For years Iworked within the Artificial\nIntelligence Lab to resist such tendencies and other inhospitalities,\nbut eventually they had gone too far: Icould not remain in an\ninstitution where such things are done for me against my will. So that Ican continue to use computers without dishonor, Ihave\ndecided to put together a sufficient body of free software so that Iwill be able to get along without any software that is not free.  Ihave resigned from the AI lab to deny MIT any legal excuse to prevent\nme from giving GNU away."
    },
    {
      "tag": "h3",
      "text": "Why GNU Will Be Compatible with Unix"
    },
    {
      "tag": "p",
      "text": "Unix is not my ideal system, but it is not too bad.  The essential\nfeatures of Unix seem to be good ones, and Ithink Ican fill in what\nUnix lacks without spoiling them.  And a system compatible with Unix\nwould be convenient for many other people to adopt."
    },
    {
      "tag": "h3",
      "text": "How GNU Will Be Available"
    },
    {
      "tag": "p",
      "text": "GNU is not in the public domain.  Everyone will be permitted to\nmodify and redistribute GNU, but no distributor will be allowed to\nrestrict its further redistribution.  That is to say, proprietary modifications will not be allowed.  Iwant to\nmake sure that all versions of GNU remain free."
    },
    {
      "tag": "h3",
      "text": "Why Many Other Programmers Want to Help"
    },
    {
      "tag": "p",
      "text": "Ihave found many other programmers who are excited about GNU and\nwant to help. Many programmers are unhappy about the commercialization of system\nsoftware.  It may enable them to make more money, but it requires them\nto feel in conflict with other programmers in general rather than feel\nas comrades.  The fundamental act of friendship among programmers is the\nsharing of programs; marketing arrangements now typically used\nessentially forbid programmers to treat others as friends.  The\npurchaser of software must choose between friendship and obeying the\nlaw.  Naturally, many decide that friendship is more important.  But\nthose who believe in law often do not feel at ease with either choice.\nThey become cynical and think that programming is just a way of making\nmoney. By working on and using GNU rather than proprietary programs, we can\nbe hospitable to everyone and obey the law.  In addition, GNU serves as\nan example to inspire and a banner to rally others to join us in\nsharing.  This can give us a feeling of harmony which is impossible if\nwe use software that is not free.  For about half the programmers Italk to, this is an important happiness that money cannot replace."
    },
    {
      "tag": "h3",
      "text": "How You Can Contribute"
    },
    {
      "tag": "p",
      "text": "(Nowadays, for software tasks to work on, see the GNU task\nlist .  For other ways to contribute,\nsee http://www.gnu.org/help .) Iam asking computer manufacturers for donations of machines and\nmoney.  I'm asking individuals for donations of programs and work. One consequence you can expect if you donate machines is that GNU\nwill run on them at an early date.  The machines should be complete,\nready to use systems, approved for use in a residential area, and not\nin need of sophisticated cooling or power. Ihave found very many programmers eager to contribute part-time\nwork for GNU.  For most projects, such part-time distributed work would\nbe very hard to coordinate; the independently-written parts would not\nwork together.  But for the particular task of replacing Unix, this\nproblem is absent.  Acomplete Unix system contains hundreds of utility\nprograms, each of which is documented separately.  Most interface\nspecifications are fixed by Unix compatibility.  If each contributor\ncan write a compatible replacement for a single Unix utility, and make\nit work properly in place of the original on a Unix system, then these\nutilities will work right when put together.  Even allowing for Murphy\nto create a few unexpected problems, assembling these components will\nbe a feasible task.  (The kernel will require closer communication and\nwill be worked on by a small, tight group.) If Iget donations of money, Imay be able to hire a few people full\nor part time.  The salary won't be high by programmers' standards, but\nI'm looking for people for whom building community spirit is as\nimportant as making money.  Iview this as a way of enabling dedicated\npeople to devote their full energies to working on GNU by sparing them\nthe need to make a living in another way."
    },
    {
      "tag": "h3",
      "text": "Why All Computer Users Will Benefit"
    },
    {
      "tag": "p",
      "text": "Once GNU is written, everyone will be able to obtain good system\nsoftware free, just like air. (2) This means much more than just saving everyone the price of a Unix\nlicense.  It means that much wasteful duplication of system programming\neffort will be avoided.  This effort can go instead into advancing the\nstate of the art. Complete system sources will be available to everyone.  As a result,\na user who needs changes in the system will always be free to make them\nhimself, or hire any available programmer or company to make them for\nhim.  Users will no longer be at the mercy of one programmer or company\nwhich owns the sources and is in sole position to make changes. Schools will be able to provide a much more educational environment\nby encouraging all students to study and improve the system code.\nHarvard's computer lab used to have the policy that no program could be\ninstalled on the system if its sources were not on public display, and\nupheld it by actually refusing to install certain programs.  Iwas very\nmuch inspired by this. Finally, the overhead of considering who owns the system software\nand what one is or is not entitled to do with it will be lifted. Arrangements to make people pay for using a program, including\nlicensing of copies, always incur a tremendous cost to society through\nthe cumbersome mechanisms necessary to figure out how much (that is,\nwhich programs) a person must pay for.  And only a police state can\nforce everyone to obey them.  Consider a space station where air must\nbe manufactured at great cost: charging each breather per liter of air\nmay be fair, but wearing the metered gas mask all day and all night is\nintolerable even if everyone can afford to pay the air bill.  And the\nTV cameras everywhere to see if you ever take the mask off are\noutrageous.  It's better to support the air plant with a head tax and\nchuck the masks. Copying all or parts of a program is as natural to a programmer as\nbreathing, and as productive.  It ought to be as free."
    },
    {
      "tag": "h3",
      "text": "Some Easily Rebutted Objections to GNU's Goals"
    },
    {
      "tag": "p",
      "text": "\"Nobody will use it if it is free, because that means they can't\n     rely on any support.\" \"You have to charge for the program to pay for providing the\n     support.\" If people would rather pay for GNU plus service than get GNU free\nwithout service, a company to provide just service to people who have\nobtained GNU free ought to be profitable. (3) We must distinguish between support in the form of real programming\nwork and mere handholding.  The former is something one cannot rely on\nfrom a software vendor.  If your problem is not shared by enough\npeople, the vendor will tell you to get lost. If your business needs to be able to rely on support, the only way\nis to have all the necessary sources and tools.  Then you can hire any\navailable person to fix your problem; you are not at the mercy of any\nindividual.  With Unix, the price of sources puts this out of\nconsideration for most businesses.  With GNU this will be easy.  It is\nstill possible for there to be no available competent person, but this\nproblem cannot be blamed on distribution arrangements.  GNU does not\neliminate all the world's problems, only some of them. Meanwhile, the users who know nothing about computers need\nhandholding: doing things for them which they could easily do\nthemselves but don't know how. Such services could be provided by companies that sell just\nhand-holding and repair service.  If it is true that users would rather\nspend money and get a product with service, they will also be willing\nto buy the service having got the product free.  The service companies\nwill compete in quality and price; users will not be tied to any\nparticular one.  Meanwhile, those of us who don't need the service\nshould be able to use the program without paying for the service. \"You cannot reach many people without advertising, and you must\n     charge for the program to support that.\" \"It's no use advertising a program people can get free.\" There are various forms of free or very cheap publicity that can be\nused to inform numbers of computer users about something like GNU.  But\nit may be true that one can reach more microcomputer users with\nadvertising.  If this is really so, a business which advertises the\nservice of copying and mailing GNU for a fee ought to be successful\nenough to pay for its advertising and more.  This way, only the users\nwho benefit from the advertising pay for it. On the other hand, if many people get GNU from their friends, and\nsuch companies don't succeed, this will show that advertising was not\nreally necessary to spread GNU.  Why is it that free market advocates\ndon't want to let the free market decide this? (4) \"My company needs a proprietary operating system to get a\n     competitive edge.\" GNU will remove operating system software from the realm of\ncompetition.  You will not be able to get an edge in this area, but\nneither will your competitors be able to get an edge over you.  You and\nthey will compete in other areas, while benefiting mutually in this\none.  If your business is selling an operating system, you will not\nlike GNU, but that's tough on you.  If your business is something else,\nGNU can save you from being pushed into the expensive business of\nselling operating systems. Iwould like to see GNU development supported by gifts from many\nmanufacturers and users, reducing the cost to each. (5) \"Don't programmers deserve a reward for their creativity?\" If anything deserves a reward, it is social contribution.\nCreativity can be a social contribution, but only in so far as society\nis free to use the results.  If programmers deserve to be rewarded for\ncreating innovative programs, by the same token they deserve to be\npunished if they restrict the use of these programs. \"Shouldn't a programmer be able to ask for a reward for his\n     creativity?\" There is nothing wrong with wanting pay for work, or seeking to\nmaximize one's income, as long as one does not use means that are\ndestructive.  But the means customary in the field of software today\nare based on destruction. Extracting money from users of a program by restricting their use of\nit is destructive because the restrictions reduce the amount and the\nways that the program can be used.  This reduces the amount of wealth\nthat humanity derives from the program.  When there is a deliberate\nchoice to restrict, the harmful consequences are deliberate destruction. The reason a good citizen does not use such destructive means to\nbecome wealthier is that, if everyone did so, we would all become\npoorer from the mutual destructiveness.  This is Kantian ethics; or,\nthe Golden Rule.  Since Ido not like the consequences that result if\neveryone hoards information, Iam required to consider it wrong for one\nto do so.  Specifically, the desire to be rewarded for one's creativity\ndoes not justify depriving the world in general of all or part of that\ncreativity. \"Won't programmers starve?\" Icould answer that nobody is forced to be a programmer.  Most of us\ncannot manage to get any money for standing on the street and making\nfaces.  But we are not, as a result, condemned to spend our lives\nstanding on the street making faces, and starving.  We do something\nelse. But that is the wrong answer because it accepts the questioner's\nimplicit assumption: that without ownership of software, programmers\ncannot possibly be paid a cent.  Supposedly it is all or nothing. The real reason programmers will not starve is that it will still be\npossible for them to get paid for programming; just not paid as much as\nnow. Restricting copying is not the only basis for business in software.\nIt is the most common basis because it brings in the most money.  If it\nwere prohibited, or rejected by the customer, software business would\nmove to other bases of organization which are now used less often.\nThere are always numerous ways to organize any kind of business. Probably programming will not be as lucrative on the new basis as it\nis now.  But that is not an argument against the change.  It is not\nconsidered an injustice that sales clerks make the salaries that they\nnow do.  If programmers made the same, that would not be an injustice\neither.  (In practice they would still make considerably more than\nthat.) \"Don't people have a right to control how their creativity is\n     used?\" \"Control over the use of one's ideas\" really constitutes control over\nother people's lives; and it is usually used to make their lives more\ndifficult. People who have studied the issue of intellectual property rights (6) carefully (such as lawyers) say that there is no intrinsic right to\nintellectual property.  The kinds of supposed intellectual property\nrights that the government recognizes were created by specific acts of\nlegislation for specific purposes. For example, the patent system was established to encourage\ninventors to disclose the details of their inventions.  Its purpose was\nto help society rather than to help inventors.  At the time, the life\nspan of 17 years for a patent was short compared with the rate of\nadvance of the state of the art.  Since patents are an issue only among\nmanufacturers, for whom the cost and effort of a license agreement are\nsmall compared with setting up production, the patents often do not do\nmuch harm.  They do not obstruct most individuals who use patented\nproducts. The idea of copyright did not exist in ancient times, when authors\nfrequently copied other authors at length in works of non-fiction.  This\npractice was useful, and is the only way many authors' works have\nsurvived even in part.  The copyright system was created expressly for\nthe purpose of encouraging authorship.  In the domain for which it was\ninvented--books, which could be copied economically only on a printing\npress--it did little harm, and did not obstruct most of the individuals\nwho read the books. All intellectual property rights are just licenses granted by society\nbecause it was thought, rightly or wrongly, that society as a whole\nwould benefit by granting them.  But in any particular situation, we\nhave to ask: are we really better off granting such license?  What kind\nof act are we licensing a person to do? The case of programs today is very different from that of books a\nhundred years ago.  The fact that the easiest way to copy a program is\nfrom one neighbor to another, the fact that a program has both source\ncode and object code which are distinct, and the fact that a program is\nused rather than read and enjoyed, combine to create a situation in\nwhich a person who enforces a copyright is harming society as a whole\nboth materially and spiritually; in which a person should not do so\nregardless of whether the law enables him to. \"Competition makes things get done better.\" The paradigm of competition is a race: by rewarding the winner, we\nencourage everyone to run faster.  When capitalism really works this\nway, it does a good job; but its defenders are wrong in assuming it\nalways works this way.  If the runners forget why the reward is offered\nand become intent on winning, no matter how, they may find other\nstrategies--such as, attacking other runners.  If the runners get into\na fist fight, they will all finish late. Proprietary and secret software is the moral equivalent of runners\nin a fist fight.  Sad to say, the only referee we've got does not seem\nto object to fights; he just regulates them (\"For every ten yards you\nrun, you can fire one shot\").  He really ought to break them up, and\npenalize runners for even trying to fight. \"Won't everyone stop programming without a monetary incentive?\" Actually, many people will program with absolutely no monetary\nincentive.  Programming has an irresistible fascination for some\npeople, usually the people who are best at it.  There is no shortage of\nprofessional musicians who keep at it even though they have no hope of\nmaking a living that way. But really this question, though commonly asked, is not appropriate\nto the situation.  Pay for programmers will not disappear, only become\nless.  So the right question is, will anyone program with a reduced\nmonetary incentive?  My experience shows that they will. For more than ten years, many of the world's best programmers worked\nat the Artificial Intelligence Lab for far less money than they could\nhave had anywhere else.  They got many kinds of non-monetary rewards:\nfame and appreciation, for example.  And creativity is also fun, a\nreward in itself. Then most of them left when offered a chance to do the same\ninteresting work for a lot of money. What the facts show is that people will program for reasons other\nthan riches; but if given a chance to make a lot of money as well, they\nwill come to expect and demand it.  Low-paying organizations do poorly\nin competition with high-paying ones, but they do not have to do badly\nif the high-paying ones are banned. \"We need the programmers desperately.  If they demand that we stop\n     helping our neighbors, we have to obey.\" You're never so desperate that you have to obey this sort of demand.\nRemember: millions for defense, but not a cent for tribute! \"Programmers need to make a living somehow.\" In the short run, this is true.  However, there are plenty of ways\nthat programmers could make a living without selling the right to use a\nprogram.  This way is customary now because it brings programmers and\nbusinessmen the most money, not because it is the only way to make a\nliving.  It is easy to find other ways if you want to find them.  Here\nare a number of examples. Amanufacturer introducing a new computer will pay for the porting of\noperating systems onto the new hardware. The sale of teaching, hand-holding and maintenance services could\nalso employ programmers. People with new ideas could distribute programs as\nfreeware (7) , asking for\ndonations from satisfied users, or selling hand-holding services.  Ihave met people who are already working this way successfully. Users with related needs can form users' groups, and pay dues.  Agroup would contract with programming companies to write programs that\nthe group's members would like to use. All sorts of development can be funded with a Software Tax: Suppose everyone who buys a computer has to pay x percent of the\n     price as a software tax.  The government gives this to an agency\n     like the NSF to spend on software development. But if the computer buyer makes a donation to software development\n     himself, he can take a credit against the tax.  He can donate to\n     the project of his own choosing--often, chosen because he hopes to\n     use the results when it is done.  He can take a credit for any\n     amount of donation up to the total tax he had to pay. The total tax rate could be decided by a vote of the payers of the\n     tax, weighted according to the amount they will be taxed on. The consequences:"
    },
    {
      "tag": "div",
      "text": "The computer-using community supports software development. This community decides what level of support is needed. Users who care which projects their share is spent on can\n          choose this for themselves."
    },
    {
      "tag": "p",
      "text": "In the long run, making programs free is a step toward the\npost-scarcity world, where nobody will have to work very hard just to\nmake a living.  People will be free to devote themselves to activities\nthat are fun, such as programming, after spending the necessary ten\nhours a week on required tasks such as legislation, family counseling,\nrobot repair and asteroid prospecting.  There will be no need to be\nable to make a living from programming. We have already greatly reduced the amount of work that the whole\nsociety must do for its actual productivity, but only a little of this\nhas translated itself into leisure for workers because much\nnonproductive activity is required to accompany productive activity.\nThe main causes of this are bureaucracy and isometric struggles against\ncompetition.  Free software will greatly reduce these drains in the\narea of software production.  We must do this, in order for technical\ngains in productivity to translate into less work for us."
    },
    {
      "tag": "h4",
      "text": "Footnotes"
    },
    {
      "tag": "p",
      "text": "(1) The wording here was careless.  The\nintention was that nobody would have to pay for *permission* to use\nthe GNU system.  But the words don't make this clear, and people often\ninterpret them as saying that copies of GNU should always be\ndistributed at little or no charge.  That was never the intent; later\non, the manifesto mentions the possibility of companies providing the\nservice of distribution for a profit.  Subsequently Ihave learned to\ndistinguish carefully between \"free\" in the sense of freedom and\n\"free\" in the sense of price.  Free software is software that users\nhave the freedom to distribute and change.  Some users may obtain\ncopies at no charge, while others pay to obtain copies--and if the\nfunds help support improving the software, so much the better.  The\nimportant thing is that everyone who has a copy has the freedom to\ncooperate with others in using it. (2) This is another place Ifailed to\ndistinguish carefully between the two different meanings of \"free\".\nThe statement as it stands is not false--you can get copies of GNU\nsoftware at no charge, from your friends or over the net.  But it does\nsuggest the wrong idea. (3) Several such companies now exist. (4) The Free\nSoftware Foundation for 10 years raised most of its funds from a\ndistribution service, although it is a charity rather than a company.\nYou can order things from the FSF . (5) Agroup of\ncomputer companies pooled funds around 1991 to support maintenance of\nthe GNU C Compiler. (6) In the 80s Ihad not yet realized how confusing it was to speak of\n\"the issue\" of \"intellectual property\".  That term is obviously\nbiased; more subtle is the fact that it lumps together various\ndisparate laws which raise very different issues.  Nowadays Iurge\npeople to reject the term \"intellectual property\" entirely, lest it\nlead others to suppose that those laws form one coherent issue.  The\nway to be clear is to discuss patents, copyrights, and trademarks\nseparately.  See further explanation of how this term spreads confusion and\nbias. (7) Subsequently we have learned to distinguish\nbetween \"free software\" and \"freeware\".  The term \"freeware\" means\nsoftware you are free to redistribute, but usually you are not free to\nstudy and change the source code, so most of it is not free software. the Confusing Words and Phrases page for more explanation."
    },
    {
      "tag": "h4",
      "text": "More about the GNU Project"
    },
    {
      "tag": "div",
      "text": "All pages on the GNU web server should have the section about verbatim copying.  Please do NOT remove this without talking with the webmasters first. Please make sure the copyright date is consistent with the document and that it is like this \"2001, 2002\" not this \"2001-2002.\""
    },
    {
      "tag": "p",
      "text": "Translations of this page : Please keep this list alphabetical, and in the original language if possible, otherwise default to English If you do not have it English, please comment what the English is.  If you add a new language here, please advise web-translators@gnu.org and add it to - in /home/www/bin/nightly-vars either TAGSLANG or WEBLANG - in /home/www/html/server/standards/README.translations.html one of the lists under the section \"Translations Underway\" - if there is a translation team, you also have to add an alias to mail.gnu.org:/com/mailer/aliases Please also check you have the 2 letter language code right versus http://www.w3.org/WAI/ER/IG/ert/iso639.htm [ English | Česky Czech | Deutsch German | Español Spanish | Français French | Italiano Italian | 한국어 Korean | Nederlands Dutch | Polski Polish | Português Portuguese | Српски Serbian | Svenska Swedish ] Translations of the GNU Manifesto are also available in:\n[ German translation submitted by Peter Gerwinski, peter@gerwinski.de Deutsch French translation written by \"Jacques Du Pasquier\" jacques@dtext.com | Français Japanese translation by H. Meiko, Omoti, tomato1@mwnet.or.jp | 日本語 Russian translation submitted by Oleg S. Tihonov, tihonov@ffke-campus.mipt.ru Russian link is dead as of 05/2004: | <a href=\"http://www.gnu.org.ru/manifesto.html\">&#x0420;&#x0443;&#x0441;&#x0441;&#x043a;&#x0438;&#x0439;</a> Swedish translation written by Linus Walleij, triad@df.lth.se href=\"/gnu/manifesto.sv.html\" - see above Please keep this list alphabetical ] Return to the GNU Project home page . Please send FSF & GNU inquiries to gnu@gnu.org .\nThere are also other ways to contact the FSF. Please send broken links and other corrections (or suggestions) to webmasters@gnu.org . Please see the Translations\nREADME for information on coordinating and submitting\ntranslations of this article. Copyright (C) 1985, 1993, 2003, 2005 Free Software Foundation,\nFree Software Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, \nMA 02110-1301,  USA Permission is granted to anyone to make or distribute verbatim copies\nof this document, in any medium, provided that the copyright notice and\npermission notice are preserved, and that the distributor grants the\nrecipient permission for further redistribution as permitted by this\nnotice. Modified versions may not be made. Updated: timestamp start $Date: 2006/05/22 10:22:27 $ $Author: ramprasadb $ timestamp end"
    }
  ]
}