{
  "url": "http://www.hazards.org/rehab/",
  "content_hash": "76aa524f335c9041c3a94db56a8079eb482b768552ba948af7a17db6d37af759",
  "total_blocks": 64,
  "retained_blocks": 6,
  "ignored_blocks": 58,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" \"http://www.w3.org/TR/REC-html40/loose.dtd\""
    },
    {
      "tag": "p",
      "text": "TRANSLATE \n          THIS SITE HOME • ARTICLES • RESOURCES • NEWS • LINKS • SUBSCRIBE • ABOUT HAZARDS"
    },
    {
      "tag": "div",
      "text": "PO \n          BOX 199   SHEFFIELD   S1 4YL   ENGLAND         WWW.HAZARDS.ORG REHABILITATION"
    },
    {
      "tag": "p",
      "text": "Safety on a sick note Britain is not a \"sickie\" nation, latest research has proved. But attendance \n          records would be better still if more employers took rehabilitation \n          seriously, says Doug Russell, health and safety officer of retail union \n          Usdaw. [17 February 2005] For the full story order Hazards 89 Britain: \n          Insurers call for tax breaks for work rehab ABI, the body representing insurers, has called for new tax incentives \n          to improve the UK’s poor record on rehabilitating employees who \n          are injured or fall ill in the workplace. Risks 258, 27 May 2006 Britain: \n          Preventing sickness absence becoming job loss A new Health and Safety Executive (HSE) guide for safety and other trade \n          union representatives “suggests ways in which you can work in \n          partnership with employers and the workers you represent to help prevent \n          illness, injury and disability leading to prolonged sickness absence \n          and job loss.” Risks * Number 216 * 23 July 2005 Britain: \n          Bosses say they want to help the sick back to work Most employers say they take measures to help sick workers reintegrate \n          to the workplace, according to a new report published by DWP. Almost \n          all employers interviewed allowed employees to return to work on reduced \n          hours to ease their return, gradually building up the number of hours \n          worked over time. Risks 188, 24 December 2004 Britain: \n          Government backs GP-based work health advisers The government has announced a new scheme to place employment advisers \n          in GPs surgeries. Risks 186, 11 December 2004 Britain: \n          Back to work is working says minister Twice as many people on incapacity benefit return to work when they \n          have access to the government's pilot \"Pathways to Work\" schemes, \n          according to a new report. Risks 185, 4 December 2004 Britain Healthier approach to work sickness A drive to help people who become ill to stay in their jobs and to prevent \n          them leaving the workforce prematurely has been announced by the government. Risks \n          180, 30 October 2004 USA Message to injured workers - adapt or adios US autoworkers' union UAW has negotiated schemes placing injured workers \n          in new or modified jobs. The pick of the bunch is the Accommodating \n          DisAbled People in Transition program (ADAPT) programme in place at \n          auto giants General Motors and Delphi. Risks \n          151, 10 April 2004 Britain The importance of being rehabilitated As part of TUC's evidence to the Work and Pensions Select Committee \n          on the work of HSE/C, the TUC has produced a detailed briefing on the \n          importance of rehabilitation. Risks \n          151, 10 April 2004 • Full \n          TUC rehabilitation briefing New Zealand What is early return to work? Worksafe \n          reps Ist stop database Primary care occupational health service SOHAS, has published a \"1st \n          stop\" online database, making the link between jobs, occupational diseases \n          and workplace hazards. SOHAS Just \n          clocking on is not on: Safe, decent work for injured workers Return to work guidance from AMWU, Australia Australia Advice to members - What your doctor needs to know Victorian \n          Trades Hall Council news release Don't write us off New TUC research will underpin one of its most important campaigns - \n          the push for a better deal for workplace injury victims. TUC's Owen \n          Tudor explains. Don't write us off: People get injured all the time, and nothing \n          gets done says TUC , Hazards 79, July-September 2002 [pdf \n          format] Job retention Simple measures could reduce the length of \n          time workers are off sick and could reduce lost income and protect their \n          jobs, says workers' health specialist Simon Pickvance. Job retention: Keeping your job when sickness \n          or injury strik es , \n          Hazards 79, July-September 2002. To obtain the full text of this article subscribe \n          to Hazards UNISON information sheet on occupational health \n          schemes UK Public sector union UNISON says: \"Occupational \n          Health Schemes have a major part to play in preventing ill-health through \n          work, and UNISON wants to see a greater priority given to them. The \n          Treasury has recently demanded that public bodies ensure that their \n          employees have reasonable access to occupational health services. Branches \n          can use this to ensure that their employer introduces a scheme or reviews \n          any existing scheme.\" UNISON \n          information sheet Healthy approaches Canadian union CAW has produced a Return to work or modified work \n          checklist . Rehabilitating sick workers Canadian Autoworkers (CAW) has produced a factsheet on rehabilitating \n          disabled workers Light duties - who benefits? Factsheet on how to protect the \"walking wounded\" from the Canadian \n          Auto Workers (CAW). USA Job Accommodation Network The Job Accommodation Network (JAN) is a free consulting service that \n          provides information about job accommodations, the Americans with Disabilities \n          Act (ADA), and the employability of people with disabilities. The website \n          includes information on possible work-related conditions, including \n          Post Traumatic Stress Disorder (PTSD), arthritis, back conditions and \n          cancer, and has extensive links. Job Accommodation \n          Network JAN \n          ergonomics in the workplace guide JAN guide to job accommodation for people with cumulative trauma disorders (strain \n          injuries) How to stop the 14 billion workplace \n                injury drain There are seven steps employers should take to prevent workplace \n                injuries and illnesses costing the British economy 14 billion \n                annually, cut the 14.5 million days of sickness absence a year \n                caused by work-related illness and injury, and prevent 27,000 \n                workers leaving the workforce permanently every year because of \n                workplace injury and ill-health, according to TUC research. Risks \n                64, 27 July 2002 • TUC \n                news release This TUC initiative is based on three Rehabilitation and retention publications: What \n                matters is what works - summary ; the \n                view from the workplace - full report ; and the \n                case studies [all pdf format] TUC WorkSmart TUC \"workSMART\" guide on workplace occupational health services, \n                including return to work agreements, long term sickness absence, \n                disability and ill-health retirement. TUC rehabilitation webpage BRITAIN Insurers and TUC get rehab A national action plan is needed to revive Britain's inadequate \n                rehabilitation services say the Association of British Insurers \n                (ABI) and the TUC. Delays in treatment, lack of resources and \n                a disjointed approach mean that the UK lags behind most other \n                industrialised nations in the help it provides to sick workers. Risks \n                91, 1 February 2003 What is a Return to Work Plan? New South Wales Labor Council, Australia OHS NET provides a briefing \n          on new work rehabilitation procedures in the state."
    },
    {
      "tag": "div",
      "text": "Rehabilitation adds up Ready reckoner The UK Health and Safety Commission (HSC) has \n        launched a \"ready reckoner\" for Britain's businesses to help them work \n        out how much work-related accidents and ill-health is costing them. Sixty \n        thousand copies of the ready reckoner are being distributed to union safety \n        reps through the TUC. Reduce risks - \n        cut costs: the real costs of accidents and ill-health at work"
    },
    {
      "tag": "p",
      "text": "What it costs to hurt you The European Agency for Safety and Health at Work has produced a new \n          tool to \"improve occupational safety and health and to increase the \n          competitiveness of your business.\" It allows you to calculate the additional \n          cash flow that would be generated if the firm invested in specific preventive \n          measures - a standard \"cost-benefit' analysis.\" European \n          Agency news release Inventory of socio-economic costs of work accidents. Summarised in Agency \n          factsheet 28 Risks \n        71, 14 September 2002 HAZARDS \n          MAGAZINE   •  WORKERS' HEALTH INTERNATIONAL NEWS"
    }
  ]
}