{
  "url": "http://www.historylearningsite.co.uk/1997_general_election.htm",
  "content_hash": "f435153263b139010f688f4274296f52725857fddbc3824857c04df2f4a132e8",
  "total_blocks": 99,
  "retained_blocks": 15,
  "ignored_blocks": 84,
  "blocks": [
    {
      "tag": "div",
      "text": "html\n\tPUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" The 1997 General Election ValueClick Media 468x60 and 728x90 Banner CODE for\r\nhistorylearningsite.co.uk ValueClick Media 468x60 and 728x90 Banner CODE for\r\nhistorylearningsite.co.uk google_ad_section_start History Learning Site > British Politics > The 1997 General Election"
    },
    {
      "tag": "p",
      "text": "Total seats contested : 659 Labour"
    },
    {
      "tag": "div",
      "text": ": 419 seats (63.6% of total seats); 43.2% of popular vote.\r\nGained 146 seats from 1992; lost no seats from 1992 results"
    },
    {
      "tag": "p",
      "text": "Tories"
    },
    {
      "tag": "div",
      "text": ": 165 seats (25.1% of total seats); 30.7% of popular vote.\r\nGained 0 seats from 1992; lost 178 seats from 1992 results."
    },
    {
      "tag": "p",
      "text": "Liberal Democrats"
    },
    {
      "tag": "div",
      "text": ": 46 seats (7% of total seats); 16.8% of popular\r\nvote. Gained 28 seats from 1992; lost 2 seats from 1992 results."
    },
    {
      "tag": "p",
      "text": "Others : 29 seats (4.3 of total seats); 7% of popular vote. Gained 5\r\nseats from 1992; lost 0 seats from 1992. Others = SNP (6), PC (4), Independent (1), Northern Irish seats (18) Added together, all the seats in opposition = 240 . Therefore, if all\r\nOpposition MPs voted against the government and all the government MPs\r\nvoted for the government, the government would have a clear majority of 179 .\r\nIf 50 maverick Labour MPs voted against the government on whatever issue, the\r\ngovernment would still have a majority of 129 - huge by parliamentary standards. Note :"
    },
    {
      "tag": "div",
      "text": "1997 represented a record number of Labour seats\r\n    The turnout for this election was 71% - the lowest for 62 years (1935)\r\n    120 female MPs were returned : 101 to Labour and 14 to the Tories\r\n    5 Asian and 4 African-British MPs were elected - all Labour\r\n    The former BBC correspondent Martin Bell won as an Independent against\r\n      Neil Hamilton, the incumbent Tory MP then accused of corruption (and found\r\n      guilty of it)\r\n    the election returned the youngest MP to Westminster - 24 years of age.\r\n    the election was the Tories worst showing since 1906.\r\n    the LibDems own the highest number of Third Party seats since 1929.\r\n    the Referendum Party spent an estimated 20 on 547 candidates and\r\n      received 3% of the total cast votes. They lost all their deposits.\r\n    the % of Tory votes for all votes cast, was the lowest since 1832\r\n    the swing from the Tories to Labour was 10% - the largest figure ever\r\n      and twice that of the previous highest\r\n    BUT the % of Labour votes cast was lower than in its election victories\r\n      of 1945 and 1966 and its electoral defeats in 1950 and 1964.\r\n    voter turnout in strong Labour areas was down in 1997\r\n    the 75 seats won by LibDems + others was the highest since 1923."
    },
    {
      "tag": "p",
      "text": "Why did the Conservatives lose the 1997 election ? Why did the Conservatives lose, especially at a time of economic recovery? Forced withdrawal from ERM in 1992 (which, paradoxically, helped\r\n  recovery) Unpopular policies, for example, rail privatisation, VAT Air of arrogance and hubris, for example, sleaze, cheating on pairing\r\n  on fishing quotas (1996), arms to Iraq, IRA prison escapes, BSE, judicial\r\n  reviews, reluctance of ministers to accept responsibilities and resign Minority government by end of 1996. Government dependent in Commons on\r\n  Unionists; abandonment of IRA ceasefire early in 1996. February 1997 Wirral South by-election: 1 7 per cent swing to Labour.\r\n  (Unhappy irony: the Conservative candidates name, Leslie Byrom, is anagram\r\n  of loser by mile) Manifest and bitter party disunity over Europe, especially\r\n  smack-of-firm-compromise wait and see approach to a single European\r\n  currency Longest post-war electoral campaign - backfired. Boredom and further\r\n  sleaze Sniping from the wings by James Goldsmiths Referendum Party and Alan\r\n  Skeds Independence Party Defections by pro-Europeans such as Alan Howarth and Emma Nicholson Unpopularity of Major when compared to Blair Conservative Norman Lamont said government gave the impression of being\r\n  in office but not in power inept campaigning, for example, demon eyes and weeping lion\r\n  posters ridiculed Conservative press largely turned against them especially \"The\r\n  Sun\". Time for a change - widely held public sentiment Why did Labour win? Labour benefited by: Internal reforms, for example, some reduction in trade union power; One\r\n  Member One Vote John Smiths death in 1994 allowed creation of New Labour by the more\r\n  modernising Blair - notably, abandonment of Clause IV in 1995 Rapid centralisation of party and presentation around leader and\r\n  spin-doctors at Millbank election headquarters and a highly polished campaign Abandonment of traditional socialist - or even social democratic -\r\n  principles and acceptance of market economics, low inflation and interest\r\n  rates, cuts in taxation, spending and welfare. Pre-election commitment to\r\n  maintain existing tax levels for a five-year term and present spending levels\r\n  for two years, welfare to work, tough law and order especially for\r\n  juvenile offenders. Difficult for the Conservatives to criticise what were,\r\n  largely, their own policies Desire for power, combined with growing party discipline, largely\r\n  silenced left-wing Labour dissidents. The campaign was hit by no major blows\r\n  from the extreme left which could have de-stabilised the election effort.\r\n  Europe was not an obviously contentious issue as it was for the Tories. New, radical proposals for constitutional reform Lack of clear blue water between the two main parties threatened to\r\nsqueeze the Liberal Democrats but - despite a lower vote than in 1992 - they won\r\nover twice as many seats due to careful targeting of their limited resources and\r\nskilful tactical voting by anti-Conservative voters. What about 2001 ? From the above, it is safe to conclude that Labour will win the next\r\nelection. It is a safe betor is it ? One of the main things that came out of the 1997 election was voter\r\nvolatility. If it happened in 1997, then it could happen in 2001. The number of\r\npeople who changed support from the 1992 election to the 1997 election has been\r\nas high as 23% by NOP. This is an increase of 2% from the 1987 election. If this\r\ntrend is continued, as many as 25% may change their voting allegiance in 2001. In 1997, Labour had very strong representation amongst the 18 to 29 years old\r\nage group. If this group feels significantly let down by the last 5 years of\r\nLabour government, it could turn against Blair. In the 5 years from 1992 to\r\n1995, the Tories lost 18% support among this group while Labour won 19% from\r\nthis group. The evidence tends to suggest that the Tories suffered the most from tactical\r\nvoting The Tories suffered in 1997 from the electoral system. If the Tories had got\r\nthe number of seats that their percentage of votes in each constituency\r\nrepresented, then the overall Labour majority would have been cut to 131 - still\r\nvery large from a Parliamentary perspective. Likewise, the LibDems success would\r\nhave been cut to 28 seats rather than 46. But the support for the Tories is\r\nconcentrated primarily in the south, whereas support for the Labour Party has\r\nexpanded away from the traditional areas associated with the Labour Party. But\r\nexpansion can always lead to contraction and tactical voting in 1997 might not\r\nrepeat itself in 2001."
    },
    {
      "tag": "div",
      "text": "History Learning Site > British Politics > The 1997 General Election"
    },
    {
      "tag": "p",
      "text": "Search Site: If you have any enquiries or notice any problems please contact me at enquiries@historylearningsite.co.uk About the Author"
    },
    {
      "tag": "div",
      "text": "google_ad_section_end"
    },
    {
      "tag": "p",
      "text": "Search Site:"
    },
    {
      "tag": "div",
      "text": "Related Pages Roman Entertainment Roman Engineering Medieval Church Architecture Abyssinia The Yalta War Conference China in 1900 Important events in public and environmental health in Great Britain 1900\r\nto 1939 The National Health Service Greensboro 1960 The 2001 British General Election © 2000-2006 historylearningsite.co.uk"
    }
  ]
}