{
  "url": "http://www.house.gov/mcdermott/agoa/index.shtml",
  "file_number": "489",
  "content_hash": "9ba6d7c57c1c9fb27feb4cf77ee24970bdfb9a67f23b102968bf85dff2400e3f",
  "total_blocks": 103,
  "retained_blocks": 4,
  "ignored_blocks": 99,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" spacer Last Page Update: Septeber 8, 2005 Home Page What is AGOA? What is AGOA III? AGOA Research <a href=\"agoa_endor.shtml\">Endorsements of AGOA III</a> </td></tr> left side"
    },
    {
      "tag": "p",
      "text": "Rarely does life present the opportunity to change the world in such a\r\nprofoundly positive way.\r\nWe are called to action today, inspired by legendary leaders who understood\r\nthat today's actions and words will echo long into tomorrow. Before the Congress of the United States is AGOA III, the Africa Growth and\r\nOpportunity Act. AGOA is a commitment to Africa's destiny, charted by Africans, encouraged by\r\nAmericans, and expressed in hopes and dreams that have stirred great nations\r\nthroughout history. Africa can bridge the political divide. AGOA can bind Republicans and\r\nDemocrats, embracing an African destiny that recalls American's own struggle\r\nfor independence. We establish this place to bring voices, and faces, and nations, together.\r\nTo share, and learn, and understand.\r\nJoin us. Contemplate what role America can play in Africa's destiny.\r\nCelebrate what Africa is, what Africa will be. Jim McDermott Member of Congress Bono Appeals to House and Senate Leaders to Quickly Pass AGOA III Earlier this year Bono spoke to Members of the U.S. House and Senate and African diplomats.  He said that Africans were terrified that provisions of AGOA would expire in September 2004, and he urged the Congress to quickly pass AGOA III The front man for the Irish rock band U2 founded the organization DATA (Debt, AIDS, Trade, Africa) in 2002 to advocate for debt relief, AIDS funding, and a fair international trade policy for Africa. Links"
    },
    {
      "tag": "div",
      "text": "U.S. Government's AGOA Page AGOA Stats Corporate Council on Africa Africa America institute Constituency for Africa Debt Aids Trade Africa - (DATA) The Global Fund Washington Office on Africa All Africa AGOA Business Center Foundation for Democracy in Africa McDermott homepage right side NEW Africa Trade Competitiveness Report Out"
    },
    {
      "tag": "p",
      "text": "The AGOA Acceleration Act, a trade law authored by McDermott enacted last summer, required the president to conduct country-by country studies on trade and investment opportunities in sub Saharan Africa.  The report details many opportunities for entrepreneurs while also pointing the barriers to economic growth in key sectors and it makes recommendations to policy makers about ways in which to overcome these challenges. Read the report... [ Adobe Reader® ] White House Press Release For Immediate Release Office of the Press Secretary July 13, 2004 President Bush Signs African Growth and Opportunity Act Remarks by the President at Signing of the Agoa Acceleration Act of 2004 Dwight David Eisenhower Executive Office Building THE PRESIDENT:  Thanks for coming.  In just four years, the African\r\nGrowth and Opportunity Act has shown the power of free markets to\r\nimprove the lives of people in both the United States and Africa.  By\r\nreducing barriers to trade, this law has increased export, created\r\njobs, and expanded opportunity for Africans and Americans alike.  It\r\nhas given American businesses greater confidence to invest in Africa,\r\nand encouraged African nations to reform their economies and\r\ngovernments to take advantage of the opportunities that AGOA provides.\r\nSo today I'm pleased to build on that success and extend the law's\r\nbenefits long into the future by signing the AGOA Acceleration Act of\r\n2004. This legislation is a product of strong bipartisan cooperation, and\r\nIthank the members of the House and the Senate for working together on\r\nthis very important piece of legislation.  And Iwant to thank those in\r\nthe audience who worked hard to see that the bill made it to my desk as\r\nquickly as it did. Mr. Secretary, thank you very much for your leadership.  Secretary\r\nPowell is a strong believer in the potential of the continent of\r\nAfrica, and so am I. Iappreciate so very much Senate Majority Leader Bill Frist for\r\njoining us today.  Senator, thank you for coming.  I'm pleased to see\r\nthat my friend, the Ranking Member of the Senate Finance Committee, Max\r\nBaucus, is still standing.  And Iappreciate your\r\nleadership, sir.  We're honored that Dick Lugar, who is the Chairman of\r\nthe Senate Foreign Relations Committee, is with us.  Mr. Chairman,\r\nthank you, and thank you for your clear vision for a better world.  Iappreciate so very much the members of the Ways and Means Committee who\r\nare here with us -- the Chairman and Ranking Member -- Chairman Bill\r\nThomas, who's worked so hard for this legislation, as has his friend\r\nand Ranking Member, Charlie Rangel, both fine members of the Congress.\r\nThank you all for being here, and thanks for your good work.  Ialso am\r\nhonored that Ed Royce, the Chairman of the International Relations\r\nSub-committee on Africa, has joined us, and soon will be joined by\r\nDonald Payne, the Ranking Member, as well. These members put in good work.  They worked hard.  They brought\r\nthe other members of Congress along with them, many of whom are with\r\nus. Iam honored that the dean of the African Diplomatic Corps stands\r\nwith me today.  Mr. Ambassador, thank you for coming.  I'm proud you're\r\nhere.  And thank you for representing the other ambassadors who have\r\njoined us today.  We appreciate you taking time to come.  And thanks\r\nfor supporting this legislation. There's a growing consensus in both Africa and the United States\r\nthat open trade and international investment are the surest and fastest\r\nways for Africa to make progress.  That's what you have said; that's\r\nwhat Congress had responded to.  For too many years, the world's\r\nefforts to promote Africa's development were focused on aid.\r\nDevelopment aid is important.  Nothing wrong with aid.  And my\r\nadministration has substantially increased aid to Africa, and we\r\nappreciate working with the members to do that. But as Uganda's President Museveni has said, \"By itself, aid cannot\r\ntransform societies.  Only trade can foster the sustained economic\r\ngrowth necessary for such transformation.\"  This African leader\r\nunderstands that when nations close their markets and opportunity is\r\nhoarded by a privileged few, no amount of development aid is ever\r\nenough.  But when nations respect their people, open their markets,\r\nexpand freedom and opportunity to all their citizens, entire societies\r\ncan be lifted out of poverty and despair.  This is a hopeful piece of\r\nlegislation.  As America works for open markets and opportunity on the\r\nAfrican continent, we will also confront disease and hunger and the\r\nviolence that undermines progress and hope. I'm deeply concerned about the humanitarian and human rights crisis\r\nin Darfur, Sudan.  For the sake of peace and basic humanity, Iecho the\r\nsentiments of the Secretary of State.  Icall upon the government of\r\nSudan to stop the Janjaweed violence.  Icall on all parties of the\r\nconflict to respect the cease-fire, to respect human rights, and to\r\nallow for the free movement of humanitarian workers and aid.  The\r\nUnited States and the United Nations and the leadership of the African\r\nUnion are working to bring relief to the suffering people of that\r\nregion.  America will continue to strongly support these efforts for\r\npeace. One way to spread peace is to encourage political and economic\r\nreform across Africa by opening markets here in the United States.\r\nIt's important for our people to understand, by opening United States\r\nmarkets we make it more likely there will be peace on the continent of\r\nAfrica. AGOA nations are strengthening the rule of law.  They are lowering\r\ntrade barriers, they're combating corruption, and eliminating child\r\nlabor.  They're setting an important example for the entire continent,\r\ndemonstrating that governments that respect individual rights and\r\nencourage the development of their markets are more likely to grow\r\neconomically and achieve political stability. Like all good partnerships, AGOA has been beneficial to all\r\nparties.  Free trade between the United States and sub-Sahara Africa\r\nhas created jobs, wealth, and opportunity on both continents.  Last\r\nyear, under AGOA, African exports to the United States increased by 55\r\npercent, and African -- and American businesses saw a 15-percent\r\nincrease in our exports to sub-Sahara Africa that equals almost $7\r\nbillion.  The most notable gains were made by American companies\r\nselling agricultural goods and machinery and transportation equipment. See, when you sell goods in Africa, it means somebody is finding\r\nwork here at home.  Trade must work both ways.  AGOA has been\r\nbeneficial to the people of the continent of Africa and to the people\r\nof the United States of America.  That's why this is a good piece of\r\nlegislation. Since its enactment in 2000, AGOA has generated over $340 million\r\nin investment and created thousands of jobs.  Things are happening\r\nbecause of the law we're extending today, positive things for people in\r\nAfrica and in America.  The enactment of this law will help ensure that\r\nthis mutually beneficial trade continues.  Trade and investment from\r\naround the world is essential to world peace.  The United States and\r\nthe nations of the sub-Saharan Africa are working together to break\r\ndown trade barriers around the world -- not just between ourselves, but\r\naround the world. My trade representative, Ambassador Bob Zoellick is in Africa right\r\nnow.  He's meeting with his counterparts from across the continent to\r\nprepare for the World Trade Organization meeting in Geneva later this\r\nmonth.  These are important meetings.  They're important meetings for\r\nthe people of the United States; they're important meetings for the\r\npeople on the continent of Africa.  And the reason why is because we\r\nwant to advance our shared economic agenda, and it's very important for\r\nour AGOA partners to help make these talks in Geneva a success.  Pass\r\nthe word on to your capitals. No region has more to gain from free markets than Africa -- that's\r\nthe message.  And no region has more to lose from a stalled WTO process\r\nthan Africa.  By working together and by our example, we can show the\r\nworld that a new global trade agreement can bring greater prosperity to\r\nall nations. Real prosperity is the work of many years.  Iknow that.  It's hard\r\nwork.  It's hard to change the status quo.  This law encourages the\r\nchange in the status quo. I'm so pleased and proud to see the ambassadors from the African\r\nnations who are here.  Thank you all for coming.  You've worked hard to\r\nmake AGOA a success.  You've worked hard to spread the message in the\r\nhalls of Congress, and your hard work has paid off.  Ishare your\r\noptimism about Africa's future.  That's what we believe.  Those of us\r\nwho are standing up here believe in the future of Africa.  We\r\nappreciate the commitment to freedom.  We appreciate your understanding\r\nthat we all have an obligation to spread opportunity throughout all\r\ncorners of this important part of the world. And now, it is my honor to sign this important piece of\r\nlegislation. This is an official website of the United States House of Representatives"
    }
  ]
}