{
  "url": "http://www.iasp-pain.org/TC98SeptOct.html",
  "file_number": "496",
  "content_hash": "e3984b2dd7cd050322a679ca4975f54b02a1e7c19792a95ea0a97676afd54640",
  "total_blocks": 61,
  "retained_blocks": 4,
  "ignored_blocks": 57,
  "blocks": [
    {
      "tag": "div",
      "text": "Logo bar Source Code Copyright © 2001 Active Matter, Inc. www.activematter.com - TemplateTopNav.cfm About IASP® Membership Meetings Education Publications Resources Chapters SIGs Contact Us What's New Utility bar Grants | Global Year Against Pain | World Congress on Pain® | Career Opportunities sidenav Print this page Text Only Site Search IASP: Advanced Search Source Code Copyright © 2005 by Advanced Solutions International, Inc."
    },
    {
      "tag": "h1",
      "text": "Welcome to IASP ®"
    },
    {
      "tag": "p",
      "text": "Welcome to our new website. We hope you like our changes. Please \r\n\r\nnote that the website is still being updated. Please let us know if you \r\nhave any questions or if you note any errors. A Feedback \r\nForm is located in the pages titled \"About IASP.\" Thank you. IMPORTANT MESSAGE: Current IASP Members: You need to \r\ncreate a NEW login and password before you \r\ncan use this site to access the members only section of this site, \r\npay your dues online, or edit your profile. You'll see the members' \r\n\r\nlogin on the left side of the screen. Click on the \"first \r\ntime?\" link and enter the email address that is on file at IASP \r\n\r\n(most likely your work email). Please do NOT use your old login \r\n\r\nand password . If you don't have an email address, or don't \r\nthink you have one on file with us, simply email members@iasp-pain.org or call \r\n+1.206.283.0311 ext 229 and we'll help you complete your \r\nregistration. The following IASP Staff are working hard to create this \r\nwebsite: Dale Schmidt, Kris Lukkarila, Yaa Cuguano, Elizabeth \r\nEndres and Marleda Di Pierri. A huge thank you to all of them plus \r\nthe back office support of Vladimir Reid and Jeff Spring at TSC and \r\ninitial project manager Grace Stahre at Fuse IQ."
    },
    {
      "tag": "div",
      "text": "We are the largest multidisciplinary international association in the \r\nfield of pain. Founded in 1973, the International Association for the \r\nStudy of Pain® (IASP) is a non-profit professional organization \r\ndedicated to furthering research on pain and improving the care of \r\npatients with pain. Membership in IASP is open to scientists, physicians, dentists, \r\npsychologists, nurses, physical therapists, and other health \r\nprofessionals actively engaged in pain research and to those who have \r\nspecial interest in the diagnosis and treatment of pain. Currently IASP \r\nhas more than 6,900 members from 106 countries. home login members Source Code Copyright © 2005 by Advanced Solutions International, Inc. Contact Information | Site Index | What's New | Disclaimer © by The International Association for the Study of Pain saved from url=(0022)http://internet.e-mail Source Code Copyright © 2005 by Advanced Solutions International, Inc."
    }
  ]
}