{
  "url": "http://www.ibiblio.org/cisco/tracy-article.html",
  "file_number": "497",
  "content_hash": "e9e090bbb38bbc6f51b802870a7e623bf81f48ba4a00c10929de418c6d10b829",
  "total_blocks": 125,
  "retained_blocks": 7,
  "ignored_blocks": 118,
  "blocks": [
    {
      "tag": "h1",
      "text": "The Internet and Schools: A Survey of Networking Activities"
    },
    {
      "tag": "div",
      "text": "Tracy LaQuey Parker Manager, Education Market Development, Cisco Systems tparker@cisco.com (Presented at the Internet Society's INET '94 Conference in Prague)"
    },
    {
      "tag": "p",
      "text": "Abstract This paper presents a survey of some of the major \ngroups and activities that are shaping the future of the \nInternet's role in education.  It also covers some \nprojects that benefit administrative, instructional, \nprofessional development and community outreach \nprojects and applications, and some exciting current \ninitiatives around the U.S.  Finally, it discusses some \nof the barriers that face schools in getting connected to \nthe Internet. The paper was written with a U.S.\nperspective. I. Introduction The school community (commonly referred to as \nK-12 in the U.S., meaning kindergarten through 12th \ngrade) is starting to focus its attention on the Internet.\nMost school networking activity has occurred in the \nU.S., however, there are projects being initiated in \nCanada, Japan, the UK and other countries. The \nInternet is being used for all aspects of education, \nincluding administrative, educational, professional \ndevelopment, and community building. A recent informal census conducted via voluntary \nreportings over the Internet estimates the number of \nteachers and students (individual and classroom \naccounts) in the U.S. using the Internet, either directly \nor indirectly, at almost 250,000. The number of \neducational resources, databases, mailing lists, and \narchives is also growing rapidly -- so much so that one \neducator recently lamented on an education mailing list \nthere was too much available, that the sheer number of \ndistributed services was large enough to overwhelm the \nnovice teacher embarking for the first time on a digital \nprofessional development trip.  (This problem is being \naddressed with the appearance of user friendly search \nand retrieval tools that present a simple, organized face \nof the Internet, such as Gopher and the \nWorldWideWeb.) The state of educational networking is being shaped \nby many groups, networking initiatives, pilot projects \nand new challenges.  Some of these are outlined below. II. International Groups and Projects Some of the international direction and evangelism \nfor K12 networking is being headed by the Internet \nSociety's K-12 Committee. The Internet Society (ISOC) is a professional \norganization that is chartered to facilitate and support \nthe technical evolution of the Internet as a research and \neducation infrastructure, and to educate the members on \nits technology, uses and applications. The ISOC's K-\n12 committee was formed about 2 years ago to \npromote the use of networking in the classroom, \ndiscuss issues related to teachers and children accessing \nthe Internet and to propose concrete and useful \nsolutions to barriers facing educators and students. II.A. IETF Involvement Among the many projects its members are working \non, the Internet Engineering Task Force (IETF) is \nworking on school-related efforts. For example, the IETF's Internet School \nNetworking (ISN) Working Group recently wrote a \nRequest for Comments (RFC) For Your Information \n(FYI) document (RFC1578) called \"FYI on Questions \nand Answers - Answers to Commonly Asked Primary \nand Secondary School Internet User.\"  The various \nsections answer questions about obtaining an Internet \nconnection, technical implementation and technical \noptions, security and ethics, educational collaboration, \nprojects and resources. This working group is creating other useful \ndocuments. One of these\"K-12 Internetworking \nGuidelines\" explains what schools need to know for \nfuture networking plans. II. B. U.S. Groups and Networks In the U.S., there is the well known National \nResearch and Education Network (NREN) part of the \nHigh Performance Computing and Communications \nAct of 1991.  The more recent National Information \nInfrastructure (NII) initiative, which is much broader in \nscale, is intended to benefit K-12 education in terms of \nubiquitous connectivity to all schools. Indeed,  the \nClinton/Gore Administration recently issued an \nambitious challenge calling for all schools and libraries \nto be connected to the NII by the year 2000.  Many \nbusinesses have responded with pledges to make this a \nreality. II.C. The Consortium for School Networking The Consortium for School Networking (COSN) is \na membership organization of institutions, companies \nand individuals charged  with promoting the use of \ncomputer network technology in K-12  education \nwithin the United States. Services COSN provides to  \nits members include regular newsletters on networking \ntopics of interest, an extensive on-line gopher server of \neducation networks,  projects and resources. COSN has \nalso testified to Congress on  behalf of K-12 \nnetworking interests. One of the latest efforts from COSN was a project \nfunded by the National Science Foundation and being \nconducted in cooperation with the Federation of \nAmerican Research Networks (FARNET). The project, called \"Building Consensus and \nModels,\" brought  together representatives from \nindustry, national, state and  local levels.   Five groups \nformed, each charged with laying  out the key \nrequirements and proposed models for a certain topic.\nThe topics and models included educational reform and  \nrestructuring for a technology-intensive society; \nconnectivity  and access; technical and user support; \nfinancial; and curriculum  and content. (See the COSN \nGopher for more information.) II. D. U.S. State Projects In the U.S., state-level discussion are underway for \na mix of connectivity and content solutions. Many states have decided not to reinvent the wheel \nand are  recommending schools and districts connect to \nexisting midlevel  and commercial networks, while \nproviding a multi-phase approach to  giving teachers \nand administrators Internet connectivity. One example of state-based education networking is \nthe Texas  Education Network, also known as TENET.\nTENET has received lots of attention because of its \nsuccess in  leveraging an existing network, the Texas \nHigher Education  Network (THEnet) as a backbone \nnetworking infrastructure.  THEnet  is a statewide \nInternet-connected network that provides services  to \nover 100 education and research organizations in Texas.\nIt is  operated and maintained by the University of \nTexas System Office  of Telecommunication Services \nin Austin, Texas. The requirements for access are minimal; an \neducator  can dial into 1 of 18 local points of presence \n(Cisco CommServers and modem pools connected to \nTHEnet member universities) using existing \nequipment in his home or classroom: a computer (PC \nor Macintosh), a modem and a phone line. (An 800 \nnumber serves those not located in a local calling area.)\nThe costs for access are low; teachers can currently get \nan account on the TENET computers for $5/year. The success of this project is obvious: after a little \nover 2  years of operation, 30,000 educators are using \nTENET.  The  Internet and TENET have been \ndemonstrated enthusiastically in  every school district \nand the benefits and uses are now obvious  to many \npeople.  As a result, many school districts are planning  \nfor direct connections to the Texas Higher Education \nNetwork.  Additionally, all 20 Texas Education Service \nCenters  (ESCs) have recently connected to THEnet. Other states have had similar successes to \nTENET's.  Virginia's  Public Education Network \n(VAPEN) and Florida's Information Resource Network \n(FIRN) are also dial-up networks servicing thousands \nand thousands of teachers.  The state of  California \noffers dial-up Internet access to teachers through the  \nCalifornia State University (CSU) network; this K-12 \nnetwork is  called California On-line Resources for \nEducation (CORE) and is  operated both by the \nCalifornia State University  system and the California \nDepartment of Education.  Oregon announced in \nSeptember 1993 their ambitious OPEN initiative \n(Oregon Public Education Network) to connect all \nschool districts, giving Internet access to 500,000 \neducators and students. Hawaii is investigating \ninterconnecting all of its public schools to a statewide \ncable system. And other states have announced or are \nworking on statewide initiatives. III. Benefits of Using the Internet for \nEducation In order for the Internet to successfully be integrated \ninto  schools, benefits must be shown for all aspects \nof education:   instructional, administrative, \nprofessional development and  community \ninvolvement.  The Internet is already proving itself in  \nthese areas as evidenced by some major initiatives.\nSome of  these projects are described here. III. A. Administrative Uses There is quite a big business in US education for \nadministrative  applications, systems that provide \neverything from student record creation and \nmaintenance, class scheduling, to food services and \naccounting.  For the most part, these systems are \naccessible to local  district or regions only and are not \nnetworked into larger  systems. This is unfortunate as there is much need for the \nability to  transfer administrative information between \nschools and  districts.  The US student population is \nvery mobile.  According  to \"A Study of the \nFeasibility of Implementing a Statewide Process  for \nElectronically Sharing Student Information\" (a \ncollaborative effort by the California Department of \nEducation, Far West Laboratory for Educational \nResearch and Development and the California \nEducational Data Processing Association, published \nOctober 1992), it is estimated  in California alone that \nas many as 20% of the student population  change \nschools annually. Furthermore, according to the study, the current \nmethod for  exchanging student records and reporting to \nstate and federal  agencies costs California a staggering \n$50 million each year.  It's not only expensive, it's \ntime consuming; the average time  spent transferring a \nrecord using the current system is 24 days. [1] Clearly what is needed are standards for the \nexchange of this  information across a common \nnetwork, such as the Internet.  Using  Electronic \nDocument Interexchange (EDI), student records could \nbe  transferred across the Internet to other schools, as \nwell as  universities and community colleges. The \ntime could be cut from  weeks to seconds and the cost \nsavings estimated are considerable;  according to the \nabove California study, the cost drops from the current  \naverage $15 per transferred record to $4. (And some \npeople think  that $4 is too high, that the cost could \nbe mere pennies per  record.) Indeed, with savings like \nthese, a business case can  certainly be made for \ninstalling a network infrastructure and a link to the \nInternet. A project called SPEEDE/ExPRESS, the \nStandardization of Postsecondary Education Electronic \nData Exchange/Exchange of Permanent Records \nElectronically for Students and Schools, is taking the \nlead in defining standard record formats, and is also \nworking with schools, universities and states to \nimplement pilot projects. The University of Texas is \ncurrently exchanging records in this fashion with the \nAustin Independent School District and is planning on \nadding other universities and schools. There are similar \npilots in Arizona, Florida and California. It will take some time before standards exist for a \nubiquitous  networked student record transfer system.\nBut the Internet is  serving in other administrative \ncapacities. The Texas Education  Agency (TEA)\ncurrently makes many documents available on-line on  \nTENET, including calendars, legislative summaries, \ndirectories,  forms and spreadsheets.  The hard copy \nversions are also mailed  to schools, but an increasing \nnumber of people are realizing they  can receive the \ninformation much faster by downloading it from  the \nnetwork.  TEA could save millions of  dollars in \nduplication and postage by making these documents  \nsolely available via the network. Indeed, the State of \nTexas has estimated annual savings of $1.4 million \nbased solely on access to TENET. III. B. Professional Development Many teachers are using the Internet for \nprofessional  development. Consider the plight of \nspecialized instructors, such  as journalism or physics \nteachers.  Many schools or school  districts only \nemploy one such teacher.  As a result, the  librarian or \nwoodworking instructor often feels isolated and must  \nbecome very self sufficient in areas such as curriculum \nand  professional development.  With a network such \nas the Internet,  these teachers now have support \ngroups; \"places\" a teacher can go  to share ideas with \nand ask questions of others in their  discipline, as well \nas download resources for use in the  classroom. For example, Pat Gathright, the journalism teacher \nat MacArthur  High School in San Antonio, Texas, is \na true believer in the  benefits of networking and using \nthe Internet.  Ms. Gathright has  a TENET account and \nuses it to collaborate with other Internet-connected \njournalism teachers across Texas and the US. \"I have the sole responsibility on my campus for \nthe yearbook,  newspaper, Journalism I, and \nPhotojournalism,\" she says. \"Few of  my fellow \nteachers can come close to understanding what my job \nis  like or help me with some of the problems I face \neach day.  But  know that I can log onto the Internet \nand share with my  journalism friends across the state a \ndesktop publishing trick  that I learned at a workshop, \na place to find information on a  story my students are \nworking on, or just news about my day.\" [2] Before TENET existed, journalism teachers like \nMs. Gathright met once a year at their annual \nconference in Austin.  Now many TENET-connected \nteachers meet online 24 hours a day, 365 days a year. Many teachers are using the Internet to coordinate \nprojects with classrooms in other countries.  For \nexample, Helen Bell, the school librarian at Lincoln \nJunior High School in El Paso, Texas, has been \ncorresponding with Taichi Kameyama, a professor at \nGifu University in Japan who has assisted in \ncoordinating projects between a local Japanese high \nschool and Lincoln.  Juliette Avots from Wellesley \nHigh School in Massachusetts also works with \nteachers in France to develop structured language \nprojects. In addition to collaborating with colleagues and \ndeveloping joint projects, teachers can also  engage in \ndialogues with field experts. Using the Internet,  \nteachers can connect to NASA's Spacelink (operated by \nthe  Marshall Space Flight Center in Huntsville \nAlabama) and send  questions to space experts, \nincluding space shuttle astronauts. Another project provided by the Educational \nResources Information  Center (ERIC), a US national \ninformation system, provides an  Internet-based \nquestion-answering service for teachers, library  media \nspecialists, and administrators who have questions \nabout K- 12 education, learning, teaching, information \ntechnology and  educational administration. Anyone \ninvolved with K-12 education  can send an e-mail \nmessage to AskERIC and receive an answer  within 48 \nworking hours. Teachers can also download useful information, \nguides and images  for use in the classroom.  Many are \ntaking advantage of on-line  Associated Press (AP) and \nReuters newsfeeds, the daily CNN (Cable  News \nNetwork) Newsroom curriculum guide, NASA space \nimages, and  regularly updated weather reports; all of \nthese are easily  accessible and available on the \nInternet. III.C. Benefits for Students One of the best publicized uses of the Internet is for  \ninstructional purposes. Children love computers and \ncomputer  networks and there are lots of distance \nlearning projects being  conducted, ranging from \nelectronic penpals to  collaborative/comparison studies.\n\nOne such project involved students from different \ncountries  comparing prices, packaging and contents of \nvarious products,  integrating math, social studies, \nlanguage and geography.  (Most  of the students were \nnot even aware they were learning!) Other  readily \navailable information services are providing students  \nwith the latest in current events.  Some of these \ninclude US  White House press releases and briefings; \nRadio Free Europe  reports; and UN News. Rachel Weston, a 7th Grader at Georgetown Day \nSchool in Washington DC, wrote in a recent essay \nhow the Internet has changed her life.  \"As I flipped \nthrough my e-mail messages one morning I suddenly \nreceived a new one entitled 'The Sydney Bush fires.'  \nThe mail was from my Australian keypal, and he was \ntelling me and some of his other keypals what it was \nlike to be experiencing the bush fires that were burning \nall round Sydney.\" [6] Rachel goes on to describe the communication that \ntook place between her friend and herself on Internet \nRelay Chat, his stories of the fires and how close they \ngot to his house.  In addition to the live reports, she \nclipped relevant newspaper articles. \"However, all week \nlong the information about the Sydney fires that I \nbrought to current events in my social studies class \nwas more up to date than anything in the newspapers,\"\nshe said. This is a powerful demonstration of how the \nInternet creates global and cultural awareness, \naugments current events classes, and motivates \nstudents to write.  However, keypal activities by \nthemselves are not always effective and usually fizzle \nunless they are given more structure than just \nassuming students will be motivated to carry on a \ndialogue. Students need a theme for their \ncommunication with other keypals. The Global Schoolhouse Perhaps one of the most interesting uses of the \nInternet recently  for education is the Global \nSchoolhouse Project.  This project is  one example of \nhow the Internet can be used to transmit video for  \neducational uses. Sponsored by the US National \nScience  Foundation, the Global Schoolhouse was \ndemonstrated during the US  National Science and \nTechnology Week in April 1993. The participants in this \"school without walls\" were children  ages 10 through 13 from four \ngeographically distant schools  -- Jefferson Junior High \nSchool in Oceanside, California; Cedar  Bluff Middle \nSchool in Knoxville, Tennessee; Longbranch  \nElementary School in Arlington, Virginia; and Oldfield \nHouse  School in Hampton, United Kingdom. As part of their studies, the students spent six \nweeks prior to  the event studying watershed pollution \nin their local areas. The  curriculum was created by the \nFrEdMail Foundation (FrEdMail  stands for Free \nEducational Mail Network), a non-profit  organization \ndevoted to creating and fostering meaningful  distance-\nbased projects using computer networks. The students had an ambitious goal; to read Earth \nin the Balance  by US Vice President Al Gore and then \nconduct ground-water  pollution studies in their \ncommunities. Beginning three weeks  before the \ndemonstration, the students met in two weekly  \nvideoconference rehearsals over the Internet to give \nprogress  reports and show video clips  of their \nresearch. During the videoconferences, each group of students \ncould see, in  real time, all of the other groups and \nthemselves on a quartered  computer screen.  For the \ndemonstration event in April, US  government \nofficials in Washington, DC joined in the discussion,  \nlistening to the students' reports and asking questions.\nThe  students continued to meet in weekly \nvideoconferences after the  demonstration until the end \nof the school year; more meetings  have been planned \nfor the future. During the Global Schoolhouse videoconference, a \nSun  Microsystems SPARCstation acted as a reflector, \ntaking the video  data from one site and reflecting it to \nthe other three sites.  A  second reflector, located at \nCornell University in Ithaca, New  York, sent copies \nof the video data to a viewing site in Vienna,  \nVirginia, where guests could monitor the \nvideoconference.  The  second reflector also sent the \nvideo data out over the Multicast  Backbone, a \ncollection of sites around the world that cooperate  in \nglobal video and audio conferencing for various events. During the videoconference, each desktop computer \nhad  a video  camera and a projector connected to the \nmonitor.  The video  camera fed the live action to the \ncomputer.  Audio was provided  by a traditional audio \nconference bridge.  Cisco routers provided  the main \ngateway between the LANs and the Internet and T1 or  \nSwitched Multimegabit Data Service (SMDS) lines \nprovided access  to the WAN. The videoconferencing software, CU-SeeMe, is \nfreely available on  the Internet and is still currently \nbeing developed by Cornell  University's Information \nTechnology Organization (CIT). It allows  one-to-one, \none-to-many, or many-to-many connections.  A user \ncan  be either a receiver, or a sender and receiver.  To \nreceive, one  only needs an Internet-connected \nMacintosh capable of displaying  16 grays.  Sending \nrequires the same plus a SuperMac VideoSpigot  board, \na camera, Quicktime and Spigot VDIG extensions \nadded to  the system. Until recently, most participants in Global \nSchoolhouse projects used the message scrawl feature \nof CU-SeeMe or audio-conference bridges.  Real-time \naudioconferencing software was released for the \nMacintosh  in March 1994 and is publicly available \nover the Internet. (Please see the  resources section at \nthe end of this paper.) III.D. Community Outreach In addition to the administrative and educational \nbenefits  achieved by access to the Internet, there are \nadvantages to  providing community access to school \nresources.  Some schools and  network projects are \nencouraging parents to become involved and  have \noffered access via dialup accounts to school systems.\nHomework  assignment archives, schedules, calendars, \nlunch menus, etc.  are just some of the things that can \nbe made publicly available.   Additionally, teachers are \nmore accessible via electronic mail  for parent/teacher \nconferences. While community access is not as  well defined or \npublicized yet, it is a crucial part of the  educational \nand community building use of the Internet. Several \nschools are experimenting with providing low-cost \naccounts (to help pay for their networking costs) to \nparents and members of the surrounding community to \nprovide access to local school information and the \nInternet. IV. Barriers and Solutions There's no question that the Internet is augmenting \ntraditional  classes with live data from distant lands and \ncultural exchange  between children. Unfortunately, \nthere are quite a few barriers  preventing teachers and \nschools from making the connection. IV.A. Internetworking Expertise For  one, there is a lack of internetworking \ntechnical expertise and  vision.  Frankly, it's hard \nenough for anyone these days to make heads or  tails of \nthe bewildering number of choices, and so it's  \nunderstandable that schools are having problems \nfiguring out  which way to go.  There's concern that \ncommitting to one distance learning solution will \nprohibit upgrading to future technologies. There's also the confusion of how to establish a \nwide area connection.  It's going to take awhile for us \nto fully  understand how the convergence of the \nbroadcast, telephone and  computer industries is going \nto play out and who the players will  be.  In the US, \nboth telephone and cable companies are promising \nconnections and reduced rates in hopes of capturing the \neducational market. There are many open system solutions, many \nstandards and many  vendors promising the \"only\"\nsolutions.  One organization called  the National \nCenter for Technology Planning (NCTP) is trying to  \nhelp. Located at Mississippi State University, NCTP \nis providing  network planning and direction to many \nschools and archiving  technology plans on the \nInternet. Other projects and studies provide some direction.\nFor example, the state of California is drafting a \nStrategic Plan for Information Technology, which \noutlines a vision for the use of computer and \ncommunications systems in California schools.  Part \nof this plan includes a Technical Model for School \nNetworks guide. Another research study conducted by \nBolt Beranek and Newman provided several current and \nfuture models for schools.  The Internet Engineering \nTask Force Internet School Working Group is drafting \na K-12 Internetworking Guidelines document, intended \nto provide technical guidance to the educational \ncommunity on school networking and connections to \nthe Internet.  All of these documents are listed in the \nresources section of this paper. IV. B. Existing Network Infrastructure Perhaps the confusing technology and large number \nof choices is  partly responsible for the next barrier:\nthe lack of existing  network infrastructure.  A \nsignificant percentage of schools  don't have local area \nnetworks in the computer labs.  Therefore  access to \nthe Internet for the time being is limited to stand- \nalone machines with modems. Unfortunately, because of the current practice of \nmost states  in the US permitting phone companies to \ncharge business rates for  telephones in schools, there \nare very few phone lines in the  classrooms.  It is \nnecessary to educate the state public utility  \ncommissions (PUCs) about the benefits of access to \nthe Internet  via a phone in the classroom; indeed, there \nhave already been  several success stories in some \nstates where regulation was  introduced to lower costs \nfor phone lines in schools. But it's important to educate the school and district \ntechnology planners on the importance of scaling their \nnetworking solutions effectively.  One phone line in a \ncomputer lab is a great start to demonstrate the benefits \nof the Internet.  However, the computer/phone \nline/modem model doesn't scale well -- the cost of \nadding phone lines and modems increases significantly, \nbut the bandwidth and increased access to resources do \nnot.  Dialup access is an easier solution to understand \nand implement initially, but ultimately harder for the \nend-user to learn, and more expensive to scale.\nSchools need to be educated on the internetworking \nmodel, that is, connecting networks to networks.\nBuilding a good local area network foundation is \ncrucial. In addition to a scalable local area network, schools \nwill need to address the issue of administrating email \naccounts, newsfeeds, local information servers and \nother network-related configuration duties.  A server \nthat makes these tasks considerably easier, and \nintegrates educational software in a distributed \nnetworked environment is the Copernicus system, \ndeveloped by Bolt, Beranek and Newman in \nCambridge, Massachusetts. There are a number of pilot \nsites which are using this server very successfully.\nOne of these is the Ralph Bunche Elementary School \nin New York, NY.  Paul Reese the Computer & \nTechnology Coordinator, says, \"We support some 350 \ne-mail accounts, a school Gopher, private and public \nnewsgroups and are developing other services.  The \nserver sits on a LAN with approximately 70 Mac \nworkstations.  A recently installed 56 Kbps line now \nconnects a neighboring middle school allowing them \nto use the server and share general network access.\" IV.C. Funding Another barrier is one of the oldest problems \nschools have faced;  that is, funding for just about \nanything that is needed. This  will continue to cause a \nproblem until schools and districts  establish visions \nand plans. Business cases can and are being  made for \nadministrative uses.  Savings on educational tools such  \nas textbooks will be realized as more and more on-line \nbooks are  distributed electronically.  Once differences \nare resolved and standards made for the transfer of such \nuseful information, such as student records and books, \nit will be easier to allocate funds for network \nconnectivity and access. In the meantime, there are a number of sources for \nfunds in the U.S.. The National Science Foundation \nhas an Internet Connections Program to which schools \nand organizations can apply for grants. The National \nTelecommunications and Information Administration \n(NTIA) recently announced a grant program to fund \nplanning and demonstration projects that (among other \nthings) promote the goals of development and \nwidespread availability of advanced telecommunications \ntechnologies and support the advancement of an \nadvanced nationwide telecommunications and \ninformation infrastructure. Both the NSF and NTIA \nprograms benefit other organizations, as well as \nuniversities and schools. IV. D. User Applications In addition to the bewildering amount of \ninformation and resources available on the Internet, \nthere's also the perceived notion that the Internet is \ndeliberately user hostile. The Internet is growing up somewhat in this area \nwith the wider availability of information discovery \nand retrieval applications, such as  archie, gopher, \nWide Area Information Servers (WAIS) and the   World \nWide Web (WWW). Most Internet-connected education \nnetworks  offer at least a simple menu interface to the \nInternet.  A  graphical program called \"Graphical \nInterface to Network Access\" or GINA (formerly \nknown as \"The Guide\")  is currently under development  \nby the California Technology Project and reviews of it \nare  confirming its promise to be one of the easiest to \nuse graphical interfaces  to the Internet yet. IV. E. Information Age Projects And finally, another barrier to using the Internet in \nthe  classroom is motivating teachers to throw away \nthe out-dated,  incorrect textbooks and instead engage \nstudents interactively,  exploring the Web for current \nevents, real examples and the  latest data. True, the Internet has a little way to go before it \ncan reliably  serve as the sole digital lab or classroom, \nbut there are plenty  of useful projects going on right \nnow where students are  encouraged to use their \ncreativity and common sense.  The problem is that \nteachers need help in learning how to use this \ntechnology  and how to apply it to teaching. What is needed are more Internet evangelists, \npeople that can  simplify the technology and \ndemonstrate the benefits. Currie Morrison, a \nTechnology Coordinator at Nathan Hale High School \nin Seattle Washington is such an evangelist and has \nseen enormous benefits from her promotional efforts.\nShe noted in a recent message sent to the COSN email \ndiscussion list, \"My anecdotal experience has seen a \nlarge number of people impacted by what I have passed \non to colleagues and students alike. Too numerous to \nmention.\" Just as school technology coordinators and directors \nplan for networks  and scalability, so must teachers \nplan for the use of technology  in their classrooms.\nToo many advanced instructional learning  systems are \nsitting gathering dust because of lack of planning in  \nthis area.  More emphasis must be made by all \nnetwork planners  (administrative and technical)\ninvolved on training and  motivation. The Port Neches-Groves School District in \nsoutheast Texas has started an interesting project \ndesigned to motivate and assist teachers with \ntransitioning to planning and developing classroom \ncurriculum projects in an online world.  Kay \nAbernathy, the technology coordinator, is pairing each \nteacher involved in the project with an online mentor \nwho is located outside of Texas.  Mentors will offer \nencouragement and assistance via electonic mail over \nthe Internet to teachers who are just getting started in \nusing the technology.  The Port Neches-Groves \nteachers will keep journals which chronicle their \nprogress and problems. V. Conclusion Despite barriers and challenges, the K-12 \ncommunity is moving ahead. The K-12 community is \nconsidered one of the fastest growing groups involved  \nin the Internet.  This market is treading on the edges of  \ntechnology and telecommunications; some schools \nhave adopted  technology for the classroom and \ndistance learning projects with  open arms, while \nothers are just now starting to think about long  range \ntechnology visions and plans. The Internet promises more equitable access to \nresources for teachers and students, as well as saving \ntime and money for administrative applications.  We \nwill continue to see growth and use of educational \nresources, increased coordination at all levels, and more \nuser-friendly applications being developed. It must be stressed that the Internet by itself is not \na panacea for educational reform.  The Internet can \nenhance classroom activities and professional \ndevelopment by creating global awareness, providing \naccess to the latest information and enabling \ncommunication on a large scale, but you cannot just \n\"throw\" the Internet into a school and expect projects \nto magically occur.  Most successful projects are \ncarefully planned, and many of them occur mostly \noutside of the Internet.   The Internet provides a \nmotivational, enabling and empowering tool for \neducation. VI. Resources The following resources were mentioned throughout \nthis paper. VI. A. Organizations"
    },
    {
      "tag": "pre",
      "text": "AskERIC\nERIC Clearinghouse on Information Resources\n030 Huntington Hall\nSyracuse University\nSyracuse, New York 13244-2340\nInternet: askeric@ericir.syr.edu\nVoice: (315) 443-9114\nFax:   (315) 443-5448\n\nConsortium for School Networking (COSN)"
    },
    {
      "tag": "p",
      "text": "1112 Sixteenth Street, NW Suite 600\nWashington, DC 20036\n1-202-872-4200\nFAX: 202-872-4318\nEmail: cosn@bitnic.bitnet\nGopher: gopher.cosn.org The Global SchoolNet Foundation (GSN) 7040 Avenida Encinas 104-281\nCarlsbad, CA  92009\n619 931-5934\nEmail: andresyv@cerf.net\n\nInternet Society (ISOC)\n12020 Sunrise Valley Drive, Suite 270\nReston, VA 22091\n1-703-648-9888\nFAX: 1-703-648-9887\nEmail: isoc@nri.reston.va.us\nGopher: gopher.isoc.org The National Center for Technology Planning \n(NCTP): ftp://Ra.MsState.Edu/pub/archives/nctp . The National Science Foundation\n4201 Wilson Blvd.\nArlington, VA  22230  USA\n+1 703 306-1949 ftp://stis.nsf.gov/nsf907 National Telecommunications and Information \nAdministration (NTIA)\nU.S. Department of Commerce\nH-4889\nWashington, D.C. 20230\n+1 202 482-2048\n+1 202 482-2156\nEmail: tiiap@ntia.doc.gov\nGopher: iitf.doc.gov VI. B. Software CU See Me: ftp://gated.cornell.edu/pub/video Maven: ftp://k12.cnidr.org/pub/Mac/Maven-2.0a11.sea.bin Graphical Interface for Network Access (GINA): Send \nemail to: kvogt@eis.calstate.edu. VI. C. Connectivity Guides All of these guides are available via anonymous FTP \nin PostScript format only. K-12 Internetworking Guidelines (an Internet-Draft) : ftp://ftp.cc.berkeley.edu/k12/ISN-draft.ps Local Infrastructures for School Networking: Current \nModels and Prospects : ftp://nysernet.org/CoSN/infrastructures.ps A Technical Model for School Networks : ftp://ftp.cc.berkeley.edu/k12/CENet-Tech.ps VI. D. Newsletter"
    },
    {
      "tag": "pre",
      "text": "NetTEACH News\nFor subscriptions queries, contact\nKathleen M. Rutkowski\n13102 Weather Vane Way\nHerndon, VA  22071  USA\ninfo@netteach.chaos.com"
    },
    {
      "tag": "p",
      "text": "VII. References [1] California Department of Education, Far West \nLaboratory for Educational Research and Development, \nCalifornia Education and Data Processing Association, \n\"California Student Information System: A Study of \nthe Feasibility of Implementing a Statewide Process \nfor Electronically Sharing Student Information,\"\nSacramento, CA.: California Department of Education, \nOctober 1992. [2] LaQuey, Tracy and Connie Stout, \"High Tech \nHighway,\" America's Agenda: Schools for the 21st \nCentury, pp. 26-30. New York, NY.: Scholastic, \nSpring 1993. [3] LaQuey, Tracy, with Jeanne C. Ryer, The Internet \nCompanion. Reading, MA: Addison-Wesley, 1993. [4] Parker, Tracy LaQuey, \"Cisco Routers Contribute \nto the Global Schoolhouse Project,\" The Packet, pp.\n22-24. Mountain View, CA.: Cisco Systems, Inc., \nFall 1993. [5] Parker, Tracy LaQuey, \"The Internet - K12 \nConnection: How Students and Teachers Are Using \nThe Internet,\" ConneXions: The Interoperability \nReport. Foster City, CA.: Interop, Inc. April 1994. [6] Weston, Rachel, \"Networks: Where Have You Been \nAll My Life?,\" Proceedings, Connecting with the \nFuture Today.: NASA and the Center for Educational \nStatistics, February 1994. Author Information Tracy LaQuey Parker received a degree in Computer \nScience from the University of Texas at Austin and \ncurrently works for Cisco Systems, Inc. as the \nManager of Education Market Development.  Before \ncoming to Cisco, she worked at The University of \nTexas System Office of Telecommunication Services \nin Austin as a Network Information Specialist where \nshe represented the Texas Higher Education Network \n(THEnet) in various national networking groups and \nwas part of the Texas Education Network (TENET, a \nstatewide K-12 network) Development Team.  A \npioneer individual member of the Internet Society, she \nrepresents Cisco Systems on the Internet Society's \nAdvisory Board.  She also participates in the \nFederation of American Research Networks \n(FARNET), and the Consortium on School \nNetworking (COSN). She is the author of two books:\nThe User's Directory of Computer Networks, published \nby Digital Press and the best selling The Internet \nCompanion: A Beginner's Guide to Global Networking \npublished by Addison-Wesley. To the Virtual Schoolhouse To the C isco E ducational ARCH ive"
    }
  ]
}