{
  "url": "http://www.igs.berkeley.edu/publications/uspolitics.html",
  "content_hash": "2bf8fa52eb3e12a5cff2b3582f7ac497ff188fc77247f4abc593bdaba5ab45ce",
  "total_blocks": 163,
  "retained_blocks": 4,
  "ignored_blocks": 159,
  "blocks": [
    {
      "tag": "div",
      "text": "BLUE LINE BLUE INFORMATION on the right MAIN RED CELL"
    },
    {
      "tag": "p",
      "text": "New Releases Cal.\n                        Politics & Gov. American Government, \n                        Politics, & Law UC\n                        History & Higher Education History &Biography Urban Studies & Planning Terrorism, National Security & Conflict Studies Casebooks\n                        & Policy BP 3 Classics"
    },
    {
      "tag": "h2",
      "text": "American Government, Politics, and Law"
    },
    {
      "tag": "p",
      "text": "Activism in Pursuit of the Public Interest: The Jurisprudence of Chief Justice Roger J. Traynor Ben Field, 132 pages, Book #4067, $21.95 Roger J. Traynor served as a justice on the California Supreme\n\t\t\t\t\t\t\t\t Court from 1940 to 1970. During that time he gained a reputation\n\t\t\t\t\t\t\t\t as one of the nation's most innovative and influential judges.\n\t\t\t\t\t\t\t\t He wrote the first state supreme court decision overturning an\n\t\t\t\t\t\t\t\t antimiscegenation statute, he reformed family law and the\n\t\t\t\t\t\t\t\t doctrines governing divorce, he restructured the rules for\n\t\t\t\t\t\t\t\t police searches, and he caused the Court to adopt a strict\n\t\t\t\t\t\t\t\t liability standard in product liability cases. Using Traynor's\n\t\t\t\t\t\t\t\t opinions, primary and secondary sources related to those cases,\n\t\t\t\t\t\t\t\t Traynor's writings on the theory of judging, and oral history,\n\t\t\t\t\t\t\t\t this book examines Traynor's work and his influence. Traynor's judicial philosophy stands out in the intellectual\n\t\t\t\t\t\t\t\t history of judging as an extreme. Few if any theorists of\n\t\t\t\t\t\t\t\t judicial decision making have so resolutely advocated innovation.\n\t\t\t\t\t\t\t\t However, unlike other activist judges of his era, Traynor often\n\t\t\t\t\t\t\t\t handled contentious issues with a minimum of controversy.  Though\n\t\t\t\t\t\t\t\t his philosophy of judging was extreme, in practice, his style was\n\t\t\t\t\t\t\t\t so persuasive that most of his innovative decisions became\n\t\t\t\t\t\t\t\t institutionalized in American law. Like the contemporary U.S. Supreme Court's \"constitutional\n\t\t\t\t\t\t\t\t revolution,\" which expanded government regulatory power over the\n\t\t\t\t\t\t\t\t economy and created a new civil liberties jurisprudence,\n\t\t\t\t\t\t\t\t Traynor's innovative opinions committed the law to the equitable\n\t\t\t\t\t\t\t\t treatment of individuals with relatively little power. However,\n\t\t\t\t\t\t\t\t Traynor's success at gaining institutional acceptance for his\n\t\t\t\t\t\t\t\t judicial innovations depended in part on his sensitivity to the\n\t\t\t\t\t\t\t\t arguments against activism. His rationalist style set apart his\n\t\t\t\t\t\t\t\t brand of activism and gave it a tone of objectivity. Despite the\n\t\t\t\t\t\t\t\t controversy surrounding judicial activism, his adroit\n\t\t\t\t\t\t\t\t articulation of the public interest in legal reform made his\n\t\t\t\t\t\t\t\t opinions widely influential. The Tenth Amendment and State Sovereignty: \n                                Constitutional History and Contemporary Issues Mark \n                                R. Killenbeck, ed., $26.95 After two centuries of interpretive debate, \n                                four leading scholars bring essential insights \n                                and a fresh perspective to this difficult \n                                question. While the conclusions they derive are \n                                not consistent, the powers of their arguments \n                                enrich the dialogue. New chapters in this story \n                                will flow from a Court that will continue to \n                                examine these issues and refine its holdings. As \n                                part of that process, the Court and those \n                                interested in its work would do well to reflect \n                                on the ideas found here. Legality and Community: On the \n                                Intellectual Legacy of Philip Selznick Robert A. Kagan, \n                                Martin Krygier, and Kenneth Winston, eds., \n                                $29.95 Philip Selznicks writings, which are still in \n                                progress, span over 60 years and several \n                                disciplinary domains. He has been a major figure \n                                in each of the fields he has touched, and one of \n                                a very few to have been profoundly influential \n                                in them all. The fields where his works have \n                                been prominent include sociology, the sociology \n                                of organizations and institutions, industrial \n                                sociology, sociology of law, and moral and \n                                social (or public) philosophy. The 23 essays in this important new \n                                book are not acts of reverence. They take off \n                                from Selznick, but that is not where most of \n                                them land. Many of them are critical, some of \n                                them sharply so. Many develop important and \n                                free-standing contributions to the areas of \n                                scholarship with which they are concerned. Yet \n                                no one can read them without recognizing that \n                                something very important has motivated them. The volume does not begin to exhaust \n                                the ways in which Selnicks work is fertile, but \n                                its chapter indicateby their variety of \n                                approach, by the different things that they take \n                                from Selznick, by the many directions in which \n                                they show this thought can be fruitfully \n                                extended, and by their criticismswhat a \n                                remarkable achievement, and what a rich lode \n                                still to be mined, it represents. Presidential Elections: Strategies and Structures of American Politics, 10th                   edition Nelson W. Polsby and Aaron Wildavsky, 340 pages, Book #NEL9261, $24.95 \"With the exception of V.O. Key's Politics, Parties and Pressure Groups, it is difficult to think of any other book in the history of American political science that                   has gone through so many new editions over such an extended time span and with  such consistently high quality. What still sets this book apart from its competitors is its sense of perspective:  about how\n                                day-to-day strategic decisions are affected by the institutional environment, about how the  dynamics of presidential elections fit into the larger picture of American national government.\" --William G. Mayer, editor, In Pursuit of the White House 2000 On Parties: Essays Honoring Austin Ranney Nelson W. Polsby and Raymond E. Wolfinger, eds., 325pp, Book #3885,  $21.95 Over the past 50 years, no one has contributed more to our understanding of political parties than Austin\n                                Ranney. Here, 12 leading experts, Ranneys colleagues and students, adopt his agenda and examine contemporary political parties from a variety of perspectives. They highlight the recent movement to subject parties to legal regulation and control and examine topics ranging from party ideology, to the nomination process, and  the perennial issue of party decline. Explorations in the Evolution of Congress H. Douglas Price, 207pp, Book #3842,  $21.95 For 30 years, Douglas Price expressed some of the most interesting ideas in the field                of congressional behavior. Here, collected for the first time, are his most important                essays on the history and structure of Congress, essays that have had enormous                influence on students of Congress everywhere. Watching Politicians: Essays on Participant\n                                Observation Richard F. Fenno, Jr., 133pp, Book # 3230, $13.95 In this brilliant case study, Fenno, America's leading practitioner of participant observation, reflects on how the press and political scientists reacted when George Bush chose Dan Quayle to be his vice presidentand on his personal dilemma as a scholar with a wealth of information about a little known, much criticized nominee. Fenno draws on his unique experience to explain the enduring ethical, tactical, and methodological  problems involved in studying politicians. The New American Political\n                                (Dis)Order An essay by Robert A. Dahl. Introduction by Austin Ranney and responses by Richard M. Abrams, David W. Brady, Patrick\n                                Chamorel, and Jack Citrin, 102pp, Book #3539, $12.95 Robert A. Dahl, America's foremost political theorist analyses the current disfunction in political decision making and the collapse of communications between citizens and their leaders. Five scholars from Berkeley and Stanford respond. Ambition & Beyond: Career Paths of American\n                                Politicians Shirley Williams & Edward L. Lascher, Jr., eds., 260pp, Book #3389,   $21.95 \"A stimulating state of the art collection of articles on political careers in the United States of America. There are enough good ideas here to keep researchers happy for\n                                years.\"-- Richard F. Fenno, Jr., University of Rochester \"Excellent papers, original research. What a welcome addition to the study of American\n                                politics!\"-- Charles O. Jones, University of\n                                Wisconsin-Madison \"Studying political careers is a way of tracing the outlines of the structure of a political system. These essays tell a great deal about the structure of American politics and how it is\n                                changing.\"--  Nelson W. Polsby, Institute of Governmental Studies, University of California, Berkeley The Governmental Process Second Edition, David B. Truman, 561pp, Book # 3451, $24.95 Winner of the 1997 Leon Epstein Award for a distinguished contribution to the field.\n                                This study of political groups, their origins, and their maneuvers remains the leading source of ideas that explain outcomes in American political systems. Generations of political scientists have found this work essential to their understanding of contemporary politics. The Press and Foreign\n                                Policy Bernard C. Cohen, 288pp, Book #346X, $17.95 Most of the important questions concerning the impact of the press on how the public views political issues were first raised in this classic study including what journalists consider news and how they establish and enforce professional norms. Cohen's theory explaining the pattern of news coverage is the most\n                                far-reaching and persuasive in the literature. Congressmen in Committees Richard F. Fenno, Jr., 302pp, Book # 3621, $19.95 In this classic study, America's leading student of Congress shows how the different organizational environments of three congressional committees affect the behavior of members and shapes legislative outcomes. Foreign Policy and Democratic Politics: The American and British\n                                Experience Kenneth N. Waltz, 561pp, Book #3362, $24.95 Americans dissatisfied with their political institutions look\n                                abroad--especially to the United Kingdom--for a model. Waltz asks whether U.K. policymaking is any better than American. In\n                                hard-hitting prose, his rigorous analysis shows that, contrary to popular myth, British government is no better than American government at protecting national interests. \"A vivid argument that in matters of foreign policy (and domestic policy as well) the American presidential system is superior to British parliamentary government....A worthy contribution to a great debate that now runs back at least a century to Walter\n                                Bagehot. In Waltz's hands the subject is still fresh, provocative,\n                                stimulating.\"-- H. Bradford Westerfield, The Journal of Politics \"Imaginative and durable. . . [An] exhibition of intellectual boldness, critical verve, and incisive writing.\"\n                                -- Leon D. Epstein, American Political Science Review \"Thorough and profound.\"-- Times Literary Supplement Making Democracy Work: The Life and Letters of Luther\n                                Gulick, 1892-1993 Lyle C. Fitch, 436pp, Book # 3710,  $21.95 A founding father of the discipline, Luther Halsey Gulick became a public\n                 administration legend in the course of a lifetime devoted to civic duty and public\n                                service. He drafted the resolution establishing the American Society for Public\n                                Administration, and every important work in the field in the latter half of the twentieth                 century reflects his influence. A\n                                first-rate biography."
    }
  ]
}