{
  "url": "http://www.indymedia.org.uk/en/regions/oxford/topics/socialstruggles/",
  "content_hash": "67470eeaf166009dfd2dc8bfa33f6ed93c2b6587410f8555488ba18d44d8e578",
  "total_blocks": 190,
  "retained_blocks": 51,
  "ignored_blocks": 139,
  "blocks": [
    {
      "tag": "div",
      "text": "top navigation bar"
    },
    {
      "tag": "p",
      "text": "HOME | IMC UK | Editorial Guidelines | Mission Statement | About Us | Contact | Help | Support Us"
    },
    {
      "tag": "div",
      "text": "/top navigation bar title"
    },
    {
      "tag": "h1",
      "text": "Oxford Social Struggles"
    },
    {
      "tag": "div",
      "text": "/title start-special /start-special features"
    },
    {
      "tag": "h3",
      "text": "18-02-2006 13:21 | 1 comment(s)"
    },
    {
      "tag": "h2",
      "text": "Swiss Police Acquitted in Aubonne Bridge Trial"
    },
    {
      "tag": "div",
      "text": "transform routines abstract.template media /media"
    },
    {
      "tag": "p",
      "text": "On the 13th, 14th, 15th of February 2006 a court case against two Swiss police officers took place in Nyon, Switzerland. Michael Deiss and Claude Poget were charged with causing bodily harm through negligence . They were in court after nearly killing climbers Martin Shaw and Gesine Wenzel during the protests against the G8 in Evian . On Friday 17 February the verdict of this private prosecution came through with an acquittal of the two policemen [Read verdict press release by Martin and Gesine]. Following this verdict, the activists announced that they will appeal against this whitewash of police violence. In June 2003, an affinity group blockaded the Aubonne Bridge with a climbing action in order to stop a G8 delegation from reaching the summit in Evian. The police cut the climbing rope. As a result both activists were seriously injured, specially Martin Shaw who spent one month in hospital and sustained irreversible injuries. See video and a Photo strory of the event. Other recent newswire reports: Report of day 3 of the trial | Statement by the Aubonne Support Group on the court proceedings | Activists walk out of court after verdict | Activists appeal against whitewash of police violence . More information: Aubonne Bridge Campaign | IMC-UK Evian G8 page | PigBrother Live Show"
    },
    {
      "tag": "div",
      "text": "/abstract.template Read more >>"
    },
    {
      "tag": "h3",
      "text": "20-09-2004 11:23 | 3 comment(s)"
    },
    {
      "tag": "h2",
      "text": "Councillors Clash on Indymedia over Housing"
    },
    {
      "tag": "div",
      "text": "transform routines abstract.template Controversy at Oxford City Council hit the pages of Indymedia last month as Green councillor Matt Sellwood accused Labour and Liberal Democrat members of wasting £100,000 in tax payer’s money on the demolition of a block of social housing. In a newswire item posted to this site Sellwood claimed that the council’s decision to demolish Stephenfield House in Rose Hill with council funds would effectively mean a massive subsidy for the private developer’s brought in to redevelop the site. He further alleged that the new development would not be retained as a 100% social housing as the Green party had demanded. In a reply posting Labour councillor Rick Muir defended the council’s decision arguing that under government regulations they have no choice but to bring in a private developer. He also claimed that the new development once completed will provide more, not less, social housing. Meanwhile the practise of squatting empty, unused properties continues to be necessary in a city of massive house prices and waiting lists. [ Stephenfield House article | Squatters in normal interaction shock ] /abstract.template Read more >>"
    },
    {
      "tag": "h3",
      "text": "23-03-2004 09:10 | 4 comment(s)"
    },
    {
      "tag": "h2",
      "text": "Blackwood Tree Camps Evicted - Campaign Continues"
    },
    {
      "tag": "div",
      "text": "transform routines abstract.template media /media Update: 29th March: The Campaign Continues! There are still around 50 trees to be defended, and there are still camps, tree houses being built, and actions taking place - read Blackwood Protest Continues and Status Report . Contractors Costain will also be holding a public meeting to address concerns and answer questions from local residents regarding the Sirhowy Enterprise Way, at 7pm, on Tuesday, March 30, at the Costain's site office, Cwm Philkins, Oakdale. Early in the morning on Tuesday 23rd March, around 70 Police, Bailiffs and specialist climbers and tunnellers began evicting the tree camps at Blackwood in South Wales - where locals have been campaigning against a new road for over a decade [ Pics ]. Around 10 people were arrested as they resisted in the trees, on walkways, in nets and in a tunnel, some after breaching cordons. At Camp Kerry, one brave activist still remained at the end of the day, and was able to climb down without being arrested. Most of the trees were destroyed, but campaigners say they will continue to resist. See Report and Pictures | 1 | 2 Also see collected reports (and pics): Bristol | UK Evictions continued throughout Wednesday as Bailiffs cut people out of lock-ons and most of the remaining trees were destroyed. Some campaigners remain camped on private land next to the road route and are determined to continue opposing the road scheme. See Report | 2 | 3 Meanwhile in London an attempted eviction was also taking place in Kentish Town. At mid morning bailiffs arrived at several flats that have been home to a group of squatters for some months. Some of the occupiers took to the roof, whilst a crowd of around 100 people gathered in the road in front of the building. /abstract.template Read more >>"
    },
    {
      "tag": "h3",
      "text": "11-11-2003 13:13 | 1 comment(s)"
    },
    {
      "tag": "h2",
      "text": "Bemused Oxford shoppers meet with walls and checkpoints"
    },
    {
      "tag": "div",
      "text": "transform routines abstract.template media /media On the 9th of November, as part of the international day of protest and action against Israel's 'security wall', protesters in Oxford (wearing huge white cardboard boxes on their heads) attempted to give the local weekend shoppers a glimpse of life in occupied Palestine. People gave leaflets, talked to people and shouted slogans. The 'wall' was seen making its way through the Westgate and Clarendon shopping centres - to the annoyance of security guards, culminating by a walk down Cornmarket and a visit to Marks and Spencer's. Finally, a 'checkpoint' was built on a nearby (pedestrianised) street, until the 'soldier' announced he was taking the 'prisoners' into custody and the wall was taken apart and dumped in a nearby bin. If only the real thing was as easily dealt with... [ Report | Photos ] [ Stop the Wall ] | [ Palestine Campaign ] | [ Wall that breaks Rafah's heart ] /abstract.template Read more >>"
    },
    {
      "tag": "h3",
      "text": "21-09-2003 17:43 | 1 comment(s)"
    },
    {
      "tag": "h2",
      "text": "Oxford Post Workers Walk Out"
    },
    {
      "tag": "div",
      "text": "transform routines abstract.template UPDATE (Thursday 25th): Striking Oxford postal workers won reinstatement yesterday for their two sacked colleagues, and voted to return to work. UPDATE (Monday 22th): Oxford postal workers voted for continued strike action in the face of management's attempts to break their union, the CWU. This came after management sacked two people as a deliberate provocation. This weekend, postal workers from Oxford staged a wildcat strike in response to agressive posturing from the chief executive, Allan Leighton. The strike started 5pm Friday, and workers intend to remain on strike until Monday, when they will discuss the next step. report | responses to no vote | UPDATE and video | update 2 /abstract.template Read more >>"
    },
    {
      "tag": "p",
      "text": "Oxford Social Struggles Feature Archive >>"
    },
    {
      "tag": "div",
      "text": "/features publish Publish your news /publish newswire"
    },
    {
      "tag": "h2",
      "text": "Newswire"
    },
    {
      "tag": "div",
      "text": "search"
    },
    {
      "tag": "p",
      "text": "Search"
    },
    {
      "tag": "div",
      "text": "indymedia search commented out"
    },
    {
      "tag": "p",
      "text": "Diggers 350th birthday march and occupation VIDEO 12-12-2006 15:27 | 1 comment(s) Designer, Mask-Maker, Seamstress? (or just interested). We need you NOW. 09-12-2006 10:49 | 0 comment(s) Singing Session at Campsfield House Detention Centre 02-12-2006 15:28 | 0 comment(s) \"Put me down! I won't bring you happiness\" More Buy Nothing Day Pixie-ing 30-11-2006 18:22 | 0 comment(s) Demo at RAF Brize Norton Dec 2 29-11-2006 12:44 | 0 comment(s) Huge Demonstration in Cite Soleil, Haiti 28-11-2006 20:55 | 0 comment(s) Oxford Shoppers Left Bemused By Consumer Cult 27-11-2006 23:48 | 6 comment(s) Reclaim The Night- TOMORROW 6.30pm 27-11-2006 20:30 | 1 comment(s) torture of Necati Zontul- an update and forthcoming documentary 24-11-2006 12:15 | 1 comment(s) report back: Oxford WDM meeting - Our World is Not for Sale 23-11-2006 11:17 | 0 comment(s) Legal Aid: The End of an Era? 19-11-2006 21:21 | 4 comment(s) Public Meeting: Our World is Not for Sale 16-11-2006 20:21 | 0 comment(s) Shell Disrupted & Protested Again in Reading 11-11-2006 17:21 | 2 comment(s) Meeting on World Bank & IMF in Oxford 10-11-2006 19:21 | 3 comment(s) RECLAIM THE NIGHT March- Oxford- Tues 28th November 2006! 09-11-2006 16:10 | 6 comment(s) Travel agents disrupted in Reading! 07-11-2006 14:12 | 2 comment(s) Tear Down THe Wall! 03-11-2006 19:31 | 4 comment(s) Shell disrupted in Reading! Solidarity with Rossport and Niger! 02-11-2006 18:14 | 3 comment(s) Nobel Peace Prize nominated activists speaking in Bristol 23-10-2006 15:51 | 1 comment(s) Remember Afghanistan and Iraq - Troops Out Now! 22-10-2006 16:00 | 0 comment(s) ALF Press Officer Injuncted in High Court 16-10-2006 10:10 | 0 comment(s) Eye-witness account from Palestine 07-10-2006 16:34 | 1 comment(s) RUGRATS launch at Reading University 04-10-2006 15:19 | 0 comment(s) London - Jack Boot City - Demo report, Weds 27th September 29-09-2006 22:41 | 3 comment(s) Mining in Colombia - An Eyewitness Account, 3rd October 22-09-2006 12:34 | 0 comment(s) A Dirty Business - Oxford University & the Dogs of War! 20-09-2006 02:17 | 0 comment(s) Is Venezuela A Threat To US Security? 11-09-2006 16:03 | 0 comment(s) Willow Walker 06-09-2006 14:30 | 2 comment(s) DEMOLISHING LEBANON - PART 2 29-07-2006 00:27 | 0 comment(s) Help Win New East Oxford Community Garden! 27-07-2006 23:25 | 2 comment(s) US Network Continues To Promote Glaxo 27-07-2006 21:28 | 0 comment(s) Protest to mark the loss of the NHS 21-07-2006 18:27 | 0 comment(s) MEDIA ALERT: BLAMING THE VICTIM IN GAZA 10-07-2006 12:09 | 4 comment(s) OXFORD CAMPAIGNERS STAGE \"G8 OLYMPICS\" 10-07-2006 10:24 | 0 comment(s) Climate Injustice in the Niger Delta - Speaker Event 03-07-2006 17:33 | 0 comment(s) Mexican ex-political prisoners speak in Reading, 27/06/06 26-06-2006 18:25 | 0 comment(s) 120 Immigration Detainees on Hunger Strike at Campsfield IRC 17-06-2006 03:59 | 3 comment(s) Global Responses to Global Threats 12-06-2006 16:43 | 0 comment(s) Greek students occupy universities 07-06-2006 21:38 | 2 comment(s) Jericho boatyard evicted (photos) 31-05-2006 22:42 | 2 comment(s) Boat yard eviction happening NOW! 31-05-2006 09:55 | 1 comment(s) Petition against Pool Closure / Unwanted Change 14-05-2006 12:30 | 0 comment(s) save our local swimming pool and gym 14-05-2006 11:57 | 0 comment(s) NARROW BOATERS RISK THEIR HOMES TO SAVE THEIR BOATYARD 12-05-2006 08:55 | 0 comment(s) 8 Gyptian homes at risk 11-05-2006 14:30 | 1 comment(s) Temple Cowley Pool closure 04-05-2006 08:45 | 0 comment(s) Oxford May Day March 21-04-2006 14:30 | 2 comment(s) The Future of Social Centres 20-04-2006 20:51 | 0 comment(s) Oppose Boatyard eviction 03-04-2006 17:58 | 1 comment(s) Human rights meeting; 28-03-2006 13:18 | 1 comment(s) Tues 28th March. Mass Strike in Britain and General Strike in France. 21-03-2006 00:08 | 14 comment(s) All Day Extravaganza - Jericho Community Boatyard Benefit Saturday 18th March 17-03-2006 21:49 | 0 comment(s) UK companies in Iraq: new report from Corporate Watch 13-03-2006 11:23 | 0 comment(s) The Real Oxford Union First Annual Address 11-03-2006 00:31 | 0 comment(s) Life without Water? public meeting 09-03-2006 20:39 | 3 comment(s) Anti-poverty campaigners ask “Where next after Make Poverty History? 07-03-2006 08:45 | 3 comment(s) Public Meeting on British companies in Colombia 22nd Feb 21-02-2006 17:45 | 0 comment(s) Taste of Palestine events - tickets selling fast! 17-02-2006 15:46 | 0 comment(s) Swiss police acquitted in Aubonne Bridge trial 17-02-2006 13:28 | 2 comment(s) worker from occupied argentinian factory speaks in oxford 11-02-2006 22:56 | 3 comment(s) Bolivarian and Alter-Globalist Youth Groups in Mexico 11-02-2006 03:31 | 0 comment(s) Where next after ‘Make Poverty History?’ 09-02-2006 22:58 | 3 comment(s) talk: Palestine, the current situation 06-02-2006 17:40 | 2 comment(s) Stop Red Ice: End Planned Murder of 300,000 Canadian Seals In March 05-02-2006 00:50 | 3 comment(s) 12th Feb: speaker from worker-occupied Zanon factory in Argentina 03-02-2006 19:57 | 1 comment(s) Vigil at Carfax for Iraqi casualties 31-01-2006 22:24 | 0 comment(s) Season of Palestinian films 26-01-2006 17:32 | 0 comment(s) Demolition of a Community - St Agnes Place, London 21-01-2006 01:13 | 1 comment(s) First student anti-sweatshop week of action 16-01-2006 18:46 | 0 comment(s) Palestine events in Oxford (Jan06) 08-01-2006 15:17 | 1 comment(s) Public talk: South Sudan 03-01-2006 11:30 | 0 comment(s) Alternative Carol Singing in support of Palestinians 14-12-2005 14:37 | 3 comment(s) NO HELP DEMO 14-12-2005 10:02 | 0 comment(s) Oxfordshire Social Enterprise Forum: Supporting Social Enterprise in Oxford 08-12-2005 23:34 | 2 comment(s) Campsfield 12years too long demo 22-11-2005 19:20 | 0 comment(s) \"Censored Artwork\" 15-11-2005 17:13 | 0 comment(s) Action against the Separation Wall 12-11-2005 20:05 | 0 comment(s) International day of action against the Wall 09-11-2005 20:54 | 2 comment(s) Jericho Community Boatyard Theatre Night 09-11-2005 16:34 | 0 comment(s) Oxford Arms Trade Investments Exposed 09-11-2005 15:40 | 0 comment(s) “Missing Syringe artwork” 03-11-2005 22:01 | 9 comment(s) Boatyard in court - Protest outside 26-10-2005 18:53 | 0 comment(s) Boatyard in court tommorow 25-10-2005 13:34 | 0 comment(s) Archbishop Nicholls and the Catholic Education Service: An Apology 22-10-2005 15:45 | 7 comment(s) Bonfire Parliment Hill 400 years 19-10-2005 16:22 | 4 comment(s) Boatyard In Court 13-10-2005 13:03 | 0 comment(s) Public Meeting: Indigenous Resistance - Chiapas & West Papua, Wed 19th October! 12-10-2005 23:56 | 0 comment(s) JERICHO COMMUNITY BOATYARD OPENS ITS GATES 16-09-2005 23:25 | 0 comment(s) Good article about the state of the left 14-09-2005 18:01 | 7 comment(s) Defend your local news media - Town Hall meeting, 13 September 11-09-2005 18:16 | 0 comment(s) nano impacts studys conference 10-09-2005 15:43 | 0 comment(s) Punk and Soundsystems to support G8 protesters 02-09-2005 21:00 | 4 comment(s) Newsflash: Indymedia Working \"Within the System\" 23-08-2005 16:43 | 8 comment(s) Caterpillar picket - Sat 20th August 18-08-2005 21:08 | 0 comment(s) Defend Civil Liberties - No Racist Scapegoating 18-08-2005 15:50 | 4 comment(s) Yarl's Wood hunger strike latest news 16-08-2005 09:57 | 4 comment(s) Boatyard Campaign on Front Foot 10-08-2005 19:09 | 0 comment(s) Student left conference at University of East London, September 3 08-08-2005 17:48 | 2 comment(s) No2ID campaign meeting in Oxford 08-08-2005 12:30 | 2 comment(s) Jericho Boatyard still squatted and needs support 02-08-2005 12:00 | 4 comment(s) Earth First! summer gathering 17-21 August 2005 31-07-2005 14:55 | 0 comment(s) Brilliant billboard subvert 28-07-2005 14:13 | 4 comment(s) Jericho boatyard needs help 28-07-2005 11:10 | 0 comment(s) AXE AND SPANNER OPEN AIR FILM NIGHT 26-07-2005 15:08 | 0 comment(s) G8 Scotland, July 2005: Mainly MPH March, Saturday 2 July 17-07-2005 16:21 | 2 comment(s) Sick of Geldof and really want to help developing countries? 10-07-2005 23:08 | 0 comment(s) Interesting article about the problems of activism at the G8 30-06-2005 19:02 | 3 comment(s) Discussion on ageism 29-06-2005 20:31 | 0 comment(s) Oxford Area Republic Group Established 24-06-2005 23:59 | 0 comment(s) talk: GENOCIDE IN PARADISE 24-06-2005 11:15 | 0 comment(s) Plater College Open Debate 22-06-2005 22:07 | 9 comment(s) Opus Dei cabinet minister supports Plater College closure 19-06-2005 15:37 | 7 comment(s) Activist Trauma Gathering 18-06-2005 17:30 | 0 comment(s) G8 in Oxford events 16-06-2005 21:22 | 1 comment(s) Indymedia Screening showing NO LAGER, Sunday 19th june 14-06-2005 12:15 | 0 comment(s) Friendship Walk for the Middle East 08-06-2005 23:21 | 0 comment(s) Make Poverty History campaigners form a human ring around Radcliffe Camera 08-06-2005 17:38 | 20 comment(s) Brazilian Carnival Party for the MST - June 11th 05-06-2005 11:20 | 1 comment(s) Battle of the Beanfield - 20 Years on :: SchNews500 03-06-2005 12:22 | 0 comment(s) Anniversary of the 'Battle of the Beanfield': 'Operation Solstice' 31-05-2005 00:03 | 1 comment(s) Oxford Social Struggles Newswire Archive >>"
    },
    {
      "tag": "div",
      "text": "/newswire Region box template regions"
    },
    {
      "tag": "h2",
      "text": "Kollektives"
    },
    {
      "tag": "p",
      "text": "Birmingham Cambridge Leeds Bradford Liverpool London Manchester Nottinghamshire Oxford Scotland Sheffield South Coast World Other UK IMCs Bristol Scotland"
    },
    {
      "tag": "div",
      "text": "/regions topics"
    },
    {
      "tag": "h2",
      "text": "Oxford Topics"
    },
    {
      "tag": "p",
      "text": "Analysis Animal Liberation Anti-militarism Anti-racism Bio-technology Climate Chaos Culture Ecology Education Free Spaces Gender Globalisation Health Indymedia Migration Other Press Repression Social Struggles Technology Workers' Movements Zapatista"
    },
    {
      "tag": "div",
      "text": "/topics Navigation actions template actions 2005"
    },
    {
      "tag": "h2",
      "text": "Oxford Actions 2005"
    },
    {
      "tag": "p",
      "text": "DSEi 2005 G8 2005 WTO Hong Kong 2005"
    },
    {
      "tag": "div",
      "text": "/2005 2004"
    },
    {
      "tag": "h2",
      "text": "Oxford Actions 2004"
    },
    {
      "tag": "p",
      "text": "European Social Forum FBI Server Seizure May Day 2004 Venezuela"
    },
    {
      "tag": "div",
      "text": "/2004 2003"
    },
    {
      "tag": "h2",
      "text": "Oxford Actions 2003"
    },
    {
      "tag": "p",
      "text": "Bush 2003 DSEi 2003 Evian G8 May Day 2003 No War F15 Saloniki Prisoner Support Thessaloniki EU WSIS 2003"
    },
    {
      "tag": "div",
      "text": "/2003 /actions links"
    },
    {
      "tag": "h2",
      "text": "Oxford links"
    },
    {
      "tag": "p",
      "text": "Action Resource - Oxford Action Resource Centre Activism - Breach of the Peace radical samba band - Oxford Student Activist Network - Oxford Dissent! Alternative Media - Undercurrents - New Internationalist Animal Rights - Reading Hunt Saboteurs - Speak Campaigns Community Action - The Rap Yard - Cyclox - Save Castle Mill Boatyard Environment - Goldenfuels - Grassroots Action on Food and Farming - Oxford Conservation Volunteers - Oxford Rising Tide Free Spaces - OCSET Legal Advice - Activists' Legal Project - FreeB.E.A.G.L.E.S. Peace Groups - East Oxford Stop the War - Muslim Oxford Stop the War - Network of Oxford Women for Peace and Justice - Rhodes Scholars Against the War - Take Action Email List Prisoner Support - B52 Two Refugee Support/No Borders - Bicester Refugee Support - Campaign to Close Campsfield - Keep Azim in Oxford Campaign - Student Action for Refugees Research Groups - Corporate Watch - ETC Group Social Justice - Oxford World Development Movement Group - FUSPEY - Make Trade Fair @ St Edmund Hall campaign - Oxford Development Abroad - Oxford for Trade Justice - Oxford Students Fairtrade Coalition - Oxford Students Stop AIDS Campaign Solidarity Campaigns - Oxford Palestine Solidarity Campaign Suggest a link More Links > >"
    },
    {
      "tag": "div",
      "text": "/links navigation.imcs"
    },
    {
      "tag": "h2",
      "text": "IMCs"
    },
    {
      "tag": "p",
      "text": "cities.inc\nlist of linked indymedia cities, for inclusion in all the indymedia sidebars\ngenerated Sun, 10 Dec 2006 05:32:23 -0800  \nWARNING DO NOT EDIT THIS FILE.\nTHIS FILE IS GENERATED AUTOMATICALLY VIA\nhttp://contact.indymedia.org/cities.php\nmailto: mark -( at )- indymedia.org www.indymedia.org Projects print radio satellite tv video Africa ambazonia canarias estrecho / madiaq kenya nigeria south africa Canada hamilton london, ontario maritimes montreal ontario ottawa quebec thunder bay vancouver victoria windsor winnipeg East Asia burma jakarta japan manila qc Europe alacant andorra antwerpen armenia athens austria barcelona belarus belgium belgrade bristol bulgaria croatia cyprus estrecho / madiaq euskal herria galiza germany grenoble hungary ireland istanbul italy la plana liege lille madrid malta marseille nantes netherlands nice norway oost-vlaanderen paris/île-de-france poland portugal romania russia scotland sverige switzerland thessaloniki toulouse ukraine united kingdom valencia west vlaanderen Latin America argentina bolivia brasil chiapas chile chile sur colombia ecuador mexico peru puerto rico qollasuyu rosario santiago tijuana uruguay valparaiso Oceania adelaide aotearoa brisbane burma darwin jakarta manila melbourne oceania perth qc sydney South Asia india mumbai United States arizona arkansas atlanta austin baltimore big muddy binghamton boston buffalo charlottesville chicago cleveland colorado columbus danbury, ct dc hampton roads, va hawaii houston hudson mohawk idaho ithaca kansas city la madison maine miami michigan milwaukee minneapolis/st. paul new hampshire new jersey new mexico new orleans north carolina north texas nyc oklahoma omaha philadelphia pittsburgh portland richmond rochester rogue valley saint louis san diego san francisco san francisco bay area santa barbara santa cruz, ca seattle tallahassee-red hills tampa bay tennessee united states urbana-champaign utah vermont western mass worcester West Asia armenia beirut israel palestine Topics biotech Process discussion fbi/legal updates indymedia faq mailing lists process & imc docs tech volunteer"
    },
    {
      "tag": "div",
      "text": "/navigation.imcs"
    }
  ]
}