{
  "url": "http://www.jeffcomo.org/main/jobs.html",
  "content_hash": "91239c912b4fa0d02573c3b7c0537b9e060e8f40135f4d89db4e73b526e38f1a",
  "total_blocks": 374,
  "retained_blocks": 7,
  "ignored_blocks": 367,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" This table encloses the entire document; do not tamper Main header table begins - current date script - Main header table ends this cell is a relative width marker Main table of contents begins About News County \r\n\t\t\t\t\t\t\t\t\tCommission Departments \r\n\t\t\t\t\t\t\t\t\t& Office Holders Invitation \r\n\t\t\t\t\t\t\t\t\tfor Bids Calendar FAQs Community \r\n\t\t\t\t\t\t\t\t\tLinks Contact Employment Search End of main table of contents Right column table begins Jefferson County Employment blank row Positions available throughout the entire county government will be updated to \r\n\t\t\t\t\t\t\t\t\t\tthis page routinely. For the most up-to-date listing, contact the Jefferson County Human Resources Department. -For other employment opportunities throughout the County, visit <a href=\"http://www.join-n.org/business.htm\" target=\"_blank\">JOIN-N</a> (the Jefferson Online Information Network).- blank row Please note that the employment applications available on this page are PDF \r\n\t\t\t\t\t\t\t\t\t\tdocuments. Adobe Acrobat Reader (4.0 or more recent version) is required to \r\n\t\t\t\t\t\t\t\t\t\tview PDF files. To download the free Adobe Acrobat Reader from the Adobe web \r\n\t\t\t\t\t\t\t\t\t\tsite, click on the logo. blank row Select the department or division to see current listings. blank row Animal Control Division Assessor's Office Auditor's Office Building Division Code Enforcement Division Collector of Revenue County Clerk and Election Authority County Commission Facility Services Division Fleet Services Division General Services Division Highway Division Human Resources Division Juvenile Office Municipal Court Office of Contracts & Grants Office of Emergency Management & Public Information Parks & Recreation Department Planning Division Prosecuting Attorney's Office Public Administrator's Office Recorder of Deeds Office Technical Administration Division Treasurer's Office Other Vacancies blank row Animal Control Division <font class=\"smtxt\"><i>No jobs currently listed</i></font> -ADD ANOTHER POSITION SUMMARY-"
    },
    {
      "tag": "p",
      "text": "POSITION VACANCY ANNOUNCEMENT Animal Control Kennel Laborer II Division of Animal Control Department of Land Use, Development and Code Enforcement $19,739 to 22,011 Annually Depending on Qualifications POSITION SUMMARY: Performs labor work cleaning and sanitizing kennels and general grounds maintenance, which includes grass cutting, weed trimming, trash pickup and snow and ice removal.  \r\n                  Cleaning duties include general sweeping, mopping, disinfecting and scrubbing of the Animal Control facilities and kennels that become unsanitary or offensive to the public. Assists public as necessary, as well as officers in removing animals from vehicles and putting them in cages, animal intake processes and record keeping, and with adoption processes including handling of animals for viewing and application completion. MINIMUM QUALIFICATIONS: High School Diploma or Equivalency Animal handling techniques helpful Red Cross Pet First Aid Training desirable KNOWLEDGE, SKILLS AND ABILITIES: Knowledge of simple, routine or repetitive tasks, operations and skill to operate simple equipment that operates repetitively, such as lawn mower, weed eater, tools commonly used in carpentry and construction, and housekeeping. Ability to lift, carry and push moderately heavy objects and materials, 50 to 75 pounds, such as dogs and other animals. Ability to walk on undeveloped properties and uneven pavements. Ability to recognize and identify similarities or differences between colors, shapes, and sounds such as identifying animal body language signals and sounds of distress. Ability to work well with others, and to represent the County in a professional manner. Must have good oral and written communication skills and the ability to resolve problems with tact and diplomacy. The Division of Human Resources will receive applications from internal candidates until Wednesday, December 13, 2006.  External applications will be accepted concurrently and will be considered if not filled by an internal candidate. - END POSITION - application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Assessor's Office No jobs currently listed application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Auditor's Office No jobs currently listed application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Building Division - <font class=\"smtxt\"><i>No jobs currently listed</i></font> - - POSITION SUMMARY - POSITION VACANCY ANNOUNCEMENT Electrical Inspector Building Division Department of Land Use, Development and Code Enforcement Depending on Qualifications POSITION SUMMARY: Performs on-site inspection of all new construction and renovation projects requiring building permits to ensure compliance with county building ordinances and state laws and regulations.  Evaluates drawings, plans, blueprint; reviews building permit applications for compliance with county building codes and approves acceptable applications. MINIMUM QUALIFICATIONS: High School Diploma or Equivalency and trade school certification; or Associates Degree in building technology or related field. Requires five (5) years of experience as an electrician. Must be able to be certified for 1 and 2 family dwellings as electrical inspector within 6 months. KNOWLEDGE, SKILLS AND ABILITIES: Must have good oral and written communication skills. Ability to read and interpret plans, drawings and blueprints. Ability to understand, interpret and apply county building codes and zoning ordinances and BOCA codes. Ability to detect county code violations and deviations from approved plans. Ability to work independently and to carry out assignments to completion with minimal instruction, adhere to prescribed routines and practices, maintain records, and to make reports requiring detail and accuracy. Ability to work well with others and to assist the public cooperatively and courteously. The Division of Human Resources will receive applications from internal candidates until Monday, November 20, 2006. External applications will be accepted concurrently and will be considered if not filled by an internal candidate. -ADD ANOTHER POSITION SUMMARY-"
    },
    {
      "tag": "div",
      "text": "application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Code Enforcement Division No jobs currently listed application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Collector of Revenue No jobs currently listed application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row County Clerk and Election \r\n\t\t\t\t\t\tAuthority No jobs currently listed application | top blank row County Commission No jobs currently listed application | top blank row Facility Services Division No jobs currently listed <p align=\"center\">\r\n\t\t<font class=smtxt>\r\n\t\t<b>POSITION VACANCY ANNOUNCEMENT</b>\r\n\t\t<Br><br><b>Maintenance Worker I</b>\r\n\t\t<br><b>Facility Services</b>\r\n\t\t<br><br><br><b>$18,450 - $20,966 Annually<br>\r\n\t\tDepending on Qualifications</b>\r\n\t\t</p>\r\n\t\t</font>\r\n\t\t<p align=\"left\"><b>POSITION SUMMARY:</b>\r\n\t\t<p>Semi-skilled work in the maintenance and repair of buildings and equipment.  Performs work in several of the building and mechanical trades.  Duties include routine preventative maintenance, assisting skilled trades workers and performing semi-skilled work in the maintenance and repair of buildings, grounds and equipment.  Duties are performed according to established procedures and specific instructions are given on new or complex work.\r\n\r\n\r\n\t\t<p align=\"left\"><b>MINIMUM QUALIFICATIONS:</b>\r\n\t\t<ul>\r\n\t\t<li>Two years of semi-skilled experience in general maintenance work.</li>\r\n\t\t<li>Completion of high school.  (Post secondary training in an accredited vocational-training school in one of the building, mechanical or electrical trades may be substituted on a year-for-year basis for the required experience.)\r\n\t\t</ul>\r\n\r\n\r\n\t\t<p align=\"left\"><b>KNOWLEDGE, SKILLS AND ABILITIES:</b>\r\n\t\t<ul >\r\n\t\t<li>Must have some knowledge of the standard tools and practices of the various trades such as mechanical, electrical, plumbing, painting, carpentry and plastering.</li>\r\n\t\t<li>Must have some knowledge of the occupational hazards and safety precautions of the mechanical and building trades.</li>\r\n\t\t<li>Must be able to perform semi-skilled work in a variety of mechanical and building trades.</li>\r\n\t\t<li>Must be able to understand and follow oral and written instructions.</li>\r\n\t\t \r\n\t\t</ul>\r\n\r\n\t\t<p align=\"left\"><b>The Division of Human Resources will receive applications from internal candidates until Friday, November 4, 2005.  The position will be open for outside applicant consideration after this date.</b></p>\r\n\t\t- application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Fleet Services Division No jobs currently listed <p align=\"center\">\r\n\t\t\t\t\t\t<font class=\"smtxt\"><b>POSITION VACANCY ANNOUNCEMENT</b>\r\n\t\t\t\t\t\t\t<Br>\r\n\t\t\t\t\t\t\t<br>\r\n\t\t\t\t\t\t\t<b>MECHANIC</b><br>\r\n\t\t\t\t\t\t\t<br>\r\n\t\t\t\t\t\t\t<b>Fleet Services</b>\r\n\t\t\t\t\t\t\t<br>\r\n\t\t\t\t\t\t\t<br>\r\n\t\t\t\t\t\t\t<b>$15.68 Hour</b>\r\n\t\t\t\t\t</p>\r\n\t\t\t\t\t</font>\r\n\t\t\t\t\t<p align=\"left\"><b>POSITION SUMMARY:</b>\r\n\t\t\t\t\t<p>\r\n\t\t\t\t\tUnder direct supervision, performs skilled mechanical work in the maintenance \r\n\t\t\t\t\tand repair of automotive and other standard equipment used in street \r\n\t\t\t\t\tmaintenance and construction activities, employing standard trade practices and \r\n\t\t\t\t\tprocedures well established in automotive repair shops and to repair and \r\n\t\t\t\t\tmaintain vehicles in the County fleet.\r\n\t\t\t\t\t<p align=\"left\"><b>MINIMUM QUALIFICATIONS:</b>\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tHigh school diploma with course work in auto mechanics or completion of an \r\n\t\t\t\t\t\t\tapproved training course.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tExperience necessary to qualify as a skilled mechanic and certification as a \r\n\t\t\t\t\t\t\tskilled automotive mechanic.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tClass \"E\" Missouri driver's license.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tA1-A8 ASE Certification with ability to gain higher ASE certifications\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t<p align=\"left\"><b>KNOWLEDGE, SKILLS AND ABILITIES:</b>\r\n\t\t\t\t\t\t<ul>\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tComputer literate.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tExtensive knowledge of all mechanical hand tools and testing equipment.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tExtensive knowledge of all materials and parts.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tKnowledge of standard garage shop practices and techniques, occupational \r\n\t\t\t\t\t\t\thazards, and applicable precautionary measures.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tAbility to locate and adjust mechanical feedback in motors and equipment and \r\n\t\t\t\t\t\t\tmake necessary repairs.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tSkill in the use of tools and the operation of the machines and equipment \r\n\t\t\t\t\t\t\temployed in motor repair and adjustment.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tAbility to weld and perform simple blacksmith operations.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tAbility to make work activity reports.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tSkill and ability to work from oral or written instructions.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tAbility to establish regular maintenance and upkeep schedule for County fleet \r\n\t\t\t\t\t\t\tof vehicles.\r\n\t\t\t\t\t\t\t<li>\r\n\t\t\t\t\t\t\tLicensed Missouri State Vehicle Inspector.\r\n\t\t\t\t\t\t</ul>\r\n\t\t\t\t\t<p align=\"left\">\r\n\t\t\t\tThe Division of Human Resources will receive applications from internal \r\n\t\t\t\tcandidates until Tuesday, May 2, 2006. The position will be open for outside \r\n\t\t\t\tapplicant consideration after this date.\r\n\t\t\t</tr> application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row General Services Division No jobs currently listed application | top blank row Highway Division No jobs currently listed - POSITION SUMMARY - -ADD ANOTHER POSITION SUMMARY- application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Human Resources Division No jobs currently listed - POSITION SUMMARY - -ADD ANOTHER POSITION SUMMARY- application | top blank row Juvenile Division - <font class=smtxt><i>No jobs currently listed</i></font> - - POSITION SUMMARY -"
    },
    {
      "tag": "p",
      "text": "POSITION VACANCY ANNOUNCEMENT Youth Care Worker Department of Juvenile Justice Part-time $9.26 per hour + Shift Incentives POSITION SUMMARY: Responsible for providing direct and appropriate care to the juvenile residents \r\n\t\t\t\t\t\tplaced with Jefferson County Children's Home in accordance with established \r\n\t\t\t\t\t\tpolicies, procedures and guidelines to ensure the rights and privileges of the \r\n\t\t\t\t\t\tjuvenile residents are not abridged in any manner. Performs routine \r\n\t\t\t\t\t\thousekeeping duties as directed; maintains and generates log entries' reports \r\n\t\t\t\t\t\tand all other documentation as required by policies, procedures and guidelines. MINIMUM QUALIFICATIONS: High School Diploma or Equivalency Must be 21 years of age or older Experience in working with youths (professionally or volunteer basis) preferred KNOWLEDGE, SKILLS AND ABILITIES: Must possess good communication and problem solving skills. Ability to perform routine housekeeping duties Knowledge of basic computer skills Must be available to work evening, midnight and weekend schedule. The Division of Human Resources will receive applications from internal \r\n\t\t\t\t\t\tcandidates until Friday, March 3, 2006. The position will be open for outside \r\n\t\t\t\t\t\tapplicant consideration after this date. -ADD ANOTHER POSITION SUMMARY-"
    },
    {
      "tag": "div",
      "text": "application | top blank row Municipal Court No jobs currently listed - POSITION SUMMARY - -ADD ANOTHER POSITION SUMMARY- application | top blank row Office of Contracts & Grants No jobs currently listed - POSITION SUMMARY - -ADD ANOTHER POSITION SUMMARY- application | top blank row Office of Emergency Management & \r\n\t\t\t\t\t\tPublic Information No jobs currently listed application | <a href=\"../hr/main/apply.html\">apply online</a> | top blank row Parks & Recreation No jobs currently listed blank row application | top blank row Planning Division No jobs currently listed application | top blank row Prosecuting Attorney's Office - <font class=\"smtxt\"><i>no jobs currently listed</i></font> - -ADD ANOTHER POSITION SUMMARY-"
    },
    {
      "tag": "p",
      "text": "POSITION VACANCY ANNOUNCEMENT Administrative Clerk II Prosecuting Attorney's Office $17,000.00 to $18,960.00 Annual Salary Depending on Qualifications POSITION SUMMARY: Type a variety of documents, often legal in character, working from rough draft.  \r\n                  Scan documents into document imaging program.  \r\n                  Organize and compile files; run criminal histories.  \r\n                  Assist with receptionist duties, and other miscellaneous clerical duties. KNOWLEDGE, SKILLS AND ABILITIES: Knowledge of business English, spelling and to make arithmetic computations. Knowledge of office practices and procedures and record keeping methods. Must have good oral and written communication skills and the ability to resolve problems with tact and diplomacy. Ability to maintain moderately complex clerical records and to prepare reports from records and to check for accuracy. Ability to make routine decisions in accordance with procedures, laws and regulations and to apply these to work problems. Strong computer skills and knowledge of Microsoft Office essential. MINIMUM QUALIFICATIONS: High School Diploma or Equivalency One year of experience in a legal environment. The Division of Human Resources will receive applications from internal candidates until Friday, December 15, 2006.  The position will be open for outside applicant consideration after this date. - END POSITION - -ADD ANOTHER POSITION SUMMARY-"
    },
    {
      "tag": "div",
      "text": "application | top blank row Public Administrator's Office No jobs currently listed <p align=\"center\">\t\t\t\t\t\t\t\t\t\r\n<font class=\"smtxt\"><b>INTERNAL POSITION VACANCY ANNOUNCEMENT</b>\r\n<br>\r\n<b>OFFICE MANAGER</b>\r\n<br><br>\r\nPublic Administrators Office\r\n<br><br>\r\n$22,000 to $25,000 Annually<br>\r\nDepending on Qualifications\r\n</p>\r\n\r\n<p align=\"left\">\r\n<b>POSITION SUMMARY:</b><br>\r\nManages the day-to-day functions of the office including scheduling, appointments, supply orders, purchase orders/requests, reports preparation, State Crisis Fund management, management of case files, correspondence, administrative aspects of client care, and personal and telephone contact with Wards of the State, their caregivers, families, and nursing facilities.\r\n</p>\r\n\r\n<b>MINIMUM QUALIFICATIONS:</b>\r\n<ul>\r\n<li>High School Diploma or equivalent and five (5) years experience in office management with supervisory experience preferred.\r\n</ul>\r\n<b>KNOWLEDGE, SKILLS AND ABILITIES:</b>\r\n<ul>\r\n<li>Knowledge of programs, rules and regulations.\r\n<li>Knowledge of office practices and procedures.\r\n<li>Ability to supervise other clerical and/or support positions.\r\n<li>Ability to communicate clearly and effectively both orally and in writing.\r\n<li>Knowledge of computer applications including Microsoft Office.\r\n<li>Ability to apply interpersonal skills in interaction with other employees and the public.\r\n</ul>\r\n\r\nThe Division of Human Resources will be accepting applications from qualified candidates until Monday, October 30, 2006. \r\n</font>\t\t\t\t\t\t\t\t\t\r\n\t\t\t\t\t\r\n\t\t\t\t\t</td>\r\n\t\t\t</tr> application | top blank row Recorder of Deeds No jobs currently listed application | top blank row Technical Administration Division No jobs currently listed application | top blank row Treasurer's Office No jobs currently listed application | top blank row Other Vacancies No jobs currently listed First Position End Positions application | top blank row Jefferson County 300 2nd Street Hillsboro, MO 63050 800-748-3456 contact | design \r\n\t\t\t\t\t\t\tteam |   support by JOIN-N Copyright © 2000 Jefferson County, Missouri All rights reserved. End right column table this is a relative width cell marker"
    }
  ]
}