{
  "url": "http://www.jhu.edu/~jhumag/0403web/cold.html",
  "content_hash": "9dcb5d53f558e59255bddc223f9854e57b3a792d6eb26fba2cb95b50aa9b0b42",
  "total_blocks": 78,
  "retained_blocks": 19,
  "ignored_blocks": 59,
  "blocks": [
    {
      "tag": "div",
      "text": "Cold Comfort"
    },
    {
      "tag": "p",
      "text": "They thought they were ready for any challenge. But the\nJohns Hopkins students on a winter camping expedition in\nthe Adirondacks found their resolve and their leadership\nskills tested -- at minus 20 Fahrenheit. By Robert Roper"
    },
    {
      "tag": "div",
      "text": "Opening photo by Matt \"Spinner\" Allen The mission statement of the Hopkins outdoor program puts\nthe matter baldly. \"We desire to push people out of their\ncomfort zone,\" it says, \"so they can see themselves ... in\nnew ways.\" The question then becomes, how big is your\ncomfort zone? Would you be happy sleeping for a couple of\nnights in a tent? How about a tent in the snow? How about a\ntent in the snow in zero-degree weather? How about a tent\nin the snow for 10 days with a low of minus 30, wind chill\nnot included?"
    },
    {
      "tag": "p",
      "text": "How about a tent in the snow and never quite getting warm\nall day, needing to rest but afraid to stop moving because\nthen the freeze sets in? Your feet and hands losing all\nfeeling, the frostbite starting on your face? That's a different idea of a comfort zone, a more special\none, and this January, those questions took on real meaning\nfor a group of Johns Hopkins students. They had set out for\ntwo weeks of winter camping in the Adirondacks, prepared\nfor cold and snow and all the challenges entailed in that,\nbut they were destined to encounter truly serious cold,\nAlaska-style cold, near-historic lows for the High Peaks\nregion of upper New York state. The whole literature of\nsurvival in the winter wilderness, from Jack London's \"To\nBuild a Fire\" to Jon Krakauer's Into Thin Air, suddenly seemed strangely relevant. The trip, organized as part of HOLT (Hopkins Outdoor\nLeadership Training), placed the students in a situation\nwhere \"their decisions had real consequences,\" according to\nPhil Zook Friesen, the university outdoor coordinator and\nsomeone well-acquainted with the challenges of backwoods\nwinter travel. A former Sierra mountain guide, Friesen has\nbeen developing a cadre of student leaders at Hopkins, men\nand women trained in specific skills -- rock climbing,\nbackpacking, white water kayaking  -- and with tested\ndecision-making abilities. His goal is to be able to offer\nan ever richer variety of outdoor activities for the\nHopkins community, in an atmosphere of safety and fun."
    },
    {
      "tag": "div",
      "text": "\"Frozen Circus\" included Eric Schenfeld (foreground) and\nJon Haslanger, Glenn Wolfe, Katie Francis, Justin Plaum,\nSarah Spriet, Liz Pazdernik, and Spinner\nAllen. Photo by Kate Francis Among the 14 students on the January expedition, several\nwere hoping to become student leaders in this summer's\nPre-Orientation Programs, which offer six- to eight-day\nwilderness trips for incoming freshmen. Friesen divided his\ngroup into two smaller squads, one called \"Sleepy Bear\" and\nthe other, aptly, \"Frozen Circus.\" The plan: to travel from\nBaltimore to upstate New York on the first day, then to\nspend Days 2 and 3 at the Rock and River Lodge, testing\ngear and making preparations to set out on Day 4. Both\ngroups would spend the nights of Days 4 and 5 at Camp Peggy\nO'Brian, then would separate and take different trails into\nthe back country (see map). Each of the teams worked out an\nitinerary through the wilderness, and, so that everyone\nhoping to become a student leader could gain experience,\nthe directing duties were rotated daily."
    },
    {
      "tag": "p",
      "text": "One of the leader candidates, Liz Pazdernik, a graduate\nstudent in geography and\nenvironmental engineering, found herself in charge of\nFrozen Circus on Day 8, a day of truly bitter cold -- minus\n18 degrees Fahrenheit. \"This was my first true backpacking trip,\" Pazdernik says,\n\"and maybe it was crazy to be doing that in the\nAdirondacks, in January, but anyhow, there I was. It was\nour second night out, and the temperatures had plummeted.\nYou immediately felt your fingers and your feet\nfreezing.... All you could think of was the cold, nothing\nbut that. And in that state of mind you had to decide if\nyour team should push on or evacuate. Basically, what in\nthe world we should do. \"Among our group, I was probably the coldest,\" she adds.\n\"My co-leader went around to everybody and explained that\nwe were bad off, really pretty bad off ... that I hadn't\nbeen warm in over 24 hours. Before conditions had become\nthat severe, it had been easy to tinker around being\nleaders and decision-makers, but once it got that extreme,\nyou didn't want to eat, you didn't want to drink, all you\ncould think of was how cold you were.\""
    },
    {
      "tag": "div",
      "text": "\"Sleepy Bear\": Charles Reyner, Emily\nKumpel, Jessica Richmond, Ayla Turnquist; (bottom, l to r)\nHoward Change, Phil Friesen, Kevin Pear. Not pictured: Sean\nHeffernan, Katy Juhaszova. Photo by Sarah Spriet After some discussion, the group decided to send four\nmembers west, toward a heated lodge at a lower elevation.\nHere they could recuperate in some comfort, while the three\nother members of the group snowshoed six miles in the other\ndirection, their goal being to recover the group's rented\nvehicles, which had been left at the trailhead, then drive\naround to the lodge on paved roads. This decision allowed\nthe team members who were suffering most to get immediate\nrelief, although at the cost of abandoning the group's\nmountaineering objectives for the day (they had been hoping\nto climb Yard Mountain and Big Slide Mountain)."
    },
    {
      "tag": "p",
      "text": "\"There was a dual purpose to everything,\" Pazdernik says,\nreferring to the training in decision-making. \"There was\nthe physical encounter with the conditions, unbelievably\nharsh, and then also this thoughtful guided training in how\nto make a smart call in the wilderness. You were\nencountering your core fears, dealing with elemental\nworries like frostbite and how do I ever get warm again,\nand meanwhile undergoing this sophisticated process, this\nexercise in interpersonal complexities.\" The leader candidates, although given considerable\nautonomy, were supervised at all times by Friesen and by\nsix instructors who had been trained by Friesen and others.\nExperiential education, the pedagogy that underlies\nprograms like HOLT and which owes a debt to Outward Bound\nand similar movements, posits personal growth as a\ndependable outcome of serious outdoor adventure. But any\nprofessionally run program of this kind will be full of\nfail-safe measures, backup personnel, and thoughtful plans\nfor dealing with all contingencies. The trick is to devise\ngenuine encounters with wilderness conditions that are\nserious as well as fun, that call on outdoor skills in a\nconsequential way, but in an environment of carefully\nmanaged risk. Friesen, who has been working in programs of this kind for\neight years, is a technical rock climber and a mountaineer.\nHe has a warm, easy manner that turns even stern encounters\nwith harsh conditions into exercises in relaxation: No,\nthis is not about proving your manhood or womanhood, not\nabout grimly holding on to the death, but rather about deep\nplay, about mastering skills that can free you in the\nwilderness and also in life. His goal in developing student\nleaders is to build a staff at Hopkins capable of leading\nmore trips, but even more to equip students to deal with\nchallenges of any sort. The aim is a deeper enjoyment, a\nfuller immersion in a difficult world  -- mindfulness and\nadventure-readiness. Follow this link \nto a larger version of this map . The High Peaks region -- the area that contains all the\nAdirondack summits over 4,000 feet -- sees very little\ntraffic in the dead of winter. (Perhaps the reason is that,\nas the Adirondack Mountain Club guidebook says, \"the \nregion presents an abundance of extremely steep terrain as\nwell as exposed alpine environments with the potential for\narctic weather conditions.\") For Eric Schenfeld,\nencountering the cold was really the point of the whole\nadventure. \"I'd never slept out in winter,\" he says, \"and I\nfigured I could either do it now, while I'm at Hopkins, or\npay Outward Bound or somebody like that a lot of money\nlater.\" On the coldest mornings, \"I woke up with no feeling\nin my feet,\" says Schenfeld. \"I rubbed them for a long time\nand the only reason I knew that they were my feet, not\nblocks of wood, was that I was looking at them.\" Schenfeld was in the same group, Frozen Circus, as Liz\nPazdernik. On Day 6, the team had climbed Lower Wolfjaw\nMountain (4,175 feet), then had hiked to an open-sided\nshelter along Klondike Brook. That night was probably the\ncoldest 12-hour period of the trip. (It was also the\nprelude to the decision, taken by Pazdernik and others, to\nsplit Circus and evacuate to Rock and River Lodge.) At\naround 8:30 a.m. the next morning, as they rubbed their\nfeet and tried to thaw their boots, which had frozen solid\ndespite being kept inside the tent, the temperature was\nabout minus 20 (presumably, it had been at least 10 degrees\ncolder during the night). Schenfeld was eager to push on, to try to snowshoe\nenergetically all day, because, as he explains, \"That's the\nonly time I was really warm, really comfortably warm, when\nwe were out hiking with full packs on. The nights weren't\nreally restful ... you're in your sleeping bag for a long\ntime, and it's supposed to be the warmest time of day for\nyou, the time when you can recuperate. But it wasn't like\nthat. Even if you took a hot-water bottle into your\nsleeping bag with you ... one person's hot-water bottle\nfroze solid and broke inside the sleeping bag.\""
    },
    {
      "tag": "div",
      "text": "Both groups, led by Friesen, started and ended their\nwinter backpacing adventure at the Adirondack Rock and\nRiver Lodge. Photo by Sarah Spriet The travelers ate well -- hearty, carbohydrate-rich food\ncooked on portable stoves -- and there was a lot of\nhorseplay and camaraderie on the trail. But at the end of\nthe day, no matter how much good feeling and enjoyment had\nbeen generated, there were those nighttime hours to be\npassed in the bone-chilling cold."
    },
    {
      "tag": "p",
      "text": "In retrospect, Friesen, who attended to both teams but\ntraveled mostly with Sleepy Bear, thinks that Frozen Circus\nmay have suffered more than Sleepy Bear because, on the day\nbefore the coldest night, they had snowshoed less far and\nthus had warmed up less thoroughly. In contrast, Sleepy\nBear had gotten seriously warmed up trying to climb\nMount Marcy, the tallest peak in the Adirondacks (5,344\nfeet). \"In the process, we lost the trail because of\nblowing snow and other factors,\" says Friesen. \"We were up\nin elevation, and the leader of the day lost a little\ncontrol, as almost anybody would.... We spent about 45\nminutes up around treeline, among the low shrubs and snow,\nsearching for the trail and not finding it. At last, one of\nthe students stumbled on it. It was now past noon and the\ntemperature was minus 10, minus 20 with the wind chill....\nWe got up pretty high, I'd say, but couldn't quite make the\nsummit, then headed north, toward Avalanche Pass, toward\nthe lean-to we knew was there.\""
    },
    {
      "tag": "div",
      "text": "Katie Francis Photo by Matt \"Spinner\" Allen Friesen put some of the students into sleeping bags\nimmediately to warm them up and stave off hypothermia.\nSeveral days earlier, Friesen had written in his private\njournal: \"Our first day in the field is drawing to a close\nand it is brutally cold.... Hiking was not too bad, but ...\nthe cold was almost unbearable.\" And now, it was colder\nthan that, much colder. At Saranac Lake, some 25 miles\naway, the recorded low was minus 31, and Friesen was fairly\nsure that it had been even colder where his group was,\npossibly minus 40 or below. As Friesen further noted in his\njournal, \"This course has been tough. One of the toughest\non me,\" because of his concern for his students, his wish\nto deliver a stellar experience for everyone -- successful\nascents of winter mountains, fun times on the trail, warm\nmoments in the tents, lots of learning and growing and\nmaturing in the grip of nature. And here was nature, biting\nback. Hard. \"We have a beginner winter backpacking\ncourse,\" he wrote, \"and the temperatures could be\nlife-threatening if anything goes wrong.... Is this the\nbest way to teach leadership?\" he wondered. \"Is this course\naccomplishing what it needs to or should?\""
    },
    {
      "tag": "p",
      "text": "On the day after Mount Marcy, Sleepy Bear remained in their\nsleeping bags until after 11 a.m. Then around 1 p.m.,\ndespite continued bitter cold, the team roused itself and\nsnowshoed over Avalanche Pass and out onto frozen Avalanche\nLake. The day, though severely cold, was brilliantly\nbeautiful. Steep cliffs rise up on either side of Avalanche\nLake, which occupies a cleft in the mountains, and in those\nsurroundings, \"Everyone just got lifted,\" says Howard\nChang, one of Friesen's student instructors. \"Just to be\nout and alive there was gorgeous. People had been bummed\nabout not getting to the summit the day before, but this\nwas an answer to that, a beautiful answer. It was\nspectacular and it will always be one of my greatest\noutdoor moments.\" Charged by the surroundings and thoroughly warmed up again,\nthe group returned to their bivouac spot near Avalanche\nPass. Here they spent a second, slightly less torturous,\nnight. Then on the morning of Day 9, they headed north, in\ncontinuing extreme cold, aiming to rendezvous with Frozen\nCircus at the Adirondack Rock and River Lodge (pictured\nat right) , with its four walls, roof, and\nwell-functioning furnace."
    },
    {
      "tag": "div",
      "text": "The picturesque view from the rear of the\nlodge (above). Photo by Matt \"Spinner\" Allen For Liz Pazdernik and the other members of Frozen Circus,\nthe lodge had felt good, very good, after the nights out in\nthe open, nights of frozen boots, fear of frostbite, and\nfive people jammed uncomfortably in a four-man tent. But\nnow, a second crisis in decision-making arose. Should they\nstay where they were, comfortably indoors, or instead\nventure out again, prove their mountaineering mettle? Most\nof the students did want to go out again: The program as\noriginally designed called for another foray into the High\nPeaks, this time without any instructors along, the\nstudents keeping in touch with Friesen and the other staff\nonly by radio. Then, when Sleepy Bear also arrived at the\nlodge, Friesen and his group joined the ongoing discussion.\nFriesen and the instructors asked the students to spell out\nthe risks involved in going out again: What would it mean\nto go to their \"breaking point,\" Friesen asked, in\ncontinued sub-minus 20-degree weather? What if somebody\nsuffered serious frostbite? How did you justify permanent\ninjury, possibly a friend's loss of fingers or toes, in the\nname of your \"personal search for limits\"? All the talk of\nthe ethics of risk and adventure now became bracingly real.\n(On those same days in mid-January, a group from Dartmouth\nCollege had to litter out a participant from the same\nregion of the Adirondack High Peaks -- the point, as\nFriesen's students came to realize, was that any unexpected development could become life-threatening in\nsuch cold.)"
    },
    {
      "tag": "p",
      "text": "Reluctantly -- but with a lot of good discussion and\n\"process\" -- the group at last decided to cut the trip\nshort. It would not be 14 days long, it would only be 10\ndays. They consoled themselves with the promise, however,\nof a session of ice climbing instruction in nearby Keene\nValley, where, as it happened, the yearly Adirondack\nMountain Festival was under way. But the chief ice climbing\nguide there, fearing frostbite in weather expected to be\nminus 12 or below, said no: In such conditions, the ice was\ntoo brittle and might shatter from the blow of an ice\nax. Thus, a disappointing winter trip. Except that no one was\ndisappointed."
    },
    {
      "tag": "div",
      "text": "After making the decision to evacuate, Frozen Circus\nheads back to the Adirondack Rock and River\nLodge. Photo by Matt \"Spinner\" Allen \"No, it was one of my best outdoor times,\" Howard Chang\nsays, \"and I've been backpacking most of my life. I was\neven an Eagle Scout. If the purpose was outdoor leadership\ntraining, then this was beautifully designed.... Everyone\nwas definitely pushed to their limit, but no one went over\nthe limit, and that was because of the careful process.\nYeah, and it was fun, too. It was good to suffer!\""
    },
    {
      "tag": "p",
      "text": "Katy Juhaszova, a student participant who had never done\nthis kind of camping, says that she \"loved the opportunity\nto see things that I had never seen and really push myself\nphysically and mentally -- to get myself out of my comfort\nzone and my routine. I came back so refreshed and\nawakened,\" she adds. \"For that, it was invaluable. Also\nmeeting other outdoors-oriented people from Hopkins,\ngetting a better idea of what was out there for me to get\ninvolved in.\" And Emily Kumpel, one of the students hoping to become a\nPre-Orientation leader: \"I thought there was an excellent\ncombination of outdoor skills, leadership training, and\ngroup development. I especially liked the chance to bond\nwith the group,\" she says. \"At first I thought having\nleaders of the day was completely unfair, as I didn't feel\nI could show my leadership when I was so unsure of what I\nwas doing. But as the course went on I realized what a true\ntest of leadership that was and how essential the process\nis to learning. Leading when I had no idea what was going\non ... became my favorite part of the course.\""
    },
    {
      "tag": "div",
      "text": "The view from Lower Wolfjaw. Photo by Matt \"Spinner\" Allen And Liz Pazdernik, who suffered so much from the cold, who\nhad to take the reins of leadership when she felt least up\nto doing so: \"I wouldn't take back a moment of it.... I now\nknow what it feels like to live outside in zero- to minus\n30-degree weather,\" she says. \"I'm now not worried about\nhiking for a few miles with a heavy pack, and I know how to\nfind my way around the woods with a map and compass. Since\nbeing back I have a new, more lasting sense of\nconfidence...."
    },
    {
      "tag": "p",
      "text": "\"I will never forget what it felt like to face the bottom\nof my strength -- to face all of my anxieties at once,\nparticularly the fear of failure. I am already preparing\nmyself for more trips. The next thing will be rock\nclimbing.... I've committed myself to getting trained and\ncertified as a rock climbing leader this spring. \"Ah,\" she says, \"the glow of a successful experience!\" Robert Roper, a visiting associate professor in the Writing Seminars at Johns\nHopkins, is the author of Fatal Mountaineer: The High\nAltitude Life and Death of Willi Unsoeld, American\nHimalayan Legend. Last fall, Roper was awarded the 2002\nBoardman Tasker Prize, an honor given each year by the\nBritish Alpine Club for an outstanding contribution to\nmountain literature. footer Return to April 2003 Table \nof Contents"
    },
    {
      "tag": "div",
      "text": "The Johns Hopkins Magazine | The Johns Hopkins University | \n3003 North Charles Street | Suite 100 | Baltimore, Maryland 21218 | \nPhone 410.516.7645 | Fax 410.516.5251"
    }
  ]
}