{
  "url": "http://www.john-daly.com/deadisle/",
  "content_hash": "fc201fa9ffc864dbc2aee9baaf29cd6a91b55e2b42a9bd71ac70cd089476ebcd",
  "total_blocks": 320,
  "retained_blocks": 33,
  "ignored_blocks": 287,
  "blocks": [
    {
      "tag": "p",
      "text": "Tasmanian Sea Levels: The `Isle of the Dead' Revisited by John L. Daly 2nd February 2003 Part 1 (Part 2 here) Summary Recent publicity arising from a study by the Universities of Southampton and Tasmania [1] of an old\r\n        sea level  benchmark at Port Arthur, Tasmania, claims `dramatic' sea level rise of about 13cm since the mark was first struck back in 1841. Fig.1 - The benchmark at mean tide"
    },
    {
      "tag": "div",
      "text": "These claims are based primarily on statistical probability models and are unsupportable when viewed in the context of\r\n        other physical and documentary evidence available surrounding the benchmark. \r\n        The study claims the benchmark was originally set 44.5cm above the mean level of the sea (as it then existed in 1841) . Since it now sits at 31.5 cm above (see fig.1) , the difference - 13cm - is claimed to be evidence of sea level rise."
    },
    {
      "tag": "p",
      "text": "However, the man responsible for putting the mark there, explorer Sir James Clark Ross stated explicitly and several times in his 1846 book [3] that the mark was placed at MSL (as he estimated it to be) , not at a point 44.5cm above,\r\n      near the high tide point, as claimed by the study. \r\n      Other evidence surrounding the original placing of the benchmark is less clear, but we do have one positive measurement of where the benchmark stood relative to sea level taken in 1888 by the then Government meteorologist, Commander J. Shortt R.N. \r\n      He found the mark to be 34cm above sea level - only 2 cm different to its current\r\n      position [7] [5] . This suggests a sea level rise since 1888 of only 2cm, not 13cm as claimed by the study. \r\n      This small rise of 2 cm is fully consistent with a survey of long-term tide gauges [15] around the Australian coast carried out recently by the National Tidal Facility in Adelaide, which found a sea level rise rate of only 0.3 mm/yr, equivalent to a sea level rise of 3cm over a century. Even the current sea level in the inner cove (Mason Cove) of Port Arthur itself is lower than that indicated by a tide gauge [6] which the study claims existed there in the early 1840s. The 1888 measurement by Cmdr. Shortt suggests sea levels rose an incredible 44.5 - 34 = 10 cm in only 47 years, at a time of global cooling\r\n      and slowly uplifting land when quite the opposite should occur. While the study dismissed\r\n      Cmdr. Shortt's measurement as inaccurate, with no coherent explanation given for that\r\n      view, it is much more probable that the study simply got the original benchmark height wrong and that the 1888 measurement by Cmdr. Shortt was sound. Complicating the issue further is the possibility, expressed by Cmdr. Shortt himself, that numerous earth tremors in\r\n      from 1883 to 1886, unprecedented either before or since, may have uplifted the land\r\n      by an unknown degree over that period of time. Indeed, this was his stated reason for making the measurement in the first place, having received reports of just such an effect from islands in the Bass Strait. \r\n      Any land uplift from the 1880s tremors would displace the benchmark upwards from its original position if the benchmark had indeed been placed at\r\n      MSL as stated clearly by James Clark Ross. In addition, modern tide gauges located at Hobart and Spring Bay on either side of the Port Arthur site, on the same coast, show no sea level rise since their installation during the\r\n      1980s [18] . The weight of physical and documentary evidence shows that sea level rise around Tasmania, and indeed Australia as a whole, is only very slight, and that this study is seriously in error. The reason may well be the over-reliance on statistical probability modelling at the expense of\r\n      physical and documentary evidence. Introduction This report has been prompted by the recent publication of\r\n      a paper by Pugh et al [1] , giving details of a 7-year  study by the\r\n      Universities of Southampton and Tasmania into the origins, history, and current\r\n      height of a sea level benchmark etched onto a cliff on a small island in Port\r\n      Arthur Harbour,\r\n      Tasmania, in 1841. The authors claim the benchmark was not struck at Mean Sea Level (MSL) as described by the man responsible for putting it there, Antarctic\r\n      explorer Captain Sir James Clark Ross , acting in association\r\n      with Thomas Lempriere (a senior official of the Port\r\n      Arthur convict colony), but was rather struck  closer to high tide, the mark estimated by Pugh et al .  to be 44.5 cm above MSL as it existed in\r\n      1841.  Since they report that the mark is now 31.5 cm above current\r\n      MSL, as determined from modern tide gauge data, they propose\r\n      that a sea level rise of 44.5 - 31.5 cm = 13 cm has therefore occurred since\r\n      1841.  Of this, they further propose that the current land uplift\r\n      rate would raise the land 3.2 cm over the same period, making a net sea\r\n      level rise of 13 - 3.2 = 9.8 cm. There are a number of  height positions relative to MSL in 1841 to which the benchmark might have been  struck - at\r\n      44.5 cm\r\n      above as claimed by Pugh et al ., or 14 cm above as suggested later in this\r\n      report or at the actual 1841 MSL itself.  Any such scenarios involve\r\n      unresolved issues with available evidence, the most serious of which is\r\n      the Pugh et al scenario which completely contradicts the written account given by\r\n      Ross in his 1847 book [3] . Between 1841 and the modern era, we have only one\r\n      measurement made of the height of the benchmark relative to sea level, and\r\n      that was organised by Commander J. Shortt R.N., the Government Meteorologist of\r\n      the day, on 24th February 1888.  The height he reported is only 2\r\n      cm different to the height today, a sea level rise of only an inch in 114\r\n      years. It is the Shortt measurement of 1888 which\r\n      is critical for any scenario.  In the case of Pugh et al ., they have applied a\r\n      very long error bar to the Shortt measurement,  26 cm, or about one third\r\n      of the full tidal range at Port Arthur.  It is only through this wide\r\n      error bar that the scenario favoured by Pugh et al works at all as the sea\r\n      level rise they propose depends on their sea level trend line passing through the\r\n      extreme lower end of their 1888 error bar.  A narrower error bar would\r\n      require a sea level rise between 1841 and 1888 of around 10 - 12 cm, much\r\n      too large for only 47 years during a period of global cooling and against\r\n      the trend of a gently uplifting coast. This report demonstrates some key problems with the Pugh et al . study and to provide an alternative scenario in\r\n      Part 2 consistent with the known evidence surrounding the Ross-Lempriere\r\n      benchmark. The Ross-Lempriere Sea Level\r\n        Benchmark Today Fig.2 - SE Tasmania"
    },
    {
      "tag": "div",
      "text": "We must first establish some geographical\r\n        context.  Firstly the general location -"
    },
    {
      "tag": "p",
      "text": "Port Arthur is a large harbour in south-eastern Tasmania, well sheltered from the\r\n                ocean, and opens out directly to the Southern Ocean with no\r\n                large rivers entering it. The harbour area is largely\r\n                undeveloped and was the site of a British convict settlement\r\n                during the middle of the 19th century, the settlement being also\r\n                called Port Arthur.  There are the ruined remains of the                                                      once-busy 19th century convict\r\n                colony, a popular spot today for visitors, and a small settlement of a few dozen houses on the southern shore\r\n                of the harbour. Everywhere else is mostly forest and undeveloped shoreline. Port Arthur sits on a large peninsula, actually two of them\r\n                linked in series. Fig 3. - The Tasman Peninsula"
    },
    {
      "tag": "div",
      "text": "This allowed the convict guards in the 19th\r\n              century to prevent escaping prisoners from getting past a narrow\r\n              isthmus of land at Eaglehawk Neck (top of\r\n              fig.3) .  Eaglehawk Neck is also of interest to the\r\n              overall story as it is only 106 metres wide [12] , wedged between the\r\n              Southern Ocean to the east and Eaglehawk Bay to the west (which also opens out to the ocean) ."
    },
    {
      "tag": "p",
      "text": "Port Arthur's harbour mouth faces south and  opens out directly to the Southern\r\n              Ocean. Consequently, it experiences tides unimpeded by large land masses or\r\n              estuary effects.  For this reason the tidal range at Port\r\n              Arthur is quite small, around 75cm, (or 2\r\n              feet) between high and low tides on\r\n              average. The tides are complex however, having alternate minor and major\r\n              tides, plus two seiches, or water swills, within the harbour, one\r\n              with a cycle of about an hour, the other with a cycle of less than\r\n              a minute.  The one-minute seiche is quite visible to the eye. Fig. 4 - Map of Port Arthur The\r\n        old convict colony is now a managed Historic Site and comprises the main convict                                                      settlement at Port Arthur, a smaller ruin settlement for convict boys at Point                                                      Puer, and finally, the `Isle of the Dead' , the final                                                      resting place of nearly 2,000 people, convicts, children, and free persons, buried                                                      there during the convict days of early settlement last century.\r\n        The Isle of the Dead lies about a kilometre east of Commandants Point and it\r\n        is here that the 1841 sea level benchmark sits on the north side of the\r\n        isle. Four locations from the above map are of special\r\n        interest for our purposes - 1) The Isle of the Dead.  The Ross-Lempriere\r\n        benchmark is located on the north side of this island. 2) The Basin and Stores area.  This is where Pugh et al . believe a tide gauge was located in 1841. 3) The CSIRO Tide Gauge.  Pugh et al . used this\r\n        tide gauge to determine modern sea level. 4) The Dockyard.  Now a ruin, but another possible\r\n        location for the 1841 tide gauge. Most people who died at either Port Arthur or Point Puer were buried on the `Isle of\r\n        the Dead', many of the  gravestones still visible today. Fig.5 - The Isle of the Dead in late afternoon   John L.\r\n        Daly The sea level benchmark engraved there on the north\r\n        side of the island (facing away from the photo,\r\n        fig.5) was originally cut on 1st July 1841, by a senior official of the penal\r\n        colony, Thomas Lempriere , in association with Captain Sir James Clark\r\n        Ross , the renowned Antarctic explorer, who was visiting Tasmania at the time. Ross\r\n        was the commander of a scientific expedition to the Antarctic, using two\r\n        ships, Erebus and Terror , both of which were moored at\r\n        Hobart between April and July of 1841 during a three-month stopover in\r\n        Tasmania. It was Ross who set\r\n        in motion the project to establish a sea level benchmark at Port Arthur,\r\n        a project fully supported by both the Governor of Tasmania,\r\n        Sir John Franklin, and the British Colonial Office.  In other\r\n        words, this project was conceived at the highest level. The benchmark they established is still there and in perfect condition - Fig.6 - The Ross-Lempriere Sea Level Benchmark today  \r\n              J. Daly"
    },
    {
      "tag": "div",
      "text": "The mark itself currently sits 31.5 cm above\r\n              MSL, as\r\n        measured by Pugh et al .  Both the MSL at Port Arthur and the height\r\n        of the benchmark above it were calculated by them as a result of\r\n        extensive survey work involving levelling and  altimetry\r\n        satellites.  The figure they give is consistent with other\r\n        estimates given of the current height of the benchmark and is not itself\r\n      in dispute here."
    },
    {
      "tag": "p",
      "text": "Pugh et al . also estimate that gradual land uplift since 1841\r\n              was 3.2 cm, which, when deducted from their estimate of sea level\r\n              rise, gives a net sea level rise of 9.8 cm. Sea Level Rise? This estimate of sea level rise made by Pugh et al .\r\n        depends critically upon exactly what height relative to MSL (as it existed in 1841) the benchmark was\r\n        originally struck to by Ross and Lempriere.  It also depends\r\n        critically upon a height measurement made of the benchmark by Commander\r\n        J. Shortt R.N., the government meteorologist, 47 years later in\r\n        1888.  As we shall later see, it is the 1888 measurement by Cmdr.\r\n        Shortt which is the weakest link in the Pugh et al . scenario of sea\r\n        level rise. Fig.7 - A Timeline of Sea Level Relative to the Benchmark, 1841-2002,\r\n      acc. to Pugh et al. [1] The above diagram is reproduced from a similar diagram in the Pugh et al . paper,\r\n      but drawn to scale marks to show the levels, error bars and years more clearly. \r\n      It shows the scenario they present of sea level rise.  The Ross-Lempriere\r\n      benchmark is taken to lie at the zero line at the top of the graph, and the changing\r\n      sea levels are referenced against it.  As the diagram shows, they\r\n      assume the sea level in 1841 to be at -44.5 cm below the benchmark, thus giving a relative sea\r\n      level rise to the present of 13 cm. As the chart indicates, the scenario of sea level rise\r\n      depends - (a) on the choice of 44.5 cm as the starting point above MSL in\r\n      1841, and (b) on the large error bar of the 1888 Shortt measurement, the\r\n      extreme bottom of which is needed to allow the rising sea level trend line to\r\n      pass through to the present.  Indeed, at a lecture given by the study\r\n      authors to explain\r\n      the results [2] , it was pointed out that because\r\n      there was no evidence from elsewhere in the world that sea levels rose in\r\n      the mid to late 19th century, then the sea level line from 1841 should\r\n      really run horizontally to 1890 and then curve sharply upward from there to\r\n      the present. In light of this, we can modify the timeline graph accordingly - Fig.8 - The Pugh et al. model modified to restrict sea level rise to\r\n      post-1890 only If that is the case, then the line would have to run\r\n      horizontally from the upper extreme of the 1841 error bar though the extreme lower tip of the 1888 Shortt\r\n      error bar.  The slightest need to narrow or even raise the Shortt\r\n      error bar would put the `sea level rise' scenario in considerable\r\n      difficulty and also call into question the validity of their 1841\r\n      benchmark height placement.  Their scenario cannot accommodate any\r\n      land uplift pre-1888 as that would impose a slight sea level fall to 1888,\r\n      again putting their trend line out of reach of the Shortt error bar."
    },
    {
      "tag": "div",
      "text": "The Recent Past"
    },
    {
      "tag": "p",
      "text": "The authors were very mindful of the claims of global sea level rise\r\n        made by the\r\n        U.N. Intergovernmental Panel on Climate Change (IPCC) . \r\n        It claims a 10 to 20 cm sea level rise since 1900, a point of some\r\n        controversy, but which\r\n        Pugh et al . regard as consistent with their result of 13 cm relative sea\r\n        level rise at Port Arthur. Firstly, can we see recent sea level rise?  For Port Arthur, we\r\n        simply don't know because the CSIRO tide gauge has been operating there\r\n        only a few years, and mean sea level determination needs 18 years of\r\n        data to get a fully accurate figure.  This is because it takes that\r\n        long for all the variations and permutations of lunar and solar cycles\r\n        to work themselves through one full cycle.  However, there are\r\n        longer-term tide gauges located at Hobart to the northwest and Spring\r\n        Bay to the north.   At the lecture it was stated  - \"We know that sea\r\n        level can't change very much between Hobart and Port Arthur. Simple\r\n        calculations show that it only varies at most 1 or 2 centimetres.\" [2] . It is this close linkage between Hobart\r\n        and Port Arthur tides and sea levels which has enabled Pugh et al . to\r\n        give a figure for current MSL at Port Arthur as being 31.5 cm below the\r\n        current height of the benchmark.  This linkage between\r\n        Hobart and Port Arthur makes sense because both harbours are adjacent to\r\n        each other and both face  south, opening out directly to the Southern Ocean.  Spring Bay to the north\r\n        is different in that it sits on the east coast of Tasmania with a sea access\r\n        facing east toward the Tasman Sea. Here are the sea level histories for Hobart and Spring Bay, plotted from\r\n        data published online by the  Permanent Service for Mean Sea Level (PSMSL) . [18] Fig.9 - Monthly Relative Sea Level at Hobart and Spring Bay [18]"
    },
    {
      "tag": "div",
      "text": "Hobart has the slightly longer record of the two and\r\n        neither shows any general tendency for sea level rise - a lot of variability certainly,\r\n        but no significant upward trend.  The lowest sea level recorded at both sites\r\n        was quite recently - late 1997, right in the middle of a major El Nio\r\n        event, a separate issue which will be returned to later."
    },
    {
      "tag": "p",
      "text": "From this data, we can confidently conclude that whatever sea level\r\n        rise may have happened since 1841, none of it happened since 1987 when\r\n        the Hobart tide gauge data from PSMSL begins.  If Pugh et al . were right, then\r\n        the sea level rise they claim - all of it - must have been pre-1987. This brings us to the work of Bruce Hamon [5] , who researched the benchmark well before\r\n        Pugh et al ., publishing a paper on the subject in 1985.  \r\n        Hamon also published his paper well before climate change and sea level\r\n        rise became a political issue and his paper can therefore be viewed as a fairly\r\n        neutral assessment on his part.  Using the\r\n        Hobart tide constants as his guide, he determined MSL at Port Arthur to\r\n        be 36 cm below the level of the benchmark, although he himself put an\r\n        error range of 5 cm for any single spot observation - such as the one\r\n        he himself made.  This makes his observation and associated error\r\n        bar within  the latest\r\n        estimate of 31.5 cm given in the Pugh et al . study. But Hamon did more than merely measure the benchmark relative to MSL\r\n        in 1985.  He proceeded to use Hobart tidal constants to effectively\r\n        go back in time.  Just as tides can be predicted years into the\r\n        future, once each areas tide constants are known, it is equally possible to\r\n        predict tides years into the past , many decades even.  Hamon took\r\n        his analysis right back to 1888 when Cmdr. Shortt made his measurement\r\n        of the benchmark."
    },
    {
      "tag": "div",
      "text": "The 1888 Height Measurement"
    },
    {
      "tag": "p",
      "text": "Commander J. Shortt R.N. was the government meteorologist of the\r\n        day.  He published government notices regularly in the local press\r\n        and was a contributor of scientific papers to the Royal Society of\r\n        Tasmania, the state's premier scientific body. During the early 1880s, and immediately in the\r\n        wake of the mammoth eruption of Krakatau in August 1883, Tasmania was subjected to over a thousand earth\r\n        tremors, mostly on the eastern half of the island [9] , and Shortt published an analysis of these in 1885 [8] . These\r\n        tremors were unprecedented in number or scale either before or\r\n        since.  Three years later, Shortt published his paper on the Ross-Lempriere\r\n        benchmark [7] , and explained that it was because of the possible vertical\r\n        movement of land following such tremors that he decided to measure the\r\n        height of the benchmark so that future vertical movements of the land,\r\n        if any, could be accurately tracked. Shortt himself did not do the actual measurement.  He\r\n        requested a\r\n        local official, `Mr. T. Mason' to do it for him (the same\r\n        name as the inner cove of the Port Arthur convict settlement\r\n        - Mason Cove.) According to Shortt - \"Mr. Mason, at my request, very kindly ascertained\r\n        the time of low water on February 24th, 1888, at 11 h. 45 m. a.m., which\r\n        day corresponds relatively with the moon's age 45 years previously (the day the benchmark was originally struck -\r\n        1st July 1841 - JD) . At this low water level the mark was found to\r\n        be 2 ft. above. This very closely corresponds with the normal\r\n        difference between these levels of low and high water,...\" . Clearly this is a `spot' measurement\r\n        and potentially contains a lot of room for error, amply justifying a\r\n        large error bar on the timeline graph in the absence of any other\r\n        information which might narrow down those errors.  There are\r\n        potential errors from the observer himself, there are errors arising\r\n        from the complex pattern of tides in that region, and there are errors\r\n        which might arise from meteorological variability such as strong\r\n        westerly winds making the tides pile up, or atmospheric pressure changes\r\n        which can raise or depress the local sea level.  Any or all of\r\n        these uncertainty factors calls for a significant 1888 error bar on the\r\n        timeline graph. With regard to observer\r\n        error, if the observer was an outsider visiting Port Arthur for the\r\n        first time, then such an observer would have no idea if the measurement\r\n        they were making was normal for that location or somehow anomalous due\r\n        to some local variable skewing the sea level on that occasion. The error\r\n        bar for such a measurement would have to be very wide in the absence of\r\n        any application of knowledge about local tides, winds, or pressure. Then we have\r\n        what we might call an `informed spot measurement', one where the\r\n        observer already has some of that additional information and acts on it. My photograph of the benchmark (fig 6) represents just one such `informed spot measurement'.  In my first\r\n        report over two years ago on this issue, I estimated the current height\r\n        of the benchmark to be 30 cm above mean sea level.  Since we now\r\n        know it is 31.5 cm above, that was an error of only 1 cm on my\r\n        part.   How did I manage to achieve such close accuracy? \r\n        It could of course be plain luck, but I did  choose a day close to\r\n        the same age of the moon as on the day\r\n        the benchmark was struck.  Next, I checked the\r\n        National Tidal Facility in Adelaide to find out the times of the tides\r\n        at nearby Hobart and Spring Bay on the day I intended to visit the Isle of the\r\n        Dead.  From this, I determined the most likely time of mean tide (not itself mean sea level, but close) .  I even checked the barometric pressure\r\n        on the day to make due allowance for that also. With that information, I hired a boat\r\n        and took the photo of the benchmark at the expected time of mean tide.  Once there, I found a lot of swell\r\n        in the vicinity of the cliff where the benchmark was located, but from\r\n        carefully observing the ebb and flow of that swell, I was soon able to settle\r\n        visually on where the mean level at any one time was. I took the photo\r\n        at the time of expected mean tide. When I looked at the photo afterward,\r\n        I saw that the benchmark was sitting about 40 cm above the water (using the horizontal line of the benchmark -\r\n        50 cm - as a guide.  See fig.6) .  Since\r\n        atmospheric pressure was 1024 mb on the day I did it, thus depressing\r\n        sea level by nearly 10 cm, I subtracted that 10 cm from the 40 cm visual\r\n        height to arrive at a figure of 30 cm for the adjusted height. \r\n        Nothing too difficult or complicated.  No ruler or measuring\r\n        stick, just knowledge of the tide times, moon phase, and the atmospheric\r\n        pressure and wind. My final answer, 30 cm, ended up only 1 cm different to the real figure\r\n        determined at some considerable cost of personnel time and a\r\n        state-of-the-art tide gauge.  If I could do that, it is simply not\r\n        credible to imagine that someone else with better local knowledge than\r\n        mine would\r\n        end up incurring an error bar 26 cm wide. This example is given to show that\r\n        the claimed difficulties in making a good spot measurement may be\r\n        over-rated, perhaps for reasons of professional pride rather than any\r\n        genuine difficulty, and that it is not necessarily inaccurate provided it is integrated \r\n        with that additional information such as knowledge of tide times,\r\n        heights, meteorology, and phases of the moon.  If I could do it to within 1\r\n        cm, with such simple methodology, there's no reason to suppose a local\r\n        man with local knowledge, Mr. Mason, could not do\r\n        equally well or better, especially as he was measuring it from the low\r\n        tide point and not the more turbulent mean tide that I used.  A 5 cm error bar,\r\n        as suggested by Hamon, to allow for potential observer error is therefore\r\n        perfectly reasonable in the circumstances. Tidal variability is\r\n        sufficiently complex at Port Arthur to impose a significant error on\r\n        Shortt's measurement.  However, this was removed by Bruce Hamon and\r\n        his backward projection of tides.  Because Shortt gave the exact\r\n        date and time of the measurement, 11.45 a.m. on 24th February 1888,\r\n        Hamon was able to determine where low tide should have been on that day,\r\n        based on the Hobart tide constants.  From that he was able to\r\n        correct for any error created by tidal variability. He wrote - \"Shortt found the mark 2ft 6in\r\n        (0.76m) above low water, at 11.45 local time on 24 February 1888. \r\n        Again using the Hobart tide constants, I found the tide at this time to\r\n        be 0.42 m below mean sea level.  Predicted low tide was about 30\r\n        minutes later, and only 1 cm lower. \" Finally, he\r\n        completed the tidal\r\n        correction - \"Shortt's\r\n        observation corresponds to the mark being 0.76 - 0.42 = 0.34 m above\r\n        mean sea level in 1888... \" (my emphasis - JD) . So, the observer error range is about 5 cm, and tidal error has been largely removed by Hamon's\r\n        calculation.  That leaves the meteorological error.  This\r\n        is potentially quite large because strong westerly winds in southeastern\r\n        Tasmania cause a `pile up' of the tides and result in very high tides\r\n        all along the east and south coasts, including Port Arthur.  In addition,\r\n        every millibar of pressure above or below the mean pressure of 1014.8 mb [5] results in a raising or lowering of sea level by about 1 cm.  That\r\n        imposes a huge uncertainty on any spot measurement since it could make\r\n        the sea level as much as 10 cm higher or lower than normal.  It\r\n        certainly did so on the day I photographed it. On this issue, Hamon regrets to inform\r\n        us  - \"We cannot apply a\r\n        correction for atmospheric pressure in this case, as no Hobart data for\r\n        for 1888 are available.\" That lack of atmospheric pressure and wind data means that the Shortt\r\n        observation would need a wide error bar after all. During a recent discussion group emailing\r\n        over a period of a week, after receipt of their paper and attendance at\r\n        their lecture,  I asked one of the authors what the basis was for the long error bar\r\n        applied to the Shortt/Hamon measurement for 1888, as the paper itself\r\n        was somewhat vague on the point.  The reply - \"After adjusting for the tides, you are still left with the meteorological variability, which is simply caused by the effects of the weather (e.g. winds and atmospheric pressure) on the oceans.\" [pers.\r\n        comm.] I took this to mean that the big\r\n        unknown\r\n        that Hamon acknowledged, atmospheric pressure, formed the basis\r\n        for the large error bar applied to the Shortt/Hamon observation, its\r\n        size making it possible for the sea level timeline in their graphic (fig.8) to squeeze in through the extreme lower tip of the Shortt error bar. Although Hamon did not have\r\n        those atmospheric pressure or wind figures, they were on public record. \r\n        Once I concluded from the email discussion that pressure and wind\r\n        uncertainty was the primary reason for the long 1888 error bar used by Pugh et al ., \r\n        it took me about half an hour at the public library to find the relevant\r\n        data on pressure and wind in 1888. On 24th February 1888, the atmospheric\r\n        pressure at Hobart was 29.96 inches, which converts to 1014.7\r\n        millibars .  The wind was light south-easterly [10] . \r\n        This information was contained in the `Shipping News' of one of the\r\n        local papers of the time, the Daily Telegraph .   Pugh et als .\r\n        determination of such a large error bar for\r\n        the Shortt measurement suggests they were including meteorological\r\n        uncertainty as a key factor in their calculation of that error bar, an uncertainty which\r\n        now no longer exists. Now that we have the wind and\r\n        pressure data, that particular uncertainty is redundant.  Since\r\n        Hamon estimated modern mean pressure in the region to be 1014.8 millibars, the lack of\r\n        wind and the Hobart\r\n        pressure for that day, 1014.7 mb, means that no adjustment is\r\n        necessary.  The figure of 34 cm can stand without any significant correction or\r\n        uncertainty allowance for wind or pressure.  A light south-easterly\r\n        wind on 28th February would have minimal effect on the height of the\r\n        tide that day.   The pressure of that day, 1014.7 mb, is only\r\n        0.1 mb different to the modern mean pressure for that area reported by\r\n        Hamon.  Consequently, the sea levels measured in 1888 and in 1985\r\n        by Hamon are directly comparable since the two atmospheric pressures\r\n        were practically the same. Clearly, an error bar 26 cm long on the\r\n        Shortt measurement, fully one third of the tidal range, is at odds with observation now that both\r\n        tides, pressure, and wind have been accounted for.  Only a smaller\r\n        error bar to cover observer error and other minor variables can be entertained.  Hamon\r\n        suggests 5 cm for such spot observations when done carefully, and that\r\n        is the revised error bar we should now apply - Fig.10 - The Pugh et al. model with revised error bar for the Shortt\r\n        measurement of 1888 The 1888 El Nio There is one further issue with the\r\n        Shortt observation of 1888.  In that year, a full El Nio was in\r\n        progress, a particularly severe one causing widespread drought and\r\n        bushfires throughout Tasmania, and widely reported in the papers of the\r\n        time.  The key measure of El Nio, the Southern Oscillation Index (SOI) averaged below  -10 for 1888, a\r\n        particularly strong event [20] . This has consequences for the Shortt\r\n        measurement."
    },
    {
      "tag": "div",
      "text": "An El Nio has the effect of temporarily depressing\r\n        mean sea levels throughout the southwest Pacific, including Tasmania,\r\n                such as shows up clearly on this sea level record from Devonport\r\n                on the north coast of Tasmania, where sea level appears to drop\r\n                about 10 cm for the duration of the event.  Data from PSMSL."
    },
    {
      "tag": "p",
      "text": "The\r\n        recent strong El Nio in 1997-98 also had a similar  effect on the tide data\r\n        for Hobart and Spring Bay (fig.9) forcing sea levels to their lowest point in\r\n        the record. Fig.11 (left)\r\n                - Monthly sea levels for Devonport, Tasmania This means, the length of the Shortt\r\n        error bar should not only be shortened to 5 cm as shown earlier, but\r\n        also be shifted upwards in fig.10 by an amount sufficient to compensate for the El Nio\r\n        and associated lowered sea level.  One of the authors said this in\r\n        a subsequent email discussion on this particular issue  - [pers.comm.]] \"From a comparison of Spring Bay sea level data and SOI, I find that sea level varies approximately as SOI/40 m. Now SOI for February and March 1888 was -0.33 and -1.47 (see http://www.cru.uea.ac.uk/ftpdata/soi.dat ). For an approximate SOI value for 24 Feb. 1888, I therefore take an average of -0.33 and\r\n        -1.47, which is -0.9. The average SOI for 1866 to 1997 is -0.067, which I will take as a reference value. Therefore the SOI adjustment should be (0.9-0.067)/40 = 0.02 m.\" That's a 2 centimetre error factor which should have been\r\n        integrated into\r\n        the Shortt error bar.  I checked the Spring Bay data from PSMSL for myself.  Instead of using\r\n        a SOI-based procedure as quoted above, I averaged the whole data from 1987 to 2000, then subtracted from\r\n        it the\r\n        average of the months of the 1997-98 El Nio.  Sure enough, the\r\n        answer also came to 2 cm.  even though my method was\r\n        different.  Since the SOI is a statistical index based on\r\n        comparative air pressure between Darwin and Tahiti, I did not regard it's use as a constant in\r\n        local sea level determination to be particularly appropriate, as subtracting averages of\r\n        sea levels directly made much better sense.  Besides, using the\r\n        pressure-based SOI as part of a sea level calculation creates an \r\n        `apples and oranges' effect which may look mathematically elegant, but\r\n        in reality be somewhat meaningless.  That we came to the same answer\r\n        for Spring Bay is interesting, perhaps coincidental, but would not\r\n        necessarily agree for other stations. However, both Hamon and Pugh et al . have consistently used Hobart as\r\n        their frame of reference for Port Arthur, particularly as both harbours\r\n        face south, whereas Spring Bay faces east and more easily subject to\r\n        wind and coastal effects on the tides.  Performing the same\r\n        subtraction of averages on the Hobart data yielded an El Nio sea level\r\n        effect of 5 cm , not 2 cm.  The statement at the lecture\r\n        - \"We know that sea\r\n        level can't change very much between Hobart and Port Arthur. Single\r\n        calculations show that it only varies at most 1 or 2 centimetres.\" means\r\n        that any El Nio effects at Hobart will show up with a similar\r\n        magnitude at Port Arthur.  It is this 5 cm correction which should\r\n        therefore be applied to the Shortt measurement of 1888, not the 2 cm one\r\n        would get from Spring Bay.  The chart now looks like this - Fig.12 - The Pugh et al. model, with\r\n        the Shortt error bar modified for the 1888 El Nio At this point, the `sea level rising' scenario\r\n        offered by Pugh et al . is in deep difficulty.  With a narrower error\r\n        bar for Shortt, and its\r\n        upward shifting to account for the El Nio of 1888, the bulk of their sea level rise of 13 cm has to now be\r\n        accomplished between the years 1841 and 1888, a period where the authors\r\n        themselves acknowledged in the lecture saw no general sea level rise at all anywhere else in the world. \r\n        The  Shortt measurement is now scarcely different to the current position of the benchmark.   The idea\r\n        that a steep sea level rise took place between 1890 and 2000 is\r\n        simply  not credible.  In addition, land uplift of about 2\r\n        cm since 1888 would make the centre of the Shortt measurement exactly\r\n        matching the current height of the benchmark, representing no sea level\r\n        change at all since 1888. Can we See Sea Level Rise? Fig.13 - Eaglehawk Neck today"
    },
    {
      "tag": "div",
      "text": "Visual evidence of the coast in and around Port Arthur also suggests\r\n        no sea level rise since the 19th century.   For example, Commandant\r\n        James Boyd, an officer of the colony in 1854 stated that Eaglehawk Neck,\r\n                the narrow isthmus of land which allowed the British to control access\r\n        to the peninsula, was only 78 yards across [11] .  That's about 71 metres. \r\n        Today, Eaglehawk Neck is 106 metres wide between the high tide points [12] .  Had there been sea level\r\n        rise as claimed by Pugh et al ., we would expect the neck to be\r\n                somewhat narrower\r\n                today, certainly not wider."
    },
    {
      "tag": "p",
      "text": "Lempriere's own tide data from 1841 and 1842 shows that the lowest\r\n        tides of all were about 2 ft in his  tide gauge, meaning, that the minimum\r\n        depth of water was 2 ft if the tide gauge stilling well was sitting on\r\n        the sea bottom.  If, as is more likely, he had left a clearance of\r\n        water below the well to avoid interior silting, that minimum depth would be 3 ft or more.  Pugh et al .\r\n        believe Lempriere kept his tide gauge at the Basin next to the stores (see map fig.4) .  But on a visit there\r\n        during low tide, I found the depth of water in the now derelict basin to\r\n        be only ankle deep ( see photo ).  Of course it could be silt accumulation even\r\n        though much of the sea bottom was stony, with not much water movement\r\n        around the cove, but it hardly inspires confidence in the `sea level\r\n        rising' claims, and we could find ourselves making endless excuses for each and\r\n        every example where sea level rise fails to manifest itself visually. Old paintings and sketches present the same problem.  Water,\r\n        water, everywhere during the 19th century, but less water\r\n        today.  With sea level rise, the opposite should be true. For copyright reasons, these images cannot be displayed here, but\r\n        clicking the following links will bring up these images directly from\r\n        the State Library of Tasmania website. (Press the `back' button of\r\n        your browser to return to this page) . 1886 1888 1884 Eaglehawk Neck 1886 1854 1860 1844 1873 1875 1846 The last image for 1846 is particularly interesting as it shows a large\r\n        3-masted sailing ship moored where the Lawn (fig.14) now sits. Here's how the Basin area looks today at low tide. High tide would only\r\n        be about 75 cm above what is shown here, or 2 feet. Fig.14 - The Port Arthur Basin and Stores area at low tide Photographs, images and paintings cannot always tell the\r\n      full story, but the lack of any visible sign of sea level rise is a\r\n      serious problem for the Pugh et al . claims.  The `Lawn' area in the\r\n      above photo was actually covered by water during the early 19th century,\r\n      but it was slowly reclaimed over a period of decades.  One man buried\r\n      on the Isle of the Dead actually drowned where that lawn now sits.  The\r\n      Lawn area was not reclaimed because of any shortage of land - there's land in abundance all\r\n      over the area, and the lawn was never built on or put to any productive\r\n      use.   For these reasons, it's not clear why the\r\n      authorities even bothered.  Perhaps it began to smell as the water got\r\n      too shallow and stagnant over time. Here's one further visual image - the Isle of the Dead\r\n      painted in the 1840s by Catherine Augusta Mitchell, wife of the\r\n      superintendent of the Point Puer boys prison [13] .  Compare\r\n      it to the photo I took of the isle from the same angle in fig.5.  Was\r\n      artistic licence involved here?   The words at the bottom of the\r\n      painting say - \"Isle de\r\n      Morts, Port Arthur - Tasmania. My two first darlings lie here. Francis Keast Mitchell and Henry John Mitchell - first 8 months, second 10\r\n      months old.\" Fig.15 - An early 1842 painting of the Isle of the Dead by Catherine\r\n      Mitchell This was less a piece of fanciful art, more a tragic\r\n      memorial on canvas, in a time before photographs. Fig.16 - The Pugh and Alternative scenarios compared - with previous\r\n        revisions included From the foregoing, the Pugh et al . study is faced with this problem. \r\nShould the sea level trend line in fig.16 be the red one, or the purple\r\none?  The purple one is that suggested by the authors at the lecture, but is\r\nclearly untenable given that we cannot now justify the excessively long 1888 error bar.   Even with the original error bar, it only then barely\r\nsqueezed in using the upper extreme of 1841 and the lower extreme of\r\n1888.  The red sea level trend line  is physically impossible. \r\nThere was slight global cooling going on during the 1841-1910 period, and that\r\nwould if anything cause a sea level fall of about 3 cm, not a rise.  In\r\naddition, the land itself is measured by them to be uplifting very slowly - 3.2\r\ncm over the full 160 years.  That means their sea level rise would have\r\nbeen swimming uphill against global cooling and rising land, a physical\r\nimpossibility given the climatic circumstances and the available evidence. \r\nProbability statistics may attempt to explain it away,\r\n      but cannot explain it. Fig.17 - 19th century temperatures at Hobart and Melbourne combined Since a sea level rise of that magnitude during the 19th century is\r\n        simply not credible, particularly as it was cooling during much of that\r\n        time as shown in the above graph [14] ,\r\n        we must go back further in time to\r\n        question the validity of the authors' original placement of the benchmark in 1841. In the 20th century, while the IPCC claims a sea level\r\n      rise of 10-20 cm globally, that has not occurred around the Australian\r\n      coast.  According to the National Tidal Facility (NTF) in Adelaide [15] , a survey of 27 long-term tide\r\n      gauges around the Australian coast (which faces\r\n      three oceans) found a rate of sea level rise of only +0.3 mm/yr,\r\n      equivalent to a rise over a century of just 3 cm , not 10-20\r\n      cm.  Even that 3 cm is queried by them because two of the tide gauges\r\n      they surveyed were on subsiding land in Adelaide harbour, with no\r\n      such subsidence at nearby sites.  If those two tide gauges are excluded\r\n      from the sample, we end up with a sea level rise of only +0.16 mm/yr,\r\n      equivalent to 1.6 cm for a full century.  Whether 3 cm or 1.6 cm, the\r\n      sea level trend suggested in this report for Post Arthur after 1888 is\r\n      consistent with the results of the NTF survey but not consistent with the\r\n      conclusions of Pugh et al . In their paper Pugh et al . drew particular attention to\r\n      the 90-year tide gauge record from Fremantle in Western Australia, with a sea level rise rate of +1.38 mm/yr, equivalent to 13.8\r\n      cm in a century.  That, they felt, vindicated their figures.  On\r\n      further investigation, it seems Perth (adjacent to\r\n      Fremantle, both being one big urban sprawl) is subsiding as indicated\r\n      by altimetry satellites. Other tide gauges around the Western Australian\r\n      coast do not support the Fremantle picture at all. Here are the NTF figures in mm/yr, sea level rises\r\n      indicated with +, falls indicated with - Wyndham -0.59,        \r\n      Port Hedland -1.32,        Carnarvon +0.24,          \r\n      Geraldton -0.95, Fremantle +1.38,       \r\n      Bunbury +0.04,              \r\n      Albany -0.86,                  \r\n      Esperance\r\n      -0.45. The average for all of them, including the errant\r\n      Fremantle, is a sea level fall of -0.31 mm/yr. In other words, the comparison with Fremantle was a red\r\n      herring.  Comparison was also made with Fort Denison in Sydney, where\r\n      a sea level rise of +0.86 mm/yr is indicated by the NTF.  However,\r\n      the record for that location kept with the PSMSL [18] shows the sea level rise there occurred\r\n      almost entirely in the first half of the 20th century, with little change\r\n      since.  Again another red herring. (For\r\n      more background  on the Fort Denison record, see the Appendix here ). The only proper basis\r\n      for comparison is the average of the whole Australian coast, not selected\r\n      locations, and that\r\n      Australia-wide average, excluding sinking Adelaide,  is +0.16 mm/yr,\r\n      or 1.6 cm for the century. This is closely in line with what we see between\r\n      Shortt's measurement of 1888 and the sea level at Port Arthur today."
    },
    {
      "tag": "div",
      "text": "The Big Day, 1st July,\r\n        1841"
    },
    {
      "tag": "p",
      "text": "Fig.18 - Ross"
    },
    {
      "tag": "div",
      "text": "Finally, we come back to where it all started -\r\n                the day the benchmark was first carved into that cliff 162 years\r\n                ago."
    },
    {
      "tag": "p",
      "text": "It began with Baron Von Humboldt who conceived the idea\r\n                of having sea level benchmarks placed at strategic points around\r\n                the world in order to ascertain any relative changes in levels\r\n                between land and sea. James Clark Ross (fig.18) heard about this idea when he returned to Tasmania from his voyage to\r\n                the Antarctic. He even bemoaned the lost opportunity of placing\r\n                such marks in Antarctica, since he heard about the idea only\r\n                after he got back to Tasmania.. When Ross returned to\r\n                England after his long voyages to the Antarctic and southern\r\n                seas, he wrote the following account in his book [3] of how and why a  benchmark\r\n                was necessary  - \"The fixing of solid and\r\n          well secured marks for the purpose of showing the mean level of the\r\n          ocean at a given epoch, was suggested by Baron von Humboldt,\r\n          in a letter to Lord Minto, subsequent to the sailing of the\r\n          expedition, and of which I did not receive any account until our\r\n          return from the Antarctic seas, which is the reason of my not having\r\n          established a similar mark on the rocks of Kerguelen Island, or some\r\n          part of the shores of Victoria Land. ...\" (in the Antarctic-JD) But all was not lost. His friend, Governor Sir John Franklin, informed him that an official\r\n        of the convict colony at Port Arthur, Thomas Lempriere, had been keeping\r\n        tide measurements for some time and that perhaps that would afford a\r\n        means of placing a sea level benchmark at Port Arthur.  Ross seized\r\n        the opportunity and went to Port Arthur, with the Governor, in May 1841\r\n        to meet Thomas Lempriere - [17] \"My principal object in\r\n        visiting Port Arthur was to afford a comparison of our standard\r\n        barometer with that which had been employed for several years by Mr.\r\n        Lempriere, the Deputy Assistant Commissary General, in accordance\r\n        with my instructions, and also to establish a permanent mark at\r\n        the zero point , or general mean level of the sea as\r\n        determined by the tidal observations which Mr. Lempriere had conducted\r\n        with perseverance and exactness for some time: by which means any\r\n        secular variation in the relative level of the land and sea, which is\r\n        known to occur on some coasts, might at any future period be detected,\r\n        and its amount determined. The point chosen for this purpose was the\r\n        perpendicular cliff of the small islet off Point Puer, which, being\r\n        near to the tide register, rendered the operation more simple and\r\n        exact; the Governor, whom I had accompanied on an official visit\r\n        to the settlement, gave directions to afford Mr. Lempriere every\r\n        assistance of labourers he required, to have the mark cut deeply in the\r\n        rock in the exact spot which his tidal observations indicated as the\r\n        mean level of the ocean .\" (my emphases\r\n        - JD) . With such an explicit explanation of what\r\n        the benchmark was for, and where it was placed, it becomes perplexing\r\n        that Pugh et al . did not take this testimony seriously enough to exhaust\r\n        every possible avenue by which their study could avoid contradicting\r\n        this very clear account.  But contradict it they did - they took\r\n        the view that the benchmark did not end up at `zero point' at all, but\r\n        at a height closer to high tide. They justified this view by citing what\r\n        Ross himself said a little later in his narrative.  Speaking of any\r\n        future such sea level mark, he said - \"I may here observe,\r\n        that it is not essential that the mark be made exactly at the mean level\r\n        of the ocean, indeed it is more desirable that it should be rather above\r\n        the reach of the highest tide: it is, however, important that it be made\r\n        on some part of a solid cliff, not liable to rapid disintegration, and\r\n        the exact distance above the mean level (which may also be marked more\r\n        slightly) recorded on a plate of copper, well protected from the\r\n        weather...\" He added - \"The most desirable\r\n        position for such another mark would be near the north-west extremity of\r\n        the island, and in the vicinity of Cape Grim...\". (Cape Grim is at the\r\n        north-western tip of Tasmania - JD) . What Ross was referring\r\n        to here was not the mark on the Isle of the Dead - he wrote about that\r\n        in the past tense, as something already done,\r\n        `rendered' - but rather about prospective future marks.  These passages can in no way be interpreted as modifying or\r\n        negating what he wrote earlier about the Isle of the Dead\r\n        benchmark.   To impute such a meaning to it is quite\r\n        misleading. Besides, the benchmark was not even struck `above the reach of the\r\n        highest tide', but rather at some point below high tide and fully exposed to\r\n        the sea. Ross did eventually get\r\n        an opportunity to strike a second mark, this time in the Falkland\r\n        Islands, and he did exactly what he said above - struck it over 5 feet\r\n        above mean sea level, `above the reach of the highest tide', with a plaque\r\n        to indicate the exact height of the mark above the real mean sea level. \r\n        That particular mark in the Falklands now poses a puzzle of its own - it shows no sea\r\n        level rise. Pugh et al . deny the accuracy of the Ross\r\n        testimony. \r\n        Are they saying Ross was mistaken?  A liar?  Did Lempriere do\r\n        something contrary to what Ross and the Governor ordered?  It should take compelling evidence to contradict such a clear and precise testimony\r\n        by someone with the stature of James Clark Ross.. But, let us assume Pugh et al . were right and\r\n        that the benchmark was not struck where Ross said it was.  That\r\n        would mean that (a) Ross was a liar, or (b) Lempriere did the job alone\r\n        and struck the mark in a different place, or in a different way, to what\r\n        Ross instructed, or (c) Ross had a lapse of memory about it all and\r\n        misreported the whole episode in his book. Taking each in turn, Scenario (a) is a\r\n        non-starter.  Ross was a respected officer of the Royal Navy, and a\r\n        scientist and explorer.  The Ross Sea in Antarctica is named after him.  He\r\n        knew only too well the importance of exactness when it came to\r\n        scientific endeavours.  He was also a mariner, and seafarers have\r\n        their own set of ethics, one of which is to report navigation\r\n        information accurately - lives may depend on it. Scenario (b) is possible, but only if Ross\r\n        was not present at the time the benchmark was struck.  Had Ross\r\n        been supervising the operation personally, or just overseeing it, he\r\n        would not have reported the mark as being at mean sea level.  \r\n        In addition, Thomas Lempriere had a wife and 11 children in cramped\r\n        quarters at Port Arthur.  He was desperately seeking both promotion\r\n        and better accommodations for his large family, and it is therefore\r\n        unthinkable that he would perform his task in any way other than to follow the\r\n        instructions of Ross - and indeed the Governor - to the letter. Scenario (c) is not credible\r\n        either.  Ross was only 41 years old when he met Lempriere, and his\r\n        book was published only 6 years later, making age-related memory loss very\r\n        unlikely for such an important project by a man in his prime.  His sense of seafarer's ethics would also have persuaded him\r\n        to report the positioning benchmark with proper attention to accuracy as\r\n        other seafarers might come across the benchmark sometime in the future.. Of the three scenarios, only (b) (i.e. Lempriere acting in defiance of instructions) could\r\n        possibly explain the benchmark being struck at a height different to\r\n        that reported by Ross.  This then raises the question - was Ross present at\r\n        Port Arthur on the day? If he was present, then there is no\r\n        way the benchmark would have been stuck at near high tide - and then for\r\n        Ross to misreport it in his book.  If he was present, then we can\r\n        be confident the mark really was struck at what Ross and/or Lempriere\r\n        estimated MSL to be. We have no confirmed evidence that Ross\r\n        was present on the day.  What we do have is four items of\r\n        circumstantial evidence - 1) A cruising yachtsman visited the Isle\r\n        of the Dead in 1891 [4] and saw the benchmark\r\n        there.  He also saw something else - a small stone tablet mounted above the benchmark, \"...erected it is said by\r\n        Captain Ross, of the Erebus and Terror Antarctic\r\n        expedition, during the interval between the visits to the south polar\r\n        regions.\" We will return to that stone tablet later,\r\n        but since 1841 was within the living memory of many of the local people\r\n        of 1891,\r\n        their collective memory that Ross struck the benchmark suggests he was\r\n        present on the day. Ross was not the kind of man people would forget\r\n        easily.  He was very famous. 2) Ross was positively placed at Hobart on 29th\r\n        June, 1841 (when he was engaged in compass\r\n        calibration) and also on 6th July (when he hosted a farewell soiree for his friends on the\r\n        eve of his departure from Tasmania) [3] , so there\r\n        was nothing to prevent Ross  making a brief overnight visit to Port Arthur to\r\n        oversee the striking of the benchmark.  Had Lempriere\r\n        deviated from the original plan in Ross' absence, he had sufficient time\r\n        and means to send a message to Ross to that effect, either by the very\r\n        quick semaphore signalling system which linked Hobart and Port Arthur,\r\n        or by sending a letter by sea, or even by meeting Ross' ships (the Erebus and Terror ) as they passed the harbour mouth of Port Arthur a week\r\n        later on their way to Sydney. Since Ross published his account\r\n        six years later in 1847, there was even ample time for normal mail. 3) Pugh et al . stated this\r\n        in their paper - \"Ross\r\n        may have been present, although preparations for the departure of his\r\n        expedition from Hobart on 7 July would have also demanded his\r\n        attention.  Examination of the copy of the official letter-book\r\n        (now in the Scott Polar Research Institute, Cambridge; called `Ross\r\n        Family Papers' in Ross, 1982) show that no official letters were signed\r\n        by Ross around 1 July.\" Since the ships were due for departure\r\n        from Hobart within a week, the lack of signed letters around that day suggests Ross was\r\n        out of town.  Where? At Port Arthur?  Port Arthur was the only\r\n        matter important enough to pull him away from Hobart during that final\r\n        week of his visit to Tasmania. (4) Lempriere kept a\r\n        meticulous tide log.  He never missed a single tide come rain or\r\n        hail or storm over the 2-year period covered by his tide log from\r\n        January 1841 to December 1842. (This fact alone suggests he was a\r\n        meticulous man who would not capriciously put the benchmark somewhere\r\n        other than where the Governor and Ross told him to put it.) But something strange happened on\r\n        1st July.  Here is how his log looks both before 1st July and\r\n        after. Fig.19 - The Lempriere tide log between June and July 1841 Look at the sudden change of the formatting.  The upper part for\r\n        June 1841 shows long dashes between numerals, making it possible for\r\n        someone to confuse what number refers to what.  Suddenly, as of 1st\r\n        July, the formatting changes from a long dash to a mere dot, much\r\n        clearer and less prone to reading error.  Who advised him to make\r\n        that change?  The upper formatting was present on all pre-July\r\n        logs, while the lower formatting style was present on all subsequent\r\n        logs.  The abruptness of the change suggests someone asked him to do\r\n        it for clarity's sake, and did so on 1st July 1841.  That someone could only be Ross as there\r\n        was no-one of seniority in Port Arthur who was interested enough in\r\n        Lempriere's tide log to suggest or demand such a change.  Lempriere is\r\n        even on record as wanting to please the scientific community as much as\r\n        possible and a `suggestion' by such a luminary as Ross would be all the\r\n        excuse Lempriere would need to change the formatting style of his tide\r\n        log. Individually, all these are merely circumstantial.  But\r\n        collectively, they strongly suggest Ross was present  on the day,\r\n        and that makes his narrative all the more compelling. Ross sailed away from\r\n        Hobart on his ships Erebus and Terror on 7th July 1841, the benchmark already struck, with or without\r\n        his presence on that July day in 1841."
    },
    {
      "tag": "div",
      "text": "The `Curious Little\r\n        Stone'"
    },
    {
      "tag": "p",
      "text": "The mystery does not end there.  The striking of the benchmark\r\n        left an intriguing postscript, one which set the Pugh et al . team off in\r\n        one direction - and this author off in another. Someone, probably Lempriere, had a small stone tablet mounted\r\n        near the\r\n        benchmark to explain its purpose. The Isle of the Dead had numerous gravestones, but this one was quite different as it sought to explain\r\n        what the benchmark was all about.  The tablet went missing early in\r\n        the 20th century so we have no way to confirm today what was written on\r\n        it.  But we do have the testimony of two people who transcribed its\r\n        words.  The first was our Mr. Mason who not only\r\n        measured the height of the benchmark in 1888, but also told Cmdr. Shortt\r\n        what was written on it.  Here's what he transcribed - \"On the rock\r\n        fronting this stone a line denoting the height of the tide now struck on\r\n        the 1st July, 1841, mean time, 4h. 44m.\r\n        p.m .; moon's age, 12 days; height of water\r\n        in tide gauge 6 ft. 1 in.\" But, three years later in\r\n        1891, we have this account by the visiting cruising yachtsman who\r\n        sketched and accurately transcribed the words from the gravestone of one Joseph\r\n        Kerr.  Then he noticed  - \"A few yards\r\n          away, on the rocks fringing the shore and facing the east, was a\r\n          curious little stone, erected it is said, by Captain Ross, of the ` Erebus ' and\r\n          ` Terror ' Antarctic expedition, during the interval\r\n          between the visits to the south polar regions. It bears the following\r\n          inscription:- \"On the rock\r\n          fronting this stone a line, denoting the height of the tide, was struck on the 1st\r\n          July, 1841. Mean time, 2.44 p.m . Moon's age, 12 days. Height of water in the tide gauge,\r\n          6 ft 1 in.\" [3] The two accounts differ from each other in the text coloured bold brown.  We have a clear conflict over the time of the\r\n        striking of the benchmark (2.44 p.m. versus 4.44 p.m.) , and a grammatical\r\n        difference - `now struck' versus `was struck'. But there are subtler differences.  Notice the formatting of the\r\n        times, Mason's clumsy `4h. 44m. p.m.' versus the yachtsman's simpler `2.44 p.m.' \r\n        Now look at fig.19 above at Lempriere's log entries.  Lempriere uses\r\n        the exact same formatting style\r\n        for times (post-1st July) as the yachtsman used, but not Mr.\r\n        Mason.  There are subtler differences still, such as the\r\n        yachtsman's use of capital letters at the start of sentences, and the\r\n        yachtsman's inclusion of commas."
    },
    {
      "tag": "div",
      "text": "Fig.20 - Joseph Kerr gravestone Which version is the more\r\n                credible?  The yachtsman's visit to the Isle of the Dead\r\n                did not stop merely with the tablet.  He also looked at\r\n                some of the gravestones, one of which he recited word for word\r\n                in his article in The Australasian magazine, and even\r\n                drew an accurate  sketch of it."
    },
    {
      "tag": "p",
      "text": "That gravestone still exists today and is fully readable in\r\n                spite of the passage of time. It is the gravestone of one Joseph\r\n                Kerr, and the yachtsman's version of what was written on it\r\n                matches the wording on the same gravestone today exactly ,\r\n                word for word. It is for this reason that the yachtsman's version of what\r\n                was written on that `curious little stone' should be treated\r\n                more with much more credibility than it has been. Furthermore, Cmdr. Shortt added this to Mason's reading of\r\n                the tablet - \"It is stated by my\r\n                informant, Mr. Mason, that the words and figures underlined\r\n                are nearly obliterated, and that he has given what they appear\r\n                to be.\" Looking to Mason's version above, we see the phrase `now struck'\r\n        underlined, as per Shortt's qualifier, but there were no figures underlined as Shortt claimed.  We are therefore\r\n        left to ponder exactly which figure or set of figures were problematic.  The\r\n        time?  The tide height? The yachtsman gave no indication of having any problem with reading the\r\n        words on the tablet, so we are left with something of a puzzle\r\n        here.  Which time is the right one?  Which tide height\r\n        applies? Taking them in turn, the time of 4.44 p.m. reported by Mason is\r\n        almost consistent with a height of 6ft 1in in Lempriere's tide gauge, based on the data in his log, but 2.44 p.m. definitely is not. \r\n        However, 4.44 p.m. (4.55 p.m. modern Australian\r\n        Eastern Standard Time) is a very strange time of day to be doing important\r\n        survey work - close to the winter solstice of the southern hemisphere,\r\n        virtually at twilight, and close to high tide when striking a benchmark\r\n        would be both difficult and potentially dangerous due to the depth and turbulence of water at the\r\n        cliff face.  On the other hand, the yachtsman's 2.44\r\n        p.m. in mid afternoon makes much better sense as there was good light\r\n        and a lower tide. Fig.21 - Blow-up of Lempriere's tide log"
    },
    {
      "tag": "div",
      "text": "But both agree on 6 ft 1 in. \r\n                Does that not settle the issue?  Not exactly.  The\r\n                yachtsman's time of 2.44 p.m. is more consistent with 5 ft 1 in in\r\n                Lempriere's tide gauge, not 6 ft 1in."
    },
    {
      "tag": "p",
      "text": "Now look at this blow-up of Lempriere's tide log and examine\r\n                the 5's and 6's.  The fourth one down on the left is\r\n                particularly confusing, as is the third, Even in our modern era, it is common for `6' and `5' to be\r\n                confused when looking at photocopies, faxes, or other\r\n                imaging.  But what of a corroded 50-year-old `curious\r\n                little stone' sitting on a cliff exposed to the wind and the\r\n                waves? There is a distinct possibility that both men got the tide\r\n                height wrong due to that 6-5 confusion, especially given Mason's\r\n                remarks about the tablet being eroded and difficult to read. Fig.22 - A `6-5' gravestone"
    },
    {
      "tag": "div",
      "text": "Here is another gravestone on the\r\n                Isle of the Dead.  It\r\n                has a `6' and a `5' adjacent to each other in the lower right of\r\n                the stone. It is in good condition because it is in a sheltered\r\n                position."
    },
    {
      "tag": "p",
      "text": "Give it 50 years of erosion from wave\r\n                action, let a little chip fall out of the\r\n                left side of the `5' and you have an instant `6',  It's as\r\n                easy as that. Pugh et al . went 100% with Mr. Mason's 6ft 1in/4.44 pm \r\n                interpretation, placing the benchmark a foot higher (30.5 cm) than\r\n                the height which would match the yachtsman's 2.44 pm time, and\r\n                in complete denial of the Ross narrative. That choice locked them into (a) denying the truth of the\r\n                Ross narrative, (b) incurring a 13 cm sea level rise in spite of\r\n                the 1888 Shortt observation and the NTF survey which would suggest no such rise, \r\n                and (c)\r\n                denying the validity of the yachtsman's observation of the time in spite of\r\n                the fact that he got the Joseph Kerr gravestone exactly right. Pugh et al . did address some of these\r\n        problematic issues in their paper and recent lecture including the Ross\r\n        narrative.  However, at a previous lecture on 5th April 2000 given to the Royal Society of\r\n        Tasmania by the same authors, they did not mention the Ross narrative or the yachtsman's reading at all. \r\n        On that occasion, they simply reported on Mr. Mason's 1888 reading and\r\n        proceeded from there. \r\n        The mostly scientific audience remained unaware that additional\r\n        significant evidence existed, evidence which did not favour the scenario\r\n        of sea level rise being presented. In the end, I raised the issue of the Ross narrative and the\r\n        yachtsman during question time. Part 2 here References Primary\r\n      References for this Report - [1] Pugh, D.,\r\n      Hunter, J., Coleman, R., Watson, C., (2002) \"A Comparison of\r\n      Historical and Recent sea Level Measurements at Port Arthur,\r\n      Tasmania.\" , International Hydrographic Review,\r\n      vol.3, no.3 (new series), November 2002. [2] Pugh D., & Hunter, J., \"Sea Level in Tasmania from 1841 to\r\nthe Present: The Results of the Port Arthur Study\" , University of Tasmania public lecture, 22 Jan 2003. [3]\r\nRoss, Sir J.C., (1847), \"A Voyage of\r\nDiscovery and Research in the Southern and Antarctic Regions, During the\r\nYears 1839-43\" , John Murray, London,\r\npp.22-32. Additional Key References [4]\r\n`Eight Bells' (1892), The Australasian, \"Notes\r\nof a Yachting Trip\" , 6th Feb., p.281 [5] Hamon, B. (1985) \"Early\r\nMean Sea Levels\r\nand Tides in Tasmania\" , Search, vol.16,\r\nNo.9-12, Oct/Dec, pp.274-277 [6]\r\nLempriere, T. (1841-1842) \"Register of\r\nTides Kept at Port Arthur\" , from the\r\nRoyal Society archives, London [7] Shortt,\r\nCmdr. J., (1889), \"Notes on the\r\nPossible Oscillation of Levels of Land and Sea in Tasmania During Recent\r\nYears\" , Royal Society of Tasmania papers,\r\nState Library of Tasmania, Hobart, pp.18-20. [8] Shortt,\r\n      Cmdr. J., (1885), \"Summary\r\n      of Observations on Earthquake Phenomena Made in Tasmania During 1883 and\r\n      1884\" , Royal\r\n      Society of Tasmania papers, State Library of Tasmania, Launceston,\r\n      pp.263-270. Other References [9] Biggs, A.,\r\n(1885), \"The Tasmanian\r\nEarth Tremors 1883-4-5\" , Royal\r\n      Society of Tasmania papers, State Library of Tasmania, Launceston,\r\npp.325-334 [10] The Daily\r\nTelegraph newspaper, \"Shipping\r\nNews\" , State Library of\r\nTasmania, Launceston,  25 Feb 1888 [11] Evans G., & Ross, M. \"A Visitors Short History Guide to Port\r\nArthur\" , Regal Publications, Tasmania, 1995 [12] Lands\r\nDepartment, Tasmanian Government, Hobart, Personal communication, 28 Jan 2003 [13] Lord, R., \"The Isle of the Dead, Port\r\nArthur\" , Richard Lord\r\n& Partners, Hobart, 1995 [14] NASA\r\nGoddard Institute, Online Weather\r\nStation Records [15] Mitchell, B., et\r\n      al., \"Australian Mean Sea Level\r\n      Survey\" , National Tidal\r\n      Facility, Adelaide. Online\r\n      Copy [16]\r\n`Hobart Town Advertiser' newspaper, editions from 27th April to 9th July\r\n1841, shipping column. [17]\r\n`The Courier' newspaper, (1841), May 21. Launceston Reference Library archives,\r\nTasmania [18] The Permanent\r\n      Service for Mean Sea Level, Online\r\n      Tide Gauge Data [19] Weidenhofer, M., (1981), \"Port Arthur:\r\nA Place of Misery\" , Oxford University\r\nPress, Melbourne, p.29 [20 Climatic\r\nResearch Unit - SOI Online\r\nData Appendix Fort Denison, Sydney Harbour, Australia Fort Denison which lies in the outer Sydney Harbour, New South Wales,\r\n        Australia.  Mean Sea Level is presented.  The graph below\r\n        shows monthly sea level since 1914  smoothed with a 12-monthly\r\n        running mean to reduce monthly `noise'.  Fort Denison with 82 years\r\n        of data shows a sea level rise of +0.86 mm/yr (or\r\n        8.6 cm if taken over a full century) .  Data from the Permanent\r\n        Service for Mean Sea Level . In a recent paper on the\r\n        Isle of the Dead sea level benchmark at Port Arthur, Tasmania, struck in\r\n        1841 by Ross and Lempriere, Hunter et al ( GRL, v.30, No. 7, 1401, April 2003) claimed that sea level had risen there by around 1 mm per year (or 10 cm over a full century) , citing a\r\n        comparison with Fort Denison and Fremantle in Western Australia as cross\r\n        validation for their statistical study. According to Australia's National\r\n        Tidal Facility , Fort Denison is only one of three tide gauges around\r\n        the Australian coast to have more than 60 years of historic sea level\r\n        data.  The other two are Port Pirie in South Australia and\r\n        Fremantle in Western Australia.  Fremantle is the oldest (90 years) , but because recent satellite\r\n        measurements have shown Perth (near Fremantle) to be subsiding steadily, its 90-year tide gauge record cannot be used\r\n        in sea level studies because the land subsidence creates an artificial\r\n        sea level `rise'.  Other tide gauges on the same coast as Fremantle\r\n        show an average sea level fall over the last 30 years , further\r\n        invalidating the Fremantle record. Here are the NTF\r\n        figures in mm/yr, sea level rises indicated in red ,\r\n        sea level falls in blue - Wyndham -0.59 , Port Hedland -1.32 , Carnarvon +0.24 , Geraldton -0.95 , Fremantle +1.38,       \r\n        Bunbury +0.04 , Albany -0.86 , Esperance -0.45 . The average for all of\r\n        them, including the errant Fremantle, is a sea level fall of -0.31 mm/yr . With Fremantle clearly\r\n        invalid, that leaves only Fort Denison and Port Pirie of the\r\n        three 60-year plus stations. On the face of it, Fort\r\n        Denison's sea level rise would seem to support Hunter et al. But does it? A careful look at the\r\n        plot of Fort Denison below shows that most of the sea level rise there\r\n        took place in a 3-year period between 1948 and 1951 when an apparent\r\n        stepwise rise in long-term sea level, of about 6 centimetres,\r\n        occurred.  This is impossible physically.  Sea level cannot\r\n        simply rise 6 cm in three years from one long-term level to another\r\n        higher level.  It is also unlikely to be caused by land subsidence\r\n        as that too is a slow cumulative process as happens at Fremantle, not a\r\n        sudden step action.  Earthquakes or tremors could cause it - if\r\n        severe or numerous enough - (such as the 1,000\r\n        tremors which happened in eastern Tasmania during the early 1880s, and\r\n        which may have affected sea level at the Isle of the Dead during that\r\n        period.) . \r\n        But that seems very unlikely in the case of Sydney Harbour.  That\r\n        leaves instrumentation problems as the only viable explanation for the\r\n        sudden datum shift around 1948-51.  Such datum shifts caused by\r\n        instrument problems are very common with tide gauges, such as those of\r\n        Hobart shown here . Simple fouling\r\n        by sea weed, marine growths and debris is all it takes to skew readings\r\n        from a tide gauge.  Relocation or instrument replacement can also\r\n        cause such shifts. But suppose Hunter et\r\n        al. was right and that the Fort Denison datum shift was a genuine\r\n        sea level rise and not an artifact of instrument problems.  Such a\r\n        large sea level rise could not go un-noticed at the other long-term tide\r\n        gauge in Australia - Port Pirie in South Australia"
    },
    {
      "tag": "div",
      "text": "The\r\n                Port Pirie record for 1945 to 1954 is shown left, with the vital\r\n                3-year period when Fort Denison recorded that big `sea level\r\n                rise', shown by the thick green line."
    },
    {
      "tag": "p",
      "text": "Not only is there no sea level\r\n                rise in that 3-year period, the adjacent years show no sea level\r\n                rise either. In fact, the NTF says that the\r\n                tide gauge at Port Pirie has shown a sea level fall of - 0.19 mm/yr over its full 63 years of\r\n                record.  With both the Fort Denison and Fremantle sea level\r\n                `rises' clearly invalid, this leaves the Hunter et al claim about a similar sea level rise at Port Arthur, Tasmania,\r\n                in a lot of difficulty. Return to \"Still\r\nWaiting For Greenhouse\" BEGIN FASTCOUNTER CODE END FASTCOUNTER CODE BEGIN FASTCOUNTER LINK FastCounter by bCentral"
    }
  ]
}