{
  "url": "http://episteme.arstechnica.com/eve/ubb.x/a/tpc/f/122097561/m/103003273731",
  "file_number": "53",
  "content_hash": "dd6ab7439f2e96d8967dda809c4dde00678afe36dad08eb79ff3942ce309ca60",
  "total_blocks": 646,
  "retained_blocks": 3,
  "ignored_blocks": 643,
  "blocks": [
    {
      "tag": "div",
      "text": "BEGIN: AdSolution-Website-Tag 4.3 : Ars Technica / HomePage 728x90 FRONT END:AdSolution-Tag 4.3 Ars Technica Ars OpenForum 3.0b Distributed Computing Arcana How many current projects? Should I seek help? Topic Closed Go New Find Notify Tools Admin New PM! Personal Zone » Ars OpenForum 3.0b » Chat Rooms » Profile Buddies Ignore List Groups Permissions Private Messaging Notifications Karma Preferences Favorites More... Discussion Poll Private Message Keyword Search Search current forum only Advanced Search New Since your Last Visit Today's Active Topics in this Category Add to My Favorites Printer Friendly Format Email a Friend Help Manage Manage Content in This Topic Manage Members Online Now Control Panel Rate It! Login/Join Welcome, [ Logout ] whilden Ars Scholae Palatinae Tribus: GR - MI - US Registered: July 03, 2001 Posts: 2783 Posted Prime95  (factoring/LL) SOB - #2 on the team F@H - I cant remember where FAD - just one machine LLRNET - side prime project anyone else like to run multiple projects, or do you stay focused on one project at a time? Calavaro Smack-Fu Master, in training Registered: November 01, 2001 Posts: 110 Posted More than 1 boxen on more than 1 project constitutes an addiction. Buying boxen or seeking out boxen to put a DC client on, would make you crazy in the common mans view. You, whilden, are just wired wrong. graemlin:;) Ignored post by Calavaro posted Show Post GOD Ars Tribunus Angusticlavius et Subscriptor Registered: January 17, 2000 Posts: 4071 Posted I'm only running 3 projects - seti classic (still), mousetracker (useless but low cost) and folding @ home (actually useful). I'm only 60% as ill as whilden . Ignored post by GOD posted Show Post garo Ars Scholae Palatinae Registered: January 05, 2001 Posts: 1876 Posted Prime95 OGR Seti Classic DIMES Proth (for generalized Fermat Numbers) SOB Sieve These are only my current projects. In the past i've also run G@H RC5-64 Distr Folding NSFNet F@H Ubero CPDN (never completed a unit) Ignored post by garo posted Show Post whilden Ars Scholae Palatinae Tribus: GR - MI - US Registered: July 03, 2001 Posts: 2783 Posted I forgot about Dimes, which is like DC on top of DC. /me calls the doc Ignored post by whilden posted Show Post MarcC Ars Scholae Palatinae Tribus: Lurking in the shadows of the AFS barracks Registered: February 17, 2002 Posts: 1338 Posted hmm let's see at the moment: Folding@home DIMES mousetracker experimenting with fad muon I've been pretty much in all projects ars is associated with at some point with the notable exception of BOINC. of course that's not what makes me certifiable. what does is this propensity I have to collect stats for all these projects and put them occasionally up for public review. if this doesn't constitute insanity I don't know what does. Cheers, Marc Ignored post by MarcC posted Show Post Animekiksazz Wise, Aged Ars Veteran Tribus: Mimico (Toronto) Registered: June 02, 2004 Posts: 623 Posted CPDN - Main thing I care about DIMES - doesn't use any cpu time (barely) MouseTracker - 'useless' Used to run SETI, and SETI@BOINC. Ignored post by Animekiksazz posted Show Post pizzaking Ars Praetorian Tribus: Ironville, UK Registered: June 08, 2001 Posts: 785 Posted Only contributing to a couple of projects these days; F@H - Windows boxes and my main project GIMPS - Mainly FreeBSD boxes, my install and forget project Although over the years I've also contributed to; D2OL, DF phases 1 and 2, ECCp-109, ECC2-109, G@H, OGR24 (or it might have been OGR25, I forget) and SETI. and I'm still a statswhore.... pk Ignored post by pizzaking posted Show Post VJS Wise, Aged Ars Veteran Registered: October 01, 2002 Posts: 948 Posted I kind of like to stay focused on one project and one project only at a time. Once entirely exhausted on a project I don't look back. Basically something else has to come around and really spark my interest to change. I believe this is the ultimate illness where one project can consume you entirely. Ignored post by VJS posted Show Post Rattledagger Wise, Aged Ars Veteran Tribus: Anandtech Registered: April 29, 2001 Posts: 504 Posted Hmm, have crunched seti for 3 different teams and CPDN for a 4th last month, so... Anyway, past projects in falling order: SETI@home \"classic\", Genome@home, UD \"think\", Folding@home, CPDN \"classic\", Distributed Folding. Current projects, various combinations of: CPDN/BOINC, Einstein@home, Folding@home/BOINC, LHC@home, Predictor@home, SETI@home/BOINC. Ignored post by Rattledagger posted Show Post Larry Loen Ars Tribunus Militum Tribus: OS/400 land Registered: August 06, 2000 Posts: 8723 Posted In my most active period, I never ran more than two projects at a time. There was turnover, however, in terms of which two it was. Ignored post by Larry Loen posted Show Post Loudergood Ars Scholae Palatinae Tribus: Northeast Kingdom Registered: March 18, 2002 Posts: 4126 Posted I'm running a few, I'm just not at liberty to say what they are at the moment. graemlin::D Ignored post by Loudergood posted Show Post Jetta \"Chili thread starter\" Ars Scholae Palatinae et Subscriptor Tribus: Tampa, FL Registered: February 09, 2002 Posts: 15613 Posted quote: Originally posted by Loudergood: I'm running a few, I'm just not at liberty to say what they are at the moment. graemlin::D graemlin::scared: Ignored post by Jetta posted Show Post Thomasn Smack-Fu Master, in training Tribus: Bergen Registered: November 05, 2000 Posts: 80 Posted I think I had FAH as main, with a bottomhugger of rc5 and one bottomhugger of manual ecm tests (when fah was unstable and I lacked FAH wu). That was on the home machine, did Find a drug at work, and ogr at the university. Now I focus on one project at a time, was FAH, which I got to 100000 points, now I have switched to rc5, goal is to reach 1M wus, currently 35K or so graemlin:;) So : you are not ill. I found after a time though that with only 5 cpus, you have to focus to gain ranks fast. Yes I am a stats whore graemlin:;) Ignored post by Thomasn posted Show Post Jamilla \"Facetus Malum\" Ars Tribunus Militum et Subscriptor Tribus: Sab Diego, CA                Crunching Granny Registered: February 02, 2001 Posts: 4677 Posted I am currently running SoB and DIMES. I just finished up running Seti Classic.  I will not be BOINC'ing until the client(s) have all of the bugs worked out. In the past I have run: Seti Classic GAH FAH Ubero ECCp-109 ECC2-109 Distributed Folding 1 & 2 RC5-64 UD Seti@Home - BOINC Predictor@Home Einstein@Home LHC@Home This message has been edited. Last edited by: Jamilla , Ignored post by Jamilla posted Show Post Jamilla \"Facetus Malum\" Ars Tribunus Militum et Subscriptor Tribus: Sab Diego, CA                Crunching Granny Registered: February 02, 2001 Posts: 4677 Posted quote: Originally posted by Thomasn: Yes I am a stats whore graemlin:;) Ain't nothing wrong with that! Ignored post by Jamilla posted Show Post kb9skw Ars Scholae Palatinae Tribus: Rockford, IL Registered: July 13, 2001 Posts: 1851 Posted Active... D2OL  (thats a given graemlin::p ) SoB F@H MouseTracker Past Stuff... SETI@Home Ignored post by kb9skw posted Show Post Stratcat Wise, Aged Ars Veteran Tribus: TDOW - Chicago Chapter Registered: August 11, 2003 Posts: 940 Posted quote: Originally posted by Loudergood: I'm running a few, I'm just not at liberty to say what they are at the moment. graemlin::D Ahhh...you're running the new adult movie rendering project, eh??? graemlin:;) Strat Ignored post by Stratcat posted Show Post Stratcat Wise, Aged Ars Veteran Tribus: TDOW - Chicago Chapter Registered: August 11, 2003 Posts: 940 Posted quote: Originally posted by Calavaro: More than 1 boxen on more than 1 project constitutes an addiction. Buying boxen or seeking out boxen to put a DC client on, would make you crazy in the common mans view. You, whilden, are just wired wrong. graemlin:;) Yeah...but he's wired perfectly for Ars-DCA! graemlin::bigdumbgrin: Strat /me goes about tinkering w/my machines & projects Ignored post by Stratcat posted Show Post MechWarrior Ars Scholae Palatinae Tribus: Richmond, VA USA Registered: August 29, 2000 Posts: 1490 Posted Currently active: S@H 1 TER Past projects include: SETI BOINC G@H D2OL SOB ECCP-109 TFY FAD Distr Folding phase one ( I beleive ) I tend to stay with one project at a time but am  running two more often now. Ignored post by MechWarrior posted Show Post Jamilla \"Facetus Malum\" Ars Tribunus Militum et Subscriptor Tribus: Sab Diego, CA                Crunching Granny Registered: February 02, 2001 Posts: 4677 Posted quote: Originally posted by Rattledagger: Hmm, have crunched seti for 3 different teams and CPDN for a 4th last month, so... Any particular reason why you move around so much?  I know that I have certain teams here that I stay with as I have certain teams elsewhere that I stay with.  Can't spread myself too thin so I stay with one group at a time and run their DC projects and vice-versa. Plus everybody should know where their allegiances lie. Jammy EDIT >>>oooo . . .I forgot the last part of the question: Should I seek help?  Uh . . .I don't think there is any kind of help available for being a stats whore.  I have tried weaning myself away from my computers and can successfully stay away for three hours.  i did move one of my boxes into the bedroom because it has a nice 19\" flat panel that I can turn around and watch my DVDs on, lol. Ignored post by Jamilla posted Show Post Rattledagger Wise, Aged Ars Veteran Tribus: Anandtech Registered: April 29, 2001 Posts: 504 Posted quote: Originally posted by Jamilla: Any particular reason why you move around so much?  I know that I have certain teams here that I stay with as I have certain teams elsewhere that I stay with.  Can't spread myself too thin so I stay with one group at a time and run their DC projects and vice-versa. Plus everybody should know where their allegiances lie. Joined the BBR-forums to answer a bandwith-question from \"someone\" graemlin::( and like other Anandtech-users made a seti-account there to get the spinning globe. But, instead of only crunching one wu like most of the others, decided on keeping wu-count higher than post-count. Keeping this up in SETI@home/BOINC is mostly for testing-purposes of BOINC client, and 99% of the time is only using one account so an ocassional result for another team shouldn't really be a problem. While my original seti-team didn't really handle the transition to v3.03 very well, when they made a CPDN/BOINC-team decided to crunch a little for them. Since uses CPDN as backup-project, it can be some time between each trickle. graemlin:;) Ignored post by Rattledagger posted Show Post Previous Topic | Next Topic powered by eve community Please Wait. Your request is being processed... [x] Site Ars OpenForum 3.0b Servlet eve1da009 Version 1.2.17 build 8729 Module Forums 4.0.3 Stylesheet \"Default Style - Site Wide\" Wordlet Set \"Default Wordlet Set\" Logout: Ars OpenForum 3.0b Update Groupee Account Topic Closed Ars Technica Ars OpenForum 3.0b Distributed Computing Arcana How many current projects? Should I seek help? Contact Us | Ars Technica | Privacy Statement | Terms of Service © Ars Technica, LLC 1998-2006."
    },
    {
      "tag": "p",
      "text": "Looking for more chatting insanity? Visit the Ars OpenIRC Server !"
    },
    {
      "tag": "div",
      "text": "View $GS_USERNAME's Public Profile Add $GS_USERNAME to my Buddies Add $GS_USERNAME to my Ignore List Remove $GS_USERNAME from my Ignore List Invite $GS_USERNAME to a Private Topic View Recent Posts by $GS_USERNAME Notify me of New Posts by $GS_USERNAME Rate Topic Quick Reply to:\n            How many current projects? Should I seek help? Guest Name Close | Quick Quote New Since your Last Visit Today's Active Topics"
    }
  ]
}