{
  "url": "http://www.juntosociety.com/dayinhistory/020103.html",
  "content_hash": "050ccb3d7cf34b2b870163a022d9ac46f95cc25a43c7091ee2fd6cd91d689955",
  "total_blocks": 548,
  "retained_blocks": 3,
  "ignored_blocks": 545,
  "blocks": [
    {
      "tag": "p",
      "text": "[ Home ]\r\n                                                          [ About\r\n                                                          Us ]\r\n                                                          [ Breaking\r\n                                                          News ]\r\n                                                          [ Commentary ]\r\n                                                          [ Contact\r\n                                                          Us ] \r\n                                                          [ Discussion\r\n                                                          Groups ]\r\n                                                          [ Education ] [ Guest\r\n                                                          Commentator's ]\r\n                                                          [ Political\r\n                                                          News ]\r\n                                                          [ Store ] February\r\n    1 1633 The\r\n              tobacco laws of Virginia are codified, limiting tobacco production to reduce dependence on\r\n              a single-crop economy. 1775 NJ\r\n              delegates declare support of the King only if liberties are\r\n              restored. 1790 The U.S. Supreme Court opens its first session. 1819 In Dartmouth v. Woodward, the Supreme Court upholds the principle of the\r\n              sanctity of contracts, ruling that the state of New Hampshire had no right to alter the charter granted to Dartmouth College . Related\r\n              Web Site 1834 Georgia had begun seizing Cherokee property.  Cherokees were forced\r\n              out by handguns, and were given to white settlers under the\r\n              lottery 1839 Cherokee\r\n              Chief John Ross and 228 other Cherokees arrive in Little Rock, en\r\n              route to Indian Territory as part of their forced immigration.  Chief Ross wife\r\n              Quatie Martin Ross, died today and was buried in Little Rock 1840 Baltimore\r\n              College of Dental Surgery is incorporated (first dental college in\r\n              the U.S. ) 1861 A\r\n              furious Governor Sam Houston storms out of a legislative session\r\n              upon learning that Texas has voted 167-7 to secede from the Union . 1862 Julia\r\n              Howe publishes Battle Hymn of the Republic 1865 Illinois becomes the first state to ratify the 13th Amendment abolishing\r\n              slavery. 1865 JS\r\n              Rock, first African American lawyer to practice before the U.S.\r\n              Supreme Court, is admitted to the bar 1867 Bricklayers\r\n              start working 8-hour days 1898 The\r\n              first auto insurance policy is issued in the U.S. (by Travelers Insurance Co) 1902 U.S.\r\n              Secretary of State John Hay protests Russian privileges in China as a violation of the \"open door policy.\" 1906 The\r\n              first federal penitentiary building is completed ( Leavenworth Kansas ) 1909 U.S. troops leave Cuba after installing Jose Miguel Gomez as president. 1920 The\r\n              first commercial armored car is introduced ( St Paul Minnesota ) 1926 Land\r\n              at Broadway & Wall Street is sold for a record $7 per square\r\n              inch 1930 A\r\n              Loening Air Yacht of Air Ferries makes its first passenger run\r\n              between San Francisco and Oakland , California .. 1942 Planes\r\n              of the U.S. Pacific fleet attack Japanese bases in the Marshall and Gilbert Islands . 1943 American\r\n              tanks and infantry are battered at German positions at Fais pass\r\n              in North Africa . 1944 U.S. Army troops invade two Kwajalein Islands in the Pacific. 1945 U.S. Rangers and Filipino guerrillas rescue 513 American survivors of\r\n              the Bataan Death March. 1951 Third\r\n              A-bomb tests are completed in the desert of Nevada . 1960 Four\r\n              African American college students began a sit-in protest at a\r\n              lunch counter in Greensboro , North Carolina , where they had been denied service unless they were willing to\r\n              stand. Related Web\r\n              Site 1964 The\r\n              Beatles' I Want to Hold Your Hand, becomes their first #1\r\n              hit (and stays #1 for 7 weeks) 1964 President\r\n              Lyndon B. Johnson rejects Charles de Gaulle's plan for a neutral Vietnam . 1965 Reverend\r\n              Martin Luther King Jr. and 770 others are arrested in protest\r\n              against voter discrimination in Alabama . 1968 U.S. troops drive the North Vietnamese out of Tan Son Nhut airport in Saigon . 1972 The\r\n              first scientific hand-held calculator (HP-35) is introduced (costs\r\n              $395) 1975 The\r\n              first successful Washington Capitols penalty shot is taken by Ken Lockett (vs the Vancouver Canucks) 1981 11th\r\n              AFC-NFC Pro Bowl: NFC wins 21-7 1982 Late\r\n              Night with David Letterman premieres on NBC-TV 1986 Two\r\n              days of anti-government riots in Port-au-Prince result in 14 dead. 1992 Denis\r\n              Potvin's #5 becomes the first number to be retired by the NY\r\n              Islanders 1994 Jeff\r\n              Gillooly pleads guilty in Portland Oregon to taking part in the attack on figure skater Nancy Kerrigan 1999 Former\r\n              White House intern Monica Lewinsky gives a deposition that is\r\n              videotaped for senators weighing impeachment charges against\r\n              President Clinton 1999 The\r\n              Morse code SOS is officially retired (replaced by the Global\r\n              Maritime Distress and Safety System) 2003 While\r\n              attempting re-entry for its landing on Earth, after completing its\r\n              research mission in orbit, the 22-year old Space Shuttle Columbia,\r\n              on its 28th flight, breaks apart in the atmosphere at 200,000 feet\r\n              in altitude while travelling at Mach-6 (12,500 mph), killing all\r\n              seven crew members onboard STS-107, the 113th shuttle mission\r\n              (debris falls on the town of Nacogdoches TX and is scattered over\r\n              several counties in central and eastern Texas) Born on February 1 1878 Hattie\r\n              Caraway, first woman elected to the U.S. Senate. 1901 Clark\r\n              Gable, American film actor (Mutiny on the Bounty, Gone With the\r\n              Wind). 1902 Langston\r\n              Hughes, African-American poet 1959 Mike\r\n              Horan NFL punter ( New York Giants) 1959 Wade\r\n              Wilson NFL quarterback ( Dallas Cowboys) 1961 Gabrielle\r\n              Carteris Phoenix AZ, actress ( Beverly Hills 90210) 1961 Daniel\r\n              M Tani Ridley Park MD, astronaut 1966 Eddie\r\n              Zambrano Venezuelan/US baseball outfielder ( Chicago Cubs) 1966 Michelle\r\n              Akers Santa Clara CA, soccer forward (Olympics-96) 1966 Donna\r\n              Edmondson Greensboro NC, playmate of the year (November 1986 1967 Tim\r\n              Naehring Cincinnati OH, infielder ( Boston Red Sox) 1968 Kent\r\n              Mercker Dublin OH, pitcher ( Atlanta Braves, Baltimore Orioles) 1968 Lisa\r\n              Marie Presley Keough, (Elvis' daughter) (35 years ago) 1969 Bryan\r\n              Jacob Palatka FL, 59 kg (130 lbs) weightlifter (Olympics-1992, 96) 1970 Eric\r\n              Mobley NBA center ( Vancouver Grizzlies) 1970 Malik\r\n              Sealy NBA guard/forward ( Detroit Pistons, Los Angeles Clippers) 1971 Derek\r\n              Byrd NFL cornerback ( New Orleans Saints) 1972 [Thomas]\r\n              Carlton Bruner US, 1500 meter freestyle swimmer (Olympics-96) 1972 Geoff\r\n              Sanderson Hay River, NHL left wing ( Hartford Whalers) 1972 Richard\r\n              Becker Aurora IL, outfielder ( Minnesota Twin) 1973 Andrew\r\n              DeClercq NBA forward ( Golden State Warriors, Boston Celtics 1973 Michael\r\n              Joyce Santa Monica CA, tennis star (1989 USTA National Boys' 18) 1974 Lisa\r\n              Marie Scott Pensacola FL, playmate (February 1994) 1974 Walter\r\n              McCarty NBA forward ( Boston Celtics) Died on February 1 1966 Nicholas\r\n                Piantanida sets balloon flight record & dies in descent 1986 Dick\r\n                James Beatles' music publisher (1962-70), dies in London at 58 1988 Heather\r\n                O'Rourke \"Poltergeist\" star dies of intestinal ailment\r\n                at 12 1991 James\r\n                G MacDonald cartoon voice (Mickey Mouse), dies at 84 1991 Phil\r\n                Watson NHL coach ( New York Rangers), dies 1996 Clive\r\n                Burton neuropathologist, dies at 54"
    },
    {
      "tag": "div",
      "text": "Copyright\r\n                                        2002 The Junto Society - All\r\n                                      rights reserved.  Permission to\r\n                                      reprint granted provided a link to this\r\n                                      site [ http://www.juntosociety/com ] is\r\n                                      plainly accompanying the article ."
    },
    {
      "tag": "p",
      "text": "[ Home ]\r\n                                      [ About\r\n                                      Us ]\r\n                                      [ Breaking\r\n                                      News ]\r\n                                      [ Commentary ]\r\n                                      [ Contact\r\n                                      Us ] \r\n                                      [ Discussion\r\n                                      Groups ]\r\n                                      [ Education ] [ Guest\r\n                                      Commentator's ]\r\n                                      [ Political\r\n                                      News ]\r\n                                      [ Store ]"
    }
  ]
}