{
  "url": "http://www.kriyayoga.com/newsletters/newsletter200010-3.htm",
  "file_number": "536",
  "content_hash": "2f894d7a84e3238b86012e43ffd9d3e05959666765a2ab9c64998500404d1e81",
  "total_blocks": 51,
  "retained_blocks": 11,
  "ignored_blocks": 40,
  "blocks": [
    {
      "tag": "h1",
      "text": "Pain and suffering The benefit of suffering and pain in life"
    },
    {
      "tag": "h2",
      "text": "When you rejected any advice, help or guidance - then pain may be your sole guidance in life left for you"
    },
    {
      "tag": "p",
      "text": "Absolutely everything has something beneficial within - however:"
    },
    {
      "tag": "h2",
      "text": "Any kind of suffering is absolutely obsolete !!"
    },
    {
      "tag": "p",
      "text": "Suffering is only the result of spiritual stubbornness and spiritual laziness to learn to love - pain is a direct result from denial to love to make one point absolutely clear right at the very\nbeginning - any kind of suffering is absolutely obsolete, anyone who thinks\nof himself or any other person needing any - even the very smallest amount\nof pain or suffering - is sadomasochistic - a very ill condition - and\nshould urgently review all his attitude toward self and all creation. However hundred of millions of people from all races, all cultures,\nall religions and all continents do suffer and have pain. Pain always is proof of disharmony between you and God. Pain always is the result of insufficient love in your behavior, actions, attitude, thoughts and fantasies. A truly loving person never has any kind of pain ! there is one single benefit for any person suffering in one way or another\n- any kind of suffering, spiritual, mental, emotional or physical - absolutely\nany kind of suffering or any kind of pain - caused by accidents or inherited\n- caused by self or others, always is a valuable FEEDBACK that can be used\nfor the spiritual benefit of that individual person."
    },
    {
      "tag": "h2",
      "text": "Pain and suffering always are proof of your own self made mistakes"
    },
    {
      "tag": "p",
      "text": "Mistakes result painful karma - are the result of lack of education - also spiritual education ! Spiritual education, spiritual teachings and the teachings of love have been known and available to all - poor and rich - since thousands of years !!! Your spiritual education helps you to establish harmony between you and God, to become wise in all situations of life and hence to accumulate treasures of lasting nature beyond death. Spiritual knowledge helps you to know how to heal in divine love any existing illnesses and pain as well as how to prevent any future suffering and pain. any kind of suffering or pain ALWAYS is karma of the soul concerned\nand is an absolute proof of the present personality - your personality\nis the same as your ego - being more or less OUT of harmony in relation\nto the very own soul and innermost divine core of your being. the soul\nhowever is the spiritual being within each of us that is directly related\nto God and all creation. the soul needs to be in full harmony with all\nand your ego needs to learn to be in full and absolute harmony with all\n- hence the personality, your present ego, needs to learn to always be\nin divine harmony with God. the more seriously you may be out of harmony with your innermost being\n- the more severe the illness will be or the more severe your pain, suffering and / or illness - the more severe\nyou might be OUT of harmony with God. hence the more you need to change\n- even totally - your present ego / personality to become healthy again. health is but the proof of great harmony with God. Illness, suffering\nand / or pain is but the proof of more or less great DISHARMONY with God.\nany ill or suffering person - before being able to be healthy - needs to\naffirm and realize MAJOR changes in the personal behavior toward self and / or part or all of creation and as a result of such changes health is re-established. such changes\nhowever need to be truly sincere - it is your very own soul watching over your ego and harmony is something absolute - something of absolute mathematical precision - that either is perfect or NOT. you are either ill or\nhealthy - anything less than perfectly healthy is ILL - and needs serious\nconsideration - YOUR consideration - and adjustments, before serious illness may occur. the intensity of illness, pain and / or suffering is DIRECTLY proportional\n- directly related - to the efforts and changes NEEDED to re-establish\nharmony and health again within and in your physical body as well."
    },
    {
      "tag": "h2",
      "text": "Use love tests to gain feedback"
    },
    {
      "tag": "p",
      "text": "Use love tests to gain feedback about your potential problems before problems actually occur - prevent pain by increasing and purifying your love. Feedback always is very positive - this kind of feedback is available to all for FREE . it tells you there is something to do and it tells you even what to do. the more you do the better your overall health - the better your overall health the closer you may be to godunion - even without knowing it. lazy - extremely lazy people - or may be extreme stingy people - now would ask for a very detailed list of what illness is related to what action\nto be taken. this - as already mentioned is VERY LAZY however !! sometimes\nsuch lists and books are sold. sometimes they are of some help. but it\nis much easier and more demanding at once than just reading such books.\nsome or much of the pain and suffering may be released by painkiller and\nvarious medications - to prevent any active and conscious work on your\nown ego - your present personality. medication is the laziest of all solutions\n- specially if applied continuously or even a lifetime. for a single or\nshort time application any medication may well be of excellent and highly\nvaluable service - but any longterm use should be replaced by intense spiritual progress instead."
    },
    {
      "tag": "h2",
      "text": "What needs to be done by all - to cure ANY illness, pain or suffering ?"
    },
    {
      "tag": "p",
      "text": "Get yourself in full and absolute harmony with god by: following to the point yama\nand niyama in all aspects of your life. in family, recreation, business.\nin your mind, emotions and all actions - in absolutely any and all situations of life ! cultivate and continuously improve divine LOVE toward ALL in all, every and any situations of life ! if there are even the smallest doubts about any part\nof above 2 points - please take a dictionary and read every single word\n- exactly that is the way it is meant - straight forward - word by word. reading books and tables to find out what behavior\ncauses what illness is lazy - extremely lazy - and means that you are searching\nfor a shortcut. shortcuts most often end short of the goal and finally\nyou may find yourself again in another incarnation - again and again -\nfor thousands or millions of years. if however you truly and sincerely want to develop\ndivine Love and achieve Godunion - you need to learn AND practice successfully\nALL anyway. hence start from scratch - at the very beginning and do it\nALL - step by step. it is the only warranty to success. developing various powerful Siddhis - special\nspiritual capabilities of various kinds as described in very detail in\nmany sutras by Patanjali - may give you great income opportunities, great\npopularity and many other possibilities - it also gives you the power of\ncreating within fewer seconds more karma, illness and disaster than ever\nbefore in entire incarnations. it may give you the power to create\nwithin seconds karma you may need millions of years to dissolve. having\nsuch Siddhis is neither a proof of divinity of any soul nor is it a proof\nof TRUE and absolute spiritual achievement of such a soul. it is just another\nskill that anyone could learn - provided you invest sufficient time, efforts\nand energy. however it also can lead to extreme suffering, illness and\nand or pain of that soul in the present and / or future incarnations. any kind of illness, pain and / or suffering is\nthe final result of extreme destructive behavior applied by THAT very soul\ntoward self or others - in the present and / or any number of  incarnations. developing DIVINE LOVE however ALWAYS guarantees\nyou to reach Godunion for sure - even if you have been conducting a very\nmodest, humble \"normal\" life - as a person totally unknown to all mankind\non earth - god has received the humble true love of your soul and being\nand your love will open all doors to God - in Love - with Love. even if illness is \"inherited\" it is YOUR karma\n- even if it is a contiguous illness of any kind and severity - it is your\nkarma - even if it is an accident or \"criminal act\" done by anyone else\nit is YOUR SOLE KARMA AND RESPONSIBILITY - it is the result of your ego, accumulated in your present or any previous incarnation - it is finally\nthe result of missing LOVE within YOU toward self or any part of creation.\nit is an absolute proof of necessity to make major changes in YOUR life. you may read through all different sections and\nchapters online or offline using the file god.zip and find all necessary help to establish harmony within and outside of\nyou. harmony between any and all aspects and manifestations of your being\nwith God and hence with all creation . as a direct result of your refining\ndivine love toward all and toward god as well. excellent overall health and wellbeing physical, emotional and mental as well as spiritual will be the result of your positive loving efforts. LOVE is the most beautiful and most divine of\nall Siddhis you ever may learn - because LOVE can but heal, free and make\nhappy - your own self as well as all and any others. LOVE is the single\nmost powerful spiritual achievement you ever may have. your body may get crucified or burnt or killed\nin any way by any methods or means - but any loving soul always continues\nto love - from eternity to eternity - your body may get completely destroyed\nby anyone in any way - but your LOVE toward all persists and continues\nto heal and free - even those who may have killed you. LOVE always is free\nof any limits - LOVE is beyond any control and beyond the reach of any\nego. Love has its absolute and final source in God and God will protect,\nheal and free anyone willing to love -even willing to LEARN TO LOVE. if you merge with God even for a single second\n- you have learned to love more than in billions of years you ever could\nlearn in physical bodies or in astral bodies or in causal bodies. to achieve such divine healing - all you need\nto do is to fully focus on developing Divine Love ALL THE TIME - rather than spending hours each day asking questions and thinking about problems.the more you think about love - the more you practice love - the more you attract love from all possible sources on earth and beyond - all sources of love help you to get closer to God - until you start to feel divine\nLove coming from God and by that time you may continue to mainly focus but on divine Love from God as your only source of Love. May Love and Divine Bliss help you to heal and dissolve in Divine Love all you want to dissolve. the more you actually LOVE the faster it will happen. love and bliss hans Overview all spiritual newsletter topics"
    }
  ]
}