{
  "url": "http://www.ladylibrty.com/our_view_archives/2005/skin-deep.html",
  "file_number": "538",
  "content_hash": "c8a3efb6702900672d2ba328aa82a7ed0f7010b485ae12b8f2d2080794c8039e",
  "total_blocks": 19,
  "retained_blocks": 2,
  "ignored_blocks": 17,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "Skin \n          Deep by Lady Liberty Iwoke up this weekend to a winter winderland outside my window. Mother \n          Nature had conspired to provide exactly the temperature, humidity, stillness, \n          and cloud saturation to result in a winter scene right off the front \n          of the most beautiful holiday card. The ground was covered in a blanket \n          of several inches of pristine white. Every tree branch was outlined \n          in sparkling snow; power lines were coated not heavily enough for danger \n          of outages but just thickly enough for beauty. Even the grey cloud cover \n          wasn't enough to prevent all of that whiteness from reflecting what \n          little light there was and turning the view into something out of a \n          backlit snow globe. Even as Ilooked in appreciation at the scene framed by my window, \n          puffy fat snowflakes continued to float to earth. The natural sound-dampening \n          properties of a thick, wet coat of snow made the noises generated by \n          those few people already out and about a distant consideration. Itook \n          an extra moment at my window just to look around and take mental snapshots \n          of what Isaw. Everywhere Ilooked, the beauty was flawless and exquisite. Within the hour, Iwas out the door and ready to begin a busy day of \n          such routine errands as banking and grocery shopping. Ihad to remove \n          the snow from my car before Icould go anywhere, a chore Iusually resent. \n          But not on this day! No, as Iworked, Icould see the trees in the front \n          yard looking as if they were transplants from fairy land. When Imoved \n          around to the back of my car, Inoted that the Victorian house across \n          the street was utterly charming behind a veil of falling snow. The pretty veneer of snow dressing up my neighborhood reminded me of \n          the beautiful people and clothes we see at presidential inaugurations. \n          \"Who are you wearing?\" is as common a question these days \n          in the high halls of politics as it is on the red carpets of Hollywood. \n          There will be bright lights and balloons. There will be parades and \n          ceremonies. Bands will play and famous singers will sing, all while \n          those Americans lucky enough to actually be in attendance will celebrate \n          the second term of President George W. Bush. It will be majestic and \n          more than a little attractive in its presentation, and those who look \n          will doubtless appreciate the sparkling spectacle. Bemused and still smiling, Igot into my car and stepped on the gas. \n          That's when Idiscovered something not nearly so attractive underneath \n          the coating of new-fallen snow: a layer of smooth and very slippery \n          ice. Fortunately, I'm familiar enough with winter driving that Ihadn't \n          made even an attempt at a quick or abrupt acceleration. Iremained in \n          complete control and was able to stop without incident before Ireached \n          the end of the driveway. Itook a firm mental note of the treacherous \n          roads that lay just beneath the innocent-seeming surface of the snow, \n          and pulled out onto the street with great care. In Washington, the rich and powerful mingle with the rich and famous \n          at inauguration parties more so than at any other time of the year. \n          Movie stars and longtime politicians almost always show up for the festivities. \n          Smiling faces beam into cameras stationed outside every door, waving \n          exclusive tickets and making audiences across the country wish for a \n          moment that they were among the select. Speeches will be given and oaths \n          will be taken. But behind the promises will be exceptions; berneath \n          the vows will be unspoken \"buts.\" And among the crowds and \n          just past the glitter are people we may not recognize, but who make \n          up in spades for their lack of fame with their stores of power. The \n          famous who publicly prevaricate for our pleasure, and the less famous \n          who also wield real and dangerous powers we cannot always see, make \n          the festivities at these premier events a mere curtain covering the \n          real and far more treacherous story. Fortunately for me and my chores, there was very little traffic and \n          so Icould go as slowly as necessary for safety without holding anybody \n          else back from their desire to live dangerously. With the snow still \n          falling, few plows had been out and even fewer salt trucks had attended \n          to the streets. Even at 20 miles an hour, control was difficult. At \n          higher speeds, it would have been impossible. Ipaid strict attention \n          to my driving, of course, but still had moments when Icould glance \n          around and see that the city parks had never been more spectacular, \n          and the historic downtown buildings couldn't have looked better even \n          when they were brand new.. The hazardous road conditions, however, meant \n          that Icouldn't afford to be distracted for long without risking life \n          and limb (and almost as importantly to me, my new car). George W. Bush and his second term agenda aren't moving anywhere near \n          a slow, safe speed. In fact, with ironic and exceedingly unfortunate \n          thanks to the 9/11 terrorist attacks, his first term agenda moved in \n          bursts of power. Congress, meanwhile, showed little inclination to apply \n          the brakes. (To be fair, I'm not entirely sure the brakes would have \n          proved effective on the slippery slope toward a police state this administration \n          seems determined to navigate. But that doesn't mean the effort shouldn't \n          have been made! Judiciously and with a careful effort, even a slipping \n          vehicle can be stopped or at least brought under some semblence of control.) \n          Now, with a second term in its beginning phases, it's clearer than ever \n          that the state is careening across dangerous ground. With care and patience, Ieventually made it to the grocery store safely. \n          Frankly, I'm glad Ididn't wait for the roads to be cleared and salted \n          because it meant Ihad the store almost to myself. There were no lines, \n          and no impatient or rude shoppers. The few of us who'd made it there \n          early in the morning smiled when we passed in the aisles largely, Ithink, because we had made it there. Clerks had time to be friendly \n          and chatty. We talked, of course, about the weather. By the time Ifinished my shopping and paid for my purchases, over \n          an hour had passed. In that time, plows had been out on the main roads \n          and traffic had increased considerably. Ileft the store parking lot \n          lamenting the changes such a short time had wrought. Where I'd looked \n          earlier at a spotless blanket of snow that gave everything a clean and \n          new appearance, Inow saw mud-spattered slush and stained snowbanks. \n          Given what was underneath the new snow, this was to be expected. Imourned \n          my loss anyway. In politics, motives—at least the stated ones—are typically \n          as pure as the, well, driven snow. \"It's for the children!\" \n          we're told, or \"It's for your safety!\" we hear. Since we all \n          want our children to be well taken care of, and our safety to be assured, \n          it's difficult to argue against these sentiments. But underneath the \n          purity of the stated reasons is the filth of power, money, influence, \n          and greed. Somehow, anything that benefits the children or enhances \n          safety almost always also increases the power of those in Washington \n          while it decreases the liberty of those outside it. It's a matter of fact we all accept that winter can be beautiful enough \n          to warm our hearts. At the same time, it can be ugly, dangerous, and \n          bitingly cold. In the same way and at least as obviously, government \n          can be good (national defense) or it can be bad (the current national \n          offense against civil liberties). Whether pretty or ugly, though, the \n          bottom line where winter is concerned is that rising temperatures force \n          it to give way to spring. And without straining the series of metaphors, \n          it seems entirely fair to say that if we raise the heat under Congress, \n          the chilling effect of many government policies created \"for the \n          children\" or \"for our security\" might also melt away. The worst thing that could happen if we light a few ideological fires \n          for freedom is that the thin and outwardly attractive coating of \"for \n          your own good\" and \"we have your best interests at heart—really\" \n          will give way to all the dirt that lies immediately underneath. Perhaps \n          there are still some in America that need to be shown the mess before \n          they understand the necessity for cleaning it up. Either way, it remains \n          that we have to slog through the mud and likely get our hands dirty \n          before we'll see the regrowth of spring—or liberty—again. Mail \n          this page to a friend ©2005 by Lady Liberty and ladylibrty.com, all \n          rights reserved."
    }
  ]
}