{
  "url": "http://www.learningsolutions.com/WhitePapers/7KeysRetainTopTalent.html",
  "file_number": "541",
  "content_hash": "0b545499baecad0fec5ebd37ade7c957d4a113504ce91bd2a5a1c82becfe8de5",
  "total_blocks": 93,
  "retained_blocks": 14,
  "ignored_blocks": 79,
  "blocks": [
    {
      "tag": "p",
      "text": "Learning\r\n        Solutions Alliance 2620\r\n        Augustine Drive, Suite 180 Santa\r\n        Clara, CA 95054 www.LearningSolutions.com ph:\r\n        (408) 727-2332 fax:\r\n        (408) 727-8544 Best Practices:\r\n        7 Keys Research Findings: The Challenge of Retaining Top Talent The\r\n        Workforce Attrition Crisis"
    },
    {
      "tag": "div",
      "text": "I t\r\n            is no wonder that in today's aggressive business environment, the\r\n            challenge of sustaining a competitive advantage preoccupies the\r\n            minds of many business leaders."
    },
    {
      "tag": "p",
      "text": "Corporate customers and individual\r\n            consumers have more providers to choose from than ever before.\r\n            Furthermore, they often perceive that what they are purchasing is,\r\n            for all practical purposes, a commodity that can be easily obtained\r\n            from other companies if need be. So how does a corporation distinguish\r\n            itself in a highly \"commoditized\" and competitive market? Today's\r\n            businesses are more dependent than ever before on their top\r\n            performers to innovate and provide services that differentiate a\r\n            company from its fierce competitors. In other words, corporations\r\n            are reliant upon their human assets to survive and thrive. However, with unemployment now\r\n            running at less than 6%, many corporations and government agencies\r\n            are struggling to find and keep these valued employees. Changing\r\n            work force demographics, such as the shrinking of the most desirable\r\n            labor pool (25-34 year olds) and the negative impact downsizing has\r\n            had on employee loyalty, has led corporate America to search for\r\n            answers to recruiting and retaining the strategic asset of the\r\n            twenty-first century: talented people. Retaining top talent was less of an\r\n            issue in the past, but the shifting tides of the unspoken\r\n            employee/employer contract have created new currents in the\r\n            workplace. The old contract asked employees to:"
    },
    {
      "tag": "div",
      "text": "work hard be loyal give their all"
    },
    {
      "tag": "p",
      "text": "In return, they would have:"
    },
    {
      "tag": "div",
      "text": "a job for life a home away from home regular salary increases a good chance for a promotion"
    },
    {
      "tag": "p",
      "text": "The new contract is substantially\r\n            different. It states that employees must now work harder, doing not\r\n            only their jobs, but the jobs of their former co-workers who were\r\n            \"right-sized.\" In return, job security is extinct,\r\n            promotions are scarce, salary increases are modest at best, and the\r\n            constant uncertainty of change is almost guaranteed. Is it any\r\n            wonder that employee loyalty is on the demise and talented\r\n            individual contributors and managers feel less bonded to their\r\n            organizations? Research We conducted attrition and retention\r\n            research with our clients, and substantiated our findings by\r\n            reviewing industry practices and the behavioral science literature.\r\n            We uncovered a number of critical findings, seven of which are\r\n            described in this article. Because of the sensitive nature\r\n            of attrition problems, we have not identified our clients or other\r\n            organizations by name in this document when citing examples of their\r\n            retention problems or solutions. 1. The Costs of Attrition Can Be\r\n            Staggering, But Often Unseen What does it cost an organization\r\n            when a talented employee defects to the competition? Some of the\r\n            costs factors are obvious, such as the productivity losses due to a\r\n            vacant position. However, there are often unseen costs, like the\r\n            reduced productivity from the departing employee who is inevitably\r\n            distracted during his or her job search and therefore contributes\r\n            less during this time period (sometimes called \"short-timer's\r\n            disease\"). Using conservative\r\n            calculations, one technical company in California's Silicon Valley\r\n            estimates that it cost them an average of $70,000 when just one\r\n            employee leaves. Other companies calculate that attrition costs them\r\n            annual productivity losses of 65-75% in the position the employee\r\n            departs. Another clients with a national sales\r\n            force of hundreds estimates that they have to scramble to make up\r\n            for over a million dollars of potentially lost sales when just one\r\n            salesperson leaves. To add insult to injury, this does not take into\r\n            consideration the departed employee's attempts to woo his/her past\r\n            customers over to his/her new employer. Multiply these costs by the\r\n            number of employees who leave in a year and the financial impact is\r\n            dramatic. 2. The Reasons Employees Stay Are\r\n            Not The Same As Why They Leave Most organizations do not have a\r\n            handle on the actual reasons why employees stay, as well as the\r\n            actual reasons why they depart. Many organizations attempt to\r\n            capture the causes of attrition through standard exit interviews.\r\n            Unfortunately, traditional exit interviews just scratch the surface\r\n            of the causes for attrition. They inevitably fail to differentiate\r\n            between factors that make the new job attractive to the departing\r\n            employee, versus the reasons why the employee was prompted to\r\n            consider leaving his or her current job in the first place. For example, many employees report\r\n            \"better compensation\" as one of their main reasons for\r\n            leaving. In many cases, our research revealed that these same\r\n            employees were not, in fact, originally dissatisfied with their\r\n            compensation. Instead, other reasons prompted them to consider\r\n            leaving their current job, such as the absence of professional\r\n            development opportunities. However, they often do not report these\r\n            negative reasons associated with their old job (possibly for fear of\r\n            retribution), but instead report what is attractive in the new job.\r\n            Because of this phenomenon, organizational data from typical exit\r\n            interviews fails to surface the real causes of an organization's\r\n            attrition problems. This is also true when an employee is\r\n            actively recruited by the competition. Our work in retention shows\r\n            that attractive candidates receive calls from recruiters all of the\r\n            time! If this is so, what causes the sudden shift that makes the\r\n            employee act on a recruiter's call at a particular point in time? We\r\n            consistently found in these circumstances that something\r\n            deteriorated in their work situations that caused them to take the\r\n            current recruiter's call more seriously. Obviously, when organizations\r\n            unknowingly misdiagnose the situation and fail to surface the most\r\n            critical factors that contribute to attrition, their solutions to\r\n            correct the problem fall short of the mark. The result is a bad\r\n            diagnosis leading to improper prescriptions. 3. The Manager's Role in Attrition\r\n            Is Paramount But Underplayed Most managers we interviewed as part\r\n            of our research in retention lamented the loss of talented\r\n            contributors. However, when asked to diagnose the reasons for an\r\n            employee's departure, the average manager pointed to a variety of\r\n            external organizational factors as the causes of attrition, failing\r\n            to take any personal responsibility for the situation. They\r\n            typically did not acknowledge any factors within their control that\r\n            contributed to the employee's departure. For example, managers often\r\n            attributed attrition problems to such factors as compensation.\r\n            Certain factors that are the responsibility of \"the overall\r\n            corporation\" can certainly aggravate attrition if they are not\r\n            in order, such as inequitable pay scales or excessively rigid\r\n            policies that dilute employee autonomy. However, we discovered that\r\n            a large number of factors contributing to employee retention are\r\n            within the manager's circle of influence. Therefore, the results of any\r\n            attrition intervention are dependent upon the organization's ability\r\n            to provide managers with an awareness of those factors, as well as\r\n            tools to help them meet their personal accountability in retaining\r\n            top talent. Furthermore, managers need this\r\n            guidance more than ever before. The managers' span of control has\r\n            been widening in most companies over the past several years, and the\r\n            number of times the manager 'touches\" the employee is therefore\r\n            less frequent. Each contact must maximize any opportunity to\r\n            influence employee motivation and commitment. 4. Prevention Is The Best Medicine The loss of key employees, even in\r\n            small numbers, can be devastating to a company. (This points to the\r\n            importance of tracking not just overall attrition ratios, but also\r\n            tracking the level of performers leaving.) Consequently, we were interested in\r\n            determining the degree to which managers rank retention as a high\r\n            on-going priority. Not surprisingly, we found that the only time the\r\n            average manager thinks about retention is when she or he receives a\r\n            resignation from an employee. We also found that most managers\r\n            predictably attempt to talk departing employees out of leaving,\r\n            trying to convince them that they are making a mistake. However, also predictably, we found\r\n            that the vast majority of the time, these employees leave their\r\n            resignations on the table, resisting attempts to persuade them to\r\n            stay. And, in the infrequent situation when a manager successfully\r\n            persuades the employee to remain, he or she often leaves within six\r\n            to nine months anyway. (The exception is when there is a clear\r\n            salary inequity which is remedied, and the employee is satisfied\r\n            with everything else about the work situation.) Clearly, the solution lies in tying\r\n            retention to critical business activities so that managers do not\r\n            think about retention after the fact, when it is too late, but\r\n            rather see it as integral to business success and survival. Treating\r\n            retention as an on-going priority enables the manager to focus on\r\n            proactive measures to sustain long term employee commitment rather\r\n            than on reactive attempts to reverse surprise resignations. 5. Retention Has An Often\r\n            Unrecognized Impact on the Customer Managers are well aware of the impact\r\n            on their function when a valued employee leaves. However, even\r\n            managers of customer contact functions, such as sales or customer\r\n            service, often fail to demonstrate a sensitivity to the impact\r\n            attrition has on customers. When key employees leave customer\r\n            contact functions, customers often experience:"
    },
    {
      "tag": "div",
      "text": "a discontinuity in the\r\n                relationship a negative impact on their own\r\n                productivity time wasted reorienting the new\r\n                employee to their operation and the way they work"
    },
    {
      "tag": "p",
      "text": "When the relationship represents a\r\n            value-added partnership, the change in account managers or service\r\n            providers can set the relationship back months and give competitors\r\n            a weighty advantage. This is especially true if the transition to\r\n            new account personnel is not well managed. At a certain point,\r\n            regular changes in account personnel can send a message of\r\n            organizational instability and create the impression that the\r\n            organization does not care about the account relationship. In the case of development or support\r\n            functions, we also found a general lack of awareness on the\r\n            manager's part of the negative impact the departing employee has on\r\n            internal customers. The departure of a top performing employee can\r\n            therefore have a \"ripple effect\" on the organization and\r\n            its clients that creates problems for months. 6. Misguided Thinking -\r\n            \"Attrition is Inevitable\" It is true that some level of\r\n            attrition is unavoidable. In fact, a certain degree of attrition is\r\n            desirable in order to compensate for poor hiring decisions. However,\r\n            human resource and senior line managers often question whether they\r\n            can really increase their retention ratios. The answer is definitively yes, with\r\n            evidence to support it. In one of our client organizations, the\r\n            attrition rate for one of their divisions in 1995, prior to our\r\n            intervention, was 18.5%, with 25% attrition in one of the most\r\n            critical occupation groups. After working with us in 1996 and making\r\n            retention a priority for every manager, the attrition rate dropped\r\n            to 11.7% overall and 15% in the critical group. One might predict that other factors\r\n            contributed to this outcome. In fact, it should be noted that there\r\n            were actually reductions in employee compensation during this time,\r\n            which should have increased attrition. Nevertheless, we still saw an\r\n            increase in retention rates. Another client asked that we conduct\r\n            a retention risk analysis and intervention in a critical technical\r\n            division because the organization feared that attrition would rise\r\n            in the near future. Two interesting findings emerged from our\r\n            research with this group. The first was that this division was\r\n            already following a number of the retention prescriptions we provide\r\n            our clients (one of the few divisions in the entire company to do\r\n            so). More striking, however, was the fact that as a result of\r\n            following these prescriptions, this group's retention rates were\r\n            over 10% higher than the rest of the company's, thus validating the\r\n            efficacy of our model. Another company in the Northwest\r\n            began with an attrition rate of 17%. After following the same\r\n            prescriptions, they reduced their attrition rate to 3%, bringing\r\n            their retention rate up to 97%. As the evidence suggests, attrition\r\n            is not an unbeatable foe. Instead, it is a challenge that can be\r\n            overcome with the right strategies and tools. 7. World Class Retention Reflects\r\n            A Multi-Factored Solution The scenario in many organizations is\r\n            the same. Someone, such as a senior line manager or HR professional\r\n            who is tied to the business, raises the red flag of attrition,\r\n            recognizing it's potentially devastating impact on the company's\r\n            strategic position. Then, someone scrambles to pull some sort of\r\n            training or tools together which focuses on only a few (but not all)\r\n            of the factors that are required to reduce attrition. The result is\r\n            the organization experiences mediocre results, or no results at all. This multi-factored retention\r\n            solution is like the story of the blind men and the elephant. Never\r\n            having seen an elephant, three blind men were brought over to a\r\n            young elephant to let them experience it. Each man touched a part of\r\n            the elephant. The first one touched a leg and said, \"Now I\r\n            understand. An elephant is like a tree trunk.\" The second man\r\n            touched the tail and said, \"No. You are wrong. An elephant is\r\n            like a snake.\" The third man touched an ear and said, \"You\r\n            are both quite mistaken. An elephant is like the leaf of a big palm\r\n            tree.\" If any of the men wanted to control\r\n            the elephant, they would have found themselves incapable of doing\r\n            so, because their understanding of the elephant was only partial.\r\n            This is also true of many organizations that try to tackle only one\r\n            factor of the attrition dilemma. One piece of anecdotal evidence comes\r\n            from a report made by one of the nation's leading financial services\r\n            companies. In an attempt to stem the outflow of critical managers\r\n            and individual contributors, they contracted with a reputable\r\n            training firm with whom they had worked successfully in the past.\r\n            While the firm admitted they were not experts in employee retention,\r\n            they nevertheless conducted sessions for senior managers, hoping to\r\n            help their client to deal effectively with the problem. Unfortunately, but also predictably,\r\n            the firm addressed only a fragment of the retention solution. The\r\n            kick back from the managers was strong, since they intuitively\r\n            sensed this was only a partial solution and it would not effectively\r\n            address their issues. Therefore, one litmus test for a retention\r\n            solution is to assess its scope and depth. Any solution that is one-dimensional\r\n            is bound to fail. Conclusion Interestingly enough, organizational\r\n            experts predicted that mergers and downsizing would result in\r\n            employees who felt lucky to have a job and who would, of course,\r\n            stay. This may be true for employees in the lower tiers of\r\n            performance. However, top talented employees recognize they\r\n            represent a valued organizational asset. When their loyalty\r\n            deteriorates, the tendency to switch organizations increases. The average costs of replacing\r\n            today's defecting work force is eating away at the profitability of\r\n            even the healthiest organizations. Even when the bottom line remains\r\n            intact, the loss of just a handful of key employees who have a\r\n            special expertise or who maintain valued customer relationships can\r\n            shake an organization to it's roots. In this age of high stakes and\r\n            unpredictable market and organizational changes, organizations must\r\n            educate their managers and create an environment where today's top\r\n            talent can thrive. The alternative is unacceptable. Related\r\n            Programs Free\r\n            Forums"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" U-Include=\"../onsite_customized_programs/onsitebottom.htm\" TAG=\"BODY\" startspan"
    },
    {
      "tag": "p",
      "text": "To\r\n        schedule a program, have a free initial consultation about your project,\r\n        or to learn more about how LSA can contribute to your business success, please\r\n        call us at 800-889-6452, 408-727-2332, or click\r\n        here to tell us what you need, or click\r\n        here to send an e-mail. We appreciate your interest and will get\r\n        back to you promptly. To\r\n        review helpful resources, select one of the following links: client\r\n        case studies , white papers , free forums ."
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" endspan i-checksum=\"3953\" webbot bot=\"Include\" U-Include=\"../bottompage.htm\" TAG=\"BODY\" startspan #BeginLibraryItem \"/lsa/Library/Footer.lbi\" class=\"Page_SubHead\" Home | Who\r\n          We Are | What\r\n          We Do | Public\r\n          Classes | Our\r\n          Clients | Membership | Contact\r\n          Us | Join\r\n          Our Mailing List"
    },
    {
      "tag": "p",
      "text": "Learning\r\n          Solutions Alliance, 2620 Augustine Drive #180, Santa Clara, CA 95054\r\n          Tel:800-889-6452, 408-727-2332, Email Copyright\r\n           2004  Learning Alliance Corporation DBA Learning Solutions\r\n          Alliance. All Rights Reserved. All copyrights, trademarks, service marks and\r\n          product names presented in this web site are copyrights, trademarks, service marks, or registered trademarks of Learning\r\n          Alliance Corporation DBA Learning Solutions Alliance, or its Partners."
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" endspan i-checksum=\"38970\""
    }
  ]
}