{
  "url": "http://www.localhistories.org/irehist.html",
  "file_number": "550",
  "content_hash": "e5c310ca927edbd04845f9422d775df2964ba9ebbb9870610aca40493b624980",
  "total_blocks": 125,
  "retained_blocks": 1,
  "ignored_blocks": 124,
  "blocks": [
    {
      "tag": "p",
      "text": "A BRIEF HISTORY OF IRELAND By Tim Lambert PREHISTORIC IRELAND The first humans\r\narrived in Ireland between 7,000 and 6,000 BC after the end of the last ice\r\nage. The first Irish people lived by farming, fishing and gathering food such\r\nas plants and shellfish. The stone age hunters tended to live on the seashore\r\nor on the banks of rivers and lakes where food was plentiful. They hunted animals\r\nlike deer and wild boar. They also hunted birds and, with harpoons, they hunted\r\nseals. About 4,000 BC farming was introduced to Ireland.\r\nThe stone age farmers kept sheep, pigs and cattle and raised crops. They\r\nprobably lived in huts with wooden frames covered with turfs and thatched with\r\nrushes. The farmers made tools of stone, bone and antler. They also made\r\npottery. For centuries the farmers and the hunters co-existed but the old\r\nhunter-gatherer lifestyle gradually died out. The stone age farmers were the first people to\r\nsignificantly affect the environment of Ireland as they cleared areas of forest\r\nfor farming. They were also the first people to leave monuments in the form of\r\nburial mounds known as court cairns. The stone age farmers sometimes cremated\r\ntheir dead then buried the remains in stone galleries covered in\r\nearth. They also created burial places called dolmens,\r\nwhich consist of massive vertical stones with horizontal stones on top, and\r\npassage graves which have a central passage lined and roofed with stones with\r\nburial chambers leading off it. The passage graves were covered with mounds of\r\nearth. CELTIC\r\nIRELAND About 2,000 BC bronze was introduced into Ireland\r\nand was used for making tools and weapons. The bronze age people also erected\r\nstone circles in Ireland. They also built crannogs or lake dwellings which were\r\neasy to defend. Then about 750 BC the Celts arrived in Ireland.\r\nThey brought iron tools and weapons with them. The Celts were a warlike people.\r\n(According to Roman writers they were passionately fond of fighting) and they\r\nbuilt stone forts across Ireland). Ireland was divided into many small kingdoms\r\nand warfare between them was frequent. Fighting often took place in\r\nchariots. The priests of the Celts were called Druids and\r\nthey practised polytheism (worship of many gods). Celtic society was divided into 3 classes. At the\r\ntop were the kings and aristocrats. Below them were the freemen who were\r\nfarmers. They could be well off or could be very poor. At the bottom were\r\nslaves. Divorce and remarriage were by no means unusual in Celtic society and\r\npolygamy was common among the rich. CHRISTIANITY COMES TO\r\nIRELAND In the 4th century Christianity spread to Ireland,\r\nprobably through trade with England and France. In 431 Pope Celestine sent a\r\nman named Palladius to Ireland. However he was killed shortly after his\r\narrival. Then in 432 a man named Patrick arrived in Ireland.\r\nPatrick was probably born about 390 or 400. He lived in Western England until\r\nhe was captured by Irish raiders at the age of 16 and was taken to Ireland as a\r\nslave. Patrick was forced to work as a herdsman and so had much time for\r\nthinking about religion. After 6 years as a slave Patrick managed to escape\r\nback to England. However he had a vision in which he read a letter\r\nasking him to come to Ireland. This he did. Patrick became a missionary to\r\nIreland until his death in 461. Patrick tried to organise the church in Ireland\r\nalong 'Roman' lines with Bishops as the leaders. However the Irish church soon\r\nchanged to a system based on monasteries with Abbots as the leaders. From 500 to 800 was the golden age of the Irish\r\nchurch. Many monasteries were founded across Ireland and soon the Irish sent\r\nmissionaries to other parts of Europe such as Scotland and Northern England.\r\nIrish monks also kept alive Greek-Roman learning during the Dark Ages. In Irish\r\nmonasteries learning and the arts flourished. One of the greatest arts was\r\nmaking decorated books called illuminated manuscripts. The most famous of these\r\nis the Book Of Kells, which was probably made at the beginning of the 9th\r\ncentury. However this golden age ended with the Viking raids. THE VIKINGS IN\r\nIRELAND The Vikings first attacked Ireland in 795. They\r\nlooted monasteries. They also took women and children as slaves. However the\r\nVikings were not only raiders. They were also traders and craftsmen. In the 9th\r\ncentury they founded Ireland's first towns, Dublin, Wexford, Cork and Limerick.\r\nThey also gave Ireland its name, a combination of the Gaelic word Eire and the\r\nViking word land. In time the Vikings settled down. They intermarried with the\r\nIrish and accepted Christianity. Around 940 the great High King Brian Boru was born.\r\nAt that time the Danes had conquered much of the kingdom of Munster. Brian\r\ndefeated them in several battles. In 968 he recaptured Cashel, the capital of\r\nMunster. After 976 Brian was king of Munster and in 1002 he became the High\r\nKing of Ireland. However in 1014 Leinster, the people of Dublin and the Danes\r\njoined forces against him. Brian fought and defeated them at the battle of\r\nClontarf on 23 April 1014, although he was killed himself. This victory ended\r\nthe Viking threat to Ireland. THE ENGLISH\r\nINVASION During the 11th and 12th centuries the church in\r\nIreland flourished once again. In the early and mid 12th century it was\r\nreformed. Synods (church meetings) were held at Cashel in 1101, at Rath Bresail\r\nin 1111 and Kells in 1152. The church was reorganised on diocesan lines and\r\nbishops became the leaders rather than Abbots. However Pope Adrian IV (actually\r\nan Englishman called Nicholas Breakspear) was not satisfied. He was determined\r\nto bring the Irish church to heel. In 1155 he gave the English king, Henry II,\r\npermission to invade Ireland to sort out the church. However Henry did not immediately invade Ireland.\r\nInstead Dermait MacMurrough, the king of Leinster, brought events to a head. In\r\n1166, another king, Tiernan O'Rourke forced MacMurrough to flee from Ireland.\r\nHowever MacMurrough appealed to the English king Henry II for help. Henry gave\r\nhim permission to recruit in England. MacMurrough enlisted the support of a man\r\nnamed Richard FitzGilbert de Clare (better known as Strongbow) to help him\r\nregain his kingdom. In return MacMurrough promised that Strongbow could marry\r\nhis daughter and would become king of Leinster after him. MacMurrough returned to South Leinster in 1167. The\r\nfirst English soldiers arrived in 1169. They landed at Bannow Bay in County\r\nWexford and soon captured the town of Wexford. The High King, Rory O'Connor led\r\nan army against the English but Dermait came to terms with him. He agreed to\r\nsubmit to O'Connor as High King. However the next year, 1170, Strongbow led an army\r\nto Ireland and captured Waterford and Dublin. Askluv the king of Dublin sailed\r\naway. However the next year he returned with a Norwegian army but some English\r\nknights sallied out on horseback and defeated them. Askluv was captured and\r\nexecuted. Next Rory O'Connor led an army to Dublin and laid siege to the town.\r\nHowever the English slipped out and made a surprise attack, routing the Irish. Henry II became alarmed that Strongbow was becoming\r\ntoo powerful and ordered all English soldiers to return to England by Easter\r\n1171. Strongbow made Henry an offer. He agreed to submit to king Henry and\r\naccept him as Lord if he was allowed to continue. Henry decided to accept the\r\noffer on condition he could have the towns of Dublin, Waterford and Wexford. In\r\nthe meantime Dermait died and Strongbow became king of Leinster. The English\r\nking Henry landed in Ireland in October 1171. Strongbow submitted to him. So\r\ndid most of the Irish kings. In 1175 Rory O'Connor submitted to Henry by the\r\ntreaty of Windsor. THE\r\nANGLO-IRISH In the early 13th century the English extended\r\ntheir control over all of Ireland except part of Connacht and Western Ulster.\r\nThe English also founded the towns of Atheny, Drogheda, Galway and New Ross.\r\nThe first Irish parliament was called in 1264 but it represented only the\r\nAnglo-Irish ruling class. However after 1250 the English tide ebbed. In 1258\r\nBrian O'Neill led a rebellion. The rebellion failed when O'Neill was defeated\r\nand killed in 1260. However the English landowners were gradually absorbed into\r\nIrish society. Many of them intermarried and slowly adopted Irish customs. In\r\n1366 the Kilkenny Parliament passed the Statutes of Kilkenny. The Anglo-Irish\r\nwere forbidden to marry native Irish. They were also forbidden to speak Gaelic\r\nor to play the Irish game of hurling. They were not allowed to wear Irish dress\r\nor ride bareback but must use a saddle. However all such attempts to keep the\r\ntwo races separate and distinct failed. In 1315 the Scots invaded Ireland hoping to open up\r\na second front in their war with the English. Robert the Bruce's brother led\r\nthe Scottish army with considerable success and was even crowned king of\r\nIreland. However the English sent an army to oppose him and he was defeated and\r\nkilled in 1318. In 1394 the English king Richard II led an army to\r\nIreland to try and re-assert English control. The Irish submitted to him but\r\npromptly rebelled once he had left. Richard returned in 1399 but he was forced\r\nto leave due to trouble at home. From then on English control continued to wane\r\nuntil by the middle of the 15th century the English only ruled Dublin and the surrounding\r\n'Pale'. THE TUDOR CONQUEST OF\r\nIRELAND Henry VII (1485-1509) tried to bring Ireland to\r\nheel. In 1494 he made Sir Edward Poynings Lord-Deputy of Ireland. In 1495\r\nPoyning persuaded the Irish parliament to pass 'Poyning's Law' which stated\r\nthat the Irish parliament could only meet with the permission of the English\r\nking and could only pass laws previously approved by the king and his\r\nministers. Henry VIII (1509-1547) continued his father's\r\npolicy to trying to bring Ireland under his control but he adopted a 'softly,\r\nsoftly' approach of trying to win over the Irish by diplomacy. In 1536 the\r\nIrish parliament agreed to make Henry head of the Irish church (although the\r\nreformation made little headway in Ireland and the country remained\r\noverwhelmingly Catholic). In 1541 the Irish parliament agreed to recognise\r\nHenry VIII as king of Ireland. Under Henry's son Edward VI (1547-1553) English\r\npolicy hardened. The English undertook military campaigns against Irish chiefs\r\nin Laois and Offaly who refused to submit to the king. They then made the first\r\nattempt to 'plant' loyal English people in Ireland as a way of controlling the\r\ncountry. Land confiscated from the Irish was given to English settlers. However\r\nin the face of attacks from the Irish the English colonists were forced to\r\nabandon the 'plantation'. After Edwards death his sister Mary (1553-1558)\r\nbecame queen. She carried out the first successful plantation of Ireland. Again\r\npeople were settled in Laois and Offaly but this time they were better prepared\r\nfor war. Further plantations took place under Elizabeth\r\n(1558-1603). From 1579 to 1583 the Earl of Desmond led a rebellion against the\r\nEnglish. When the rebellion was finally crushed much of the land in Munster was\r\nconfiscated and was given to English colonists. Then in 1592, Elizabeth founded the first\r\nuniversity in Ireland, Trinity College, Dublin. Finally in 1593 rebellion broke out in Ulster. Hugh\r\nO' Neill the Earl of Tyrone, joined the rebellion in 1595. At first the\r\nrebellion was successful. The rebels won a great victory at Yellow Ford in\r\n1598. However O'Neill was severely defeated at the battle of Kinsale in 1601.\r\nThe rebellion ended in 1603. IRELAND IN THE 17th\r\nCENTURY After the rebellion O'Neil was, at first, treated\r\nleniently. He was allowed to return to his land. However after 1605 English\r\nattitudes hardened. In 1607 Hugh O'Neil and Rory O'Donnell, the Earl of\r\nTyrconnell, fled to France with their supporters. This event became known as\r\nthe flight of the Earls. Afterwards their land in Ulster was confiscated by\r\nKing James who decided on a plantation of Ulster. This time the plantation was\r\nto be far more thorough. This time Protestant settlers would outnumber the\r\nnative Irish. Between 1610 and 1613 vast numbers of English and Scots settled\r\nin Ulster on confiscated land. Many new towns were founded. Naturally the native Irish resented the plantation\r\nand in 1641 Ulster rose in rebellion. Some massacres of Protestants undoubtedly\r\noccurred. However the extent of the massacres was later greatly\r\nexaggerated. In the South in 1642 the Anglo-Irish and the native\r\nIrish formed an alliance called the Confederation of Kilkenny. They quickly\r\ntook over all Ireland except Dublin and some other towns and part of Ulster.\r\nMeanwhile in England civil war was raging between the English king and\r\nparliament so Ireland was largely left to its own devices for several years.\r\nHowever divisions between the Anglo-Irish and the native Irish weakened the\r\nrebellion. Moreover the English civil war ended in 1646. King Charles Iwas\r\nexecuted in January 1649. Afterwards the English parliament turned its\r\nattention to Ireland. Oliver Cromwell was determined to crush Irish\r\nresistance and impose Protestantism on Ireland. He also sought revenge for the\r\nmassacres of 1641. When Cromwell captured Drogheda in 1649 the defenders were\r\nmassacred. Asimilar massacre took place in Wexford. Cromwell left Ireland in\r\n1650 and his Son-in-law took over. By 1651 all of Ireland was in English\r\nhands. In 1653-654 another plantation took place. Land\r\nbelonging to Irish Catholics was confiscated. Those who could prove they had\r\nnot taken part in the rebellion of 1641 were given other (less fertile) land\r\nwest of the Shannon. The confiscated lands were given to Englishmen. In 1660 Charles II became king of England and\r\nScotland. At first it looked as if he would undo the Cromwellian confiscation\r\nof Irish land. However the king soon back-pedalled, fearing a backlash among\r\nhis own people if he treated Catholics too kindly. Furthermore during the 1660s the export of cattle\r\nfrom Ireland to England was banned. Yet exports of meat and butter boomed. The\r\npopulation of Ireland also rose rapidly in the late 17th century. English\r\nmerchants also resented competition from the Irish wool trade. Labour costs\r\nwere lower in Ireland than in England and Irish wool was exported to many other\r\ncountries. In 1699 the Irish were forbidden to export wool to any country\r\nexcept England. However the English already charged high import duties on Irish\r\nwool and there was little demand for it. So exports of Irish wool were\r\neffectively ended. In 1685 a Catholic, James II, succeeded Charles II.\r\nThe Irish hoped James would treat them more kindly but he was deposed in 1688\r\nand fled to France. The Dutchman William of Orange and his English wife Mary\r\nwere invited to come and rule in James's place. However James was not willing to give up his crown\r\nso easily. The Lord-Deputy of Ireland, the Early of Tyrconnell was still loyal\r\nto him. So were most of the Irish. In March 1689 James landed at Kinsale and\r\nquickly took most of Ireland. Londonderry was one of the few places that stood by\r\nWilliam. In December 1688 Catholic troops attempted to enter but 13 apprentice\r\nboys shut the gates against them. In April 1689 James laid siege to Londonderry\r\nand his men laid a boom across the River Foyle to prevent supplies reaching it\r\nby water. However in July a ship called the Mountjoy broke the boom and\r\nrelieved the town. William's army landed in Ireland in August 1689 and\r\non 1 July 1690 the two armies met at the battle of the Boyne near Drogheda.\r\nJames was decisively defeated. William entered Dublin on 6 July 1690. The next\r\nyear his army lay siege to Limerick. That town surrendered in October 1691. The\r\ntreaty of Limerick ended the war in Ireland. THR PROTESTANT\r\nASCENDANCY Following the defeat of James II the Irish\r\nProtestants passed certain laws to repress the Catholics. In 1695 Catholics\r\nwere forbidden to carry arms. In 1697 the Banishment Law ordered all bishops\r\nand priests to leave Ireland (although many did not). In 1704 Catholic priests\r\nwere required to register and to swear an oath of allegiance to the\r\nking. Furthermore from 1704 all members of the Irish\r\nparliament and all holders of office had to be members of the Church of\r\nIreland. (This Act applied to Presbyterians as well as Catholics. As a result\r\nmany Presbyterians left Ireland for North America during the 18th\r\ncentury). Another Act of 1704 stated that Catholics could not\r\nbuy land. They could not leave their land to a single heir, and they could not\r\ninherit land from Protestants. These measures meant that by 1778 only 5% of the\r\nland in Ireland was owned by Catholics. Both Catholics and Dissenters\r\n(Protestants who did not belong to the Church of Ireland) had to pay tithes to\r\nthe Church of Ireland which naturally caused great resentment. An Act of 1719 reaffirmed the British parliaments\r\nright to legislate for Ireland. The Irish parliament was made definitely\r\nsubordinate. In 1727 Catholics lost the right to vote. There was a great deal of dire poverty in Ireland,\r\nat its worst during the famine of 1741. This disaster killed hundreds of\r\nthousands of people. In the 1760s the grievances of Irish peasants\r\nboiled over into violence. In Munster the 'whiteboys', so called because they\r\nwore white smocks or shirts to disguise themselves burned buildings and maimed\r\ncattle. In the 1770s they were followed in the north by the oak boys and the\r\nsteel boys. From 1778 the penal laws were gradually repealed.\r\nFrom that year Catholics were allowed to lease land for 999 years. From 1782\r\nthey were allowed to buy land. In 1782 Poynings Law is repealed after nearly\r\n300 years. The law of 1719, which gave the British parliament the right to\r\nlegislate for the Irish, was also repealed. In 1792 Catholics were allowed to\r\npractise as lawyers and to marry Protestants. From 1793 Catholics were allowed\r\nto vote (but were not allowed to sit as MPs). In the 18th century a linen industry grew up in\r\nNorthern Ireland. A Linen Board was formed in Dublin in 1711. However the linen\r\nindustry soon became concentrated in the north and another Linen Board opened\r\nin Belfast in 1782. From the late 18th century Britain began to industrialise.\r\nIn Ireland industrialisation was limited to the north. The south of Ireland\r\nremained agricultural, exporting huge quantities of meat and butter to Britain.\r\nDuring the 18th century the population of Ireland rapidly increased from less\r\nthan 2 million in 1700 to nearly 5 million in 1800. Trade with Britain boomed\r\nand the Bank of Ireland opened in 1783. However at the end of the 18th century the ideas of\r\nthe American Revolution and the French Revolution reached Ireland. They\r\ninfluenced a Protestant lawyer, Theobald Wolf Tone who, in 1791, founded the\r\nSociety of United Irishmen. The society wanted Ireland to become an independent\r\nrepublic with religious toleration for all. In 1794 Britain went to was with\r\nFrance. The United Irishmen were regarded as a dangerous organisation and were\r\nsuppressed. Wolf Tone fled abroad and tried to persuade the French to invade Ireland.\r\nIn 1796 they sent a fleet but it was prevented from landing by a\r\nstorm. Then in May 1798 risings took place in Wexford,\r\nWicklow and Mayo. However the rebellion was defeated at Vinegar Hill near\r\nEnniscorthy on 21 June. French soldiers landed at Killala in August but they\r\nwere forced to surrender in September. The French sent another fleet but their\r\nships were intercepted by the British navy and most of them were captured. On\r\nboard one was Wolf Tone. In November he committed suicide in prison. IRELAND IN THE 19TH\r\nCENTURY The British government then decided that radical\r\nreform was needed. They decided the answer was to abolish the Irish parliament\r\nand unite Ireland with Britain. In 1800 they managed to persuade the Irish\r\nparliament to agree to the measure. It came into effect in 1801. In 1803 Robert Emmet (1778-1803) and a small group\r\nof followers attempted an uprising in Dublin. They killed the Lord Chief\r\nJustice of Ireland and his nephew but the rising was quickly crushed. Emmet was\r\nhung, drawn and quartered. In the early 19th century a movement to remove\r\nremaining restrictions on Catholics was led by Daniel O'Connell (1775-1847). In\r\n1823 he founded the Catholic Association. In 1829 their wishes were granted.\r\nThe Catholic Emancipation Act allowed Catholics to become MPs and to hold\r\npublic office. In 1840 O'Connell began a Repeal Association to\r\ndemand the repeal of the Act of Union. He arranged 'monster meetings' of his\r\nsupporters. In 1843 he called for one at Clontarf. However the British\r\ngovernment banned the meeting. O'Connell cancelled the meeting and his movement\r\ncollapsed. THE POTATO\r\nFAMINE In 1845 a large part of the Irish population lived\r\non potatos and buttermilk. It was an adequate diet but if anything happened to\r\nthe potato crop there would be disaster. In 1845 potato blight hit Ireland.\r\nPeel, the British Prime Minister, appointed a scientific committee to study the\r\ndisease. Unfortunately they did not understand its true nature. Faced with famine Peel started relief works to\r\nprovide work for the starving. (Peel was reluctant to give away free food). The\r\npotato blight returned in 1846. By 1847 the situation was so bad that Peel's\r\nsuccessor, Lord John Russell realised direct relief was necessary and soup\r\nkitchens were set up. Private charity also struggled to cope with the\r\ncalamity. However hundreds of thousands of people died each\r\nyear of starvation and disease such as cholera, typhus and dysentery. (In their\r\nweakened condition people had little resistance to disease). The famine was worst in Southern and Southwest\r\nIreland. The North and the East coast were less affected. Many people fled aboard. In 1851 alone some 250,000\r\npeople emigrated from Ireland. (Many of them died of disease while on board\r\nship). The population of Ireland fell dramatically. From over 8 million in 1841\r\nit fell to about 6 1/2 million in 1851 and it continued to fall. An estimated 1\r\nmillion people died during the famine. Many others emigrated. The failure of the British government to deal with\r\nthe famine caused a lasting bitterness in Ireland. THE HOME RULE\r\nMOVEMENT In 1842 an organisation called Young Ireland was\r\nformed to campaign for Irish independence. (They were called 'Young Ireland'\r\nbecause they were opposed to O'Connell's 'Old Ireland', which advocated\r\npeaceful methods. In 1848 Young Ireland attempted an uprising. Led by William\r\nSmith O'Brien 1803-64 a group of Irish peasants fought with 46 members of the\r\nIrish Constabulary at Ballingary in County Tipperary. The skirmish later became\r\nknown as 'the battle of the Widow McCormack's cabbage patch'. Afterwards\r\nO'Brien was arrested. He was sentenced to death but instead was transported to\r\nTasmania. In 1858 another movement called the Fenians was\r\nformed. In 1867 they attempted a rising in England, which did not succeed. In\r\n1870 they were banned by the Catholic Church but they continued to\r\noperate. Also in 1870 a lawyer named Isaac Butt (1813-1879)\r\nfounded the Irish Home Government Association. The aim was to gain MPs in the\r\nBritish parliament and fight for independence. The Association was a success in\r\nthat it soon gained a large number of MPs but Butt was regarded as too\r\nmoderate. He soon lost control of the movement to a Protestant Lawyer called\r\nCharles Steward Parnell (1846-1891). THE LAND\r\nWAR In the late 1870s Irish agriculture entered a\r\nrecession and many tenant farmers were evicted. Then in 1879 a Fenian called\r\nMichael Davitt (1846-1906) founded the Irish National Land League to demand\r\nland reform. He asked Parnell to lead the movement. The land war of 1879-1882\r\nfollowed. Rents were withheld until the last moment. Anyone who took the land\r\nof an evicted tenant was boycotted. This word came from a Captain Charles\r\nBoycott. He managed an estate in Mayo. Local people refused to work for him but\r\nin 1880 50 labourers from Ulster, protected by troops, were sent to harvest his\r\nfarm. However life was made so unpleasant for Boycott he was forced to\r\nleave. During the land war some people became violent. As\r\na result in 1881 the British government passed the Coercion Act, which allowed\r\nthem to imprison people without trial. The leaders of the land league were\r\narrested. At the same time Gladstone passed another land act. Tenants could\r\napply to a special land court for a fair rent. Gladstone's land acts of 1881\r\nand 1882 also gave tenant farmers greater security of tenure. The land war ended with an agreement called the\r\nKilmainham Treaty. The government released the leaders and agreed to some more\r\nconcessions and the violence died down (although the Chief Secretary for\r\nIreland Lord Frederick Cavendish and the Under Secretary were murdered in\r\nPhoenix Park, Dublin). THE HOME RULE\r\nBILLS In 1886 Gladstone introduced his first Home Rule\r\nbill but it was rejected by the House of Commons. Gladstone introduced a second\r\nHome Rule bill in 1893. This one was passed by the House of Commons but it was\r\nrejected by the House of Lords. Gladstone introduced a second Home Rule bill in\r\n1893. The House of Commons passed this one but the House of Lords rejected it.\r\nNevertheless some reforms were made to land ownership. In 1885 money was made\r\navailable for leaseholders to borrow to buy their land. The loans were repaid\r\nat low rates of interest. The loan system was extended in 1891. More land acts\r\nwere passed in 1903 and 1909. As a result many thousands of tenant farmers\r\npurchased their land. In 1893 the Gaelic League was founded to make\r\nGaelic the main language of Ireland once again. Meanwhile Protestant opposition to Home Rule was\r\ngrowing. The Ulster Unionist Party was formed in 1886. Other unionist\r\norganisations were also formed at the end of the 19th and beginning of the 20th\r\ncentury. However Sinn Fein (Gaelic 'we ourselves') was\r\nformed in 1905. In the 1900s Ireland moved towards civil war. The\r\nUlster Volunteer Force was formed in 1913. In the South Nationalists formed the\r\nIrish Volunteers. Both sides obtained arms. Finally a Home Rule Bill received the Royal Assent\r\non 15 September 1914. However it was put on hold for the duration of the First\r\nWorld War. The war split opinion in Ireland. Some people were willing to wait\r\nfor the end of the war believing that Ireland would then become independent.\r\nSome were not. The Irish Volunteers split. About 12,000 men broke away but kept\r\nthe name Irish Volunteers. The rest (0ver 100,000 men called themselves the\r\nIrish National Volunteers. THE EASTER\r\nRISING In the early years of the 20th century the Irish\r\nRepublican Brotherhood remained a powerful secret organisation. Many of them\r\njoined the Irish Volunteers. In May 1915 the IRB formed a military council. In\r\nJanuary 1916 they planned an uprising and set Easter Day (April 24) as the\r\ndate. MacNeill, the leader of the Irish Volunteers, wa sonly informed about the\r\nplanned uprising on 21 April. At first he agreed to co-operate. He ordered the\r\nVolunteers to mobilise on 24 April. However a German ship called the Aud, which\r\nwas carrying rifles to Ireland was intercepted by the British Navy and her\r\ncaptain scuttled her. MacNeill changed his mind and cancelled the Volunteer\r\nMovements. As a result the uprising was confined almost entirely to Dublin and\r\ntherefore had no chance of success. The insurgents occupied the Post Office in\r\nO'Connell Street where their leader Patrick Pearse announced an Irish Republic.\r\nHowever the British crushed the rebellion and the insurgents surrendered on 29\r\nApril. The British then court-martialed the insurgents and 15 of them were\r\nexecuted. Public opinion was appalled and alientated by the executions. THE FIGHT FOR\r\nINDEPENDENCE In December 1918 a general election was held and\r\nSinn Fein won 73 seats. However the Sinn Fein MPs refused to sit in the Britsh\r\nparliament. Instead they formed their own parliament called the Daill Eirann,\r\nwhich met in Dublin. In January 1919 the Irish Volunteers renamed\r\nthemselves the IRA the IRA began a guerilla war when they shot two RIC men. The\r\nguerilla war continued through 1920 and 1921. The British recruited a force of\r\nex-soldiers called the Black and Tans to support the RIC. The Black and Tans\r\nwere sent to Ireland in March 1920. They undertook reprisals against the IRA by\r\nburning buildings. In Dublin on 21 November 1921 they fired upon a crowd\r\nwatching a football match killing 12 people. Shortly afterwards the Black and\r\nTans burned part of Cork city centre. The war continued into 1921. On 25 May 1921 the IRA\r\nburned Dublin Customs House However 5 of them were killed and 80 were captured.\r\nShortly afterwards, in July 1921, the war ended. Meanwhile in 1920 the British government passed\r\nthe Government of Ireland Act. By it there would be 2 parliaments in Ireland,\r\none in the north and one in the south. However both parliaments would be\r\nsubordinate to the British parliament. An election was held for the southern\r\nIrish parliament in May 1921. Sinn Fein won almost all the seats but their MPs\r\nrefused to sit in the new parliament. Instead the Dail continued to\r\nmeet. Then in October 1921 a group of 5 men were\r\nappointed by the Dail to negotiate with the British. The British prime minister\r\ndemanded that Ireland be partioned and he threatened the delegates with war if\r\nthey did not sign a treaty. Therefore they did so. The Dail approved the treaty on 7 January 1922.\r\nHowever opinion split over the treaty with some people willing to accept it as\r\na temporary measure and some people bitterly opposed. Fighting broke out\r\nbetween the IRA and the National Army. Michael Collins was killed in an embush\r\non 22 August 1922. The civil war lasted until May 1923. IRELAND IN THE EARLY 20th\r\nCENTURY During the 1920s and 1930s unemployment was high in\r\nIreland. Furthermore many people lived in overcrowded conditions. As a result\r\nemigration continued. However things slowly improved. In the years 1925-1929\r\nthe government created a hydro-electricity scheme called the Shannon scheme. By\r\n1943 all the towns in Ireland had electricity. So did most of the villages. In\r\nthe 1930s the government tried to help the unemployed with a road-building\r\nscheme. Furthermore some industry developed in Ireland at that time. In 1937 a new constitution made an elected\r\npresident head of state. Furthermore the name 'Irish Free State' was replaced\r\nwith either Eire or Ireland. Then in 1948 Ireland was made a republic and the\r\nlast ties with Britain were cut. In the 1930s Ireland fought an 'economic war' with\r\nBritain. Before 1922 many tenant farmers borrowed money from the British\r\ngovernment to buy their farms. As part of the treaty of 1922 the Irish state\r\nwas to collect this money and pass it on to the British. However in 1932 de\r\nValera stopped paying. In response the British imposed a tariff of 20% on Irish\r\ngoods. This caused great harm to the Irish cattle trade. However de Valera\r\nimposed import duties on British goods such as coal. He hoped Ireland would\r\nbecome economically self-sufficient and Irish industries would develop. In\r\nreality the war hurt both sides. In 1935 they made a coal-cattle pact, which\r\nmade trade in the two commodities easier. In 1938 a general trade treaty\r\nbrought the economic war to an end. THE REPUBLIC OF\r\nIRELAND In 1949 an Industrial Development Authority was\r\nfounded to promote industrialisation and from the late 1950s the Irish economy\r\ndeveloped rapidly. During the 1960s and 1970s the Irish economy grew an average\r\nof 4% per year. The first Irish motorway opened in 1962. Also in 1962 Irish\r\ntelevision began broadcasting. However Irish people continued to emigrate abroad\r\nduring the 1950s and 1960s. Despite emigration the population of Ireland rose\r\nin the 1960s and 1970s (for the first time since the mid-19th\r\ncentury. In 1973 Ireland joined the EEC (forerunner of the\r\nEU). Membership brought great benefit to Ireland both in direct aid and in\r\ninvestment by foreign companies. During the 1980s the Irish economy was in the\r\ndoldrums. Unemployment was only 7% in 1979 but it rose to 17% in 1990. Then in\r\nthe 1990s the situation changed completely. The Irish economy boomed and it\r\nbecame known as the Celtic Tiger. By 2000 unemployment in the Irish Republic\r\nhad fallen to less than 4%. Irish society also changed rapidly in the last\r\nyears of the 20th century. Mary Robinson was elected the first woman president\r\nin 1990. In 1995 the Irish people voted in a referendum to allow\r\ndivorce. Today Ireland is a prosperous country with a bright\r\nfuture. Today the population of Ireland is 3.95 million. Click below to read\r\nhistories of: Belfast Cork Derry Dublin Galway Limerick Waterford Home Last revised 2004"
    }
  ]
}