{
  "url": "http://www.lvlife.com/2000/11/features/story01.html",
  "file_number": "554",
  "content_hash": "263a76ba31ca489fe24f6637a245ed741423bbba15013240abbcfef1e9b024b1",
  "total_blocks": 94,
  "retained_blocks": 4,
  "ignored_blocks": 90,
  "blocks": [
    {
      "tag": "div",
      "text": "AdSpace spacedesc=banner #include virtual=\"html.ng/spacedesc=banner\" /AdSpace AdSpace spacedesc=tile #include\nvirtual=\"html.ng/spacedesc=tile&tile_a:=Ads.ID\" /AdSpace AdSpace spacedesc=tile #include\nvirtual=\"html.ng/spacedesc=tile&Ads.ID!=$tile_a$&tile_b:=Ads.ID\" /AdSpace #include virtual=\"/2000/11/incl/nav.txt\""
    },
    {
      "tag": "p",
      "text": "These \n        Old Houses Lured by \n        restorable digs and a sense of community, the children of the McNeil neighborhood \n        are coming home By Christopher \n        Hagen photography by Greg Cava"
    },
    {
      "tag": "div",
      "text": "Asnapshot \n            of an early McNeil house, on Campbell Drive, circa 1950-54. The area \n            was at the edge of town then; it's near the center now."
    },
    {
      "tag": "p",
      "text": "Fred and \n        Irene Tabor bought their custom-built house on Mason Avenue in 1957. There, \n        in the McNeil neighborhood, they raised their family. \"We moved in just \n        before Roger was born,\" Irene says. \"In back of us was the desert, some \n        barns and horses. And there was a big gap between us and Downtown.\" Over \n        the years the barren land became rich with vegetation--and lush with friendships. Two years \n        ago, after 11 years of retirement in California, they wanted to come home \n        to their \"very friendly, small community.\" It wasn't easy. Hoping to find \n        a place on Mason, they had to settle for Westleigh Avenue, several blocks \n        away. \"It was as close as we could get,\" Irene says. In their absence, \n        the old neighborhood had become very popular. The Tabors found their children \n        and friends of their children moving in. They saw a lot of new faces. \"The neighborhood \n        hasn't changed that much,\" Irene says. \"It is still a friendly, small \n        community.\" Bill \n            and Heather Coulthard have the ideal picket fence around their nice \n            Cape Cod number. Bounded by Charleston \n      and Oakey, and stretching west from Rancho to about Cashman, McNeil was \n      one of the city's first westward suburban \"sprawls.\" Now it's pretty much \n      in the heart of town, just a mile or so southwest of the Union Pacific plot \n      that city leaders see as the key to Downtown revitalization. And while the \n      Tabors are seeing a lot of re-energizing activity in McNeil, it's not the \n      high-density infill city officials talk about. These are single-family homes \n      on big, quarter-acre lots. The folks moving in aren't exactly yuppies--they're \n      a bit older now and raising young kids. But in Vegas, where \"new\" is de \n      rigueur, and where the new-housing market leads the universe, there actually \n      are people buying old homes in an old neighborhood close to the city center. They are \n        buying inexpensively, spending big bucks to remodel, renovate, retrofit \n        and add on. For what it's costing them, most could have had new custom \n        homes in the 'burbs. But they're drawn to McNeil by the individuality \n        of the houses, the mature landscaping and larger yards, the proximity \n        to work, the challenge of renovating old homes and the sense of neighborhood. \n        Most buyers are natives, and some grew up in the neighborhood, have lived \n        elsewhere and are now drawn \"back home\" to raise their own families. Roger \n            and Amy Tabor have equally pleasant grounds in their back yard. \"There are 580 \n      houses in the neighborhood, and only seven or eight on the market right \n      now,\" says Realtor Debbie Zois of Debbie Zois & Associates. Arriving \n      from Canada 15 years ago she found it to be \"the only older neighborhood \n      that's still well-maintained.\" She soon began a monthly \"McNeil Update\" \n      mailer that lists offerings and recent sales. The homes, mostly ranches, \n      typically cost $160,000-$180,000 for about 2,500 square feet. Buyers, Zois \n      says, are often professionals, drawn by the ease of commuting to the University \n      Medical Center/Valley Hospital complex, Downtown, the business area, the \n      county center and the Strip. Today, old-timers \n        living in '50s and '60s houses mix neatly with a revitalizing element \n        that has brought babies and speed bumps. Some have moved here to downsize, \n        and content themselves with updating the insides. Some are using the lot \n        size to expand the houses for growing families. Afew, asserting individuality, \n        are changing the exterior style of their homes. Roger \n            and Amy Tabor front yard. Adrive through \n      the grid of tree-lined streets elicits a time-warp feeling and reveals a \n      striking variety of well-kept dwellings. Some still have the early wood \n      shake or white stone roofs, others the more modern tile or asphalt. Some \n      homes still have carports; at others, the homeowners have enclosed them \n      as garages or incorporated them into the living quarters, then built new \n      carports or garages. For new buyers, among the first things to go are the \n      '70s period details. \"The avocado carpeting, the turquoise and gold appliances--they \n      just don't cut it anymore,\" Zois says. The \n        rejuvenation of McNeil may have begun as early as 1985, when newlyweds \n        Bob and Mary Apple purchased a brown ranch-style house on Strong Drive. \n        They had often jogged through the neighborhood in search of the right \n        place. What they found was a 1962-vintage home with an interior that had \n        been \"upgraded\" to 1970s corkboard and shag carpeting. The roof was still \n        wood shakes. \"They needed repair,\" says Bob Apple, a local attorney, \"but \n        Iwanted to wait and replace them with red tile as part of a major remodel. \n        So Iwould go up and staple visqueen on it during the rains.\" The \n            home of Bob and Mary Apple was one of the earliest renovations. Aself-described \n      \"weekend warrior,\" he set to work on minor projects: moving walls, enclosing \n      the patio, vaulting a ceiling, remodeling the kitchen. (\"Since my wife is \n      an artist, Ihad to change the window in the kitchen three or four times.\") \n      The major project came in 1992, when the ranch was completely transformed \n      into a lovely Spanish-style house, inspired by the architecture of Santa \n      Barbara. The tile roof covered an added 1,000 square feet, including a new \n      master bedroom and bath. Apple also built a bell tower and removed the curved \n      driveway so he could convert the front yard into an enclosed courtyard. Down a couple \n        of houses and across the street, a bright white picket fence encircles \n        the Cape Cod home of Bill and Heather Coulthard. Bill had grown up in \n        the nearby Rancho Circle area, and the couple had tried life in a new \n        country club community in the far northwest. They found that the commute \n        (to Bill's law offices on Howard Hughes Parkway) was \"not very nice,\" \n        that the houses \"all look alike,\" and they missed sidewalks. \"In the newer \n        neighborhoods you end up walking in the streets,\" Heather says. So they \n        moved to McNeil in 1992. \"Here there is a lot of activity--kids riding \n        bikes, people walking their dogs, mothers with strollers in the mornings.\" The \n        previous owner had converted the attic of the bungalow to living space, \n        but the home was a real patchwork, Heather says. \"There were 17 different \n        floor coverings. The family room had been the garage, the bar had been \n        the patio.\" First, they gutted the kitchen and laundry area: out with \n        four layers of wallpaper, pink formica counters and 40-year-old appliances. \n        Project number two, completed this year, meant re-doing the family room \n        so they could enjoy time with their two young children. And they added \n        the white picket fence. The contractor \n        for Coulthard's projects was Tom DeBoard, who has found work in the McNeil \n        neighborhood to be a budding subspecialty. He's done more than a half-dozen \n        remodeling and retrofitting projects there in four years. \"These people \n        have looked at new houses,\" he explains, \"and for comparable footage they're \n        getting a better deal here.\" He's been modernizing, updating kitchens \n        and baths, and, especially, enlarging. \"They want more space,\" he says. \n        \"And they are absolutely opening the spaces more and lightening them.\" DeBoard \n        has just opened up the kitchen in the home owned by Roger Tabor and his \n        wife, Amy. It's the latest of their three projects since buying the ranch \n        on Ashby nine years ago. The kitchen/family area, Amy says, had \"carpeting \n        coming up over a bench and table, and a fake fireplace with plastic logs \n        and a red light.\" Now a sleek and efficient culinary island overlooks \n        the great room--where the three children can watch a G-gauge train circle \n        the perimeter on a ledge below the raised ceiling. Built in \n        1954 with 1,200 square feet on a huge corner lot, the house has maintained \n        its ranch character while climbing to nearly 5,000 square feet. Amajor \n        expansion four years ago provided a three-bedroom wing for the children, \n        as well as a high-ceilinged greenery-and-glass master bath that segues \n        to a yard of lush foliage, pool and entertainment area with built-in grill. Roger, \n        an investment adviser, has pondered the financial end of their plan: buy \n        relatively inexpensively, upgrade and enlarge as family needs grow. The \n        total investment may or may not be reflected in the new market value, \n        but it will be close. Meanwhile, the intangibles--quality of life, the \n        community--make it worthwhile. \"Instead of spending all kinds of money \n        on commissions and costs while buying and selling as you move up, you \n        can grow with the house,\" Roger says. \"We've saved a lot of money.\" Roger lives \n        a stone's throw from where he was raised. \"Alot of the kids are coming \n        back,\" says his mother, Irene. \"Our daughter is back now, too, and several \n        of Roger's friends.\" Amy quickly names about 10 couples in the area who \n        live in homes that once belonged to a parent. Mark Stewart, \n        one of Roger's childhood chums, bought a 1959-vintage ranch house on Strong \n        Drive five years ago, and soon spent time and money redecorating. Gone \n        is the dark paneling and wallpaper; in is a lighter, \"cleaner\" decor. \n        Now he's wrestling with a major project, or perhaps a string of them. \n        \"What I'm about to do, I've wanted to do for some time,\" says the certified \n        public accountant. \"But it's a balancing act--how much to do, at what \n        cost, when.\" The \n            living room of the Apple residence, above, offers a perfect spot to \n            while away a lazy afternoon. Working within \n      the 2,700 square feet of his house, Stewart plans to address a few problems. \n      Because the only bathrooms are in the sleeping area, he will convert utility \n      space into a privy and shower near the family room. Because he has no formal \n      dining area, part of the living room will be reconfigured into one. Because \n      he likes wine, the old carport--which has already been converted into a \n      garage, and then a laundry room--will be insulated and air-conditioned to \n      accommodate a \"wine cellar.\" And because he has modern tastes, the formica \n      countertop and gold sliding-door shelves will be removed from the bar area/family \n      room. Then there's \n        the kitchen, a wonderful old galley with birch cabinetry. He plans to \n        conceal the kitchen from the front entry, open it up to the rest of the \n        house, refinish the cabinets and add new countertops, wood flooring and \n        appliances. After that \n        on Stewart's list: the back yard--add a built-in grill, change the dog \n        run to a greenhouse. It is evident that he has caught the contagious excitement \n        of creating something new within the old. \"Ihave a lot of respect for \n        the old neighborhood,\" Stewart says. The \n            Coulthard's new family room, top, becomes a son room when young Lane \n            Coulthard drops in to mix it up with Oscar, the family pooch. There are still \n      old-timers like Bob and Bobby Johnston, who built their house on Strong \n      Drive in 1962. Bob has noticed changes in recent years, with some of the \n      original residents selling and moving to condos. They, too, have thought \n      about moving, maybe to Summerlin. \"But it would just be too far away,\" Bob \n      says. Besides, \"now there are a lot of young children here. That's good. \n      It's very good to have the families here.\" And the \n        next generation is on the move. \"We recruit people,\" Stewart says. \"If \n        something comes up for sale, we talk to our friends.\" The Tabors hosted \n        a Christmas party last year and, Roger says, \"the next day, four couples \n        were driving through the neighborhood looking--and two ended up buying.\" Many are \n        returning to their old stomping grounds, but word may be getting out to \n        Valley newcomers as well. Bob and Marta Winner--he's a Nebraskan, she's \n        from Holland--bought a new tract home on their arrival in 1993. But last \n        year they moved to Strong Drive and have set Tom DeBoard to work adapting \n        the home for their three kids. \"You could \n        buy a nice home in Summerlin for what we are spending to buy old and remodel,\" \n        Marta says. \"But the important thing is the convenience of the location, \n        the kids going to the same school with our friends' kids--and the neighborhood.\" * Bill \n        and Heather Coulthard have the ideal picket fence around their nice Cape \n        Cod number, above. Roger and Amy Tabor have equally pleasant grounds in \n        their back yard (opposite, top left) and out front (top right). The home \n        of Bob and Mary Apple (opposite below) was one of the earliest renovations. Nerve-soothing \n        time in her renovated master bathroom is one of the quality-of-life intangibles \n        that endeared McNeil to Amy Tabor. The striking living room below has \n        a similar effect on the Coulthards. The kitchen and dining area offers \n        plenty of room for Marta and Quinn Winner to gab with friends Sue and \n        Ally Gordon (opposite right). The \n        living room of the Apple residence, above, offers a perfect spot to while \n        away a lazy afternoon. The Coulthard's new family room, top, becomes a \n        son room when young Lane Coulthard drops in to mix it up with Oscar, the \n        family pooch. Building \n        History Aclassic neighborhood was born of free lots, good \n        deals and close ties This \n            would be the \"before\" picture: The Apple residence prior to renovation. The \n        McNeil neighborhood's street names are reminders of Las Vegas history: \n        Cashman (businessman, civic leader), Cahlan (founder / editor of the Las \n        Vegas Review-Journal ), Ashby (Union Pacific president), Campbell (realtor/developer). \n        Then there's Mason, named after a supervisor for the McNeil Construction \n        Company, which built the Basic Magnesium plant, the original Basic Townsite \n        neighborhood (later incorporated as Henderson) and the Huntridge Addition \n        surrounding Maryland Parkway. Larry \n        McNeil platted his new development in the no-man's land west of the Union \n        Pacific property and southeast of the springs in 1947. According to Frank \n        Wright of the Nevada State Museum and Historical Society, the first model \n        opened in 1949, and UP executive Frank Strong moved in (presumably on \n        the street named for him) soon after. Miriam \n        Belmont was secretary to the president of Bonanza Airlines, Edmund Converse, \n        at the time. \"One evening we were having a company party and Larry (also \n        a Bonanza board member) wasn't too happy because there was no action in \n        the tract,\" she recalls. \"We were all young--pilots, mechanics, office \n        people. Larry said that the first couple that had a baby in the group \n        would get a free lot, and any of the rest of us would get 25 percent off \n        if we would build a home within a year. Turned out that the Halls were \n        already pregnant.\" Richard Hall, Bonanza's chief pilot, was quick to take \n        the offer. So did Miriam and her husband, Edwin, an insurance adjustor \n        and later investigator for the Gaming Control Board. The \n        Belmonts paid a discounted $1,250 for one of the smaller lots, just under \n        a half acre. In early 1950 they moved into their new $10,000 ranch house \n        on Campbell. \"The minimum size required was 1,250 square feet, and that's \n        what we built,\" she says. Over the years, as their family grew, three \n        major add-ons more than doubled its size. The \n        original McNeil tract was modest, from Charleston to Ashby and Strong \n        to Cashman. The kids would go out the door and into the desert to hunt \n        jackrabbits, chipmunks and snakes, Belmont recalls. \"My mother asked, \n        'Why did you buy that lot way out there? You will never have any neighbors.'\" \n        But, later in the '50s, McNeil built luxury-type spec houses on the large \n        lots of Ashby, and the neighborhood blossomed. \"We thought it was an address \n        we could really be proud of,\" Belmont says, \"and it never changed.\" Over the years, several builders created a variety of housing within seven \n        different subdivisions. Fred and Irene Tabor bought their home on Mason \n        in 1957, a custom-built four-bedroom, two-bath for $36,500. He was a stage \n        electrician and she \"worked wardrobe.\" During their stay in McNeil, they \n        came to own and operate the Chevron station at Charleston and Rancho, \n        Downtown's El Portal Theater and two drive-in theaters. Others \n        followed. Bob Johnston, who owned Las Vegas Furniture and then the House \n        of Lamps, had his house on Strong built in 1962. Notables such as entertainer \n        Sonny King and longtime school superintendent Guild Gray were early residents. Miriam \n        Belmont stayed for 45 years. The Tabors tried retirement in California \n        but returned. Bob Johnston and wife Bobby are still there. \"It was the \n        first upgraded neighborhood west of the railroad tracks,\" he says, \"and \n        the neighborhood has remained good forever.\" Back to the top of this page."
    }
  ]
}