{
  "url": "http://www.manchesteronline.co.uk/news/s/125/125550_mps_quizzed_on_metrolink_snub.html",
  "file_number": "556",
  "content_hash": "14eebfbbc31ea7a27b7c4b593203fbf70be85a299dd77720f2f29ec791e6916d",
  "total_blocks": 180,
  "retained_blocks": 19,
  "ignored_blocks": 161,
  "blocks": [
    {
      "tag": "div",
      "text": "upper header start Take me to... upper header end header bar start This site The web men search <input type=\"submit\" name=\"submit\" value=\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\" class=\"infoseeksubmit\" /> Site map : FREE web feed header bar end : Bookmark News nav column start Manchester Evening News News Education Health Technology Showbiz User Comments Your Pictures Manchester Bomb Shipman Archive News Archive News Sport Football Entertainment Business Jobs Personal Finance Blogs Photo Galleries Postbag In Touch Crossword Audio & Video Dating About Us Contact Us Manchester Online Health and Beauty Advertise A Job CV-Station Homes Food & Drink Holidays Motors Classifieds The Cloud Wi-Fi Bingo IQ Tests Family Notices Public Transport Hotels Dating Mancunians Build A Site Tourist Guide Local Press Weather Online Shop Advertising Broadband Manchester United Rental Property Driving Experience Holiday Rentals Hotels in Manchester"
    },
    {
      "tag": "p",
      "text": "Search the Web"
    },
    {
      "tag": "div",
      "text": "include virtual=\"/ssi/google120x600.txt\" nav column end home > news columnone content start Email to a Friend | Your comments Friday, 30th July 2004"
    },
    {
      "tag": "h4",
      "text": "MPs quizzed on Metrolink snub"
    },
    {
      "tag": "div",
      "text": "ON HOLIDAY: Ian McCartney"
    },
    {
      "tag": "p",
      "text": "Tony Lloyd, Labour, Manchester Central: \"I hope the transport secretary understands Greater Manchester expects him to return with proposals, and to ensure our conurbation has the Metrolink it badly needs.\" Spokeswoman for Ian McCartney, Labour, Makerfield (Labour Party chairman): \"We cannot contact him as he is on holiday.\" Ian Stewart, Labour, Eccles: \"I will support the M.E.N. campaign. I and other MPs from Greater Manchester have been working very hard on the development of Metrolink.\" Graham Stringer, Labour, Blackley: \"I won't accept this decision. It is fundamental to the future economic health of Manchester that we have the extension to the tram system.\" Andrew Stunell, Liberal Democrat, Hazel Grove: \"If the government is serious about reducing congestion and improving public transport, they must rethink this appalling decision.\" David Crausby, Labour, Bolton North East MP: \"I am always concerned about money being spent in London when the north west is in dire need. I am disappointed that the Metrolink will not be extended as I would like to see it in Bolton.\" Brian Iddon, Labour, Bolton South East : \"Bolton would not be directly affected by the expansion but I am disappointed. Passengers and Manchester Airport will suffer as the airport links were essential.\""
    },
    {
      "tag": "div",
      "text": "DISAPPOINTED: Ann Coffey"
    },
    {
      "tag": "p",
      "text": "Spokeswoman for David Chaytor, Labour, Bury North : \"He is on holiday and we cannot get hold of him.\" Spokeswoman for Hazel Blears, Labour, Salford (Home Office minister). The M.E.N. called both her constituency office and the Home Office after parliament's recess: \"We cannot comment because she is on holiday but she will comment next week.\" Spokesperson for Andrew Burnham, Labour, Leigh: \"He has only just gone on holiday.\" Spokesman for Gerald Kaufman, Labour, Gorton. The M.E.N. had tried to contact him for comment last week before Parliament's summer recess: \"He cannot be contacted because he is in Canada.\" James Purnell, Labour, Stalybridge and Hyde: \"A lot of money has been spent already. I am disappointed but the door is not closed yet. Hopefully we will see some progress by autumn.\" Ruth Kelly, Labour, MP Bolton West (treasury minister): \"I have written to Mr Darling outlining the implications of this decision. I am working with my parliamentary colleagues in Greater Manchester to highlight the benefits.\" Ann Coffey, Labour, Stockport (PPS to Alistair Darling): \"It is disappointing. It is in all our interests to control costs. The losers from a failure to do so are the taxpayer and public services. I will continue to give Metrolink wholehearted support.\""
    },
    {
      "tag": "div",
      "text": "SUPPORTER: Graham Brady"
    },
    {
      "tag": "p",
      "text": "Patsy Calton, Liberal Democrat, Cheadle: \"We have got to get it back on track. We can't allow it to disappear. It seems everybody I speak to in Stockport catches the train into Manchester so they can get on the tram.\" Graham Brady, Conservative, Altrincham and Sale West: \"I am a great supporter of Metrolink. The Conservatives have both backed Metrolink and delivered when we were in control. The extension would clearly be advantageous to Greater Manchester.\" Terry Lewis, Labour, Worsley: \"This is an enormous setback for the north west region. It was announced on the same day as the £10bn Crossrail project in London - it's typical of the way the north west is ruled by the London elite.\" Phil Woolas, MP for Oldham East and Saddleworth and deputy leader of the House of Commons: \"We are not giving up on this, far from it.\" Michael Meacher, Labour, Oldham West and Royton: \"I think this a serious drawback and I am determined to get it re-instituted as quickly as possible. I do understand the concerns about cost.\" Paul Goggins, Labour, Wythenshawe and Sale East (prisons minister): \"As a minister I am unable to sign up formally to a campaign that seeks to change government policy. But I will do everything I can to keep this project firmly on the government's agenda.\" Lorna Fitzsimons, Labour, Rochdale: \"My reaction is one of huge disappointment. We see the Metrolink expansion as hugely important to Rochdale and Oldham, both in terms of their economy and regeneration.\""
    },
    {
      "tag": "div",
      "text": "ESSENTIAL: Bev Hughes"
    },
    {
      "tag": "p",
      "text": "Jim Dobbin, MP for Heywood and Middleton: \"I very much support the campaign. The more opinion formers we have the better and that includes the Manchester Evening News.\" Keith Bradley, Labour, Manchester Withington: \"There will be huge disappointment in South Manchester because of yet another delay in bringing Metrolink extensions through to my constituency and to Manchester Airport.\" Beverley Hughes, Labour MP for Stretford and Urmston: \"The extension is essential and should go ahead. Metrolink is a really crucial part of Greater Manchester's economic development.\" Andrew Bennett, Labour, Denton and Reddish: \"I am utterly disgusted. It's another example of the way people of London and the south east get resources. We need to look at new ways of funding this project including congestion charging.\" David Heyes, Labour, Ashton-under-Lyne: \"It's a double blow for me and my constituents as two lines would have run through Ashton. I am seeking an urgent meeting with Mr Darling. I will carry on fighting.\" Ivan Lewis, Labour, Bury South, Minister for Skills and Vocational Education: I endorse other MPs and I going back to the Department of Transport and getting them to think again . . . we all need to work together.\" Submit your comments"
    },
    {
      "tag": "div",
      "text": "columnone content end columtwo content start"
    },
    {
      "tag": "h5",
      "text": "Current headlines"
    },
    {
      "tag": "div",
      "text": "Parents launch fund for murdered woman Thousand gather for Boxing Day hunts Half of us ditch New Year's Resolutions Sex does matter at the sales Kylie's top role model for 2006 Gym for mates as well as health Poisoned spy's contact arrested Snow no show Queen praises courage of armed forces Police appeal after man raped Bishop enters veil row Bus fleet banned from city's roads The £1m bill for a bright Christmas Reunited - couple forced to live in separate homes Airport cheer for the festive jet-setters Shameless star Jody is arrested in drugs raid Christmas dinner takes you round the world Homeless helpers still need cash and food Lads lift the Premiership Winter springs a floral surprise in the garden columntwo content end right hand column start"
    },
    {
      "tag": "p",
      "text": "FINANCIAL CONTROLLER Manchester Click Here Customer Services Advisers British Gas Click Here Finance Assistant/Analyst Rochdale Click Here Security Guards Manchester Click Here"
    },
    {
      "tag": "div",
      "text": "Late Rooms"
    },
    {
      "tag": "p",
      "text": "Palace Hotel - 4* Manchester Tue 26th Dec - £79.00 (save 32%) Wed 27th Dec - £79.00 (save 32%) Thu 28th Dec - £79.00 (save 32%) The Midland - A QHotel - 4* Manchester Tue 26th Dec - £78.00 (save 20%) Wed 27th Dec - £78.00 (save 20%) Thu 28th Dec - £78.00 (save 20%) Express by Holiday Inn Manchester Salford Quays - 3* Manchester (Salford Quays) Tue 26th Dec - £79.00 (save Infinity%) Wed 27th Dec - £79.00 (save Infinity%) Thu 28th Dec - £79.00 (save Infinity%) Urban City Apartments - Royal Mills - 4* Manchester Tue 26th Dec - £125.00 (save 50%) Wed 27th Dec - £125.00 (save 50%) Thu 28th Dec - £125.00 (save 50%)"
    },
    {
      "tag": "div",
      "text": "right hand column end This site The web men search <input type=\"submit\" name=\"submit\" value=\"&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\" class=\"infoseeksubmit\" /> footer start Home | About Us | Advertise With Us | Site Map | Contact Us Audio & Video . Business . Crossword . Entertainment . Football . In Touch . Kilimanjaro 2005 . News . Personal Finance . Photo Galleries . Postbag . Sport . Blogs .\n<a href=\"/healthandbeauty/\">Health&nbsp;&amp;&nbsp;Beauty</a>\n.\n<a href=\"/jobs/\">Jobs</a>\n.\n<a href=\"/cars/\">Cars</a>\n.\n<a href=\"/homesearch/\">Home&nbsp;Search</a>\n.\n<a href=\"/classifieds/\">Classifieds</a>\n.\n<a href=\"/publictransport/\">Public&nbsp;Transport</a>\n.\n<a href=\"/competitions/\">Competitions</a>\n.\n<a href=\"/accommodation/\">Hotels</a>\n.\n<a href=\"/food/\">Food&nbsp;&amp;&nbsp;Drink</a>\n.\n<a href=\"/dating/\">Dating</a>\n.\n<a href=\"/mancunian/\">Mancunians</a>\n.\n<a href=\"http://www.mymanchesteronline.co.uk/\" target=\"_blank\">Build&nbsp;A&nbsp;Site</a>\n.\n<a href=\"/tourist/\">Tourist&nbsp;Guide</a>\n.\n<a href=\"/newspapers/\">Local&nbsp;Press</a>\n.\n<a href=\"/weather/\">Weather</a>\n.\n<a href=\"/shopping/\">Online&nbsp;Shop</a>\n.\n<a href=\"/travel/\">Travel</a> © Copyright 2006 Manchester Evening News . footer end Sublime Media Tag for manchesteronline_couk(Place within the HEAD tags only)"
    }
  ]
}