{
  "url": "http://www.mercycorps.org/items/1150/",
  "content_hash": "99e6b1418ff5642ac50edffa0e5f4dec11ddd4a2caf4e980fe927121d5e6b430",
  "total_blocks": 807,
  "retained_blocks": 10,
  "ignored_blocks": 797,
  "blocks": [
    {
      "tag": "div",
      "text": "Mercy Corps delivers water containers and tarps on Somalia-Kenya border Relief team distributes critical supplies to war-affected families Read More > Mercy Corps Be the Change UNIVERSAL NAVIGATION United Kingdom Home HOME SEARCH Close X Select Country - Afghanistan Azerbaijan Bosnia and Herzegovina China Colombia East Timor Eritrea Ethiopia Georgia Guatemala Honduras India Indonesia Iran Jordan Kiribati Kosovo Kyrgyzstan Lebanon Liberia Mongolia Nepal Nicaragua Niger North Korea Pakistan Serbia Somalia Sri Lanka Sudan Tajikistan Uganda United States Uzbekistan West Bank/Gaza Zimbabwe and/or Select Topic - Agriculture Children Civil Society Econ Development Education Emergencies Health HIV/AIDS Hunger/Nutrition Hurricane Katrina Peaceful Change Sports Tsunami Water Women and/or Keywords EMAIL UPDATES CONTACT LOCATIONS Close X Select Location - Greater China United Kingdom United States Pages for - Grantmakers Journalists Job Seekers Community Groups MAIN NAVIGATION DONATE DONATE DONATE Monthly Giving Tax Wise Giving Legacies Community Fundraising Matching Gifts Share Your Shares So Many Ways to Give GET INVOLVED GET INVOLVED GET INVOLVED Advocacy Companies Events Grantmakers Individuals Teaching & Learning Volunteering TOPICS TOPICS TOPICS Agriculture Children Civil Society Economic Development Education Emergencies Health HIV/AIDS Hunger/Nutrition Hurricane Katrina Peaceful Change Sports Tsunami Water Women ABOUT US ABOUT US ABOUT US Jobs Overview Global Headquarters Leadership Partners Press Room COUNTRIES COUNTRIES COUNTRIES Afghanistan Indonesia North Korea Azerbaijan Iran Pakistan Bosnia and Herzegovina Jordan Serbia China Kiribati Somalia Colombia Kosovo Sri Lanka East Timor Kyrgyzstan Sudan Eritrea Lebanon Tajikistan Ethiopia Liberia Uganda Georgia Mongolia United States Guatemala Nepal Uzbekistan Honduras Nicaragua West Bank/ Gaza India Niger Zimbabwe MAINNAV BACKGROUND PRIMARY CONTENT FOCUS FOCUS Photo: Thatcher Cook for Mercy Corps Photo: Thatcher Cook for Mercy Corps"
    },
    {
      "tag": "h1",
      "text": "One night in Ogonyo"
    },
    {
      "tag": "p",
      "text": "Over the past two decades, Uganda's civil war has forced hundreds of thousands of families into miserable camps. Now, buoyed by recent peace talks, many are clustering into less-cramped \"return camps.\" Senior writer Roger Burks spent a night alongside displaced families in one of these makeshift villages, Ogonyo, where Mercy Corps is helping residents support themselves while they await the day they can return home."
    },
    {
      "tag": "div",
      "text": "Learn more > SPOTLIGHT <table cellpadding='0' cellspacing='0' border='0' width='234'>\r\n <tr>\r\n  <td>\r\n   <a href='/aboutus/overview/784'><img src='/images/home/spotlight/spotlight_bethechange.gif' width='243' height='30' border='0'></a></td>\r\n </tr>\r\n <tr>\r\n  <td style='padding: 0 0 0 20px; font-size: 12px; line-height: 14px; background-image: url(\"/images/home/spotlight/spotlight_middle.gif\")'>\r\n <a href='/aboutus/overview/784'><img style=\"padding: 0 4px 0 0\" src=\"/images/home/ETSpotlight1.jpg\" border=0 height=\"92\" width=\"66\" align='right'></a>Mercy Corps works every day to unleash the power and potential of people who can win against impossible odds.<br><a href='/aboutus/overview/784'>See the Video ></a></td>\r\n </tr>\r\n <tr>\r\n  <td>\r\n   <img src='/images/home/spotlight/spotlight_bottom.gif' width='243' height='8' border='0'></td>\r\n </tr>\r\n</table> BLUE DONATION BOX </td> Programme/Issue Where Most Needed Emergency Response Fund Children in War Zones Pakistan Earthquake Tsunami Rebuilding Lebanon Crisis Gaza Crisis Employee Capacity Fund Amount (Pounds Sterling) £ HOMEPAGE STORIES <table cellpadding='0' cellspacing='0' border='0' bgcolor='#DBDAC2' width='470'>\r\n<tr>\r\n  <td bgcolor='#36301C'>\r\n   <img src='/images/home/bars/bar28.gif' alt='United States' width='156' height='11' border='0'></td>\r\n</tr>\r\n<tr>\r\n  <td bgcolor='#D3CCAE'>\r\n   <img src='/images/spacer.gif' alt='' width='156' height='1' border='0'></td>\r\n</tr>\r\n<tr>\r\n  <td bgcolor='#5B502D'>\r\n   <img src='/images/home/bars/bar114.gif' alt='' width='156' height='11' border='0'></td>\r\n</tr>\r\n<tr>\r\n  <td id='homepage_story'>\r\n<table cellpadding='0' cellspacing='0' border='0'>\r\n<tr>\r\n  <td valign='top' style='padding: 2px 0 0 0'>\r\n   <a href='/countries/unitedstates/1544'><img src='/photos/photo1157754877.jpg' width='210' height='140' border=''0\" alt=\"Michael Stipe\"></a></td>\r\n  <td>\r\n   <img src='/images/spacer.gif' alt='' width='10' height='1' border='0'></td>\r\n  <td>\r\n   <span id='homepage_story_2'><a href='/countries/unitedstates/1544'>Q&A: R.E.M. Frontman Michael Stipe</a></span>\r\n    <p>Hurricane Katrina deeply shook Michael Stipe - and he saw a need to help. Since then, he has been an ardent supporter of our programmes to help hurricane survivors, a champion for rebuilding Gulf Coast communities and a clear voice of action.</p>\r\n<p><a href=\"/countries/unitedstates/1544\">Learn more &gt;</a></p></td>\r\n</tr>\r\n</table></td>\r\n</tr>\r\n</table> Behind the Horn of Africa's Brewing Storm"
    },
    {
      "tag": "p",
      "text": "Randy Martin, director of Global Emergency Operations, discusses the worsening conditions on the Kenya-Somalia border, where Mercy Corps is delivering critical supplies amid the growing concerns of a regional war."
    },
    {
      "tag": "div",
      "text": "Read more > Tsunami: Two Years Later"
    },
    {
      "tag": "p",
      "text": "Mercy Corps is helping communities in tsunami-affected areas of Indonesia. Since December 2004, we've assisted more than 1 million survivors with innovative programmes designed to \"build back better.\""
    },
    {
      "tag": "div",
      "text": "Read more > Holiday Shopping Made Easy"
    },
    {
      "tag": "p",
      "text": "We would like to introduce our new online shop, which features Christmas cards, decorations and calendars.  Your holiday purchases help us fund critical projects in more than 35 countries around the world."
    },
    {
      "tag": "div",
      "text": "Read more > Panda Completes 9,000 Mile Rally BBC News, 30 August 2006 After Katrina, Mercy Corps Finds Willing Allies: The Locals The Oregonian, 25 August 2006 Plan for Rally to Mark Success of Historic Anti-Poverty March The Scotsman, 20 June 2006 FOOTER Efficiency Commitment High-Value Over the last five years, more than 90% of resources allocated directly to programmes. \"Mercy Corps finds lasting solutions in poor and war-damaged countries long after the media spotlight has moved on.  I applaud their commitment.\" - Martin Bell Every pound you give helps us secure 11.30 in donated food and other critical supplies. 17 Claremont Crescent -  Dept W - Edinburgh - UK - EH7 4HX Copyright © 2006 Mercy Corps Privacy Policy"
    }
  ]
}