{
  "url": "http://www.military.com/NewContent/0,13190,Smith_051905,00.html",
  "content_hash": "6e5ea27ab5cf549fa9cd937230a6ab193cfa89fdcd628f161078caa27894a1a2",
  "total_blocks": 198,
  "retained_blocks": 9,
  "ignored_blocks": 189,
  "blocks": [
    {
      "tag": "div",
      "text": "Vignette V/5 Tue Dec 26 23:38:02 2006 htdig_noindex 2 center contents start SUB MENU START SUB MENU END New Top NavBar Page Header Banner Ad 468x60 Starts Banner Ad 468x60 Ends Page Header Main Contents Start Conner Blue Conner Blue /htdig_noindex Stew Smith: \n\n\n High Blood Sugar and Diabetes Email \n                    this page to friends RSS \nfeed About \n                            the Author"
    },
    {
      "tag": "p",
      "text": "Stew Smith is a graduate of the U.S. Naval Academy, \n                                      a former Navy SEAL, and author of several \n                                      fitness and self defense books such as The \n                                      Complete Guide to Navy SEAL Fitness , \n                                      and Maximum Fitness . As a military \n                                      fitness trainer, Stew has trained hundreds \n                                      of students for Navy SEAL, Special Forces, \n                                      Air Force PJ, Ranger Training, and other \n                                      physical law enforcement professions. His \n                                      eBooks at Military.com can help you achieve \n                                      your fitness goals, whether you're a beginner \n                                      or an expert. For more info \n                                      on his books, visit: Military.com \n                                      eBook Fitness Store View \n                                      the Smith Archives Email Stew Smith at stew@stewsmith.com . Visit Stew Smith's Official Website: www.stewsmith.com ."
    },
    {
      "tag": "div",
      "text": "Enter to Win the Ultimate Bodybuilding DVD Here's your chance to win the Bodybuilding: Passion - Pain - Perfection: The DVD Trilogy. Visit muscletech.com/DVD to get access to exclusive content and for Official Rules. Find your destiny among the world's greatest warriors. The Few. The Proud. Marines.com <table align=\"center\" width=\"95%\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#003366\" hspace=\"3\">\n                    <tr> \n                      <td> \n                       <table width=\"100%\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#FFFFFF\">\n                          <tr bgcolor=\"#FFFFCC\"> \n                            <td> <span class=\"standard-2\"><b>Thinking about Serving?</b><br>\n                              <br>\n                              <table align=\"center\" width=\"97%\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">\n                                <tr> \n                                  <td> <span class=\"standard-2\"> \n                                    <table width=\"90\" align=\"right\">\n                                      <tr> \n                                        <td align=\"right\"><img src=\"/pics/serve.jpg\"></td>\n                                      </tr>\n                                    </table>\n                                    <a href=\"https://secure.military.com/leads/Recruiting/RecruitingLeadForm1.jsp\">Get \n                                    the information you need</a> to decide if \n                                    a military career is right for you. No obligation \n                                    -- just free information from the branches \n                                    of service that interest you. <br>\n                                    <br>\n                                    </span> </td>\n                                </tr>\n                              </table>\n                              </span></td>\n                          </tr>\n                        </table>\n                      </td>\n                    </tr>\n                  </table><br>\n                  <table align=\"center\" width=\"95%\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#003366\" hspace=\"3\">\n                    <tr> \n                      <td> \n                        <table width=\"100%\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#FFFFFF\">\n                          <tr bgcolor=\"#FFFFFF\"> \n                            <td> <span class=\"standard-2\"><b>Joining the Military</b><br>\n                              <br>\n                              <table align=\"center\" width=\"97%\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">\n                                <tr> \n                                  <td> <span class=\"standard-2\"><a href=\"http://www.military.com/Recruiting/Content/0,13898,rec_splash,,00.html\">10 \n                                    Steps to Joining the Military</a><br>\n                                    <a href=\"https://secure.military.com/leads/Recruiting/RecruitingLeadForm1.jsp\">Contact \n                                    a Recruiter Now</a><br>\n                                    <a href=\"http://www.military.com/ASVAB\">Ace \n                                    the ASVAB</a><br>\n                                    <br>\n                                    </span> </td>\n                                </tr>\n                              </table>\n                              </span></td>\n                          </tr>\n                        </table>\n                      </td>\n                    </tr>\n                  </table> <table align=\"center\" width=\"256\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\" bgcolor=\"##003366\" hspace=\"3\">\n                    <tr> \n                      <td> \n                        <table width=\"100%\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">\n                          <td class=\"b-title\" align=\"center\" height=\"20\"><font color=\"#ffffff\">Get $985 a Month!</font></td>\n                          </tr>\n                        </table>\n                      </td>\n                    </tr>\n                  </table>\n                  <table align=\"center\" width=\"256\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#003366\" hspace=\"3\">\n                    <tr> \n                      <td> \n                        <table width=\"100%\" cellspacing=\"0\" cellpadding=\"2\" border=\"0\" bgcolor=\"#FFFFFF\">\n                          <tr bgcolor=\"#FFFFFF\"> \n                            <td> \n                              <table align=\"center\" width=\"97%\" cellspacing=\"0\" cellpadding=\"0\" border=\"0\">\n                                <tr> \n                                  <td class=\"standard-2\"><br>\n                                    Your service may have earned you great education benefits.  Get up to $985 per month to pay for your undergraduate, graduate or technical degree. <a href=\"http://www.military.com/Education/Lead1\"><br><br>Find out about military-friendly schools today</a>.<br>\n                                    <br>\n                                  </td>\n                                </tr>\n                              </table>\n                            </td>\n                          </tr>\n                        </table>\n                      </td>\n                    </tr>\n                  </table> Special 4th of July SALE!"
    },
    {
      "tag": "p",
      "text": "Until midnight of July 4th -- America's Independence Day -- the Military.com eBook Fitness Store will be offering ONE free eBook of your choice with ANY purchase. Do not purchase the one you wish to have for FREE, just place your added eBook in the comments section of your order form and Stew Smith will email you the FREE Workout. After last week's diet related article posted in the Military.com Newsletter, I received several emails about helping the reader repair their diet. There is a diet plan I refer people to  with a motivating and humorous picture as well as a free downloadable sample week of diet information. However, you should visit a registered dietician if you are severely overweight or pre-diabetic. Pre-diabetic refers to Type II diabetes and usually occurs in older and/or obese people who do not have to have a family history of diabetes. 80 percent of Type II diabetics are overweight. This type of diabetes can be prevented or significantly delayed by watching processed sugar intake and regular daily exercise. This week's question is related to the above paragraphs. The former Army soldier writes, My doctor says my blood sugar is too high and I have tried exercise, a no carbohydrate diet, and am having trouble keeping my blood sugar and my weight down. As you know, I am not a doctor. But there are still two areas you need to focus on. The fact that you stated your sentence in the past tense causes me to ask -- are you still exercising? Daily? For 45-60 minutes a day? And -- are you still watching your food intake? Because the only way you can have high blood sugar is IF you are eating foods or soft drinks or juices with sugar in them period . The exercise will allow you to burn the blood sugar before it has a chance to turn to fat and it will burn your stored fat as well, thus causing a weight loss. The two areas to focus on for at least 3-4 months faithfully are: Food intake - To control your high blood sugar you have to watch your intake of carbohydrates -- true -- but you do not have to eliminate them as required by the Atkin's Diet. High sugar sodas, fruit drinks, processed foods are bad, but carbohydrates in fruits, vegetables are good fuels sources for your body, so do not eliminate them from your diet. Just make sure you are exercising daily by simply walking, biking, do a superset of pushups and crunches. See the Article Archive for more ideas of daily routines."
    },
    {
      "tag": "div",
      "text": "Get Stew Smith as your personal online trainer! Check out Stew \n                  Smith's downloadable fitness eBooks , designed to help you \n                  pass PFT and to get you into the best shape of your life."
    },
    {
      "tag": "p",
      "text": "Exercise -- There are two types of exercise: Aerobic and Anaerobic . Aerobic means with oxygen and refers to exercise that maintains a level of activity capable of moving oxygen through your lungs, blood, heart and to your muscles. This is a great fat burning zone and requires you to keep your heart rate at 50-70 percent of max heart rate, which is theoretically (220 minus age). Keep it conversational pace, meaning be able to talk, but it is not that easy to talk and breathe regularly. Anaerobic means without oxygen and refers to exercise that causes the heart to race in the 70-90 percent of maximum heart rate and includes sprinting while running, biking, swimming, and even weight training or high repetition calisthenics exercises (resistance training). Your heart and lungs cannot keep up with the demand for oxygen your muscles are placing on them, so you will tire out fast but burn a significant amount of blood sugar (glycogen). So -- back to the Army soldier's question. Start Exercising Everyday NOW! Along with weight loss, your goal will be to begin program of physical activity, if you are not exercising regularly now. Why? Because physical activity will help you use the insulin you produce to convert the food you eat into energy. This will help keep your blood glucose lower. A great example -- it is always a good idea to follow a meal with a brisk walk. If you can make sure your exercise combines aerobic and anaerobic activity every day, then you will have a better chance of lowering your blood sugar. And you need make sure your refined sugar intake is limited."
    },
    {
      "tag": "div",
      "text": "The bad news is this. Many people with Type  II diabetes find that despite their best efforts, weight control, exercise and diet aren't enough to keep their blood sugars in a healthy range. One theory is that some people's insulin-producing cells just get tired out from having to produce more and more insulin because their cells are resistant to the effects of insulin. So, try to focus on the above recommendations for at least three months. Go to your doctor again, and talk about the possibilities of diabetes."
    },
    {
      "tag": "p",
      "text": "Email \n                    this page to friends RSS feed 2005 Stew Smith. All opinions expressed \n              in this article are the author's and do not necessarily reflect \n              those of Military.com."
    },
    {
      "tag": "div",
      "text": "End of table width=598 Main Contents End Right Navbar Starts Member Center FREE Newsletter Military Report Equipment Guides Installation Guides Military History Vert-banner ad 160x600 Right Navbar Ends center contents end START FOOTER Military.com | Newsletters | About Us | Press | Advertising | Affiliate Program | Work at Military.com Monster Network | Help & Feedback | Privacy Policy | User Agreement | Site Map | Veterans Day |    ©2006 Military Advantage"
    }
  ]
}