{
  "url": "http://www.momsview.com/discus/messages/23/13275.html",
  "file_number": "581",
  "content_hash": "76b51c35b747591b846ae7f2fda0f74ce0d5c6963182af5dc544636675f05510",
  "total_blocks": 119,
  "retained_blocks": 7,
  "ignored_blocks": 112,
  "blocks": [
    {
      "tag": "div",
      "text": "WARNING!  DO NOT EDIT THIS FILE BY HAND OR USING AN HTML EDITOR! Level 1: 18246/Archive January-June 2003 Level 2: 13275/DD &#34;Graduates&#34; from speech next week! <IMG SRC=\"http://www.momsview.com/discus/clipart/happy.gif\" ALT=\":&#41;\"> Me: 13275/DD &#34;Graduates&#34; from speech next week! <IMG SRC=\"http://www.momsview.com/discus/clipart/happy.gif\" ALT=\":&#41;\"> Owner: users Param: MessagesAdd Parent: 18246 Properties: icons=1;hidden=0 Topic: 23/Parenting Discussion Discussion Topics Last Day Last Week Tree View"
    },
    {
      "tag": "p",
      "text": "Search Board Keyword Search By Date Your Profile Post a Message Edit Profile Utilities Contact Administration Documentation Getting Started Formatting Troubleshooting Attention! YOU ARE NOT PERMITTED TO REMOVE THE FOLLOWING LINK.  Doing so\nis a violation of the Discus license agreement and may result in the loss of\nyour right to use Discus on your site. Program Credits End warning notice Coupons Best Coupons Freebie Newsletter! Coupons & Free Stuff"
    },
    {
      "tag": "div",
      "text": "Bigtitle DD \"Graduates\" from speech next week! /Bigtitle Navbar Moms View Message Board : Parenting Discussion : Archive January-June 2003 :\nDD \"Graduates\" from speech next week! /Navbar Announcement Off\n<HR> Announcement Source: /Announcement Sublist Off\n<HR>\n<UL>\n<!-EndSub-!>\n</UL> /Sublist Create Off\n<HR>\n<FORM ACTION=\"http://www.momsview.com/cgi-bin/discus/board-post-form.cgi\" METHOD=POST>\n<INPUT TYPE=HIDDEN NAME=HTTP_REFERER VALUE=\"//23/13275.html\">\n<CENTER><INPUT NAME=SUBMIT VALUE=\"Create New Conversation\" TYPE=SUBMIT></CENTER>\n</FORM> /Create About Off\n<HR> Source: /About Messages -Post: 63274-! -Time: 1051807017-! By -Email-! -/Email-! -Name-! Dana -/Name-! on Thursday, May 1, 2003 - 12:36 pm:"
    },
    {
      "tag": "p",
      "text": "-Text-! DD had her annual evaluation today.  She did GREAT!!!!!  She is smack right on target for her age.  She is not above or below, but right on target.  That is good enough for me!  I am so proud of her. Her teacher said we could let today be her last day or do next week.  Truth be known, I am so DONE with biweekly visits.  I asked DD if she wanted to come next week and work on /SH/ or be finished today.  She wanted to do one more week. We went across the street and bought two videos at the pawn shop to celebrate (they only cost $3 ea!) I am so proud and happy for her.  So glad we got her tonsils out.  Life is GOOD! -/Text-! -/Post: 63274-! -Post: 63282-! -Time: 1051808665-! By -Email-! -/Email-! -Name-! Trina -/Name-! on Thursday, May 1, 2003 - 01:04 pm: -Text-! YEAH!! After all you and A have been through, this is great news! My DD has made HUGE strides with her speech since starting therapy at 3, however I think she has at least another year to go. It has done her a world of good for her self confidence as well. She only goes once a week and loves her therapist. -/Text-! -/Post: 63282-! -Post: 63299-! -Time: 1051812479-! By -Email-! -/Email-! -Name-! Palmbchprincess -/Name-! on Thursday, May 1, 2003 - 02:07 pm: -Text-! WTG!!!!! I'm so happy for you both!!!! -/Text-! -/Post: 63299-! -Post: 63307-! -Time: 1051819957-! By -Email-! -/Email-! -Name-! Renee -/Name-! on Thursday, May 1, 2003 - 04:12 pm: -Text-! That is awesome news!!! Congrats to A! I can't wait for my dd to be done with hers. She has it 2x week in school and a double session at the hospital weekly. Its a pain. DS used to take speech but he caught up last fall and is to be re-evaluated this fall to see if he needs to restart again. I hope he doesnt have to because it is a lot of running around. -/Text-! -/Post: 63307-! -Post: 63314-! -Time: 1051824479-! By -Email-! -/Email-! -Name-! Feona -/Name-! on Thursday, May 1, 2003 - 05:27 pm: -Text-! Great news! -/Text-! -/Post: 63314-! -Post: 63315-! -Time: 1051826922-! By -Email-! -/Email-! -Name-! Karen55 -/Name-! on Thursday, May 1, 2003 - 06:08 pm: -Text-! WOO HOO!!!!!!!!!! Congratulations to A, I know you are thrilled!! -/Text-! -/Post: 63315-! -Post: 63335-! -Time: 1051834187-! By -Email-! -/Email-! -Name-! Semperspencer -/Name-! on Thursday, May 1, 2003 - 08:09 pm: -Text-! Big Hugs and Congratulations! -/Text-! -/Post: 63335-! -Post: 63341-! -Time: 1051838776-! By -Email-! -/Email-! -Name-! Mommyathome -/Name-! on Thursday, May 1, 2003 - 09:26 pm: -Text-! Congratulations to your DD!!!!! -/Text-! -/Post: 63341-! -Post: 63351-! -Time: 1051841606-! By -Email-! -/Email-! -Name-! Pamt -/Name-! on Thursday, May 1, 2003 - 10:13 pm: -Text-! Congrats!! Wonderful news Dana. I can assure that her speech therapist is just as excited. It is always a thrill to discharge a child who \"graduates\" because they are doing great (as opposed to those who move, quit coming, etc.)Kudos to both of you!! -/Text-! -/Post: 63351-! -Post: 63352-! -Time: 1051841835-! By -Email-! -/Email-! -Name-! Pamt -/Name-! on Thursday, May 1, 2003 - 10:17 pm: -Text-! P.S. Renee, as a therapist who works at an outpatient clinic at a hospital let me just tell you how highly you are esteemed by your DD's therapist(s). We all quickly get a feel for \"good parents\" (those who rarely miss appts., who follow through with the home program, are on time, etc.) and the not-so-good parents. We also realize what a huge sacrifice it is to haul your kid (usually with siblings in tow) to therapy twice a week and then sit and wait while entertaining bored kids in the waiting room while we work with your child. You are a jewel among moms! Hope your DD makes super fast progress!! ((Renee)) -/Text-! -/Post: 63352-! -Post: 63404-! -Time: 1051879541-! By -Email-! -/Email-! -Name-! Renee -/Name-! on Friday, May 2, 2003 - 08:45 am: -Text-! Pam, you made me chuckle. How in the world did you know by my lil comment that I always made sure she made it to speech, we're never late and practiced with her??? I thought for sure I came off pretty badly stating how much a pain it was. lol Actually, I'm not sure how long it will be before we are done. Out therapist hasn't yet determined if dd has apraxia yet. A lot leads to it but.. But she has made lots of improvement in the past 2 years. -/Text-! -/Post: 63404-! -Post: 63482-! -Time: 1051908839-! By -Email-! -/Email-! -Name-! Dana -/Name-! on Friday, May 2, 2003 - 04:53 pm: -Text-! Renee, what is apraxia? -/Text-! -/Post: 63482-! -Post: 63487-! -Time: 1051909996-! By -Email-! -/Email-! -Name-! Trina -/Name-! on Friday, May 2, 2003 - 05:13 pm: -Text-! Here you go, Dana. http://www.apraxia-kids.org/faqs/faq.html -/Text-! -/Post: 63487-! -Post: 63488-! -Time: 1051910206-! By -Email-! -/Email-! -Name-! Pamt -/Name-! on Friday, May 2, 2003 - 05:16 pm: -Text-! Dana, apraxia (a HUGE interest of mine!) is when a child is physically capable of making speech sounds in that there is no muscular problem, but they have difficulty sequencing the sounds of speech and stringing them together. For example, the child can produce /p/ and /t/ and even consonant-vowel syllables with these sounds like pea, poo, pah, tuh, tay, etc. But when the 2 syllables are combined, like in \"potty\" for example, the child might end up saying \"gahfee\". It is the same type of thing that happens if you try to say \"linoleum-linoleum-linoleum\" repeatedly very fast. Your mouth knows what to do, but the message gets short-circuited in between your brain planning the subtle fine motor speech movements and your mouth actually doing them. Apraxia results in poor articulation, but the errors are inconsistent and in no particularly pattern. Speech therapy to treat apraxia is very different than a traditional or a phonological approach to articulation. Renee, I'm very curious as to why they haven't yet determined if she has apraxia yet if she's already been in speech 2 years?? -/Text-! -/Post: 63488-! -Post: 63489-! -Time: 1051910704-! By -Email-! -/Email-! -Name-! Renee -/Name-! on Friday, May 2, 2003 - 05:25 pm: -Text-! Thanks for explaining Pam. I think one reason why its taking so long is that DD has behavoral problems that the therapist has been working on in addition to the speech.  I would love for them to dx it so that our insurance would cover it since its not covered at the moment. Plus dd has had problems with muscle movement  She just now is getting used to using her tongue correctly. Before therapy started, she would talk without moving her mouth and it looked and sounded like a person whose had a stroke. Even though our therapist is wonderful, it does leave me wondering now, why it isnt dx fully yet. hmmmmmmm... -/Text-! -/Post: 63489-! -Post: 63503-! -Time: 1051919046-! By -Email-! -/Email-! -Name-! Dana -/Name-! on Friday, May 2, 2003 - 07:44 pm: -Text-! hmm.  Amazing what all goes into speaking -/Text-! -/Post: 63503-! -End-! /Messages Add -Conversation - LEAVE THIS HERE!-!"
    },
    {
      "tag": "h3",
      "text": "Add a Message"
    },
    {
      "tag": "p",
      "text": "-Identification Tag - LEAVE THIS HERE-! This is a private posting area. A valid username and password combination is required to post messages to this discussion. Username: Password: -Anon-! Post as \"Anonymous\" -/Identification Tag - LEAVE THIS HERE-! /Add"
    },
    {
      "tag": "div",
      "text": "Message Source"
    }
  ]
}