{
  "url": "http://www.myeclipseide.com/PNphpBB2+file-viewtopic-t-75.html",
  "file_number": "592",
  "content_hash": "79be544a514bb1975704af13a1cf69e691f279e6e9547ee04bd45bf7fef345db",
  "total_blocks": 336,
  "retained_blocks": 3,
  "ignored_blocks": 333,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" MemberID: Password: Create a new account... Home | My Account | Download | Forums | Advanced Search | FAQ | Member Services | Payment Options | Contact Us 359763  Members 394  Users Online Main About MyEclipse (TM) Career Opportunities Enterprise Workbench Features Tutorials and Demos Road Map Documentation New and Noteworthy Partner Network MyEclipse Blog"
    },
    {
      "tag": "h4",
      "text": "As an Eclipse plugin , MyEclipse offers an end-to-end Integrated Development Environment (IDE) for Web , CSS , Javascript , J2EE, XML , JSP , struts , JSF and application server integration"
    },
    {
      "tag": "div",
      "text": "FAQ :: Search :: Register :: Profile :: Log in to check your private messages :: Watched Topics <a href=\"PNphpBB2+file-login.html\">Log in</a> Configuring Oracle and JBoss and My Eclipse overall <td class=\"gensmall\" align=\"right\" valign=\"bottom\"><a href=\"PNphpBB2+file-viewtopic-t-75-view-next.html\">View next topic</a><br />\n<a href=\"PNphpBB2+file-viewtopic-t-75-view-previous.html\">View previous topic</a><br />\n<a href=\"PNphpBB2+file-printview-t-75-start-0.html\" target=\"_blank\" title=\"Printable version\">Printable version</a><br />\n<br />\n<strong></strong><br />\n</td> MyEclipse Forum Index » Off Topic » Old Posts Author Message wk5657 Registered Member Joined: Jun 17, 2003 Posts: 88 Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=285#285\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 19, 2003 - 03:19 PM First, Overall configuration: If Ihave 2 workspaces in my environment and then install MyEclipse, one of them is never properly configured (and apparently can't be).  The Winddows->Preferences stuff is there, but there is no MyEclipse menu or toolbar entry and there is no launcher button. Next: JBoss and Oracle Creating a web project for standalone Ovacle (OC4J) has an assumed structure that is different from JBoss (at least).  The project template from J2EE in Myeclipse should be on the Server level (in my opinion) since the various app servers have such widely varying forms.  In addition, since at least JBoss (and probably WebLogic and WebSphere as well)  require additional xml files required to deploy to those environments, the templates should include those items in the structure (including empty defaults with appropriate dtd - at least referenced). Next: Shutdown does not work for Oracle.  Ican do it with admin.jar (so it is not horrible), but it is annoying to have to do it.  both userid and password are required to propeerly shutdown using admin.jar from Oracle.  The problem is that the hanging server instance for a new user makes the software look amateurish. Finally: Even if this stuff can't get in to the upcoming release, someone should spend a couple of hours writing something beyond the tiny bit that is written  here.  There is virtually nothing written about Oracle. Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod support-scott Moderator Joined: May 05, 2003 Posts: 6266 Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=288#288\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 19, 2003 - 11:14 PM Quote: The Winddows->Preferences stuff is there, but there is no MyEclipse menu or toolbar entry and there is no launcher button. If you've already customized the Java perspective, Eclipse won't respect our code's request to add the MyEclipse menu items.  You can add them manually by selecting all the MyEclipse options under Window->Customize Perspective->Other->MyEclipse*. Quote: Creating a web project for standalone Ovacle (OC4J) has an assumed structure that is different from JBoss (at least). The project template from J2EE in Myeclipse should be on the Server level (in my opinion) since the various app servers have such widely varying forms. Actually, the forms don't vary that much.  They all support WAR, EJB jar, and EAR formats in either an exploded or archive form.  JBoss is odd because it expects that exploded directories are suffixed with a .war or .ear or whatever.  However, we have compensated for this in the next release of Enterprise Workbench, which will be available on 6/23.  As far as custom descriptors go, we are rapidly moving in the direction of creating basic server-specific descriptors.  At present, this would best be handled as an enhancement request since we'll already honor any custom descriptors that you've written. Quote: Shutdown does not work for Oracle. Ican do it with admin.jar (so it is not horrible), but it is annoying to have to do it. both userid and password are required to propeerly shutdown using admin.jar from Oracle. True.  And the userid of 'admin' and the password you set in the configuration dialog are passed to Oracle for shutdown.  This works quite well in the default installation configuration.  Iassume you set a different administrator account than the default?  Would you like to propose an enhancement request that we also allow configuration of the admin account user name? Quote: Even if this stuff can't get in to the upcoming release, someone should spend a couple of hours writing something beyond the tiny bit that is written here. There is virtually nothing written about Oracle. We certainly agree.  However, since the software is in an Early Adopter release state, the documentation is very incomplete since we've concentrated on features over documentation at this pont.  Documentation will be one of the areas of concentration between EA2 and GA.  By the way, if you'd like to help out and write an Oracle tutorial, we'd be more than happy to incorporate it into the documentation.  Our consulting practice doesn't use Oracle 9i/AS that much so a tutorial from an expert would really be useful. --Scott MyEclipse Support Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod wk5657 Registered Member Joined: Jun 17, 2003 Posts: 88 Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=289#289\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 20, 2003 - 12:17 AM scott wrote: Quote: The Winddows->Preferences stuff is there, but there is no MyEclipse menu or toolbar entry and there is no launcher button. Quote: If you've already customized the Java perspective, Eclipse won't respect our code's request to add the MyEclipse menu items.  You can add them manually by selecting all the MyEclipse options under Window->Customize Perspective->Other->MyEclipse*. Actually, Ifound a post about this and was able to use the post after Isubmitted this message.  If someone could put this stuff in a searchable place, you would not have to answer it multiple times. Quote: Creating a web project for standalone Ovacle (OC4J) has an assumed structure that is different from JBoss (at least). The project template from J2EE in Myeclipse should be on the Server level (in my opinion) since the various app servers have such widely varying forms. Quote: Actually, the forms don't vary that much.  They all support WAR, EJB jar, and EAR formats in either an exploded or archive form.  JBoss is odd because it expects that exploded directories are suffixed with a .war or .ear or whatever.  However, we have compensated for this in the next release of Enterprise Workbench, which will be available on 6/23.  As far as custom descriptors go, we are rapidly moving in the direction of creating basic server-specific descriptors.  At present, this would best be handled as an enhancement request since we'll already honor any custom descriptors that you've written. Oracle wants an application.xml file in a META-INF at the top of the project.  It seems that JBoss is quite insistent on its jboss-xxx.xml (Oracle does not have that sort of thing).  My real goal is to have a project that Ican decide to test and deploy to multiple servers.  Ithink the spec is close to that kind of capability.  This kind of capability would put myeclipse head and shoulders above any other J2EE environment.  Iwill put something in enhancement request. Quote: Shutdown does not work for Oracle. Ican do it with admin.jar (so it is not horrible), but it is annoying to have to do it. both userid and password are required to propeerly shutdown using admin.jar from Oracle. Quote: True.  And the userid of 'admin' and the password you set in the configuration dialog are passed to Oracle for shutdown.  This works quite well in the default installation configuration.  Iassume you set a different administrator account than the default?  Would you like to propose an enhancement request that we also allow configuration of the admin account user name? Idid not change the account from admin.  It just did not work.  When Icould not make it work, Idid change the password to something (the default in the Oracle download is \"\" and so Iactually put something there and set it in the server dialog in myecliipse, but to no avail. Quote: Even if this stuff can't get in to the upcoming release, someone should spend a couple of hours writing something beyond the tiny bit that is written here. There is virtually nothing written about Oracle. Quote: We certainly agree.  However, since the software is in an Early Adopter release state, the documentation is very incomplete since we've concentrated on features over documentation at this pont.  Documentation will be one of the areas of concentration between EA2 and GA.  By the way, if you'd like to help out and write an Oracle tutorial, we'd be more than happy to incorporate it into the documentation.  Our consulting practice doesn't use Oracle 9i/AS that much so a tutorial from an expert would really be useful. --Scott MyEclipse Support Icertainly do not, by these comments, mean to denigrate the effort you have put in here.  Iam very pleased and encouraged.  This is a fine piece of work that IBM or Oracle or BEA would charge thousands for with much  less capability (especially for multiple deployments).  Thank you for this effort and for its afforability. Wayne Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod support-scott Moderator Joined: May 05, 2003 Posts: 6266 Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=290#290\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 20, 2003 - 10:15 AM Wayne, Quote: Actually, Ifound a post about this and was able to use the post after Isubmitted this message. Good to hear you're up and running. Quote: If someone could put this stuff in a searchable place, you would not have to answer it multiple times. Acutally, the forums are searchable and there is a link labeled 'Search' just stays just above the forum title / or message title, depending on which level you're looking at.  In any event, it's below the main \"link bar\" whenever you're in the Forums area. Quote: Oracle wants an application.xml file in a META-INF at the top of the project. It seems that JBoss is quite insistent on its jboss-xxx.xml (Oracle does not have that sort of thing). My real goal is to have a project that Ican decide to test and deploy to multiple servers. All the application servers, JBoss included, support application.xml and the other required J2EE descriptors.  In addition, all of them (including Orion / Oracle 9iAS) have a set of server specific descriptors where you can specify all the stuff that the spec was too naive to include.  Little things like what JNDI names you want your EJB's to have, etc. :-)  Fortunately, the names for these server-specific files don't seem to collide with each other from vendor to vendor so you can have them all in one project and the server you deploy on will only read the standard descriptors plus the ones for that server.  The rest are ignored. Quote: Idid not change the account from admin. It just did not work. On my current build, which will be released as EA2 on Monday, it's working well.  Idid notice a couple bugs that have been logged and fixed against the Oracle connector, but nothing related to shutdown.  What I'd like to suggest is that you download EA2 next week and see if the problem persists with the new build.  If so, we'll investigate further. Quote: Iam very pleased and encouraged. This is a fine piece of work that IBM or Oracle or BEA would charge thousands for with much less capability (especially for multiple deployments). Thank you for this effort and for its afforability. Iquoted this mainly because Iliked to read it so Iwanted it to show up in two message. ;-)   Seriously though, you're welcome and thanks for your interest and improvement suggestions.  You'll see that we're very serious about our feature set being customer-driven in the upcoming releases. --Scott MyEclipse Support Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod Guest Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=13128#13128\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 25, 2004 - 09:57 AM how to configurate websphere, oracle, struts, J2ee. thank you all Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod Guest Image Mod <td width=\"100%\" class=\"postdetails\"><a href=\"index.php?name=PNphpBB2&file=viewtopic&p=13129#13129\"><img src=\"./modules/PNphpBB2/templates/PNTheme/images/nucleus2/icon_minipost.gif\" width=\"12\" height=\"9\" alt=\"Post\" title=\"Post\" border=\"0\"  /></a>Posted: Posted: Image Mod Jun 25, 2004 - 09:58 AM how to configurate websphere, oracle, struts, J2ee. thank you all Begin PNphpBB2 Attachment Mod End PNphpBB2 Attachment Mod Display posts from previous: All Posts 1 Day 7 Days 2 Weeks 1 Month 3 Months 6 Months 1 Year Oldest First Newest First <form method=\"get\" name=\"jumpbox\" action=\"PNphpBB2+file-viewforum.html\" onsubmit=\"if(document.jumpbox.f.value == -1){return false;}\">\r\nJump to:<select name=\"f\" onchange=\"if(this.options[this.selectedIndex].value != -1){ forms['jumpbox'].submit() }\"><option value=\"-1\">Select a forum</option><option value=\"-1\">&nbsp;</option><option value=\"-1\">Forum index</option><option value=\"-1\">|--[Frequently Asked Questions]</option><option value=\"35\">|&nbsp;&nbsp;&nbsp;|--&nbsp;FAQ</option><option value=\"-1\">|--[Announcements]</option><option value=\"22\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Genuitec Announcements</option><option value=\"2\">|&nbsp;&nbsp;&nbsp;|--&nbsp;MyEclipse IDE Announcements</option><option value=\"3\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Eclipse News</option><option value=\"-1\">|--[MyEclipse Portal]</option><option value=\"20\">|&nbsp;&nbsp;&nbsp;|--&nbsp;News</option><option value=\"26\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Comments</option><option value=\"-1\">|--[MyEclipse IDE]</option><option value=\"1\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Installation, Configuration &amp; Updates</option><option value=\"5\">|&nbsp;&nbsp;&nbsp;|--&nbsp;General Development</option><option value=\"33\">|&nbsp;&nbsp;&nbsp;|--&nbsp;UML Development</option><option value=\"23\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Application Servers and Deployment</option><option value=\"24\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Web Development (HTML, CSS, etc.)</option><option value=\"25\">|&nbsp;&nbsp;&nbsp;|--&nbsp;J2EE Development (EJB, JSP, Struts, XDoclet, etc.)</option><option value=\"27\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Database Tools (DB Explorer, Hibernate, etc.)</option><option value=\"38\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Web 2.0 / AJAX</option><option value=\"40\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Matisse/Swing UI Development</option><option value=\"41\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Web Services</option><option value=\"6\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Documentation</option><option value=\"7\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Feature Requests</option><option value=\"13\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Comments</option><option value=\"8\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Bugs</option><option value=\"-1\">|--[Off Topic]</option><option value=\"28\">|&nbsp;&nbsp;&nbsp;|--&nbsp;General</option><option value=\"29\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Software Development</option><option value=\"18\"selected=\"selected\">|&nbsp;&nbsp;&nbsp;|--&nbsp;Old Posts</option></select><input type=\"hidden\" name=\"op\" value=\"modload\" /><input type=\"hidden\" name=\"name\" value=PNphpBB2 /><input type=\"hidden\" name=\"file\" value=\"viewforum\" /><input type=\"hidden\" name=\"sid\" value=\"\" /><input type=\"submit\" value=\"Go\" class=\"catbutton\" />\r\n</form> All times are GMT - 6 Hours MyEclipse Forum Index » Off Topic » Old Posts <strong></strong><br />\n<br />\n<a href=\"PNphpBB2+file-printview-t-75-start-0.html\" target=\"_blank\" title=\"Printable version\">Printable version</a><br />\n<a href=\"PNphpBB2+file-viewtopic-t-75-view-previous.html\">View previous topic</a><br />\n<a href=\"PNphpBB2+file-viewtopic-t-75-view-next.html\">View next topic</a><br /> You <b>cannot</b> post new topics in this forum<br />You <b>cannot</b> reply to topics in this forum<br />You <b>cannot</b> edit your posts in this forum<br />You <b>cannot</b> delete your posts in this forum<br />You <b>cannot</b> vote in polls in this forum<br />You <b>cannot</b> attach files in this forum<br />You <b>cannot</b> download files in this forum<br /></td> Powered by PNphpBB2 1.2f © 2003-2004 PNphpBB Group Credits We request you retain the full copyright notice below including the link to www.phpbb.com.\r\nThis not only gives respect to the large amount of time given freely by the developers\r\nbut also helps build interest, traffic and use of phpBB 2.0. If you cannot (for good\r\nreason) retain the full copyright we request you at least leave in place the \r\nPowered by phpBB 21.2f line, with phpBB linked to www.phpbb.com. If you refuse\r\nto include even this then support on our forums may be affected. \r\n\r\nThe phpBB Group : 2002\r\n\r\nPowered by <a href=\"http://www.pnphpbb.com\" >PNphpBB2</a> 1.2f &copy; 2003-2004 based on <a href=\"http://www.phpbb.com/\" target=\"_phpbb\">phpBB</a> 21.2f  2001, 2002 phpBB Group <br />\r\nand by <a href=\"http://batpuppy.drpeay.com/\">PNTheme</a> 1.2 which uses Theme Graphics by <a href=\"http://www.forumimages.com/\" target=\"_blank\">Daz</a><br />\r\nand by <a href=\"http://www.opentools.de/\">Attachment-Mod</a> 2.3.6<br />\r\n// Contact \r\n      Us :: Site Map :: Self Services Copyright  2003 - 2006 by Genuitec L.L.C - Java \r\nIDE and Eclipse Plugin Authority for UML,  AJAX, J2EE, Web tools, and Application Development"
    }
  ]
}