{
  "url": "http://www.nasaexplores.com/extras/astronauts/lu.html",
  "file_number": "598",
  "content_hash": "d80bbefb28fd42f422b4b59f015c9e7a3e1a47e37528cf7566b39d011b97e6a0",
  "total_blocks": 23,
  "retained_blocks": 2,
  "ignored_blocks": 21,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""
    },
    {
      "tag": "p",
      "text": "Ed \n              Lu Space Station Science officer Ed Lu was NASA’s science officer on the Expedition 7 \n              mission to the International Space Station from April until October \n              2003. He and cosmonaut Yuri Malenchenko were the first two-person \n              crew to live board the Station following the loss of the Space Shuttle \n              Columbia in February 2003. The crew flew to and returned from the \n              Station aboard a Russian Soyuz rocket. On riding the Soyuz spacecraft : “Ihad the pleasure to fly twice on the Shuttle, and Ican \n              tell you the experience in Russia is very different,” Lu said. \n              “When you’re launching on the Shuttle, it shakes a lot. \n              It’s like driving over a dirt road at 40 to 50 miles per hour.” \n              The vibrations are caused by the Shuttle’s Solid Rocket Boosters. \n              Since the Soyuz rocket relies entirely on liquid-fuel engines, it’s \n              a much smoother ride. However, the Soyuz is a three-stage rocket, \n              and there’s a strong acceleration when the stages separate, \n              particularly the last one. “When that thing went, if felt \n              like we’d been kicked in the butt by a giant.” Another \n              difference was that he and Malenchenko were not allowed to carry \n              as much with them on the Soyuz for their 6-month stay. Landing was \n              also very different. For example, the Soyuz uses an ablative heat \n              shield, which means it burns up as the craft re-enters the atmosphere. \n              “Iremember looking out the window watching pieces of our \n              ship burn off, which is normal, but it’s still a little bit \n              disconcerting,” he said. The Soyuz also uses a parachute attached \n              to the side of the spacecraft. When it opens, the crew is hanging \n              sidewise, spinning in a circle. On \n              the International Space Station : “The Space Station is like a big tube now,” Lu said. \n              “It’s about the size of a large jetliner.” As \n              the Soyuz approached the Station, he said it “looked like \n              a small model. It really feels like you’re in a science fiction \n              movie.” With the smaller crew and fewer supplies coming up \n              from Earth, keeping equipment operational was an important part \n              of the crew’s duties. “We spent a lot of time working \n              on equipment,” he said. “Another thing we spent a lot \n              of time doing was exercise.” The exercise paid off—Lu \n              was one of the first American astronauts to return from a long-duraction \n              spaceflight with almost no loss in bone density and little loss \n              in muscle strength. The crew was given an “exercise prescription” \n              for the work-out they had to perform. “And, Idid extra on \n              top of that on my own,” Lu said. “Icame back with less \n              bone loss than anyone.” His experience will help astronauts \n              healthy when they begin making the long trips to other worlds. “When \n              we do fly to Mars or asteroids or far away locations, it will take \n              months,” he said. “It could even take years.” \n              Lu said he enjoyed his stay on the Station. “It was a blast \n              from start to finish. Towards the ending Iwas wishing it would \n              last a little longer. Iwasn’t ready to come home yet.” On \n              eating aboard the Space Station : “The food up there is pretty good, actually,” Lu said. \n              However, while the food is tasty, it gets monotonous after a while, \n              much like eating at your favorite restaurant every night would be. \n              “For us, it’s 3 months before we get to eat somewhere \n              else.” That’s why the crew looks forward to the arrival \n              of the Progress cargo ship, carrying supplies from Earth. “It \n              is a welcome thing, because it brings fresh food.” Another \n              welcome delivery of the Progress is odors. “Space Station \n              has no smell whatsoever,” Lu said, explaining that, because \n              of the air circulation system, when you open a can of food, you \n              can smell it only for seconds before the odor is circulated away. \n              When the Progress docked, however, the astronauts could smell food \n              inside. “When you opened the valve up, before you actually \n              open the hatch, you could smell apples in the Space Station,” \n              he said. “We were looking at our watches (until it was time \n              to open the hatch). Those things tasted terrific.” On \n              playing the piano upside down in microgravity : You can’t do it. When you’re upside down, “everything’s \n              reversed,” Lu explained. “If you ever try it, it’s \n              not as easy as it looks.” On \n              the view from the Space Station : “With binoculars, you can see airplanes in flight,” \n              he said. “You can see individual buildings. Ieven have a \n              picture of my home. You can also see lots of craters on the \n              surface of the Earth.” Lu showed us a picture he took from \n              the Space Station which showed the Moon and Mars next to each other \n              in a single frame. “This is one of my favorite pictures from \n              the mission, because it shows where we’re going.” Mars, \n              which was closer to Earth than it had been in 60,000 years when \n              Lu was on the Station, put on quite a show for the crew. Ordinarily, \n              it is difficult to see celestial objects from the Station while \n              the lights are on, since the crew’s eyes are adjusted for \n              the brighter conditions. “Mars was bright enough last summer \n              that it was always out the window,” he said, explaining that \n              it was visible even with the lights on. On \n              being on a two-person crew with Malenchenko : “Ilearned to like, believe it or not, Russian rap music,” \n              he said. “We got along great. We never had a single argument. \n              We think a lot a like.” He said that he and Malenchenko were \n              fortunate that they had similar philosophies about the mission, \n              and that they each worked to be a good crewmate. Biographical \n              Data Hometown : Honolulu, Hawaii, and Webster, New York Born : July 1, 1963 Education : Graduated from R.L. Thomas High School, \n              Webster, New York, in 1980. Bachelor of science degree in electrical \n              engineering from Cornell University, 1984. Doctorate in applied \n              physics from Stanford University, 1989. Spaceflight \n              Experience : Mission Specialist, Atlantis STS-84—Docked with the Russian \n              Space Station Mir on this May 1997 mission. Mission Specialist, Atlantis STS-106—Lu and Malenchenko performed \n              a space walk to perform assembly work on the International Space \n              Station. Science Officer, International Space Station Expedition 7—Lu \n              lived aboard the Station for 6 months, and became the first NASA \n              astronaut to both launch and land aboard a Soyuz spacecraft. For more information \n              about Lu, visit the following links: Ed Lu’s Biography http://www.jsc.nasa.gov/Bios/htmlbios/lu.html Expedition 7 Information http://spaceflight.nasa.gov/station/crew/exp7/index.html Greetings, Earthlings http://spaceflight.nasa.gov/station/crew/exp7/luletters/index.html NASAexplores On-Orbit Interview With Lu http://nasaexplores.com/show2_articlea.php?id=03-053 Official Ed Lu Web Site http://www.edlu.com [ BACK \n              TO ASTRONAUT PROFILES ]"
    }
  ]
}