{
  "url": "http://www.nattax.com/testimonials.htm",
  "file_number": "599",
  "content_hash": "c2c3ccefdc816709a18902ec3c964680075471402c2c3e53fdb24437ce3563fb",
  "total_blocks": 89,
  "retained_blocks": 55,
  "ignored_blocks": 34,
  "blocks": [
    {
      "tag": "p",
      "text": "Read these samples from our file of unsolicited comments and case histories."
    },
    {
      "tag": "div",
      "text": "... In the end, I must say \r\n       that your courses have been designed with great expertise and in a most \r\n       professional way. It has been a very great help to grasp this vast \r\n       subject in a shortest possible time and with a lot of clarity and \r\n       confidence. You really deserve a great praise for this. You are doing a \r\n       wonderful job and a great service to the nation. Keep it up."
    },
    {
      "tag": "p",
      "text": "M. J. C. - Houston, TX"
    },
    {
      "tag": "div",
      "text": "I really enjoyed working on this course, and, as a teacher, greatly \r\n       appreciate the professional way your course is presented. It was \r\n       extremely challenging, but well worth the effort. Thank you for \r\n       organizing such an effective program."
    },
    {
      "tag": "p",
      "text": "F. J. B. - \r\n        Cromwell, CT"
    },
    {
      "tag": "div",
      "text": "\"I'm writing to you to say thanks for the training program I received \r\n       from National Tax Training School. This is my first venture into my own \r\n       business and I must say it was a success.\""
    },
    {
      "tag": "p",
      "text": "Retired \r\n        Army Officer Norfolk, Virginia"
    },
    {
      "tag": "div",
      "text": "Thank you for the knowledge I gained from your tax program. How the \r\n       course has been designed was absolutely excellent. During my study, I was \r\n       able to give tax advice to my husband and his friend that saved them \r\n       money last tax season. I could see that I will have better \r\n       opportunities."
    },
    {
      "tag": "p",
      "text": "L. F. K. - Caldwell, TX"
    },
    {
      "tag": "div",
      "text": "I am very pleased with the outcome of this. I think your organization \r\n       provides a great course and I look forward to enrolling in the higher \r\n       course once I have completed the initial course. Thank you very much for \r\n       your time and assistance ...."
    },
    {
      "tag": "p",
      "text": "J. D. B. - Ontario, \r\n        Canada"
    },
    {
      "tag": "div",
      "text": "I would like to compliment you on a well written and thorough program. \r\n       Your Higher Course in Federal Taxes is one of the best I have taken."
    },
    {
      "tag": "p",
      "text": "P. L. W. - Imperial, MO"
    },
    {
      "tag": "div",
      "text": "I learned twice more from this course than the class of 4 credits \r\n       attended and taken in college!"
    },
    {
      "tag": "p",
      "text": "M. S. - Charlotte, NC"
    },
    {
      "tag": "div",
      "text": "Your course is very well set \r\n       up for maximum learning efficiency. The practice questions, with answers \r\n       following immediately after, are perfect. I intend to take the advanced \r\n       course as well as regular continuing education. Thank you for a very \r\n       enjoyable learning experience  and for you help."
    },
    {
      "tag": "p",
      "text": "C. L. - Porterville, CA"
    },
    {
      "tag": "div",
      "text": "\"I've just completed my third year as an income tax practitioner with \r\n       much success after graduating from NTTS ... Now that I have established \r\n       my reputation as a good and reliable income tax consultant, several small \r\n       businessmen have approached me to keep their books for them too ...\""
    },
    {
      "tag": "p",
      "text": "Grocery Clerk, Teaneck, N.J ."
    },
    {
      "tag": "div",
      "text": "Dear Student Advisor, I want to thank you for all your help and support. I'll never forget all \r\n       you've done for me. May God bless you and your family. What you've given will last a \r\n       lifetime."
    },
    {
      "tag": "p",
      "text": "N. P. - Pittsburgh, PA"
    },
    {
      "tag": "div",
      "text": "\"I must tell you that I thought your course was absolutely excellent! I'm \r\n       just beginning to work on my own income tax return and I have already \r\n       saved $500 that I would not have known about had I not taken your course. \r\n       (My husband, I might add, is delighted). Thank you so much."
    },
    {
      "tag": "p",
      "text": "Brenda R., Marisville, Wa."
    },
    {
      "tag": "div",
      "text": "I found the practical case studies very helpful in pulling the whole \r\n       program together. I am currently working for a small accounting firm and \r\n       am involved in income tax preparation .... your course definitely \r\n       provided a solid foundation."
    },
    {
      "tag": "p",
      "text": "D. A. D. - Niagara \r\n        Falls, NY"
    },
    {
      "tag": "div",
      "text": "I would like to take this time and tell you how much I have enjoyed \r\n       taking this course. It was very informative, and challenging. I would \r\n       definitely recommend it to anyone that is interested in Income Tax in \r\n       passing, or seriously, like myself. If I am fortunate, and pass my final \r\n       exam and get my certificate, I am hoping to have my own small business."
    },
    {
      "tag": "p",
      "text": "K. C. - Birmingham, AL"
    },
    {
      "tag": "div",
      "text": "In Charge of 14 Tax Offices \"Although I had not yet finished my NTTS course I was considered good enough to teach income tax for the ... Tax Service Company. This was my first\r\n   encounter with tax work other than as an NTTS student. The next tax season I worked for the same company as an office manager with 4 tax preparers under my\r\n   supervision. That season we did 50% more business than that office had done during the previous three years. The office won a prize for greatest increase in\r\n   revenue of all city offices and I won a prize for the highest average charge of all the employees in the city area. I also received mention for the largest\r\n   number of business returns in my type of office. After the season I represented many of my company's clients at IRS audits and did other part-time work for\r\n   them. The following season I was offered and accepted a position as acting assistant city manager and trouble shooter for 14 local offices.\""
    },
    {
      "tag": "p",
      "text": "E.L.Ralph, Phila. Pa."
    },
    {
      "tag": "div",
      "text": "\"Being retired I know how hard it is to find enjoyable, helpful and \r\n        profitable employment - especially if you have been accustomed to \r\n        working with your head and not your hands ... I can't resist offering \r\n        the suggestion that you make a special effort to reach the vast army of \r\n        retired clerical workers, executives, etc. What a big favor it would be \r\n        to many of these people if they enrolled in NTTS. I know. I did and now \r\n        I'm happily employed as my own boss - I'm a tax consultant, thanks to \r\n        NTTS.\""
    },
    {
      "tag": "p",
      "text": "Ira Dunn, Birmingham, Ala."
    },
    {
      "tag": "div",
      "text": "\"I love my tax business ... Today I purchased a new car all from tax \r\n       business earnings; I worked just part-time from January 1 to April 15.\""
    },
    {
      "tag": "p",
      "text": "A.T.S. Somerset, Mass."
    },
    {
      "tag": "div",
      "text": "\"It has been 11 years since I took your training course and it was a \r\n       fortunate step, even though I was an accounting graduate ... At first I \r\n       only did taxes on a part-time basis since I was working for someone else, \r\n       but when I was let go by my employer, I decided to go into business \r\n       full-time. This I have never regretted, and year after year I have \r\n       continued to grow ...\""
    },
    {
      "tag": "p",
      "text": "J.T., Palm Beach, Fla."
    },
    {
      "tag": "div",
      "text": "\"I would like to take this opportunity to say that due to your Federal \r\n       Income Tax Course I have established a flourishing practice. I am still \r\n       on a part-time basis, yet word of mouth advertising on the part of last \r\n       year's clients and no effort on my part has kept me busy so far this \r\n       year."
    },
    {
      "tag": "p",
      "text": "Samuel T. Boyd, Chesapeake, Va."
    },
    {
      "tag": "div",
      "text": "Saved One Client $9,000! \"I want to thank you for your help in making my future better. \r\n       Incidentally, I have saved many people much money; one person I saved \r\n       $9,000, which gives me much pleasure.\""
    },
    {
      "tag": "p",
      "text": "Don D., New \r\n        Castle, In."
    },
    {
      "tag": "div",
      "text": "\"I look forward to another tax season. It is a very challenging, \r\n       enjoyable, rewarding and profitable second occupation for me.\""
    },
    {
      "tag": "p",
      "text": "Guidance Counselor, Waseka, Minnesota"
    },
    {
      "tag": "div",
      "text": "\"Since I finished my course through your school, I've worked part-time \r\n       each year preparing tax returns. I thank you very much as I wouldn't take \r\n       anything for the knowledge I obtained from your correspondence course. \r\n       Since that time my daughter has finished high-school and she is \r\n       interested in tax work, too.\""
    },
    {
      "tag": "p",
      "text": "F.C., Danville, Va. \r\n        Housewife"
    },
    {
      "tag": "div",
      "text": "... Thanks again for your help. Enjoyed the course. It is well written."
    },
    {
      "tag": "p",
      "text": "J. M. - Fremont, CA"
    },
    {
      "tag": "div",
      "text": "\"I've enjoyed studying the course and I feel that I've learned so much. I \r\n       know I was slow in getting the exams in but I studied and read every \r\n       chapter until I felt that I really knew it. I want to thank you for your \r\n       patience and time ... I shall continue to keep in touch with you. I \r\n       worked last tax season and showed the results of studying your course. I \r\n       am very grateful that I had the opportunity.\""
    },
    {
      "tag": "p",
      "text": "Edna \r\n        Tidd, West Virginia"
    },
    {
      "tag": "div",
      "text": "\"Thanks to your tax course I now have a growing business ... In fact, I \r\n       am still asked to do taxes for my clients who have moved out of New York \r\n       State.\""
    },
    {
      "tag": "p",
      "text": "Mrs. S.P., Marion, N.Y."
    },
    {
      "tag": "div",
      "text": "\"This past tax season I had 1,350 clients in and did all the work myself. \r\n       I'm sure you will agree that this is quite a load for one person and I \r\n       may cut back a little this year and not overload myself so much.\""
    },
    {
      "tag": "p",
      "text": "V.E.W., Battle Creek, Mich."
    },
    {
      "tag": "div",
      "text": "\"I received a certificate from you after completing your tax course and \r\n       have found it to be one of the better moves of my life ... Thank you for \r\n       your assistance. It sure helped me to enjoy a great profession as well as \r\n       owning my own business today.\""
    },
    {
      "tag": "p",
      "text": "H.A.B., Westover, W.Va."
    },
    {
      "tag": "div",
      "text": "About The Tax School | Tax Courses | Contact Us | Enroll Today | Site Map | Questions? | Privacy Policy | Student Login"
    },
    {
      "tag": "p",
      "text": "Copyright  National Tax \r\n Training School - All Rights Reserved 67 Ramapo Valley Rd. Suite 102\r\n Mahwah, NJ 07430 - 1.800.914.8138"
    }
  ]
}