{
  "url": "http://flakmag.com/film/sunshine.html",
  "file_number": "60",
  "content_hash": "9bc425a68b248ad62cbb9b98217daa2f845a58e8c59c0102d2f657ff0edca709",
  "total_blocks": 100,
  "retained_blocks": 15,
  "ignored_blocks": 85,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2 Final//EN\" BIG TABLE BODY SPACER END SPACER LEFT MENU START GLOBAL SECTION LINKS FILM"
    },
    {
      "tag": "p",
      "text": "<a class=\"navlink\" href=\"/misc/\">Index Page</a><br> Archives Submissions 2005 Also-Ran Awards: The Steak Knives 2004 Oscar Dialogues 2002 Oscars Roundtable In Pursuit of Oscarness Popcorn Picnic Mulholland Drive audio commentary"
    },
    {
      "tag": "div",
      "text": "END GLOBAL SECTION LINKS CONTENT LINKS RECENTLY IN FILM"
    },
    {
      "tag": "p",
      "text": "Volver dir. Pedro Almodóvar For Your Consideration dir. Christopher Guest Casino Royale dir. Martin Campbell Borat dir. Larry Charles All the King's Men dir. Steve Zaillian School for Scoundrels dir. Todd Phillips The Black Dahlia dir. Brian DePalma Hollywoodland dir. Allan Coulter Talladega Nights dir. Adam McKay Snakes on a Bingo Card More Film ›"
    },
    {
      "tag": "div",
      "text": "END CONTENT LINKS ABOUT FLAK <tr>\n\t<td valign=\"top\" align=\"center\" bgcolor=\"#C0C0C0\">\n\t<font class=\"menuhead\">\n\t\nBUY FLAK PRINT\n\n\t</font>\n\t</td>\n\t</tr>\n\t</table>\n\t\t\n\t<table border=\"0\" cellpadding=\"5\" cellspacing=\"0\" width=\"100%\">\n\t<tr>\n\t<td valign=\"top\">\n\t\n\t<font class=\"navtext\">\n\n<p><a class=\"navlink\" href=\"/print/\">What is Flak Print?</a></p>\n\n<p><a class=\"navlink\" href=\"https://www.paypal.com/xclick/business=jessica%40flakmag.com&undefined_quantity=1&item_name=Flak+Print&item_number=1&amount=11.00&return=http%3A//www.flakmag.com/print/thanks.html&cancel_return=http%3A//www.flakmag.com/print/cancel.html&no_note=1&currency_code=USD&lc=US\" target=\"outlink\"><IMG SRC=\"/print/images/flakbuy1.jpg\" border=\"0\" align=\"left\"></A><a class=\"navlink\" href=\"https://www.paypal.com/xclick/business=jessica%40flakmag.com&undefined_quantity=1&item_name=Flak+Print&item_number=1&amount=11.00&return=http%3A//www.flakmag.com/print/thanks.html&cancel_return=http%3A//www.flakmag.com/print/cancel.html&no_note=1&currency_code=USD&lc=US\" target=\"outlink\">Flak Print ($8 + $3 shipping)</a></p>\n\n<p><a class=\"navlink\" href=\"/print/mailorder.html\" target=\"outlink\">Mailorder Flak Print / International orders</a></p>\n\n\t</font>\n\t\n\t</td>\n\t</tr>\n\t</table> ABOUT FLAK"
    },
    {
      "tag": "p",
      "text": "About Flak Archives Letters to Flak Submissions Rec Reading Rejected!"
    },
    {
      "tag": "div",
      "text": "END ABOUT FLAK ALSO BY FLAK ALSO BY FLAK"
    },
    {
      "tag": "p",
      "text": "Flak Sunday Comics The Spam Blog The Remote Flak Print [6mb PDF] Flak Daily Photo"
    },
    {
      "tag": "div",
      "text": "<a class=\"navlink\" href=\"http://www.buyawar.com/\">BuyaWar.com</a><br> <a class=\"navlink\" href=\"http://www.toms-artichokes.com/\">Tom's Artichokes</a><br> <a class=\"navlink\" href=\"/flash/swdvd.html\">Star Wars DVD Bonus Feature</a><br> <a class=\"navlink\" href=\"/features/hateus\">Why They Hate Us Weblog</a><br> <a class=\"navlink\" href=\"/smartersun/\">Smarter New York Sun</a><br> <a class=\"navlink\" href=\"/dumber/\">Dumber Times</a></p> END ALSO BY FLAK SEARCH SEARCH FLAK flakmag.com www Powered by\r\nGoogle END SEARCH MAILING LIST MAILING LIST Sign up for Flak's weekly e-mail updates: Subscribe Unsubscribe END MAILING LIST END LEFT MENU SPACER END SPACER MAIN COLUMN CONTENT BEGIN COPY HERE"
    },
    {
      "tag": "p",
      "text": "Sunshine State dir. John Sayles Sony Pictures Classics The torching of a tacky float during \"Buccaneer \nDays\" opens John Sayles' Sunshine \nState . Pirates of all types abound in fictional \nPlantation Island, Fla., a small town suffering its \nconversion from a place of character and history into \none of those upscale, pastel resorts you speed past on \nI-95. The ensemble cast is split by the dividing line \nof the movie's primary concern: To sell out or not \nsell out? As it's Florida, there's plenty of sun, sea \nand palms, golfers in white slacks, weary locals in \ndenims; and, as it's John Sayles territory , our \nsympathies are meant to fall wholly on the side of the \ngrassroots townies. The heart of the film is split between two daughters. \nMarly Temple (Edie Falco) is the proprietor of a small \nmotel; after getting dumped by her golf-pro \nboyfriend, she couples up with a nicer example of one of \nthe enemy, landscape architect Jack Meadows (Timothy \nHutton). Marly longs to sell the motel her father (a \ngrizzled, speechifying Ralph Waite) has pushed on her \nas his personal dream to maintain. A former \"Weeki \nWachee Mermaid,\" Marly exudes a knowing \nworld-weariness, the threat of the encroaching \ndevelopers awakening in her a desire for flight. By \ncontrast, Desiree Perry (Angela Bassett) returns to \nnext-town-over Lincoln Beach (based on the actual \nAfrican-American community of American Beach, Fla., \nfounded in 1935) to wrestle with a difficult mother \nand finds herself staying to fight for the home from \nwhich she was exiled years before. As in Sayles' Passion Fish , two women, one immobilized and \nwhite, the other itinerant and black, share the \nemotional center of the film. The social ecosystem \naround these women gradually reveals itself as a net \nthat grips, either as a trap or as necessary support. In weaving his morality play, Sayles has chosen sides \nand doles out the vice and virtue in a \nstraightforward, if simplistic, manner. Those on the \nside of maintaining the old community have all the \ndignity, pathos and deeply felt issues to be played \nout; those who favor gentrification have all the \nneuroses — they are suicidal gambling addicts, \nbitter former beauty queens, wounded semi-pro athletes \nturned car salesmen, heartless local politicos, \nclownish fat golfers, trailer park Civil War \nreenactors. The decks are stacked against these folks, \nat times mere foils to Sayles' soapboxing. Francine \nPickney (Mary Steenburgen) is the town's Chamber of \nCommerce queen bee, an \narchetype dusted off from nearly every Robert Altman \nfilm, married to troubled banker Earl Pickney (Gordon \nClapp, the wimpy cop from \"NYPD Blue\"). Flash Philips \n(Tom Wright) is the ex-linebacker (he skipped out long \nago after getting a teenage Angela Bassett pregnant) \nhired as front man for a car dealership, itself the \nfront for some nameless, faceless corporate entity \nbuying up all the homes in Lincoln Beach. Miguel \nFerrer has a too-brief gem of a scene planning his \nhard-sell strategy like a wartime general. Alan King \nand Clifton James are two stogie-chomping golfers who \neventually run out of green, playing ironic Greek \nchorus to the proceedings (\"Nature! Who needs it?\") \nThese are folks, Sayles tells us with the \nsubtlety of tractors plowing through an ancient Indian \ngraveyard, neither to be pitied nor trusted; they are, \nin the end, comic relief. In a similar dramatic cul de sac, Sayles shows the \nsame love of loose ends he practiced in Limbo , by dealing us a \nbig wooden red herring of a plot point. Acting teacher \nDelia Temple, played by former NEA chairwoman Jane \nAlexander, hires a pyromaniac teen to build her a \ncoffin for her upcoming solo performance of Faulkner's \n\"As I Lay Dying.\" Beyond two minor scenes involving \nthe construction and delivery of the coffin, nothing \nelse ever comes of this (ever-unoccupied) box. This \nall seems to be Sayles at his most didactic: Is he in \nmourning for the NEA, paved over by the new anti-art \nmorality? The film's strength is quieter than Sayles' politics, \nwhich, despite his broad strokes, displays genuine, \nadult interest in the demarcation of character \n(refreshing in this summer of animated sci-fi \nspectacles ). People decide to sell out, love, forgive or remain entrenched in their need \nto believe in the American dream; and their paths \nshift, slightly yet deeply. Even the climax is a \nminor, if momentous, affair: What halts the progress \n(or destruction) is not the human endeavor on either \nside of the battle, but the ghosts of the past. The \ndead demand attention, and rising from their graves \n(literally), they stop the major conflict of Sunshine State in its tracks. The powerbrokers, the moneymen, the sharks in on the \nmoney trail, all leave town when the tractors halt. \nMen leave, Sayles seems to say; they are either \nwalking out on women or paving over things. What's \nleft in the vacuum is the film's true concern: the \nwomen who have to clean things up. Sayles may be his \nown best example of a male involved in his own drama \nwhile a quieter, more human story resolves itself on \nthe sidelines. This character-driven quality has \nalways been in Sayles' films, and bringing together \nsuch distinct concerns as presenting \nbroad social canvas, as in Matewan , and telling \nthe African-American's story \nundiluted, as in The Brother From Another Planet , \nmakes Sunshine State his \nmost comprehensive film to date. And he does it \nquietly: The prodigal daughter who has returned is \nable to stay, and the one who had been stuck at home \nhas, like all true mermaids, returned to the sea. — AUTHOR Stephen Bracco EMAIL ( sbracco@yahoo.com )"
    },
    {
      "tag": "div",
      "text": "END COPY HERE END CONTENT END MAIN COLUMN RIGHT COLUMN START RELATED LINKS COMMENT OUT THIS SECTION BY INSERTING COMMENT TAG AT START OF SECTION TABLE BELOW RELATED LINKS"
    },
    {
      "tag": "p",
      "text": "Official Site IMDB entry Trailer Flak: Review of Limbo"
    },
    {
      "tag": "div",
      "text": "END COMMENT OUT OF THIS SECTION BY INSERTING COMMENT TAG AT END OF SECTION TABLE ABOVE END RELATED LINKS AUTHOR LINKS COMMENT OUT THIS SECTION BY INSERTING COMMENT TAG AT START OF SECTION TABLE BELOW <table border=\"0\" cellpadding=\"2\" cellspacing=\"0\" width=\"100%\">\n\t<tr>\n\t<td valign=\"bottom\" align=\"center\" bgcolor=\"#C0C0C0\">\n\t<font class=\"menuhead\">\n\t\nALSO BY &#133;\n\n\t</font>\n\t</td>\n\t</tr>\n\t</table>\n\t\n\t<table border=\"0\" cellpadding=\"5\" cellspacing=\"0\" width=\"100%\">\n\t<tr>\n\t<td valign=\"top\">\n\t\n\t<font class=\"navtext\">\n\n<p>Also by Sean Weitner:<br>\n<a class=\"navlink\" href=\"/film/ai.html\">A.I.</a><br>\n<a class=\"navlink\" href=\"/film/blairwitch.html\">The Blair Witch Project</a><br>\n<a class=\"navlink\" href=\"/film/crouching.html\">Crouching Tiger, Hidden Dragon</a><br>\n<a class=\"navlink\" href=\"/film/deepbluesea.html\">Deep Blue Sea</a><br>\n<a class=\"navlink\" href=\"/film/famman.html\">The Family Man</a><br>\n<a class=\"navlink\" href=\"/film/fellowship.html\">The Fellowship of the Ring</a><br>\n<a class=\"navlink\" href=\"/film/femme.html\">Femme Fatale</a><br>\n<a class=\"navlink\" href=\"/film/finding.html\">Finding Forrester</a><br>\n<a class=\"navlink\" href=\"/film/generalsdaughter.html\">The General's Daughter</a><br>\n<a class=\"navlink\" href=\"/film/hannibal.html\">Hannibal</a><br>\n<a class=\"navlink\" href=\"/film/hollow.html\">Hollow Man</a><br>\n<a class=\"navlink\" href=\"/film/bedroom.html\">In the Bedroom</a><br>\n<a class=\"navlink\" href=\"/film/insomnia.html\">Insomnia</a><br>\n<a class=\"navlink\" href=\"/film/intolerable.html\">Intolerable Cruelty</a><br>\n<a class=\"navlink\" href=\"/film/wasntthere.html\">The Man Who Wasn't There</a><br>\n<a class=\"navlink\" href=\"/film/matrix3.html\">The Matrix Revolutions</a><br>\n<a class=\"navlink\" href=\"/film/miib.html\">Men in Black II</a><br>\n<a class=\"navlink\" href=\"/film/mulholland.html\">Mulholland Drive</a><br>\n<a class=\"navlink\" href=\"/film/onehour.html\">One Hour Photo</a><br>\n<a class=\"navlink\" href=\"/film/payback.html\">Payback</a><br>\n<a class=\"navlink\" href=\"/film/phantom.html\">The Phantom Menace</a><br>\n<a class=\"navlink\" href=\"/film/reddragon.html\">Red Dragon</a><br>\n<a class=\"navlink\" href=\"/film/thering.html\">The Ring</a><br>\n<a class=\"navlink\" href=\"/film/series7.html\">Series 7</a><br>\n<a class=\"navlink\" href=\"/film/signs.html\">Signs</a><br>\n<a class=\"navlink\" href=\"/film/spykids.html\">Spy Kids</a>, <a class=\"navlink\" href=\"/film/spykids2.html\">2</a>, <a class=\"navlink\" href=\"/film/spykids3.html\">3</a><br>\n<a class=\"navlink\" href=\"/film/sum.html\">The Sum of All Fears</a><br>\n<a class=\"navlink\" href=\"/film/unbreak.html\">Unbreakable</a><br>\n<a class=\"navlink\" href=\"/film/02oscars/\">2002 Oscar Roundtable</a></p>\n\n\n\t</font>\n\t\n\t</td>\n\t</tr>\n\t</table> END COMMENT OUT OF THIS SECTION BY INSERTING COMMENT TAG AT END OF SECTION TABLE ABOVE END AUTHOR LINKS END RIGHT COLUMN SPACER END SPACER END BODY"
    },
    {
      "tag": "p",
      "text": "All materials copyright © 1999-2006 by Flak Magazine"
    },
    {
      "tag": "div",
      "text": "END BIG TABLE"
    }
  ]
}