{
  "url": "http://www.newhumanist.org.uk/volume118issue3_more.php?id=94_0_21_0_C",
  "file_number": "607",
  "content_hash": "d87dac44ad6d8cccdb804eceb87d3360d8459336c6db87976d9ff36960822290",
  "total_blocks": 58,
  "retained_blocks": 8,
  "ignored_blocks": 50,
  "blocks": [
    {
      "tag": "div",
      "text": "End of global header About Us New Humanist Current Issue Back Issues Subscribe News Weblog Forum Links Contact Us Rationalist Association"
    },
    {
      "tag": "h2",
      "text": "September 2003 Issue"
    },
    {
      "tag": "div",
      "text": "See\r\nmore from this issue. Get a subscription. Newsletter Enter your email address above to receive free email updates from New Humanist editors. Special offer If you like what you've read, you can try New Humanist magazine free of charge. Just give us your address details and we'll send you a copy. For more information, click here . Send article to a friend"
    },
    {
      "tag": "h5",
      "text": "Email address of recipient Your name Your email address Personal message What would you like to send?"
    },
    {
      "tag": "p",
      "text": "Link only Full text"
    },
    {
      "tag": "div",
      "text": "Related Topics space between left and right side end space between left and right side Shows the single weblog entry <rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\r\n     xmlns:trackback=\"http://madskills.com/public/xml/rss/module/trackback/\"\r\n     xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\r\n<rdf:Description\r\n    rdf:about=\"http://www.newhumanist.org.uk/volume118issue3.php?id=P94\"\r\n    trackback:ping=\"http://www.newhumanist.org.uk/pingserver.php?p=tb&amp;id=94\"\r\n    dc:title=\"The luxury of doubt\"\r\n    dc:identifier=\"http://www.newhumanist.org.uk/volume118issue3.php?id=P94\" />\r\n</rdf:RDF>"
    },
    {
      "tag": "h2",
      "text": "The luxury of doubt"
    },
    {
      "tag": "div",
      "text": "by Laurie Taylor Sep 01, 03 Satirist, moralist, literary provocateur Will Self lectures Laurie Taylor on addiction, debauchery, banality and the search for serious thought Q Id like to start with one of your specialist subjects  addiction.Youve written about yourself as an addictive personality and about how youve beaten your various addictions. Iwas wondering if Icould fall back on that personality description myself. Im currently having terrible trouble kicking the smoking habit. A Im sorry, but Ithink that smoking may be special. There is a strange confluence in smoking between social acceptability and the physiological addictiveness of the nicotine itself. Thats why Ithink there may be a difference in kind between addiction to nicotine and those other forms of addiction where individual psychopathology plays a much greater role. So you find people  possibly yourself  who really have an addiction issue with nicotine but not with any other substances. There are other people  and Iam definitely one  who manifest the full blown addictive psychopathology. Q Is that an inbuilt personality trait  a genetic attribute? A Its not easy to be precise about the genetic or individualhistorical or cultural components in that psychopathology. In a way it doesnt matter. You can spend an awful lot of time as an addict, an awful lot of useless time, debating such stuff. My view of addiction is that once you have acknowledged it, once you have seen it within yourself, then such debates become otiose. They actually may obscure the issue of how one recovers from it. Q You talk about recovering from addiction. Does that recovery have to take the form of complete abstinence? No cocaine at all. No heroin at all. No drink at all. Isnt that attributing too much power to the substance? A When you have been wellknown and typified as a heavy user of intoxicants, as Ihave, and you stop completely, a lot of people who know you socially say, Was it really that bad? Did you really need to go that far, to that extreme? And you can understand that reaction. Because of course the social use of intoxication is endemic in our society and in many instances it is a highly constructive form of social bonding, a type of social cement, and even a source of inspiration. All you can say in reply to such people is that You werent actually there. You didnt see what the reality of my relationship with intoxication was like. And you couldnt see it because by definition it was something that only occurred in private or with other people who also had an addictive psychopathology. Q Ican understand what youre saying about the need to stop completely when were talking about hard drugs. But Im rather with your questioners when they ask why you needed to stop drinking as well. Ive never considered such a big step. It would change my life too much. Imean Iwouldnt have half the friends Ive got now if Ihadnt got drunk with them in the first place. Thats how Igot to like them. A But by the same token, you arent going to like people who you wouldnt know you liked sober, if you dont stop drinking. And while the world of intoxication is pretty large, its actually not as large as the world of nonintoxication. It just seems that way from within it. Its like a Saul Steinberg cartoon of a New York drinkers view of the world. Manhattan and the giant skyscrapers are entirely made up of bottles and optics and so forth, and the plains of sobriety are tiny. Q Is there a moral dimension to this? Did you come to dislike yourself as an addict? A Yes, very much so. Ididnt like what Ihad become in moral terms. Iactually found Iwas doing things that were against my moral will, not just occasionally, but a lot of the time, on a daily basis. Ihad the distinct sensation that Iwas a puppet of an addictive manipulator, that there was a kind of sinister hand which was forcing me in directions that Ididnt like. Q A Fat Controller? A Yes Q And the directions in which you were being forced came to seem increasingly mindless, silly, even sordid? A All of the above. Iwas ceasing to function as a parent, as a partner, and certainly as a constructive person in wider society. Inever missed an opportunity to put someone else down or to make a snide or cynical remark and Idisplayed a closed rather than an open mind. Somebody who has helped me a lot in recovery from my addictive illness said to me very early on allow yourself the luxury of doubt. No closed minds. Ifound that a very, very interesting statement. It was interesting because it was recasting the idea of being an agnostic. Agnosticism is very very seldom correctly treated as a form of conviction in itself. But that phrase, the luxury of doubt points to the idea that clinging fast to doubt is an extremely viable form of conviction. Q Of course, there must always be the slight background worry that drugs had something to do with your literary inspiration. A There is ample ammunition to stoke up that particular funeral pyre but even in the course of my heaviest drink and drug using, Iknew that wasnt the case. Iwas extremely well versed in the history of intoxication in relation to creativity. Iwas always very fond of quoting De Quincys line: if a man who keeps oxen should take opium he will dream of oxen. Q Your indulgences may not have prompted your creativity but they certainly gave you good material. Iwas reading your book Dorian recently and was relishing your capacity to create an atmosphere of decadence. A Well, you have got to have been there. Idid a reading at the Soho theatre when Dorian first came out. And after the show this woman came out and said to me, Ivery much enjoyed your reading  Id read the whole of the first chapter  But Ifound your characters absolutely incredible. Icant believe that people like that exist. And Iactually lost my temper, which Idont do very often with members of my reading public. Isaid: Just how many repressed homosexual upperclass drug addicts were you hanging out with in the early 1980s? Well, actually, none, she said. And Isaid, WELL, I WAS. So you know, Ireally know what that milieu was like, Iwas there. It really comes back again to the oxen quote. The reason why Ihave written so much about decadence and drugs is because that is the way Ihave lived. Its where Ive lived a lot of my adult life. But Ilike to think that if Ihad run a donkey sanctuary in Cornwall then Iwould have written well about that. Q Its probably because of your addictive notoriety that we dont hear too much about any other parts of your life. Iwas interested, for example, to discover that your father was Peter Self, a wellknown and highly respected academic A He was a political scientist, Professor of Public Administration at the LSE and he ended up as Emeritus Professor at the Australian National University. He died in 1999. He emigrated when Iwas at Oxford at the end of the 70s so Ididnt see a great deal of him in the last 20 years of his life. Ihad a very tricky relationship with him. It has improved dramatically since he died. For various reasons. One of which is that Iam able to talk to him in a way that Icouldnt do when he was alive. He doesnt answer back. And if he does Ican script his replies. The other thing he was a relatively old parent. He was in his midforties when Iwas born. So its only now that Ive reached the same age that he was when Iwas a baby. And that allows me to feel a profound physical sympathy with him in a way that Ihavent before. Thats because of the way ones inheritance appears in mannerisms. Ifind myself involuntarily caught within the tiny ephemeral prison of his cough, or his sneeze, or his yawn. You get to know your same sex parent at that physiological level. Q How much did his opinions influence you? A What Ihave never denied about Peter, about my father, is that he had some excellent attributes although he came from a kind of odd uppermiddle class background, public school, Oxford. When Iwas in my early teens, rather like some strange kind of JB Priestley inspired peregrination, our divorced fatherandson contact time was spent doing these walks around England, walking the Pennine Way, walking the Cornish coast... and talking. Talking endlessly, endlessly talking about philosophy and politics, and stopping in pubs where my father was always unable to understand the licensing laws so that he was always plying me with forbidden drink. Ionce got thrown out of a pub in Padstow because he bought me a double brandy. Iwas 12 at the time. The landlord was absolutely furious. Peter couldnt understand why. Q What were his politics? A He was Labour with utopian leanings. A Footite to some extent. In the 70s he was very angry with the Labour Partys failure to adequately negotiate a role for industrial democracy within the emerging economy. And he was learned and perspicacious enough to see that the rigidity which the old Labour party embraced would entail its own reaction. He was not, therefore, surprised by Thatcherism. He saw where we were going. The last book he wrote was called Rolling Back the Market. It was an attack on the new free market libertarianism. Q Do you share his political views? A Dad and Iwere in agreement on most things up until he died. But where Ithink he had the edge on me, as an academic and as someone who had been an adviser to ministers here and in Australia, as somebody who sat on government commissions  he was more committed and he worked harder. It is very easy for us in the fourth estate and in the media to attitudinise because we have always got the escape hatch of saying, well it is not our job to prescribe. Q You say that your father predicted something like Thatcherism. Ithink perhaps that you might be given some credit on the left for having foreseen what New Labour under Blair would be like in power. You were condemning his political style and content long before he was elected. A Thats right. Ibow to no man or woman in my Blair hatred. Idid one of the Independents Heroes and Villains columns on Blair shortly after he got the Labour party leadership. So yes, early on. Ialways thought he was vapid, sanctimonious. He represented politics as an absence rather than a presence. Q When you talk and write in this way about Blair and New Labour in your various journalistic roles, do you see yourself as in the conversion business. Do you want people to change their minds and agree with you? A No, Idont. Broadly, Ithink Ican be described as a satirist as much as anything else. And Ithink traditionally satire had a covert agenda of moral reform. If the audience for satire knows you are really convinced of the underlying truth then it becomes merely a form of pontificating. They must have a residue of doubt about where it is you are really coming from. But in the past that kind of satire, satire like that of Swift, operated within a matrix of JudeoChristian moral precepts. We dont have those any more. So, the new problem that satirists have to face is moral relativism. And in that context, it seems to me that the role of satire that Iproduce is to make the audience think for themselves. It is to throw the whole burden of moral thought back on to the audience. So Iam not trying to convert people to anything but thinking seriously. Im trying to be a provocateur. Q What about your religious attitudes? Was religion around you in your childhood? A It was around in a profoundly English way. My grandmothers family were clergymen. They were Anglican pastors. And the Bishop of Chichester was a greatgreat grandfather of mine and my grandfather was Chairman of the Lay Association of the Church of England. Q So it was more or less taken for granted that to be Cof Ewas the normal state of affairs? A More or less, but it was a very broad church. Youre a Devil worshipper? Jolly good. Do come along to the vicarage on Sunday morning. That kind of thing. But of course my mother was Jewish, but Jewish in denial partly because of coming to England in the late 50s and being married to a gentile and partly because of her own psychological makeup. Jewishness was something that was only partly acknowledged in our family. It was either oddly embraced or oddly rejected so much so, for example, that my brother doesnt even think of himself as being that Jewish, whereas Ido tend to. Maybe its all because of family politics. Q Where are you now? Does anything in that Anglican or Jewish background still speak to you. Is religion real to you? Is it significant? Or can Iput you down as a straightforward nonbeliever? A Ihave to go back to agnosticism, to the luxury of doubt. If Iallow myself the luxury of doubt in this area Iam wholly conflicted. All my study of religion leads me to believe that there is a hell of a lot more to religious belief than the notion that it is simply an opiate. There is a hell of a lot more to religious experience than that. Q You seem to be echoing William Jamess view of religious experience as special, as distinctive. A Yes, yes. Thats right. Ido believe that it is different. Actually that book by William James, Varieties of Religious Experience, had a big impact on me for just that reason. It is a fantastic book and mandatory reading for anyone who wants to deal with that stuff seriously. Q But does this mean that you want to say that our capacity to have religious experiences means that there is some external power from which such experiences spring? A Idont mean a personified god. Im far too influenced by Nietzsche for that. Ifind it impossible not to see that sort of god as the shadow play of the ego itself. Ilove that line from Schopenhauer about Kant: Kant is like a man who flirts and dances all evening at a masked ball only to find that when the lady takes the mask off, it is his wife. But Ido have the view that a godless existence, an atheist existence, an existence which excludes the possibility of God, which doesnt allow the luxury of doubt, does usher in all sorts of spiritual malaise. Ireally feel that a lot of contemporary society is venal and prostituted, debauched on pornography, and subject to a banalisation of feeling, and what J.G. Ballard has called the death of affect. Ireally find all that abhorrent and amoral. What my recovery programme forced upon me was the need to seriously consider the existence of some kind of higher power and its imminence in the world, some sort of transcendence. It asked me to seriously consider the limitations of ego, the old Socratic formulation that reason is that that knows its own limit. Q Iunderstand that youre writing a book about religion at the moment, a book about the manner in which the orthodoxy of fundamentalist religions depends upon the existence of a sacred text? A Yes thats right. What started me off on this were conversations with the Muslim fundamentalists who run my local curry house. Around the same time Iactually went to see the festival of the whirling dervishes in Anatolia, in central Turkey. Iwas reading around Islam quite a lot. And there, as with any monistic fundamentalism, you find this idea that the text is a book of words for the world that exists independently from its own rubric. It abolishes time and stands outside of time. It can tell you what to think about everything, about genetic engineering and nuclear weapons. Well, the best way to satirise and undermine that timeless view of the sacred text would be to reveal the wholly contingent and arbitrary nature of a particular revolutionary text. That is what Iam intending to do in the next novel. Basically, it is about a contemporary Londoner who buries a kind of rant against modern society in a time capsule for his own strange twisted reasons, not for prosperity or anything, but for his child, in fact, and it remains buried for 500 years and then becomes the sacred book for the future of society. Now that device enables me to unlock all of these questions Ihope in an absurdist and funny way. Q Will, Idont want to make you too selfconscious, but Icant help noticing that youve taken a pipe out of your pocket, and that youre even now lighting it. Will Self, pipe smoker. Abit like catching Jack Kerouac pulling on his slippers. Where did the pipe come from? Let me guess. Your father? Another inherited mannerism? Did Peter smoke a pipe? A Of course he did. Absolutely. Ive been smoking it now for about seven months. Ifelt it creeping up on me. Ah, Ithought, time for the pipe. Thats why Igave up cigarettes altogether for a year because Ifelt the pipe coming on. The tweed jacket comes next. [Will Self declined to be photographed with his pipe] [0 comments] read/post comments printer-friendly \r\n            page Dynamic link that returns visitors to the last page they were on Back to contents Beginning of global footer about | news | bookshop | forum | home RPA One Gower Street London WC1E 6HD T 020 7436 1151 F 020 7079 3588 All content (c) of the RPA or its respective author This site was built with pMachine . Free headlines: RSS"
    }
  ]
}