{
  "url": "http://www.nisat.org/publications/us_arms_central_america.htm",
  "file_number": "610",
  "content_hash": "e76ef3ea24d5917e63fd7a13a34f4249462de054aeb26dcff7f990f0def7a451",
  "total_blocks": 128,
  "retained_blocks": 9,
  "ignored_blocks": 119,
  "blocks": [
    {
      "tag": "div",
      "text": "The US Arms Central\r\nAmerica—Past and Present"
    },
    {
      "tag": "p",
      "text": "Lora Lumpe"
    },
    {
      "tag": "div",
      "text": "Norwegian Initiative on Small Arms\r\nTransfers/Peace Research Institute, Oslo for Conference on Small Arms and\r\nLight Weapons in Central America Armas Pequeas - Grandes problemas Stockholm, 18-19 May 1999"
    },
    {
      "tag": "blockquote",
      "text": "By all available evidence, the United States\r\n  has been the leading source of small arms supply to Central America since the 1950s and\r\n  continues to be so today. Although there is little difference to people being harassed\r\n  with such weapons, these arms have flowed to Central America both legally—with the\r\n  approval of the U.S. government—and illegally. Under U.S. law (Arms Export Control\r\n  Act), any U.S. national or U.S. registered corporation, or any person or corporation\r\n  residing in the United States, must obtain permission from the government to export any\r\n  munition. Other laws (National Security Act, Foreign Assistance Act) give the U.S.\r\n  government the right to transfer weapons on a sale or grant basis—overtly or\r\n  covertly."
    },
    {
      "tag": "p",
      "text": "Weapons \"made in the USA\" have found their way to\r\n  Central America principally in four ways: on-going commercial sales, negotiated by the arms industry or a\r\n      middle man and approved for export by the State and Commerce Departments; open (transparent) government-negotiated military aid or sales; clandestine government-supplied arms (usually by the CIA); and illegal purchase and shipment from the United States by private\r\n      actors operating for financial gain. This paper briefly describes what is known about Cold War-era,\r\n  recent past, and on-going small arms supply to the region through each of these programs. Commercial Arms Sales Historically, and continuing on through today, the vast\r\n  majority of small arms exports from America occur through Direct Commercial Sales (DCS),\r\n  negotiated between U.S. companies or brokers and foreign buyers. The foreign customer may\r\n  be a government entity ( e.g. , interior ministry, justice ministry, ministry of\r\n  defense, or national police), a corporation or person using the weapons for private\r\n  security, or a gun vendor. Direct Commercial Sales must be approved by the State Department's\r\n  Office of Defense Trade Controls or the Commerce Department’s Bureau of Export\r\n  Administration, depending on the equipment. The Commerce Department regulates transfers of\r\n  12-gauge shotguns and components and shotgun shells, as well as stun guns and shock\r\n  batons. The State Department is responsible for all other gun exports, including\r\n  non-military rifles and pistols. Some State Department-licensed sales are subject to Congressional\r\n  notification before export licenses may be granted. For sales over $14 million Congress\r\n  must be given 15-30 days pre-notice. Commerce Department-licensed sales are not subject to\r\n  any prior Congressional scrutiny. In general, when the customer is a government entity, the choice\r\n  of whether to use the government-to-government channel or to deal directly with the arms\r\n  manufacturer or broker is up to the purchaser. Direct sales are quicker, sometimes cheaper\r\n  and entail less oversight than do government-negotiated sales. In addition, both the\r\n  Commerce and State Departments are less transparent about the deals they are licensing\r\n  than the Pentagon is about sales it is negotiating. Many foreign customers have viewed\r\n  this secrecy with favor, and therefore prefer to purchase arms directly from\r\n  manufacturers. Prior to 1996 it was practically impossible to obtain any\r\n  information about State Department-licensed small arms exports to Central America or\r\n  elsewhere. Beginning in that year, however, Congress caused the government to provide an\r\n  annual highly specific report on export license authorizations granted in the preceding\r\n  year. This report is known as the \"Section 655 Report\"—after the provision\r\n  of law mandating it. According to this report, during 1996 and 1997, the U.S.\r\n  government authorized at least $110 million worth of small arms and light weapons to the\r\n  region.(1)  Included in this were nearly 190,000 guns of various types (handguns\r\n  through machine guns). El Salvador and Mexico were by far the leading destinations for\r\n  these weapons during these two years, with the former slated to receive up to 33,000 guns\r\n  and the later 43,000. In addition, neighboring Venezuela has been cleared to receive more\r\n  than 75,000 guns during this time. See Appendix 1 for profiles of U.S. arms export\r\n  authorizations to individual countries in Central America. Because the State Department previously refused to release any information about small arms sales it had licensed, it is not possible to determine\r\n  relative changes in the volume of exports or licenses over time. However, the State\r\n  Department's Office of Defense Trade Controls reported in mid-1994 that it had experienced\r\n  a recent noticeable increase in the number of applications for firearm and ammunition\r\n  exports.(2)  And data obtained by Congressional investigators showed that during the\r\n  five year period 1989-1993 the State Department granted 1,600 export licenses for over\r\n  $100 million of pistols, revolvers and rifles to eight Latin American countries.(3)\r\n    Thus, it would appear that small arms export licenses have increased rather\r\n  dramatically during the period 1996-1997, equalling in those two years the level of small\r\n  arms licensed during 1989-1993."
    },
    {
      "tag": "div",
      "text": "Table 1: Value and\r\n      Quantity of Commercial Export Licenses for Small Arms, 1989-1993 Value of licenses no. of licenses no. of end-use checks Argentina $47,747,115 686 7 Brazil $3,957,533 343 2 Colombia $643,785 39 0 Costa Rica $556,274 117 0 El Salvador $891,916 61 3 Guatemala $6,766,983 141 3 Mexico $34,362,973 108 3 Peru $11,704,189 137 3 Total $106,630,768 1,632 21"
    },
    {
      "tag": "p",
      "text": "Source: U.S. Senate Committee on Governmental\r\n  Affairs, A Review of Arms Export Licensing, Senate Hearing 103-670, 1994, p. 37. These license approvals do not represent final sales. The licenses\r\n  are valid for four years, and it is currently not possible to determine how many of these\r\n  licenses result in actual delivery of the weapons."
    },
    {
      "tag": "h3",
      "text": "Government-Negotiated Sales/Grants"
    },
    {
      "tag": "p",
      "text": "Through the Foreign Military Sales (FMS) program, the U.S.\r\n  government (represented by the Defense Department) negotiates weapons transfers directly\r\n  with foreign militaries. FMS may cover sales or grants of new equipment (purchased by the\r\n  Pentagon from U.S. weapons manufacturers and in effect re-sold to foreign militaries),\r\n  coproduction of weapons overseas, or transfers from surplus Pentagon stocks. An FMS deal is usually initiated with a request for weapons\r\n  transmitted from the U.S. embassy in the customer country to the \"implementing\r\n  agency\"—the Army or the Defense Logistics Agency in the case of small/light\r\n  arms. Copies of the request are sent to several relevant government agencies, including\r\n  the State Department's Bureau of Politico-Military Affairs, the Defense Security\r\n  Cooperation Agency (DSCA) in the Office of the Secretary of Defense, and the Unified\r\n  Command responsible for the region where the customer country is located. If no objections\r\n  are raised, the implementing agency, in conjunction with the DSCA, begins to prepare the\r\n  contract for the arms package. By law, the U.S. administration must notify Congress 15-30\r\n  days before offering a sales contract to a foreign customer, if the proposed sale is\r\n  valued at $14 million or more. Until recently, the only source of information on past shipments\r\n  of government-brokered small arms sales was through submission of a request under the\r\n  Freedom of Information Act (FOIA), a law directing that the executive branch release all\r\n  requested information to the public that is not exempt from disclosure (national security\r\n  and foreign policy reasons are grounds for exemption). Detailed information obtained from\r\n  the Defense Department in 1994 showed that between 1980-93, the Pentagon transferred\r\n  nearly 50,000 pistols, over 170,000 rifles and shotguns, nearly 1,000 submachine guns, and\r\n  more than 12,000 grenade launchers to 49 countries through FMS, including the following\r\n  quantities to the armed forces of El Salvador: Table 2: U.S. Foreign Military Sales Shipments of Small\r\n  Arms/Light Weapons to El Salvador, 1982-1991 33,274 M16 assault rifles 3,120 40mm grenade launchers 267,000 hand grenades source: Department of Defense (Defense Security\r\n  Assistance Agency), response to request by Federation of American Scientists under Freedom\r\n  of Information Act, 14 September 1994. In addition to sales of newly-manufactured weapons, the Pentagon\r\n  gives away or sells at deep discount the vast oversupply of small/light weapons that it\r\n  has in its post cold-war inventory. Most of this surplus is dispensed through the Excess\r\n  Defense Articles (EDA) program. The Foreign Assistance Act defines EDA as weapons or other items\r\n  owned by the U.S. government, which were not procured in anticipation of military\r\n  aid or sales. Originally only the southern-tier members of NATO were cleared to receive\r\n  EDA, but following the 1991 Gulf war, many Middle Eastern and North African states were\r\n  added; anti-narcotics aid provisions expanded EDA eligibility to include South American\r\n  and Caribbean countries. Around 1995, large scale grants and sales of small/light arms\r\n  began occurring. In the past few years, over 300,000 rifles, pistols, machine guns and\r\n  grenade launchers have been offered up, including the offer of large quantities of M1\r\n  rifles to Mexico and small arms to Colombia and states in the Caribbean in\r\n  furtherance of the \"war on drugs.\" Surplus weapons are also provided to foreign governments under\r\n  special Presidential authority to \"draw down\" U.S. military equipment to meet\r\n  emergency needs. The Foreign Assistance Act provides permission for the President to\r\n  transfer on a grant basis up to $150 million worth of military articles from U.S. stocks\r\n  annually. The executive branch has used this provision increasingly in recent years,\r\n  particularly in support of counter-narcotics efforts. U.S. law requires the President to\r\n  notify Congress of any planned drawdowns of equipment, and also to notify Congress upon\r\n  completion of delivery. Covert Government Arms Supply Operations Clandestine U.S. government operations are another\r\n  way in which small/light were exported from or by America to the region. Technically\r\n  speaking, such transfers are not illegal under U.S. or international law—although\r\n  they certainly violate the spirit of the U.N. Charter. The National Security Act of 1947\r\n  authorizes covert political and military operations, including secret arms supply. The\r\n  president must first make a \"finding\" that the operation is vital to U.S.\r\n  national security. Section 505 of the act requires the Central Intelligence Agency, or\r\n  other government agencies engaging in such activities, to notify the Congressional\r\n  committees responsible for oversight of U.S. intelligence community activities of any arms\r\n  supply operation undertaken valued at $1 million or more. Because these programs are classified, little is known with any\r\n  precision about the frequency, magnitude and specifics of covert arms supply. In recent\r\n  years, however, government documents have been declassified on some of the earlier\r\n  operations in the region, including the United States’ supply of arms to the rebel\r\n  forces of Colonel Carlos Castillo Armas in Guatemala in 1954, and to the Cuban exile\r\n  forces involved in the abortive Bay of Pigs invasion of 1961.(4) More recently, it is public knowledge that during the Reagan\r\n  Administration covert arms supply operations run by the Central Intelligence Agency (or\r\n  the National Security Council) were a major source of small/light arms to insurgent groups\r\n  around the world. These operations armed, trained and financed guerrillas fighting\r\n  communist-backed state forces in Nicaragua, Angola, Afghanistan and Cambodia. Some of the\r\n  weaponry supplied was manufactured in America; some, in an effort to hide U.S. support of\r\n  the operation, was not. Probably the most documented covert arms-supply operation ever\r\n  undertaken by a U.S. administration was the \"Iran-contra\" affair of the\r\n  mid-1980s. This effort was initiated in 1981, when President Reagan signed a classified\r\n  \"finding\" to the effect that U.S. security would be enhanced by providing covert\r\n  support for paramilitary operations against \"the Cuban presence and Cuban-Sandinista\r\n  support infrastructure in Nicaragua and elsewhere in Central America.\"(5)\r\n    Ultimately, this operation resulted in the delivery of millions of dollars’\r\n  worth of arms and ammunition to the anti-Sandinista insurgents in Nicaragua and, when the\r\n  scheme was finally uncovered, in felony charges against senior officials of the Reagan\r\n  Administration.(6) In arming the contras, U.S. operatives generally sought weapons of\r\n  Soviet or Eastern bloc manufacture, thereby allowing the insurgents to employ ammunition\r\n  captured from the Sandinista army, which was largely equipped with Soviet-type weaponry.\r\n  (The use of Soviet-type weapons also made it easier for the contras and their backers to\r\n  claim that they were obtaining their arms from defectors or fallen Sandinista soldiers,\r\n  rather than from the United States.) To obtain such arms, the CIA drew on a variety of\r\n  sources. In May 1983, for instance, retired Air Force Major General Richard Secord, acting\r\n  on behalf of CIA Director William Casey secretly obtained several tons of Soviet-type\r\n  munitions that had been confiscated from PLO forces by the Israelis in 1982. These\r\n  weapons, and additional ex-PLO munitions acquired from Israel in March-July 1984, were\r\n  then transferred to the CIA and, through a variety of clandestine channels, passed on to\r\n  the contras.(7) Although the full extent of covert arms aid to the contras has\r\n  never been established, the available documentation suggests that it was substantial. In\r\n  one memo sent to CIA Director William Casey in July 1986, retired Major General John\r\n  Singlaub (a key figure in the covert supply operation) discussed a pending delivery of\r\n  10,000 Kalashnikov AKM assault rifles, 200 RPG-7 rocket launchers, 200 60 mm mortars, 50\r\n  82 mm mortars, 60 12.7 mm machine guns, 50 SA-7 portable surface-to-air missiles, and\r\n  related ammunition.(8)  Other evidence of large arms shipments comes from the\r\n  transcripts of radio communications between the contras and their contacts at the CIA. On\r\n  April 12, 1986, for instance, a rebel field commander radioed a CIA official to\r\n  acknowledge that his forces had just received an airdrop of 20,000 pounds of military\r\n  equipment, including German-type G3 assault rifles, rifle magazines and ammunition, RPG-7\r\n  rockets, grenades, and grenade launchers.(9)  Because supply operations of this type\r\n  were conducted on a regular basis for several years, it is clear that substantial\r\n  quantities of small arms and other light weapons were given to the contras during this\r\n  period. These supply operations would have continued had not an\r\n  Enterprise-owned Fairchild C-123K cargo plane been shot down on October 5, 1986, while\r\n  dropping guns and ammunition over southern Nicaragua. The sole surviving crew member,\r\n  Eugene Hasenfus, was captured by the Sandinista army, and, under interrogation, told his\r\n  captors that the contra resupply flights were part of a CIA-sanctioned operation. In addition to aiding the contras, the United States provided\r\n  covert assistance to special intelligence organizations in Guatemala and Honduras during\r\n  the 1980s and (in the case of Guatemala) the early 1990s. These units—the D-2 branch\r\n  of the Guatemalan military and Battalion 316 of the Honduran military—were\r\n  responsible for identifying and, in many cases, murdering members of opposition political\r\n  movements. Typically, the victims of these agencies were beaten, tortured, and then\r\n  \"disappeared\"—that is, executed in secret, with their remains hidden in\r\n  unmarked burial sites. While condemning such behavior in public, the Reagan and Bush\r\n  Administrations secretly approved the transfer of CIA funds and equipment to these units\r\n  on the premise that their assistance was needed in the struggle to wipe out communism in\r\n  Central America.(10)  Later, when the Cold War drew to a close, the United States\r\n  continued its support—estimated at $3-5 million per year—for the Guatemalan D-2,\r\n  in order (it was claimed) to obtain information on illicit drug trafficking in the\r\n  region.(11) It is unclear whether small arms were among the items directly\r\n  furnished to these agencies by the CIA. Given Washington's desire to boost their\r\n  effectiveness, however, it is likely that the CIA provided them with arms and ammunition\r\n  or with the funds to acquire them. Illegal Exports The final source of American small and light arms to the region is\r\n  completely outside of U.S. law—black market, or \"illicit\" arms transfers.\r\n  In his key note speech before the 50 th anniversary opening of the U.N. General\r\n  Assembly in 1995, President Clinton raised the issue of the illicit arms market, and its\r\n  role in supplying drug traffickers, terrorists and criminals. The U.S. President's focus\r\n  on the illicit arms traffic was spurred, in large part, by the growing concerns of the\r\n  Mexican government about the proliferation of illegal U.S. weapons into the hands of\r\n  Mexican drug-traffickers and other criminals. According to the Bureau of Alcohol, Tobacco\r\n  and Firearms (BATF), Mexico is one of the leading recipients of illicitly exported U.S.\r\n  weapons: In 1993, foreign governments reported 6,238 unlawfully acquired U.S.-origin\r\n  firearms to the Bureau of Alcohol, Tobacco and Firearms. Over half—3,376—were\r\n  discovered in Mexico.(12)  Guns flow from and through America to Mexico and beyond in\r\n  several ways. On 14 March 1997, U.S. federal agents opened two crates in a\r\n  \"left cargo\" hold at the Otay Mesa border crossing near San Diego, uncovering\r\n  the largest illegal shipment of arms ever intercepted in the United States en route to Mexico. The weapons—thousands of unassembled grenade launchers and parts for M2\r\n  automatic rifles—had been sitting unclaimed for two months. The shipment had\r\n  originated in Vietnam, where America left behind large quantities of weapons, including M2\r\n  automatic rifles. Before the arms returned home, they were well-traveled, having gone from\r\n  Ho Chi Minh City to Singapore to Bremerhaven, Germany, through the Panama Canal and up to\r\n  Long Beach, California, where the weapons entered the United States in two large, sealed\r\n  containers.(13)  The contents were falsely represented as hand tools and strap\r\n  hangers, but U.S. Customs at Long Beach did not inspect the cargo, since the shipment was\r\n  \"in-bond\"—that is, the items were simply transiting the United States to\r\n  Mexico. In-bond cargo containers typically remain sealed as they move from ship to truck\r\n  to border. Luckily, this shipment was held up at the border because the Mexican freight\r\n  forwarder commissioned to get the crates to Mexico City did not have an address for the\r\n  purchaser.(14) The in-bond system is built on trust, and on the Customs\r\n  Department's lack of resources. Customs has fewer than 135 inspectors at the port of Long\r\n  Beach, the nation's busiest port.(15)  Nevertheless, the Customs Department has\r\n  successfully thwarted a number of illegal arms export efforts, many of them involving\r\n  small arms shipments. For instance, in 1997 several defendants were indicted for\r\n  attempting to export illegally 53 AR-15 rifles from the United States to Colombia. In\r\n  another case in 1997, Customs blocked an attempt to import surface to air missiles from\r\n  Bulgaria for transhipment to Colombia. The Department also successfully prosecuted a\r\n  former Venezuelan secret service agent for the unlawful shipment of 120 firearms to\r\n  Venezuela between 1993-95.(16)  Unfortunately, there is no way to know what\r\n  percentage of the illegal trade from the United States to Central America is being\r\n  intercepted. Large and relatively well-organized arms shipments like the one\r\n  intercepted in San Diego are thought to be unusual. A more routine way of smuggling arms\r\n  across the border is the hormiga (ant) run: repeated trips across the border with\r\n  one or a few guns. A legally eligible or \"straw\" purchaser buys a few weapons\r\n  (often cheap .22 and .25 caliber pistols, \"38 specials,\" and 9mm pistols) from\r\n  gun stores in El Paso and other American border towns and hands them over to the\r\n  trafficker, who smuggles them across the border, generally either on foot or in the trunk\r\n  of a car. This process is repeated thousands of times a year, as smugglers make repeated\r\n  trips to gun stores and shows in Florida, Texas and California, in particular.(17) Some legal constraints are now in place, but lack of investigative\r\n  and regulatory resources reduce their efficacy. The \"Brady Bill\" mandates a\r\n  national system of background checks prior to gun purchases. And a rule recently enacted\r\n  by the Clinton administration requires purchasers to show that they have lived for at\r\n  least three months in the state where they are buying a gun. In addition, the 1994 assault\r\n  weapons ban curbs purchases by civilians of automatic and semi-automatic weapons. The Firearms Owners Protection Act of 1986 (sponsored by the\r\n  National Rifle Association) requires that multiple sales be reported to the BATF and local\r\n  law enforcement agencies, so that they can monitor multiple gun purchases and investigate\r\n  if they suspect criminal intent. But currently only three states—Virginia, Maryland\r\n  and South Carolina—have laws that prevent people from buying more than one gun a\r\n  month. In all other states, straw purchasers can buy significant quantities of guns and\r\n  ammunition from gun dealers at one time and pass them on to smugglers for clandestine\r\n  shipment. A 1991 BATF report describes a number of such transactions, including a 1989\r\n  case in which three Arizona residents purchased 93 assault rifles and 22 handguns for a\r\n  well known Mexican narcotics trafficker, who then smuggled them into Mexico.(18) U.S. and foreign military depots are another likely source of\r\n  black-market arms supply. In 1993, the General Accounting Office (GAO) found that small\r\n  arms parts were routinely stolen from a number of U.S. military repair shops and\r\n  warehouses. The parts were then sold to gun dealers or to walk-in customers at gun shows\r\n  around the United States. GAO investigators were able to purchase military small arms\r\n  parts at 13 of 15 gun shows they visited. They were able to buy everything needed to\r\n  convert a semiautomatic AR-15 rifle into a fully automatic M16, as well as 30-round M16\r\n  magazine clips still in their original packages.(19)  Given the paucity of end-use\r\n  checks performed on U.S.-supplied arms (see table 1), it is reasonable to assume that\r\n  theft of U.S.-supplied small arms from depots in Central America contributes to the black\r\n  market in arms, as well. [Appendix 1 deleted:  it was a printout from the small arms\r\n  database of US small arms authorizations to countries of the region during 1996-97.] Notes 1. U.S. Department of State and U.S.\r\n  Department of Defense, Foreign Military Assistance Act Report to Congress, Fiscal Year\r\n  1996 , September 1997; and the same for Fiscal Year 1997. 2. U.S. Department of State, Defense Trade News , Vol. 5,\r\n  No. 3 (July and October 1994), p. 6. 3. U.S. Senate Committee on Governmental Affairs, A Review of\r\n  Arms Export Licensing , Senate Hearing 103-670, p. 37. 4. For an account of these activities, see John\r\n  Prados, Presidents' Secret Wars: CIA and Pentagon Covert Operations Since World War II (New York: William Morrow, 1986), pp. 30-238; Harry Rositkze, The CIA's Secret\r\n  Operations: Espionage, Counterintelligence and Covert Action (New York: Reader's\r\n  Digest Press, 1977), pp. 166-80; and Gregory F. Treverton, Covert Action: The Limits of\r\n  Intervention in the Postwar World (New York: Basic Books, 1987), pp. 44-98. 5. Nina M. Serafino, Contra Aid 1981-March\r\n  1987: Summary and Chronology of Major Congressional Action on Key Legislation Concerning\r\n  U.S. Aid to the Anti-Sandinista Guerrillas , CRS Report for Congress (Washington:\r\n  Congressional Research Service, U.S. Library of Congress, 21 July 1987), p. 2. 6. See U.S. Congress, Report of the\r\n  Congressional Committees Investigating the Iran-Contra Affair (Washington: U.S.\r\n  Government Printing Office, 1987). 7. U.S. v. North, Stipulation, pp. 1-2. 8. Letter of John K. Singlaub to William J. Casey,\r\n  7 July 1986, accessed through the National Security Archives, Iran-Contra Document Set . 9. \"UNO/FARN Lethal Airdrop to Combat\r\n  Forces,\" CIA Intelligence Report on Enterprise Flight, Cable no. 825696, 12 April\r\n  1986, accessed through the National Security Archives, Iran-Contra Document Set . 10. On Guatemala see Tim Weiner, \"Tale of\r\n  Evasion of Ban on Aid for Guatemala,\" New York Times , 30 March 1995; Weiner,\r\n  \"In Guatemala's Dark Heart, C.I.A. Tied to Death and Aid,\" New York Times ,\r\n  2 April 1995; Wiener, \"C.I.A. Director Admits to Failure in Disclosing Links to\r\n  Guatemala, New York Times , 6 April 1995. On Honduras see Douglas Farrah,\r\n  \"Impunity Challenged,\" Washington Post , 16 October 1995; Ginger Thompson\r\n  and Gary Cohn, \"Honduras Charges Soldiers,\" Baltimore Sun , 26 July 1995. 11. See Dana Priest and R. Jeffrey Smith,\r\n  \"Defense Dept. to Investigate U.S. Military Role in Guatemala,\" Washington\r\n  Post , 1 April 1995; Tim Weiner, \"Secret Guatemalan Military Unit,\" New\r\n  York Times , 10 April 1995. 12. U.S. Department of the Treasury, Bureau of Alcohol, Tobacco\r\n  and Firearms, International Traffic in Arms Annual Report for FY 93 . 13. Valerie Alvord, \"Illegal Weapons Were\r\n  Well-Traveled,\" San Diego Union Tribune , 21 March 1997. 14. San Diego Union Tribune , 14 March 1997. 15. Anne-Marie O’Connor and Jeff Leeds, \"U.S. Agents\r\n  Seize Smuggled Arms,\" Los Angeles Times , 17 March 1997. A recent\r\n  Congressional hearing focused on the adequacy of the Customs Department's $2.1 billion\r\n  budget, noted that Customs has just 167 people in its investigative unit in Los Angeles,\r\n  less than half the number in each the New York and Florida branches. Jeff Leeds,\r\n  \"Customs Staffing Disparity Seen to Favor East,\" Washington Post , 20\r\n  October 1997. 16. U.S. Department of Justice, Export Control Enforcement Unit,\r\n  \"Significant Export Control Cases,\" 5 September 1997, Freedom of Information Act\r\n  request. 17. As of July 1997, there were 108,591 federally-licensed\r\n  firearms dealers in the United States. Of these, 1,860 were in Arizona; 7,138 in\r\n  California; 955 in New Mexico; and 7,922 in Texas. According to the Bureau of Alcohol,\r\n  Tobacco and Firearms, most of the U.S.-origin firearms traced to crimes in Mexico during\r\n  1994-97 came from Houston, Tuscon, Phoenix, El Paso and Dallas. 18. U.S. Department of the Treasury, Bureau of Alcohol, Tobacco\r\n  and Firearms, Firearms Division, International Traffic in Arms , Report to\r\n  Congress (1991), p. 132. 19. U.S. General Accounting Office (GAO), Small Arms Parts:\r\n  Poor Controls Invite Widespread Theft , Report GAO/NSIAD-94-21"
    }
  ]
}