{
  "url": "http://www.nsna.org/career/juggling.asp",
  "file_number": "613",
  "content_hash": "0f660f3687067b7f4d9458a9789d1c9aabd42725a5524c72592552d29f305f22",
  "total_blocks": 82,
  "retained_blocks": 6,
  "ignored_blocks": 76,
  "blocks": [
    {
      "tag": "p",
      "text": "NSNA Home | Contact Us | About Us | Member Services / Join or Renew | Sustaining Membership | Calendar & Deadlines | Site Map USER MENU FOR MILADY RESOURCES NURSING \r\n        - THE ULTIMATE ADVENTURE PLANNING \r\n        YOUR CAREER <a href=\"http://btob.barnesandnoble.com/index.asp?sourceID=0041497226&btob=Y&r=1\" target=\"_blank\"><img src=\"/images/bn/150x150_logo_noURL_stacked2.gif\" width=\"146\" height=\"82\" border=\"0\"><br>\r\n    </a><a href=\"http://btob.barnesandnoble.com/index.asp?sourceID=0041497226&btob=Y&r=1\" target=\"_blank\"><img src=\"/images/bn/8496_120x90.gif\" width=\"120\" height=\"90\" border=\"0\"></a> <a href=\"http://acareerathca.com\" target=\"_blank\"><img src=\"images/HCA_katie.gif\" border=\"0\"></a>\t</p> EMPLOYMENT \r\n        LINKS CAREERS \r\n        HOME HOSPITALS WITH INTERNSHIPS MAGNET HOSPITALS Careers by Location WEST CENTRAL SOUTHWEST SOUTH MIDWEST NORTHEAST ADVERTISING For information on advertising your facility on these pages, please contact Tom Edwards at tomNSNA@aol.com"
    },
    {
      "tag": "div",
      "text": "MAIN PAGE CONTENT GOES HERE"
    },
    {
      "tag": "p",
      "text": "Juggling Nursing School and Family by Diana Bitritto Nursing school today attracts many older students \r\n              who are looking to embark on new career paths. However, these mature \r\n              students often face challenges not usually encountered by their \r\n              younger associates, such as work and family. Juggling nursing school with family responsibilities or a full-time \r\n              job (usually both) is a difficult and often overwhelming task. The \r\n              good news is that there's a vast difference between difficult and \r\n              impossible. This article is intended to help the mature student \r\n              survive and even thrive on the challenge. First of all, flexibility is essential – and an important \r\n              part of being a nurse. Kids will fight while you're trying to figure \r\n              out a care plan. The babysitter may call in sick, your car may break \r\n              down, or you might have to work overtime on the day of your final \r\n              exam. If you're taking your courses at college, take it slowly – \r\n              even one course a semester. You may not have the luxury of having \r\n              the time to study several courses at once. You may be able to transfer \r\n              prerequisite college level courses (English, math, or psychology, \r\n              for example). There's also a program called CLEP, which gives college \r\n              credit for life experiences, such as work, travel, or independent \r\n              study. The student who works outside the health care field may unfortunately \r\n              encounter skepticism from classmates and even some instructors. \r\n              They may challenge you with, \"You have it pretty good at your \r\n              present job. Why do you want to go into nursing?\" If you wanted \r\n              to stay in your present occupation you wouldn't be attending nursing \r\n              school. Many working students are concerned whether or not they should \r\n              let their boss or co-workers in on their secret. This is a highly \r\n              individual decision which depends greatly on your work arrangements, \r\n              how much school will affect your work, and how well you get along \r\n              with your boss. Bear in mind that a boss's job as well as yours \r\n              is to act in the best interests of the company. It's easier if your \r\n              going to school has a minimal impact on your job performance. Bear in mind. that a boss's job as well as yours is to act in the \r\n              best interests of the company. It's easier if your going to school \r\n              has a minimal impact on your job performance. Employers also vary greatly in their flexibility regarding time \r\n              off. Be creative in using your vacation time. You might need only \r\n              half a vacation day to attend an extended clinical or you might \r\n              skip lunch to leave an hour early for last minute exam preparations. \r\n              Save some vacation time for school activities that might otherwise \r\n              conflict with your work schedule. Use your lunch hour to study or \r\n              even to get in a little lab practice if your job is close enough \r\n              to school. Students who are already working in the health care field have \r\n              a distinct advantage. Not only do they have related experience, \r\n              but their employer is more likely to be supportive of their educational \r\n              goals. Every job, however, has attributes that are valuable in nursing. \r\n              Asalesperson or receptionist, for example, needs excellent communications \r\n              skills to deal with angry or difficult customers. Other positions \r\n              may require analytical, creative, or critical thinking skills, manual \r\n              dexterity, mathematical aptitude, attention to details, or the ability \r\n              to set priorities. all of these skills are desirable qualities for \r\n              a nurse. Use your job skills to your advantage in your education. Going to school will also have a profound impact on your home life. \r\n              If you pride yourself on keeping an immaculate house, you may need \r\n              to lower your standards. Family members can vacuum or run the dishwasher, \r\n              but only you can study for your exams. However, your family might \r\n              not always give you the support you need. You may come home from \r\n              clinical to a kitchen sink piled high with dirty dishes, an overflowing \r\n              laundry hamper, and two chapters you still have to study for tomorrow. \r\n              If you can afford to hire a cleaning service or send out your laundry, \r\n              the investment could well be worth it in saved time. Prepared frozen \r\n              foods are also a real time saver. Finally, and most important of all, take time for yourself every \r\n              day. This point cannot be stressed enough! Even half an hour to \r\n              enjoy a warm bath, stroll around the block, or read something without \r\n              the word \"nursing\" in it can do wonders to refresh you \r\n              physically, mentally, and emotionally. It is encouraging to see more evening nursing programs, but nursing \r\n              schools need to be more aware of and address the concerns of the \r\n              student who is trying to balance three different and often conflicting \r\n              roles. For example, the evening LPN program at our county vocational \r\n              school runs for two years as compared to one year for the daytime \r\n              program. It is unrealistic to suggest that working students cut \r\n              back to part-time or quit altogether. Most of them need the income \r\n              and benefits until they can get that first nursing job. They might \r\n              already be concerned about the possibility of having to choose between \r\n              leaving the job and facing financial hardship in order to complete \r\n              school or giving up school – and their dreams. Instructors \r\n              who treat working students with a little extra patience and emotional \r\n              support will be rewarded by these who readily give 200% to their \r\n              nursing studies. Even half an hour to enjoy a warm bath, stroll around the block, \r\n              or read something without the word \"nursing\" in it can \r\n              do wonders to refresh you physically, mentally, and emotionally. Going to nursing school while having to work and care for a family \r\n              requires stamina, self-discipline, resourcefulness, and dedication, \r\n              all of which are prerequisites for being a nurse. The demands are \r\n              numerous on nursing students in their 30s, 40s, or beyond, but their \r\n              maturity and experience are invaluable assets in helping to meet \r\n              them. Older students are highly motivated and usually of excellent \r\n              quality. They bring a wealth of backgrounds, perspectives, and life \r\n              experiences to enrich the nursing profession. ............................................................. The author is a nursing student in the LPN program at Ocean \r\n              County Vocational Technical School in Toms River, NJ."
    },
    {
      "tag": "div",
      "text": "FEATURE COLUMN STARTS HERE"
    },
    {
      "tag": "p",
      "text": "Career \r\n        Center | Membership | Elected \r\n        Officials | Publications | Foundation | Faculty/Advisors | Links/Resources NSNA Home | Adobe Acrobat | Feedback | Policy Disclaimer"
    },
    {
      "tag": "div",
      "text": "SiteCatalyst code version: G.5.\r\nCopyright 1997-2003 Omniture, Inc. More info available at\r\nhttp://www.omniture.com End SiteCatalyst code version: G.5."
    }
  ]
}