{
  "url": "http://www.offoffoff.com/theater/2004/corporaterock.php",
  "file_number": "617",
  "content_hash": "d21e321ea31258624791913b59ed32e986465c251851534a92c29868a05032f3",
  "total_blocks": 94,
  "retained_blocks": 5,
  "ignored_blocks": 89,
  "blocks": [
    {
      "tag": "div",
      "text": "$pattern = /theater/2004/corporaterock[0-9]?.php3? $ordered_comment_array[-1] = $ordered_comment_array[0] = OFFOFFOFF PAGETOP RIGHT-HAND AD CELL OPEN RIGHT CELL MIDDLE TABLE ADVERTISEMENT KABOOMMOVIE.COM SUBSCRIBE FORM END KABOOMMOVIE.COM SUBSCRIBE FORM <tr><td bgcolor=\"#0453a4\" width=142>\n\t\t\t\t<font size=1 face=\"arial,helvetica,sans-serif\">&nbsp;BULLETIN BOARD</font>\n\t\t\t</td></tr>\n\t\t\t\n\t\t\t<tr><td bgcolor=\"#000000\" width=142><table cellspacing=1 cellpadding=5 border=0 width=140><tr><td bgcolor=\"#ffffff\" width=140>\n\t\t\t\n\t\t\t<img src=\"http://www.offoffoff.com/images/clear.gif\" width=130 height=5><br>\n\t\t\t\n\t\t\t<font size=1 face=\"arial,helvetica,sans-serif\">\n\t\t\t\t\n\t\t\t\t\t\t\t\tMessages from our readers:<br><br>\n\t\t\t\t\n\t\t\t\t\t\t\n\t\t\t\t<br><br>\n\t\t\t\t\t\t\t\t\n\t\t\t\tGot an event to promote? Got an opinion? <a href=\"/bulletinboard/enter.php\">Submit it free</a>. \n\t\t\t\t\n\t\t\t\t<br><br>\n\t\t\t\t\n\t\t\t</font>\n\t\t\t\n\t\t\t</td></tr></table></td></tr> ADVERTISEMENT GOOGLE CODE <a href=\"/ads/redirect.php3?a=52&u=http://www.filmmovement.com/\" target=\"_blank\"><img src=\"/ads/images/filmmovement/filmmovement_120x60.gif\" width=\"120\" height=\"60\" border=\"0\"></a><br><br>\n\t\t\t\t\n\t\t\t\t<a href=\"/ads/redirect.php3?a=61&u=http://www.dixonplace.org/\" target=\"_blank\"><img src=\"/ads/images/dixon/dixon_136x500.gif\" width=\"136\" height=\"500\" border=\"0\"></a><br><br> CLOSE RIGHT CELL MIDDLE TABLE END RIGHT-SIDE AD CELL LEFT INDEX CELL Site links OFFOFFOFF Home About OFFOFFOFF Contact us NEWSLETTER SIGNUP FORM <img src=\"/images/newsletterbutton.gif\" width=\"144\" height=\"28\"><br> Get our newsletter: <input type=\"submit\" value=\"Sign me up!\"> SITE SEARCH FORM Search the site: Theater section Theater main page Theater archive Theater links Current theater I Found Her Tied to My Bed Nine Parts of Desire Archive Complete archive, 1999-present 2004-2005 reviews: Abundance Audit Aunt Dan and Lemon Barbara Bush Never Slept Here Charlie Victor Romeo Cooking the Books Corporate Rock Demon Baby Doa Rosita the Spinster The Eliots Great Men of Gospel The Heiress King Cowboy Rufus Rules the Universe The Last Supper The Life and Times of Barry Goldhubris (dance) Mao on Line One A Midsummer Night's Dream The Mystery of the Charity of Joan of Arc Outside the Law Promised Land The Soup Comes Last Suitcase, or Those that Resemble Flies from a Distance Waitin' 2 End Hell Weights The Wild Duck CENTER CONTENT CELL ADVERTISEMENT REVIEW: CORPORATE ROCK INNER TABLE CONTAINING CONTENT CELLS"
    },
    {
      "tag": "p",
      "text": "<img src=\"/film/2002/images/top10of2002.gif\" width=248 height=30> &nbsp;"
    },
    {
      "tag": "div",
      "text": "CONTENT STARTS HERE Rocking Rolling Stone Set in the offices of a fictional Rolling Stone magazine, \"Corporate Rock\" is a very loose comedy about the pathetic state of mainstream music redeemed by some very funny screwball antics."
    },
    {
      "tag": "p",
      "text": "By JOSHUA TANZER Offoffoff.com"
    },
    {
      "tag": "div",
      "text": "\"It's better to burn out than to fade away,\" the house misfit mentions to the big boss at this fictionalized version of the Rolling Stone offices, and he's promptly told to quit quoting Hunter S. Thompson all the time. Thus has the onetime chronicle of the counterculture evolved to the MTV-ified present day. CORPORATE ROCK Written by: William Bennett . Directed by: Tim Haskell . Cast: Travis York, Dorian Missick, Natalia Hernandez, Charles Jang, Gerry Sheridan, Jamie Benge, Aaron Haskell, Kellie Arens, Nick Arens . Choreography by: Rebecca Ramirez . Sound design by: Vincent Olivieri . Set design by: Paul Smithyman . Costumes by: Sarah Iams . Lighting design by: Nick Hohn . Fight choreography: DeeAnn Weir . SCHEDULE Blue Heron Arts Center 123 E. 24th St. July 8 - Aug. 1, 2004 Thurs.-Sat. 8 p.m., Sun. 3 p.m. (212) 868-4444 Tickets: $25 Those who recognize the quote above (including most readers of this article, Ihope) will also remember the other signature line from the same song: \"Rock and roll will never die.\" Neil Young was probably in anthemic rather than ironic mode when he wrote those lyrics, or he might have foretold the actual death throes of rock and roll, which are what the show \"Corporate Rock\" is all about. Over the top and under the top, overacted and underacted, ridiculously campy and occasionally earnest, William Bennett's play cranks out riff after comedic riff in the hopes that something in there will rock your world. Sometimes it does. Dylan (Travis York), the misfit who is the magazine's last connection to the soul of rock and roll, squanders his days writing articles about bands with names like Underkill and the Knights Who Say Neat, which get filed away on the web site while the magazine's bigger names churn out repeated cover stories on Britney Spears and the plastic surgeons to the stars. (It's better to churn out than to fade away, you might say.) The closest thing he gets to a big break is the chance to edit the mag's star writer, Nathaniel Hunger (a permanently leering Jamie Benge), which actually means keeping him from falling out of his chair long enough to half-finish a piece of minimally publishable prose. Acockamamie plot ensues in which something happens to make Nathaniel disappear, Dylan surreptitiously usurps his byline for the duration, and the whole thing is given a screwball wrapup involving a Russian call girl, French heavy-metal gangsters (huh?), and an argument about Def Leppard. Whether any of this holds together as a convincing comedy, the play has a number of hilarious individual moments. Besides a few of Dylan's choicest pronouncements on the lame pop stars of the moment, there are several great visual gags (the handshakes alone are a hoot), and Aaron Haskell as a high-pitched white hip-hopper borders on the unintelligible but can be mad funny. And somewhere behind the play's shenanigans is a message about the heat death of our cultural universe. The last time Iread Rolling Stone was probably 18 years ago, when the likes of Phil Collins on the cover were already advertising the magazine's creeping irrelevance, so Ican't say exactly how much more out of touch it may be today. But of course one magazine's failure of nerve doesn't mean rock and roll is really dead — today's Hendrixes and Cobains have just been pushed back under the radar where, perhaps, they belong. Today's rock \"Corporate Rock\" isn't the most eloquent takedown of our tepid mass culture, but most of the audience walked away well entertained. From director Timothy Haskell and some of the other talents behind last year's self-explanatorily raucous hit \" Road House: the stage version of the cinema classic that starred Patrick Swayze Except This One Stars Taimak from the 80's Cult Classic 'the Last Dragon' wearing a Blonde Mullet Wig ,\" it's another anything-goes tag-team mle of a play, only this time with less fighting and more arguing about whose favorite band sucks. In more subject-appropriate terms, it's a play with one part Frank Zappa to every two parts Dweezil. JULY 14, 2004 OFFOFFOFF.COM • THE GUIDE TO ALTERNATIVE NEW YORK Post a comment on \"Corporate Rock\" CONTENT ENDS HERE"
    }
  ]
}