{
  "url": "http://www.opinionjournal.com/best/?id=110002241",
  "content_hash": "451bce18d1a9c924f78ce339cb84b686014676d56a877fdeee9c90b72bea51c9",
  "total_blocks": 318,
  "retained_blocks": 9,
  "ignored_blocks": 309,
  "blocks": [
    {
      "tag": "div",
      "text": "BEGIN promo END promo [[container:tabs]] BEGIN Omniture Call END Omniture Call [[/container:tabs]] top header dividing line <a href=\"/politicaldiary/\"><img src=\"http://images.opinionjournal.com/images/nav_left/nav_politicaldiary.gif\" alt=\"&quot;Political Diary&quot;\" width=\"146\" height=\"16\" hspace=\"0\" vspace=\"0\" border=\"0\"></a></td> Search Box BEGINS OpinionJournal WSJ Online Search Box ENDS Select a Page Editorial Page Leisure & Arts Front Page Asia View Europe View Weekend Journal Money Tech Center Wall Street Journal CareerJournal CollegeJournal RealEstateJournal StartupJournal WSJbooks CareerJournalAsia CareerJournalEurope MarketWatch December 26, 2006 7:44pm EST BEGIN big ad END big ad BEGIN viewpoint END viewpoint BEGIN viewpoint PatriotShop.US Visit PatriotShop.US to find the Right Gifts for every Patriot on your Christmas list. The American Spectator The voice of the true conservative -- Ben Stein, the Washington Prowler and R. Emmett Tyrrell, Jr. Keep Our Markets Free Investing commentary \nfrom a conservative perspective. Promote Your Company Distribute a news release with PR Newswire and create visibility. It's Just Lunch Wall Street Careers CRM Software SALESFORCE.COM - Rated #1 CRM. Free 30-Day Trial and Demo. $100k+ job search Advertisement end font-style explicit size END viewpoint"
    },
    {
      "tag": "blockquote",
      "text": "Note: Links were good at the time we posted this column,\r\n\tbut they often go bad after a while. We make no guarantees."
    },
    {
      "tag": "div",
      "text": "BY JAMES TARANTO Monday, September 9, 2002 1:57 p.m. EDT"
    },
    {
      "tag": "p",
      "text": "Why \r\n  We Hate Them \"Why \r\n  do they hate us?\" was a common refrain after Sept. 11; far less often heard \r\n  was the converse question: Why do we hate them? Maybe that's because the answer \r\n  is so obvious, but even so, a reminder every now and then doesn't do any harm. \r\n  A group of radical Islamists in London are providing just such a reminder, holding \r\n  a rally to celebrate--yes, celebrate--the atrocities their coreligionists committed \r\n  a year ago. The poster nearby advertises the event with the slogan \"September \r\n  the 11th 2001: A towering day in history.\" Oh, those wacky Islamic punsters. \"The conference, which will be attended by the most radical mullahs in Britain, \r\n  will argue that the atrocities were justified because Muslims must defend themselves \r\n  against armed aggression,\" the London Daily Telegraph reports. Al-Muhajiroun , \r\n  the sponsor, has a program for the confab on its Web site; it includes talks \r\n  on \"The positive outcomes of the 11th September 2001,\" \"The US conspiracy against \r\n  Islam and Muslims\" and \"The alliance of the US and Al-Saud [our friends the \r\n  Saudis] in their attack against Muslims.\" The men behind the celebration say \r\n  they're starting a new group called the Islamic Council of Britain, \"funded \r\n  by Saudi-based businessmen, which, if true, will embarrass Saudi Arabia,\" \r\n  according to the Telegraph. This is of course enraging, but it's also just plain weird. What kind of country, \r\n  in the midst of a war, allows its mortal enemies to hold a hate-fest on its \r\n  own soil? It's as if Nazi sympathizers were holding Nuremberg-style rallies \r\n  in Britain and the U.S. in 1942. In most countries at most times in history, \r\n  surely the Al-Muhajirounites would be rounded up and arrested, if not executed, \r\n  for treason. One might take a perverse pride that the Anglo-American tradition of freedom \r\n  is so robust, and so fearless, that it allows even the most thuggish fanatics \r\n  to speak their minds in public. Or one might argue that this is a case of tolerance \r\n  gone mad. In any case, let's hope the conference is well attended by folks from Scotland Yard and MI5 . Baghdad \r\n  Jane Maybe the Cold War is a better analogy than World War II. During that conflict, \r\n  there was a communist fringe in the U.S., and even more so elsewhere in the \r\n  West, which, McCarthyism notwithstanding, generally was free to express its \r\n  hatred for America. Everyone remembers how \" Hanoi \r\n  Jane \" Fonda went to North Vietnam in 1972 to show solidarity with the \r\n  enemy. Call Scott Ritter \"Baghdad Jane.\" The erstwhile U.N. weapons inspector \r\n  was in the Iraqi capital yesterday, where he told Iraq's \"parliament\" \r\n  as the BBC puts it, \"that Iraq is not a threat to the outside world and \r\n  that military action against the country would not be justifiable.\" Ritter \r\n  did call on the Iraqis to let inspectors back in, but he also claimed Iraq has \r\n  no weapons of mass destruction--though it's hard to see how he could know this, \r\n  since no inspectors have been to Iraq in four years. Saddam's \r\n  Nuke Quest \"Iraq could assemble a nuclear weapon in months if it had foreign help,\" \r\n  CNN reports, citing a new study by the International \r\n  Institute for Strategic Studies . \"The argument in favor of taking action \r\n  now, whether it's to compel Baghdad to accept inspectors or to use military \r\n  force to change the regime, is that it's better to act when [Iraq's] capabilities \r\n  are still short of reaching their ultimate objective,\" the report's author, \r\n  Gary Samore, tells CNN. The New \r\n  York Times also reports that \"Iraq has stepped up its quest for nuclear \r\n  weapons and has embarked on a worldwide hunt for materials to make an atomic \r\n  bomb\": In the last 14 months, Iraq has sought to buy thousands of specially designed \r\n    aluminum tubes, which American officials believe were intended as components \r\n    of centrifuges to enrich uranium. American officials said several efforts \r\n    to arrange the shipment of the aluminum tubes were blocked or intercepted \r\n    but declined to say, citing the sensitivity of the intelligence, where they \r\n    came from or how they were stopped. . . . The attempted purchases are not the only signs of a renewed Iraqi interest \r\n    in acquiring nuclear arms. President Hussein has met repeatedly in recent \r\n    months with Iraq's top nuclear scientists and, according to American intelligence, \r\n    praised their efforts as part of his campaign against the West. Iraqi defectors who once worked for the nuclear weapons establishment have \r\n    told American officials that acquiring nuclear arms is again a top Iraqi priority. The Scotsman has details on a dossier it says Prime Minister Tony Blair will soon issue on Saddam's efforts to acquire \r\n  nukes. The Telegraph reports that \"Tony Blair and President George W Bush have agreed to topple \r\n  Saddam Hussein by military means even if the United Nations does not pass a \r\n  Security Council resolution authorising the use of force.\" So much for \r\n  complaints of U.S. \"unilaterialism.\" Though the U.S. must be willing to act alone, there's ample evidence that President Bush is in the midst of \r\n  assembling an international coalition:"
    },
    {
      "tag": "div",
      "text": "John Howard, prime minister of Australia , \r\n    tells the Associated Press that he agrees with \"Washington's position \r\n    . . . that the United Nation's should play a greater role in resolving \r\n    the problem with Iraq's alleged nuclear ambitions.\" \"President Jacques Chirac of France proposed a two-stage plan today that could lead to United Nations authorization \r\n    of military force against Iraq,\" the New York Times reports. Germany 's \r\n    Chancellor Gerhard Schroeder says he's unalterably opposed to toppling Saddam--but \r\n    his challenger, Edmund Stoiber, is more flexible, and the election is less \r\n    than two weeks off. Bush is meeting with Canada 's \r\n    Prime Minister Jean Chretien today--though Reuters quotes Chretien's deputy, \r\n    John Manley, as saying the Canadians \"haven't signed on to\" Bush's \r\n    plans for regime change."
    },
    {
      "tag": "p",
      "text": "Oddly, British and American opponents of overthrowing Saddam (with a few exceptions, \r\n  such as Brent \r\n  Scowcroft ) have shied away from forthrightly making the case against intervention, \r\n  instead professing their ignorance and calling on President Bush to \"make \r\n  the case\" against Saddam. The Telegraph's Barbara \r\n  Amiel is on to them: These voices never floundered before. They have never let information alone \r\n    stand in the way of telling Prime Ministers and Presidents what to do about \r\n    the Cold War, the Gulf war, the Panama invasion, the Falklands, Global Warming, \r\n    Poverty, Hunger and Dirt. One suspects that they really want to put their collective heads in the sand \r\n    or, less generously, side with a coalition of anti-Americans, muddled Marxists \r\n    and confused admirers of Islamism all intent on seeing capitalism, Israel \r\n    and America crippled. But as this agenda is not quite respectable, so it must \r\n    be masked by a feigned thirst for knowledge. And what about Arab opposition? \"Syria is showing increasing signs of \r\n  unease at Washington's plans to topple Saddam Hussein in neighboring Iraq, fearing \r\n  it would be the first step in a wave of regime changes in the Middle East to \r\n  suit US and Israeli interests,\" the Christian \r\n  Science Monitor reports. (Such changes, of course, would also suit the interests \r\n  of the people of the countries whose tyrannical regimes change.) The \r\n  paper quotes Murhaf Jouejati, a Syrian specialist at Washington's Middle East \r\n  Institute: \"Damascus would not like to see the regime toppled and substituted \r\n  by a pro-American regime because in that case Damascus would be totally surrounded \r\n  by American power.\" Is \r\n  Osama Dead? Al-Jazeera seems to think so. \"A slip of the tongue by one of Osama bin \r\n  Laden's top henchmen seems to have betrayed al-Qaeda's most potent secret: its \r\n  charismatic leader is dead,\" the Times of London reports. In an interview \r\n  with the Qatar-based satellite network, Khalid Sheikh Mohammed \"referred \r\n  to bin Laden, who has not been seen since the fall of Afghanistan's Taleban \r\n  regime, in the past tense. The reporter Yosri Fouda, London bureau chief for \r\n  al-Jazeera, concluded that bin Laden is now likely to be dead.\" Mohammed also told Fouda that, in the Times' words, \"the target of the \r\n  fourth, thwarted hijack attack in Washington was Congress, not the White House; \r\n  the original plan was to crash aircraft into atomic power stations; and the \r\n  plotters used simple codes to keep in touch by internet.\" In its report on the al Qaeda confession, Reuters declares, believe it or not, that \"Washington has accused bin Laden and \r\n  al Qaeda of being responsible for the attacks.\" Reuters \r\n  Outdoes Itself--II As we \r\n  noted , last week Reuters published a photo of the World Trade Center site \r\n  with the following caption: Recovery and debris removal work continues at the site of the World Trade \r\n    Center known as \"ground zero\" in New York, March 25, 2002. Human rights around \r\n    the world have been a casualty of the U.S. \"war on terror\" since September \r\n    11. That photo has now disappeared from the Yahoo! archives, and the Washington \r\n  Post's Howard Kurtz reports that Nancy Bobrowitz, the wire service's spokeswoman, \r\n  \"says the caption was a 'mistake' because the information, drawn from an \r\n  accompanying story, was taken 'out of context.' \" Well, here are the first \r\n  two paragraphs of the accompanying \r\n  story : GENEVA (Reuters)--Human rights around the world have been a casualty of the \r\n    U.S. \"war on terror\" since September 11. In the year since Muslim extremists flew hijacked planes into New York and \r\n    Washington, killing some 3,000 people, many Western governments have armed \r\n    themselves with greater powers of arrest and curtailed the legal rights of \r\n    detainees as they hunt for accomplices. The dispatch is headlined \"Rights the First Victim of 'War on Terror,' \" \r\n  and only in the third paragraph does reporter Richard Waddington attribute these \r\n  opinions to \"human rights activists\"--hardly an unbiased source. Not \r\n  Too Brite--IV \"An Iranian man cut off his seven-year-old daughter's head after suspecting \r\n  she had been raped by her uncle,\" Reuters reports, citing a report in an \r\n  Iranian newspaper. \" 'The motive behind the killing was to defend \r\n  my honor, fame, and dignity,' the paper quoted the father as saying.\" Reuters apparently thinks the murder of a seven-year-old girl is kind of cute; \r\n  the story appears under the heading \"Oddly Enough.\" Great \r\n  Moments in Law Enforcement \"The government mistakenly gave alleged terrorist Zacarias Moussaoui classified \r\n  documents related to al Qaeda,\" ABC News reports. \"The material--both \r\n  on disk and as hard copy documents--was sent to Moussaoui as part of discovery \r\n  for his legal defense, said several legal sources, including one at the Justice \r\n  Department.\" Meanwhile, the Associated \r\n  Press reports that \"German authorities had suspicions nearly two months \r\n  ago about a Turkish man suspected of plotting to bomb U.S. military bases in \r\n  Germany, but bureaucratic procedures delayed his arrest until last week\": A tip from U.S. security officials that a witness reported the suspect had \r\n    chemicals at home reached German prosecutors in mid-July, but a judge put \r\n    off questioning of the woman, scheduled for Aug. 13, because the summons could \r\n    not be delivered on time, said Elke O'Donoghue, a prosecutor in the city of \r\n    Stuttgart. Prosecutors got a search warrant Aug. 30, and six days later they arrested \r\n  Osman Petmezci and his American fiancée, Astrid Eyzaguirre. \"Inside \r\n  the couple's third-floor apartment, police found 287 pounds of bomb-making chemicals--which \r\n  investigators said Sunday could have been used to make about 44 pounds of gunpowder--along \r\n  with five pipe bombs, a book about bomb-making and electronic parts apparently \r\n  intended as detonators.\" The cops say they don't think the couple were \r\n  connected with al Qaeda. Only \r\n  Outlaws Will Have Suicide Bombs \"Palestinian leader Yasser Arafat is to ask a key meeting of the Palestinian \r\n  parliament on Monday to outlaw suicide bombing and to reaffirm the Palestinian \r\n  commitment to peace with Israel,\" the Associated Press reported. But he \r\n  ended up doing no such thing. Instead, as the New York Times reports, he \"told \r\n  Palestinian legislators today that he condemned acts of terror against Israeli \r\n  and Palestinian civilians, and said he believed that peace with Israel was still \r\n  possible. But he stopped short of calling for an end to all attacks against \r\n  Israelis.\" Even Arafat's condemnation of terror \"against Israel civilians\" doesn't \r\n  amount to much, for the Palestinian Arabs don't regard anyone who's ever served \r\n  in the Israeli Defense Forces (in a country with universal conscription) or \r\n  who lives in the disputed territories as a \"civilian.\" Agence \r\n  France-Presse , meanwhile, reports that the IDF found a \"powerful bomb\" \r\n  in the offices of what AFP calls \"Arafat's mainstream Fatah movement.\" Arafat won a Nobel Peace Prize in 1994. Ha'aretz reports that one of Arafat's cabinet members threatened that, in the paper's \r\n  words, \"the Palestinian Authority might reconsider its recognition of the \r\n  State of Israel, in view of Prime Minister Ariel Sharon's declaration that all \r\n  the signed agreements between the two sides are canceled.\" Oh, what a threat! \r\n  Next thing you know the Palestinians will initiate some sort of hostilities \r\n  or something. Here's some good news from the Mideast. Time magazine reports that the terror group Hamas is in ruins. \"Israeli intelligence \r\n  officials tell TIME that since the start last spring of the West Bank offensive \r\n  known as Operation Defensive Shield, 98% of the members of Hamas' military wing \r\n  who are known to them in the area have been killed or arrested--a total of 70 \r\n  men.\" Who says there's no military solution to terrorism? A \r\n  Real Martyr Contrary to early reports, at least one of the men whom U.S. special forces \r\n  troops shot and killed during an assassination attempt against Afghanistan's \r\n  President Hamid Karzai was not an assassin. The New York Times reports on how \r\n  Azimullah Muhammad became \"Afghanistan's newest hero\": On Friday, television viewers around the world watched BBC reports of a man \r\n    in a brown tunic watching as an Afghan army guard turned his gun the wrong \r\n    way -- against President Hamid Karzai and the Kandahar governor, Gul Agha Shirzai. \"Azimullah didn't hesitate a second, he just jumped on him when he saw him \r\n    shooting,\" Khalil Pashtoon, the governor's press secretary, said today of \r\n    the young man. . . . In the scuffle, the soldier apparently shot the young man as they wrestled \r\n    to the ground. Then, American Special Forces bodyguards apparently shot them \r\n    both dead. Next: \r\n  O.J. Simpson Lectures Us on Nonviolence Former tennis star John McEnroe weighs in with an op-ed in the Daily Telegraph, \r\n  and we swear we're not making this up: In travelling the world as a tennis player, I have a better appreciation \r\n    of other countries than most Americans. We could do with being a little less \r\n    besotted with money, money, money, win, win, win. When I am in England each \r\n    summer people always ask: \"Why don't English players win Wimbledon? They ought \r\n    to be more like Americans and play to win.\" To my mind, it's time Americans \r\n    started being more like the English--or at least learnt to lose with grace. Those \r\n  Skeptics Will Believe Anything Tom Brazaitis of the Cleveland Plain Dealer reports on an article in Skeptical \r\n  Inquirer (the piece itself isn't online) that says terrorism is no big deal: The authors, research scientists Clark Chapman and Alan Harris, say that \r\n    the disproportionate reaction to Sept. 11 has been as damaging as the destruction \r\n    of lives and property on that day. \"An objective of terrorism is to multiply damage by inducing irrational fears \r\n    in the broad population,\" they write. \"One defense is to learn to evaluate \r\n    such situations more objectively.\" . . . \"Every month, including September 2001, the U.S. highway death toll exceeds \r\n    fatalities in the World Trade Center, Pentagon and four downed airliners combined,\" \r\n    they write. Don't you feel better now? You Probably \r\n  Think This Screed Is About You Matt Drudge picks up a Sunday Times of London op-ed by Norman Mailer (the Times' \r\n  Sunday edition is no longer available online without a steep subscription fee) \r\n  in which the author says America is \"so vain\": Culturally, emotionally America is growing more loutish, arrogant, and vain. \r\n    I detest this totally promiscuous patriotism. Wave a little flag and become \r\n    a good person? Ugly. If we have a depression or fall into desperate economic \r\n    times, I don't know what's going to hold the country together. . . . There's just too much anger here, too much ruptured vanity, too much shock, \r\n    too much identity crisis. And worst of all, too much patriotism. Patriotism \r\n    in a country that's failing has a logical tendency to turn fascistic. Freudian Slip Bill Clinton called on the U.S. to \"flush out\" al Qaeda, not \"flesh \r\n  out,\" as the Associated Press quoted him. We repeated \r\n  the error Friday. The \r\n  Grass Is Always Greener on the Other Side \"U.S. politicians have expressed unhappiness with the idea of Canada in \r\n  any way easing its stance on marijuana and some say if Ottawa did relax its \r\n  rules, this could lead to a clampdown on the countries' long joint frontier,\" \r\n  Reuters reports. Homelessness Rediscovery Watch \"If George W. Bush becomes president, the armies of the homeless, hundreds \r\n    of thousands strong, will once again be used to illustrate the opposition's \r\n    arguments about welfare, the economy, and taxation.\"-- Mark \r\n    Helprin , Oct. 31, 2000 \"The 'Homeless in Paradise' Inhabit Beach Cities in Growing Numbers\"--headline, Los \r\n    Angeles Times , Sept. 8, 2002 No \r\n  Man's Land \"India's first eunuch mayor has been unseated in a legal dispute over whether \r\n  she is a man or a woman,\" the Washington Times reports: As all Indian eunuchs do, Kamla Jaan dresses as a woman and believes she \r\n    is a female. But a judge in the central state of Madhya Pradesh ruled last \r\n    week that Kamla Jaan is, in fact, a man and should be disqualified from the \r\n    mayoral post, which is reserved under a quota system for a female candidate. . . . Kamla Jaan, who is illiterate, argued that she was a \"born eunuch\"--an authentic \r\n    eunuch is a castrated male--and so should not be considered a man. But in \r\n    his 40-page ruling, the judge agreed with the group of petitioners that Kamla \r\n    Jaan is male. The Times quotes P. Manorama, a physician who works with eunuchs, as saying \r\n  that \"roughly estimated, one in a hundred eunuchs is a natural eunuch or hermaphrodite \r\n  born with deformed or ambiguous genitalia--neither a boy nor a girl.\" That \r\n  means the other 99 are all castrated. Which leads us to wonder: Why do press \r\n  reports treat this as a quaint feature of Indian culture, when it seems every \r\n  bit as barbaric as the African and Muslim practice of female genital mutilation? You \r\n  Don't Say \"HP Researchers Make Tiny Memory From Molecules\"--headline, Reuters, \r\n  Sept. 9 Of course, lots of big things, including trucks and skyscrapers, are also made \r\n  of molecules. It's \r\n  the Eponymy, Stupid A woman in Arlington, Wash., was driving her pickup truck when a red-tailed \r\n  hawk collided with it. \"after she freed the bird's wing from the side-view \r\n  mirror, the hawk invaded the truck, bit [the woman's] lip and then sank its \r\n  talons into her right arm,\" the Associated Press reports. She drove to \r\n  a gas station and shouted: \"Call 911! I have a hawk stuck to my arm.\" The woman's name is Jamie Wing. 'My \r\n  Public Spirit Stops at My Daughter' In a letter to the editor of the Washington Post, one April Falcon Doss explains \r\n  why she chose to send her daughter to a private school: For a card-carrying liberal, I was surprisingly unapologetic about our decision. \r\n    Why should I sacrifice our daughter's future to an abstract principle? I wasn't \r\n    up to battling the school system about class size, curriculum and extracurricular \r\n    activities. And by the time any changes could be made, our daughter would \r\n    have already missed out on a vibrant education Here in a nutshell is the definition of an American liberal: one who is willing \r\n  to sacrifice the future of other people's children to an abstract principle. (Elizabeth Crowley helps compile Best of the Web Today. Thanks to Drew Parkhill, \r\n  Jenifer Sawicki, Rosanne Klass, David Gartenstein-Ross, Ian Wright, S.E. Brenner, \r\n  Jeffrey Weinstein, Tom Palermo, Dan Friedman, Peg Innis, David Merrill, Greg \r\n  Dougherty, Doug Levene, Raghu Desikan, Jose Guardia, Ken Jorgensen, Judith Kaplan, \r\n  Diane Ravitch, Jim Fehrle, Michael Segal, C.E. Dobkin, Carl Sherer, Ed Kehm, \r\n  Alan Perlman, Richard Haisley, Darren Gold, Marie Bourgeois, Daniel Ciment, \r\n  David Sherzer, Andrew Fox, Julie Carlson, Zabelle Huss, Jerome Marcus, Howard \r\n  Weiser, Yehuda Hilewitz, Jonathan Yunger, Alyssa Lappen, Russell Roberts, Aaron \r\n  Gross, Adam Flisser, Elliot Ganz, Brian Simmons, James Trager, Brian Meeker, \r\n  Steve Hilton, Thomas Leahey, Mike Rogers, Tom Episcopio, Mike Cakora, Joe York \r\n  and Francesca Watson. If you have a tip, write us at opinionjournal@wsj.com , \r\n  and please include the URL.) Today on OpinionJournal: William \r\n    McGurn : Did Bill O'Reilly collude with the Saudis? We report, you decide. \r\n    (Plus: O'Relily vs. McGurn: The transcript .) Robert \r\n    Bartley : If we've learned anything in the past year, we'll topple Saddam. Brendan \r\n    Miniter : The speech New York needs, but won't hear, on Sept. 11. E-MAIL THIS TO A FRIEND PRINT FRIENDLY FORMAT GET THIS VIA EMAIL HOME TOP OF PAGE ARCHIVE PREVIOUS DAY NEXT DAY SUBSCRIBE TO THE WALL STREET JOURNAL ONLINE OR TAKE A TOUR SIGN UP TODAY FOR FREE MARKETWATCH MEMBERSHIP"
    },
    {
      "tag": "div",
      "text": "copyright"
    },
    {
      "tag": "p",
      "text": "Copyright © Dow Jones & Company, Inc. All Rights Reserved. By using this site, you agree to the Terms of Use and Privacy Policy . RSS"
    },
    {
      "tag": "div",
      "text": "kanoodle advertiser links begin ad tag (this line does not need to be included) unicast expose layers for NS4"
    }
  ]
}