{
  "url": "http://www.opm.go.kr/warp/webapp/content/view?meta_id=english&id=28",
  "content_hash": "d8613b002e16465cc88f8e1c5c1d7063160a2f371ec0eb7518a61669a323c71a",
  "total_blocks": 128,
  "retained_blocks": 1,
  "ignored_blocks": 127,
  "blocks": [
    {
      "tag": "div",
      "text": "Greetings Biography Prime Ministers in History Office for Government Policy Coordination Office of the Prime Minister Constitution Executive Branch Legislature Judiciary Constitutional Court Local Government National Symbols Geography & People History Economy Society National Symbols Flag Anthem Flower Great Seal Emblem Geography & People Geography Location Landforms Climate and Weather Flora Fauna Geology People & Population Language History Ancient History Gojoseon The Three Kingdoms The Balhae Kingdom Unified Silla Goryeo and Joseon Dynasties - Goryeo Dynasty - Early Joseon Period - Late Joseon Period - Cahllenges of Modernization Modern History - Colonial Period - Contemporary Period Economy Overview Industrial Development Science & Technology Economic Challenges Financial Corporate Restructuring Other Measures Environment for Foreign Investment Capital Market Liberalization Investor-Oriented Support System Outlook for the Economy Society Social Welfare Health and Medical Services Women Education - Overview - Historical Review - Educational System - The School System - Special Education and Non-formal Education - Korean Studies Transportation & Communications - Transportation - Communications Korean Beliefs and Religion - Introduction - Ancient Myths - Buddhism and Confucianism - The Christian Movement - The Attitude of Selective Acceptance Customs and Traditions - Family - Housing - Society - Beliefs - Rites and Rituals - Rites of Passage HOME > About Korea > Geography & People > Landforms Mountains and Hills Mt. Seoraksan National Park Between the Korean peninsula and Manchuria flow, in opposite\r\n\t\t    directions, the two largest rivers of the region, the Amnokgang\r\n\t\t    (Yalu) and Duman-gang (Tumen), both originating at Mt. Baekdusan\r\n\t\t    (2,744 meters), the highest mountain in the region.\r\n\t\t    The peninsula is surrounded by the Yellow Sea, the East Sea and\r\n\t\t    the South Sea. Nearly 70 percent of the Korean Peninsula is covered by mountains\r\n\t\t    and hills. Low hills in the southern and the western regions give\r\n\t\t    way gradually to increasingly higher mountains toward the eastern\r\n\t\t    and the northern areas. On the whole, the western and southern slopes\r\n\t\t    of the peninsula are wide with some plains and basins along rivers,\r\n\t\t    while the eastern slope is very steep as high mountains precipitate\r\n\t\t    into the East Sea. Most of the high mountains are located along the Taebaek mountain range\r\n\t\twhich runs parallel to the east coast, roughly north-to-south. West of\r\n\t\tthis range are the drainage basins of the Han-gang and Geumgang rivers.\r\n\t\tThis range extends to the Nangnim range in North Korea, forming the\r\n\t\tgeological and geomorphological backbone of the peninsula and constituting\r\n\t\tthe watershed between the western and eastern slopes of the peninsula.\r\n\t\tMt. Nangnimsan (2,014m), Mt. Geumgangsan (1,638m), Mt. Seoraksan (1,708m),\r\n\t\tand Mt. Taebaeksan (1,567m) are some of the highest peaks along these\r\n\t\tranges. Just southwest from the Taebaek range is the Sobaek range, which\r\n\t\tculminates in the massive Mt. Jirisan (1,915m). This range was historically\r\n\t\ta great barrier between the central and southern parts of the peninsula,\r\n\t\tand also between the eastern and western regions in the south.\r\n\t\tThe Nakdonggang river basin is thus segregated in southeastern Korea.\r\n\t\tThe Gaemagowon Plateau, the so-called \"Roof of Korea,\" located in the\r\n\t\tnorthwestern corner of the peninsula, has an average elevation of about\r\n\t\t1,500 meters above sea level. The landmass of the peninsula is rather stable geologically in spite of\r\n\t\tits proximity to Japan; it has neither active volcanoes nor strong\r\n\t\tearthquakes. There are, however, a few dead volcanoes that were formed\r\n\t\tduring the Pleistocene era. Mt. Baekdusan is famous for a large caldera\r\n\t\tlake, \"Cheonji,\" meaning heavenly tarn. Mt. Hallasan in Jejudo island,\r\n\t\tthe highest mountain in South Korea, was recorded to have had minor\r\n\t\tvolcanic activity in the early 11th century. It has a small crater lake,\r\n\t\t\"Baengnokdam,\" and there are about 400 parasitic cones in its piedmont. About two-thirds of the Korean Peninsula is composed of pre-Cambrian\r\n\t\tmetamorphic and granitic rock. Although the distribution of sedimentary\r\n\t\trock is very limited, limestone is quite abundant in some regions and a\r\n\t\tnumber of limestone caves can be found, some of which are tourist attractions.\r\n\t\tAmong the most famous caves are Gossigul, Gosugul and Seongnyugul, all of\r\n\t\twhich are adorned with stalagmites and stalactites. Rivers and Plains The Han-gang River Most of major rivers flow into the Yellow Sea and a few into the\r\n\t\t    South Sea, draining the western and southern slopes of the peninsula.\r\n\t\t    Considering its size, Korea has a relatively large number of long\r\n\t\t    rivers, six of them exceeding 400 kilometers. The discharge of rivers\r\n\t\t    fluctuates very much due to the summer monsoon. In the summertime,\r\n\t\t    rivers swell with heavy rainfall, flooding valley plains every once\r\n\t\t    in a while. In drier seasons, the water level drops and often much\r\n\t\t    of the river bed is exposed. Typhoons, which hit the southern part\r\n\t\t    of the peninsula once every two or three years, also bring heavy\r\n\t\t    rainfall in late summer and early autumn. In the past, rivers were important for transportation. Historical capitals\r\n\t\tsuch as Pyongyang and Buyeo are located adjacent to major rivers, as is\r\n\t\tSeoul. After the introduction of railroads and automobiles, however, the\r\n\t\timportance of rivers for transportation has decreased sharply, and rivers\r\n\t\tare now used mainly for the irrigation of rice fields and power generation.\r\n\t\tDuring the last two decades a number of huge dams have been constructed for\r\n\t\tflood control, electricity, and irrigation. But these dams have gradually\r\n\t\tbegun to play a major role as reservoirs for piped water supply to large\r\n\t\tcities and industrial plants as a result of rapid urbanization and\r\n\t\tindustrialization nationwide. Most farming fields are narrow floodplains developed along rivers,\r\n\t\tespecially in their lower reaches. These plains serve as the major\r\n\t\trice-producing lands. Large tidal differences at the mouths of major\r\n\t\trivers flowing into the Yellow Sea inhibited the development of deltaic\r\n\t\tplains, although rivers transport large amounts of sediment during floods.\r\n\t\tOnly the Nakdonggang river flowing into the South Sea has a small delta\r\n\t\tat its mouth. Erosional basins along rivers in areas of granitic rocks\r\n\t\thave also served as agricultural regions since ancient times. Many large\r\n\t\tcities such as Chuncheon, Cheongju and Wonju are located in such basins. Coasts The Dadohae National Park at the tip of the Korean Peninsula Korea has a long coastline divided into the east, west and south\r\n\t\t    coasts. The east coast has small tidal differences, a third of one\r\n\t\t    meter at the most, and a relatively smooth shoreline with few islands\r\n\t\t    offshore. The Taebaek range runs closely along the East Sea. Where\r\n\t\t    mountains protrude from the Taebaek range, coasts are rocky in general,\r\n\t\t    but some beaches are found in places into which small streams carry\r\n\t\t    sediment from the high mountains. In many instances, the beaches take\r\n\t\t    the form of sand spits and bars enclosing lagoons, which are notable\r\n\t\t    features of the east coast. Along the coast between Wonsan and\r\n\t\t    Gangneung are located a series of lagoons, including Gyeongpo and\r\n\t\t    Hwajinpo, two famous resorts. The highway connecting Gang-neung and\r\n\t\t    Seoul has been expanded recently, reducing the travel time between\r\n\t\t    the central region and the east coast. The shorelines of the south and west coasts are very irregular with\r\n\t\tinnumerable small peninsulas and bays as well as a large number of islands.\r\n\t\tThe west coast facing the Yellow Sea, which is very shallow, has large\r\n\t\ttidal ranges, which rise above 10 meters in places. Harbors have been\r\n\t\tdifficult to develop while tidal flats are common coastal features\r\n\t\tespecially in bays into which rivers discharge sediment during floods.\r\n\t\tTidal flats have been reclaimed from ancient times mainly for rice fields,\r\n\t\tbut since the 1970s, the reclamation grew in terms of magnitude.\r\n\t\tThe Saeman-geum Project, the largest such project ever undertaken,\r\n\t\tseeks to reclaim a total of 40,100 hectares of the flats through the\r\n\t\tconstruction of huge dikes, but it faces strong opposition from\r\n\t\tenvironmental groups. The south coast shows a typical ria shoreline, a coastal zone which\r\n\t\thas been submerged. The length of coastline is nearly eight times longer\r\n\t\tthan its straight-line distance, and its indentation is far greater than\r\n\t\tthat of the west coast. The tidal ranges are relatively small at two to\r\n\t\tfive meters, and tidal flats are not as wide as along the west coast.\r\n\t\tAlthough mountains face the sea, there are few beaches and sea cliffs\r\n\t\talong the mainland coast, as innumerable islands prevent the penetration\r\n\t\tof waves from offshore. Narrow straits between the mainland and islands\r\n\t\tare associated with extremely rapid tidal currents. At Uldolmok toward\r\n\t\tthe western end of the south coast, the tidal current reaches up to 13\r\n\t\tknots. ư ϴ īǶ ̺ Դϴ. Central Government Complex 77-6, Sejongno, Jongno-gu, Seoul, Korea Copyright by Office of the Prime Minister .\n    All rights reserved."
    }
  ]
}