{
  "url": "http://www.ouboces.org/MSTgrant2/CONTENT/penguinparade.html",
  "file_number": "623",
  "content_hash": "534ffb59e4dc8af3839a3ed56ebcf913e65fe85fdd1f74893f61b744e7c7f14d",
  "total_blocks": 162,
  "retained_blocks": 58,
  "ignored_blocks": 104,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "p",
      "text": "A Parade Of Penguins An MST Unit/ELA Unit for\r\nPrimary Grades Beth Tellefsen, Grade\r\n2 Teacher Cornwall-on-Hudson Elementary\r\nSchool Cornwall Central School\r\nDistrict 914-534-9110 Unit Directory Unit\r\nDirectory : click on title to go to that section Introduction Learning Experiences: 1.\r\nHow Do Penguins Measure Up? 2.\r\nHow Cold Is It? 3. Solving\r\nPenguin Problems 4. Antarctic\r\nAdaptable Animals 5. The Blubber\r\nGlove Resources Introduction Topic: Penguins What can we learn about\r\npenguins through research, experimentation, observation, design projects\r\nand problem solving? The following unit provides\r\n5 detailed learning experiences and a list of additional activities that\r\nexplore the life cycle and habitat of a variety of penguins. This unit\r\nwas designed for second grade but can be easily modified for any elementary\r\nlevel class. The unit took approximately 5 to 6 weeks to cover. Although\r\nall areas of the curriculum were involved, the focus was on math, science\r\nand technology. The culmination of this unit was a special \"Penguin Program\".\r\nParents and special guests were invited to see a production, which involved\r\nsongs, poems, a readers theater and a geography presentation involving\r\nBeanie Babies. I then presented a Power Point Program which allowed the\r\nguests to see an outline of the unit and pictures of the various activities\r\nand experiments that the students had taken part in. Back to Unit Directory Learning\r\nExperience #1 Title: \"How Do Penguins\r\nMeasure Up?\" Learning Context: NYS Standards:"
    },
    {
      "tag": "blockquote",
      "text": "MST Standard #2- Information Systems MST Standard #3- Mathematics ELA Standard #1- Language for Information\r\nand Understanding Social Studies Standard #3- Geography"
    },
    {
      "tag": "p",
      "text": "Objectives:"
    },
    {
      "tag": "blockquote",
      "text": "The students will research a particular\r\npenguin species to find out its average height as well as three other facts\r\nabout that penguin. The students will use a variety of tools\r\nto measure the height of their penguin on paper and then draw and color\r\na picture of that penguin showing its characteristics. The students will then use the information\r\nthat they have gathered to create a graph that shows the height of the\r\npenguin species. They will also answer questions based on that graph."
    },
    {
      "tag": "p",
      "text": "In order for the students to succeed with\r\nthis learning experience they must enter into it with some prior knowledge.\r\nThe students should show some competency with the following skills:"
    },
    {
      "tag": "blockquote",
      "text": "Differentiating between a fact and an opinion Measuring, using an inch or centimeter\r\nruler, yardstick or tape measure Interpreting information using a bar graph\r\nor pictograph"
    },
    {
      "tag": "p",
      "text": "Procedure:"
    },
    {
      "tag": "blockquote",
      "text": "Match students up with a partner. Assign\r\na specific species to each pair, or let them draw a name of the species\r\nfrom a hat. Distribute books or photocopies to each\r\npair so that they can research their penguin (see appendix for references).\r\nIf you have a computer lab, and appropriate software is available, try\r\nresearching the species through the use of technology. Supply each pair with a long sheet of butcher\r\nblock, or similar paper. Give each pair of students a checklist\r\n(see attached), so that they know exactly what criteria must be met in\r\norder to have an acceptable project. Poll the students to find out the height\r\nof their species. List this information on chart paper. Then, supply the\r\nstudents with graph paper so that they can transfer this information into\r\ngraph form. The students then create questions that can be answered by\r\nusing the graph."
    },
    {
      "tag": "p",
      "text": "Instructional/Environmental\r\nModifications:"
    },
    {
      "tag": "blockquote",
      "text": "In order to meet the needs\r\nof a hearing impaired student in my class, I always wear a Phonic Ear Device.\r\nThis helps the student filter out background noise and concentrate more\r\non my voice. When the students broke up into their groups I then attached\r\nthe Phonic Ear Device to the childs partner so that they could communicate\r\nbetter. For a visually impaired student other modifications should be considered.\r\nThe writing paper the students use to record their facts may need to be\r\nenlarged and the middle, dotted line can be highlighted in yellow."
    },
    {
      "tag": "p",
      "text": "I also found that it was necessary to\r\nalter the physical setting of my classroom. We pushed back the students'\r\ndesks to make a large, open floor space. This allowed the students to spread\r\nout their papers and measure and draw more comfortably. I also allowed\r\na different group to work out in the hall each day. Time Required:"
    },
    {
      "tag": "blockquote",
      "text": "Prior to beginning this learning\r\nexperience, I spent about an hour in the school and local public library\r\ncollecting appropriate childrens books and magazines on penguins. I allotted\r\na 45-minute period each day for one week for the children to complete and\r\nreport on this experience. I was able to assess the students' work each\r\nday by making observations and keeping notes. I also assessed their final\r\nproject when they made their presentations on the fifth day."
    },
    {
      "tag": "p",
      "text": "Resources:"
    },
    {
      "tag": "blockquote",
      "text": "Various reference\r\nbooks on penguins, crayons or markers"
    },
    {
      "tag": "p",
      "text": "Software for referencing, writing paper,\r\npencils Butcher block paper Various measuring tools (inch and centimeter\r\nrulers, yardsticks, or measuring tapes) Assessment Plan:"
    },
    {
      "tag": "blockquote",
      "text": "At the beginning of this experience\r\nthe students were given a checklist (please see attached) to use as a guide.\r\nThe list helped them to keep track of all the steps they had to complete\r\nto have an acceptable project. The students were also given the opportunity\r\nto critique each others work. After each group presented their final project\r\nthe other students described what they liked best about the project and/or\r\nmade suggestions on how to make the project \"even better\". Some groups\r\nopted to put these suggestions to use while others did not."
    },
    {
      "tag": "p",
      "text": "While the students worked in their groups\r\neach day, I went around and made observations and kept notes on how the\r\nstudents interacted with one another. I also made assessments when the\r\ngroups made their final presentations. Student Work: (Please See\r\nAttached) Reflection: I chose to develop this learning experience\r\nbecause it integrated many curriculum areas and provided the students with\r\nthe opportunity to work together, cooperatively, in small groups. The students\r\nreally enjoyed this experience and looked forward to working on it everyday.\r\nI found the use of a checklist to be beneficial and will incorporate it\r\ninto more lessons in the future. Back to Unit Directory Learning\r\nExperience #2 Title:\r\n\"How Cold Is It?\" Learning\r\nContext: NYS Standards:"
    },
    {
      "tag": "blockquote",
      "text": "MST Standard #2-\r\nInformation Systems MST Standard #3-\r\nMathematics MST Standard #4-\r\nScience MST Standard #6-\r\nInterconnectedness: Common Themes"
    },
    {
      "tag": "p",
      "text": "Objectives:"
    },
    {
      "tag": "blockquote",
      "text": "The students will\r\nuse the Internet to look up various weather sites and choose the most appropriate\r\none. The students will\r\nsuccessfully navigate through a web site using links to obtain specific\r\ninformation. The students will\r\nlearn how to bookmark and retrieve a particular site. The students will\r\nlocate and record the temperature of a given area and then compare that\r\ntemperature with the temperature of another area to determine which is\r\nwarmer or colder. The students will\r\ncolor a thermometer to match the recorded temperature."
    },
    {
      "tag": "p",
      "text": "In order for the\r\nstudents to succeed in this learning experience they must have some prior\r\nknowledge. They must show some competency with the following skills:"
    },
    {
      "tag": "blockquote",
      "text": "Telling temperature\r\nto the nearest degree (Celsius or Fahrenheit) Understanding of\r\nnegative temperature readings Locating different\r\nregions on a map and understanding that these regions have different climates"
    },
    {
      "tag": "p",
      "text": "Procedure:"
    },
    {
      "tag": "blockquote",
      "text": "Present the class\r\nwith a whole group lesson on how to use the Internet to locate a specific\r\nweb site and then determine if it provides the necessary information. Guide\r\nthe class through the process of bookmarking the site. Pair up the students.\r\nWhenever an opportunity arises (we did this first thing in the morning)\r\nallow the partners to access the web site and record the temperature for\r\ntheir town, as well as the temperature in an area of Antarctica (we used\r\nVostok). The information can be recorded on the attached sheet. The students must\r\nthen compare the two recorded temperatures and determine which area is\r\nexperiencing colder weather. This is also recorded on the data sheet. Finally, the students\r\nwill color in a thermometer to visually display the temperature."
    },
    {
      "tag": "p",
      "text": "Instructional/Environmental\r\nModifications: In order to do\r\na whole group lesson on using the Internet, I took my class to the computer\r\nlab so that each student could have a computer in front of him/her. If\r\nyou have access to the Internet through a computer in the classroom, then\r\nthat computer could be used along with a LCD or video projector. The hearing impaired\r\nstudent in my class had no problems with this lesson since use of the computer\r\nheadphones was not required. For visually impaired students, the teacher\r\nmay want to consider the use of transparent, colored, highlighter tape.\r\nThis tape can be placed directly on the monitor screen to highlight the\r\ninformation the students are locating. Time\r\nRequired: This learning\r\nexperience was implemented with the help of a student teacher who was a\r\ngreat deal more computer literate than I was at the time. She spent about\r\nan hour locating weather web sites and scanning through them to\r\nsee which one would provide us with the appropriate information. She then\r\nspent about a half an hour teaching me how to get into the web sites and\r\nhow to bookmark them. This experience\r\ntook about two weeks to finish. Each morning my student teacher took two\r\nchildren to the classroom next door to access the web sites, and record\r\nthe information. They then returned to our room to make comparisons, color\r\nin the thermometers, and discuss what they had learned. In all, it required\r\nabout 15-20 minutes. I led the rest of the class through the morning opening\r\nexercises at the same time. After each child had a turn working on the\r\ncomputer and recording data, we discussed our findings in a whole group\r\nlesson. We spent a 45- minute period posting the information on a bulletin\r\nboard and drawing conclusions based on our data. Resources: A Computer with\r\nan Internet connection and a Printer Data recording\r\nSheet (see attached) Temperature Recording\r\nSheet (see attached) Red crayon or\r\nmarker Pencils Assessment\r\nPlan: The teachers made\r\nobservations each day when working with a pair of students on the computer.\r\nA rubric (see attached) was then used to determine the students' level\r\nof competency. The students math skills were assessed by the success they\r\nhad with the temperature recording sheets they filled in. The two recording\r\nsheets should be compared to make sure that the information coincides.\r\nSmall group discussions also enable the teacher to assess the students\r\nability to draw conclusions based on the information they had discovered. Student\r\nWork: Please see attached. Reflection: Although I was\r\nvery pleased with the students performances during this learning experience,\r\nI must admit I was a little hesitant at the beginning due to a lack of\r\n\"computer knowledge\" on my part. I was forced to learn some new skills\r\nfor which I am now very grateful. I dont think\r\nit would be possible to carry out this learning experience unless you have\r\nanother adult in the room, whether its a teachers aide, student teacher\r\nor a parent volunteer. I think its very important to work in small groups\r\nand you must have someone by the computer at all times to make sure the\r\nstudents are accessing the information correctly. Back to Unit Directory Learning\r\nExperience #3 Title: \"Solving Penguin\r\nProblems\" Learning Context: NYS Standard:"
    },
    {
      "tag": "blockquote",
      "text": "MST Standard #3- Mathematics ELA Standard #1- Language for Information\r\nand Understanding ELA Standard #3 - Language for Critical\r\nAnalysis and Evaluation"
    },
    {
      "tag": "p",
      "text": "Objectives:"
    },
    {
      "tag": "blockquote",
      "text": "The students will solve math word problems\r\nby using a storyboard and \"goldfish\" manipulatives. The students will create and solve their\r\nown word problems as well as design their own storyboard that reflects\r\nthe problem. The students will practice keyboarding\r\nby typing their word problems on the computer."
    },
    {
      "tag": "p",
      "text": "Upon beginning this learning experience,\r\nit is helpful, but not necessary, for the students to know how to properly\r\nhandle manipulatives. Rules should be established and \"free play\" time\r\nshould be given so that the students can explore the manipulatives before\r\nthey are asked to use them as a problem solving strategy. Procedure:"
    },
    {
      "tag": "blockquote",
      "text": "Distribute storyboards (see attached) so\r\nthe students can color and personalize them. Distribute a bag of Pepperidge Farm Goldfish\r\nto each student and allow time to explore and play. Use the overhead projector to display a\r\ncopy of the storyboard on a large screen. Present the students with a word\r\nproblem that they can solve by using the goldfish as manipulatives. Model the process on the overhead. As the students get more comfortable with\r\nthis problem solving strategy, increase the level of difficulty of the\r\nword problems After discussing the strategies used for\r\nproblem solving, pass out writing paper and challenge the students to come\r\nup with their own word problems. You may wish to post the problems you\r\nsolved together as models for the students to refer to. Depending on their\r\nability level, some students may copy the problem and only change the numbers;\r\nothers will create their own problems. Conference with the students and edit the\r\nproblems as needed. Then, allow the students the opportunity to type their\r\nword problem on the computer and print it. Finally, distribute a variety of construction\r\npaper, scissors and glue and have the students design their own storyboard\r\nthat illustrates the word problem that they created. When all the storyboards and word problems\r\nare complete, post them in the hall or on a bulletin board. Give the students\r\nan opportunity to choose a classmates problem and solve it in their math\r\njournals. The students should also include a journal entry describing why\r\nthey chose that particular problem."
    },
    {
      "tag": "p",
      "text": "Instructional/Environmental\r\nModifications:"
    },
    {
      "tag": "blockquote",
      "text": "It was necessary for me to\r\nuse a Phonic Ear Device so that a hearing impaired student could participate\r\nin the learning experience."
    },
    {
      "tag": "p",
      "text": "Once the students began work on their\r\nown projects, I separated them into groups according to their math skills\r\nand their ability to work independently. Time Required:"
    },
    {
      "tag": "blockquote",
      "text": "This learning experience took\r\nseveral days to implement. I used two 45-minute periods to introduce and\r\npractice problem solving through the use of manipulatives and storyboards.\r\nOnce the students were comfortable with this skill we spent the next 4\r\ndays (45-minutes to an hour) writing problems, creating storyboards and\r\nprinting the problems on the computer. Since the assessment was on going,\r\nI did not have to allot extra time for reviewing student work."
    },
    {
      "tag": "p",
      "text": "Resources:"
    },
    {
      "tag": "blockquote",
      "text": "Penguin storyboards for each\r\nstudent"
    },
    {
      "tag": "p",
      "text": "Overheard copy of the storyboard One bag (about 20) of Pepperidge Farm\r\nGoldfish per student Writing paper Pencils Crayons or markers Scissors Glue Construction paper Assessment Plan:"
    },
    {
      "tag": "blockquote",
      "text": "For the most part, assessments\r\nwere made during whole group and small group instruction. The students'\r\ndemonstrated the level of difficulty they were comfortable with as they\r\nbegan to create their own word problems. Observations were made and notes\r\nwere taken during conferencing times in which the students explained what\r\nproblem they created and how they got the answer. Some students needed\r\nmore coaching then others, but everyone had an acceptable storyboard by\r\nthe end of the learning experience."
    },
    {
      "tag": "p",
      "text": "Student Work: Please\r\nsee attached. Reflection: Although we all enjoyed\r\nthis learning experience, I think the students, in particular, found it\r\nrewarding. Their pride was very evident when all their work was displayed\r\nin the hall. They were extremely excited to find that older students were\r\nlooking at their work and trying to solve the problems. I had tried a similar\r\nlesson earlier in the year but found that it was a little too difficult\r\nfor the majority of my students. I was very pleased to see that they had\r\nprogressed a great deal with their problem solving skills. Back to Unit Directory Learning\r\nExperience #4 Title: \"Antarctic Adaptable\r\nAnimals\" Learning Context: NYS Standards:"
    },
    {
      "tag": "blockquote",
      "text": "MST Standard #4- Science MST Standard #5- Technology ELA Standard #1- Language for Information\r\nand Understanding ELA Standard #4- Language for Social Interaction"
    },
    {
      "tag": "p",
      "text": "Objectives:"
    },
    {
      "tag": "blockquote",
      "text": "The students will collect data and facts\r\nand use newly learned concepts to create a creature, which could survive\r\nlife in Antarctica. The students will make informed and intelligent\r\nchoices in choosing the materials needed to create a model of this creature."
    },
    {
      "tag": "p",
      "text": "Procedure:"
    },
    {
      "tag": "blockquote",
      "text": "Create a Venn Diagram with the students\r\nthat compare whales and Emperor penguins. Discuss what similarities they\r\nshare and the characteristics that enable them to survive in their environments. Distribute the attached worksheet and give\r\nthe students the opportunity to brainstorm about the new concepts that\r\nthey have discovered about penguins and other Antarctic creatures. Display a variety of materials (see materials\r\nlist for ideas) on a worktable. Encourage students to give other suggestions\r\nas well. Allow students to work individually or\r\nin pairs to create their Antarctic Adaptable Creature. Finally, provide the students with the\r\nopportunity to introduce the creature to the class and describe what features\r\nit has that would enable it to live in Antarctica."
    },
    {
      "tag": "p",
      "text": "Instructional/Environmental\r\nModifications: For visually impaired students, the\r\nteacher may wish to enlarge the Venn diagram and questionnaire. It may\r\nalso be helpful to print these pages on contrasting paper. I used a Phonic\r\nEar Device during whole group instruction to meet the needs of a hearing\r\nimpaired student. I found it necessary to reconfigure\r\nthe furniture in my classroom for this learning experience. I used one\r\nlarge table in the back of the room to hold all the craft materials the\r\nstudents used for creating their creatures. The students spread newspaper\r\nover their desks since they were using clay. I used a small table in the\r\nfront of the room to conference with the students. Here, we discussed the\r\nanswers to their questionnaires before they began creating with materials. Time Required: Prior to beginning this learning experience,\r\nI took 2 days to inventory my craft supplies and then spent an afternoon\r\nat Wal-Mart stocking up on some necessary items. We spent a 45-minute period completing\r\nand discussing the Venn diagram. The next day, the students used their\r\n\"Independent Work\" period to complete their questionnaire and drawing.\r\nAfter sharing their ideas with their classmates (a 45-minute session) the\r\nstudents made some alterations to their design projects. Finally, we spent\r\nabout 45-minutes to an hour actually creating the creatures with craft\r\nmaterials. If some students finished early they\r\nwere directed to make a mate or baby for their creature. Resources:"
    },
    {
      "tag": "blockquote",
      "text": "Venn Diagram worksheet (see\r\nattached)"
    },
    {
      "tag": "p",
      "text": "Design Worksheet (see attached) Craft materials  modeling clay (assorted\r\ncolors), pipe cleaners, googly eyes, toothpicks, feathers, etc. Assorted boxes to create dioramas for\r\nthe creatures Assessment Plan:"
    },
    {
      "tag": "blockquote",
      "text": "I found that\r\nwith this technology/design project I used a more informal assessment plan.\r\nBy looking at their questionnaires and discussing their responses at conference\r\ntime I was able to determine how much information the students understood\r\nand were able to apply to this design project. The final product was also\r\na good indicator of their level of understanding."
    },
    {
      "tag": "p",
      "text": "Student Work: Not\r\nAvailable Reflection: Although I have done similar lessons,\r\nthis was my first attempt at a formal technology/design project. I was\r\ngratified to see that the students were extremely creative and gave their\r\nprojects a great deal of thought. I was surprised that some students did\r\nnot want to alter their \"Antarctic Adaptable Animal\" even though others\r\nhad pointed out some flaws in their design. For example, one student chose\r\nto use pink feathers and another student informed her that pink would not\r\nbe a good color to use for camouflage in Antarctica. The student said that\r\nshe didnt care, she liked pink! Some students got so caught up in this\r\nexperience that they took it a step further and wrote puppet shows for\r\ntheir creatures. Back to Unit Directory Learning\r\nExperience #5 T itle:\r\nThe Blubber Glove Learning Context: NYS Standards:"
    },
    {
      "tag": "blockquote",
      "text": "MST Standard #1- Analysis, Inquiry, and\r\nDesign MST Standard #4- Science"
    },
    {
      "tag": "p",
      "text": "Objectives:"
    },
    {
      "tag": "blockquote",
      "text": "The students will explore the uses of blubber\r\nand explain its purpose for a penguin. The students will successfully follow directions\r\nto perform an experiment. The students will make predictions based\r\non prior knowledge."
    },
    {
      "tag": "p",
      "text": "It is not necessary for the students to\r\nhave any specific prior knowledge in order for this learning experience\r\nto be successful. If you incorporate cooperative learning groups into the\r\nexperience be sure that each student knows what he/she is responsible for. Procedure:"
    },
    {
      "tag": "blockquote",
      "text": "Pair the students or make small groups\r\nof three or four. Give each group a tray of materials and a bucket of cold\r\nwater with ice cubes. Ask students what facts we might find out\r\nabout penguins using the materials on the table and the bucket of ice water.\r\nList predictions on the board or a chart. Have the students take turns and instruct\r\none team member to put on a surgical glove. Have another student place\r\nfive or six tablespoons of solid shortening into a small resealable plastic\r\nbag and \"mush\" it up. Next, the student with the surgical glove\r\nplaces his/her hand into the resealable plastic bag with the shortening.\r\nAnother team member will then place a rubberband around the students wrist\r\nto secure the top of the plastic bag. The student with the blubber glove will\r\nnow plunge both the blubber glove hand as well as his/her unprotected hand\r\ninto the ice water. The other team members will time how long the student\r\ncan keep each hand in the bucket of water. Allow each team member to experience\r\nthis activity. Finally, discuss the differences the students\r\nfelt when they had both hands in the water. Ask the students to explain\r\nwhy it was easier to keep the blubber glove hand in the water longer. Ask\r\nthe students how this experiment is related to penguins."
    },
    {
      "tag": "p",
      "text": "Instructional/Environmental\r\nModifications:"
    },
    {
      "tag": "blockquote",
      "text": "In order to do conduct this\r\nlearning experience I used our science lab. The set up is more conducive\r\nto working with cooperative learning groups and there is a sink with running\r\nwater. This experience could be carried out in the classroom but it would\r\nrequire greater preparation."
    },
    {
      "tag": "p",
      "text": "I used a Phonic Ear Device to meet the\r\nneeds of a hearing impaired student. Time Required: I spent about 20 minutes setting up\r\nthe science lab prior to this lesson. I spent about a half an hour collecting\r\nand organizing materials. The learning experience itself required about\r\n45-minutes. Assessment was on going throughout the lesson. Resources: For each pair of students you will need: 2 small plastic surgical gloves (or\r\nin place of the gloves, use 2 more resealable plastic bags) 2 plastic resealable bags 1 pound of solid vegetable shortening\r\n(such as Crisco) 2 rubberbands a stop watch a bucket of water with ice cubes Assessment Plan: The students tried to figure out what\r\nwe were going to do based on the materials set up in the lab. We made a\r\nlist of possibilities and altered the list as the experience continued.\r\nThe students asked questions and tried to answer them as we went along.\r\nI was able to assess their level of understanding based on the types of\r\nquestions they asked and the conclusions they drew during the experience. Student Work: None Available Reflection: This experience was based on a similar\r\nlesson my student teacher had taken part in during an undergraduate course.\r\nWe altered it somewhat to meet our needs. We also changed it so that the\r\nstudents were always making inquiries and trying to find out how the experience\r\nrelated to penguins. It didnt take them long! Back to Unit Directory Resource Reference Books for Children: Adrian, Mary .\r\nWildlife in The Antarctic . New York: Simon and Schuster, 1978. Barkhausen, Annette\r\nand Geiser, Franz . Penguins . Milwaukee, W.I.:Gareth Stevens\r\nPublishing, 1994. Fontanel, Beatrice. Animal Close-Ups: The Penguin . Watertown, MA: Charlesbridge\r\nPublishing, 1992. Kalman, Bobbie. Penguins . New York: Crabtree Publishing, 1995. Khanduri, Kamini. Usborne World Wildlife: Polar Wildlife . London, Usborne Publishing,\r\n1992. Lepthien, Emilie\r\nV. A New True Book: Penguins . Chicago: Childrens Press,\r\n1983. Resnick, Jane .\r\nEyes On Nature: Penguins . Chicago: Kidsbooks, Inc., 1997. Fiction Books: Freeman, Don .\r\nPenguins, Of All People . New York: The Viking Press, 1971. Glendinning, Sally .\r\nPen, Emperor Penguin . Champaign, Illinois: Garrard Publishing, 1980. Klebe, Gene and\r\nMargot. Penguin Family . Toronto: Longmans Canada Limited,\r\n1967. Tripp, Valerie. The Penguins Paint . Chicago: Childrens Press, 1987. Internet: World\r\nWide Web: Weather Underground . http://www.wunderground.com Teacher Materials: Thematic Unit-\r\nPenguins. Teacher Created Materials, Inc., 1991. Frank Schaffers\r\nSCHOOLDAYS, Nov./Dec./Jan. 1990-1991. Back to Unit Directory Return to MST\r\nQuilt"
    }
  ]
}