{
  "url": "http://www.packing.org/news/article.jsp/5273",
  "content_hash": "b5727ce0d4d891e54b895c23a8abd9e03605ec8b5306ff9132baf9155f93df3d",
  "total_blocks": 91,
  "retained_blocks": 26,
  "ignored_blocks": 65,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" Concealed carry database, News tracking, Gun ranges, Events, etc."
    },
    {
      "tag": "h1",
      "text": "Tennessee: Open Carry in Tennessee???"
    },
    {
      "tag": "p",
      "text": "FAQ: Question Posted 2002-01-13 @ 22:17:42 by dron31 (\n\t\tRead 1372 times with \n\t\t\t3 comments\t\t\t\t)"
    },
    {
      "tag": "div",
      "text": "Does anyone know the open carry status in Tennessee?  I'll be travelling there from NC at the end of this week.  Also, what about car carry?"
    },
    {
      "tag": "h2",
      "text": "Comments: Cannot carry with \"the intent to go armed\" Added by ICP_juggalo on 2002-01-14 @ 00:21:11"
    },
    {
      "tag": "div",
      "text": "From what I understand about the law in TN, you cannot carry on your person or loaded in your car a pistol or any other loaded firearm. If you carry a loaded pistol on your person or in your car, it is defined by law a \"carry with the intent to go armed\" and is illegal unless you have a license to carry. So I would carry unloaded in a case and seperated from the ammunition.  -ICPjuggalo"
    },
    {
      "tag": "h2",
      "text": "Thanks!!! Added by dron31 on 2002-01-14 @ 22:52:16"
    },
    {
      "tag": "div",
      "text": "Thanks for the info!"
    },
    {
      "tag": "h2",
      "text": "Yeah man.. Added by ICP_juggalo on 2002-01-15 @ 00:21:37"
    },
    {
      "tag": "div",
      "text": "No problemo. Tennessee is a very beautiful state, almost makes me want to move there, hope you have a successful trip and carry safetly. <hr> about packing.org | disclaimer | mark solomon homepage copyright © 1996-2006 mark solomon middlecontent middle state ccw info license tool news events gun ranges gun talk links Dec 26, 2006 Jump to State Alabama Alaska All of Canada All of Mexico All United States Arizona Arkansas California Colorado Connecticut Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York New York City North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Puerto Rico Rhode Island South Carolina South Dakota Tennessee Texas US Virgin Islands Utah Vermont Virginia Washington Washington DC West Virginia Wisconsin Wyoming Old news | Old talk Submit bug report"
    },
    {
      "tag": "h3",
      "text": "Guns and Airlines"
    },
    {
      "tag": "div",
      "text": "Commercial flying & guns: How to obey the law on commercial flights cached by Mcache::get from Dec 26, 2006 @ 07:44 pm begin ad"
    },
    {
      "tag": "h1",
      "text": "Advertisement"
    },
    {
      "tag": "div",
      "text": "In the Gravest Extreme Role of the Firearm Really good book by Massad F. Ayoob (Amazon) About ads container end ad cached by Mcache::get from Dec 26, 2006 @ 07:20 pm"
    },
    {
      "tag": "h3",
      "text": "F.A.Q."
    },
    {
      "tag": "div",
      "text": "General Questions on Concealed Firearm Laws Q: Why are \"Concealed Carry Badges\" frowned upon by most non-newbie ccw license permit holders and police? A: Because badges are a symbol of authority, they are easily misinterpreted as law enforcement badges, which for a non LEO is a bad thing.  Concealed carry licences/permits give no authority, rather, only the permission to carry a concealed weapon.  If the state, city, county, or town wanted to issue CCW permits/licences in the form of a badge, they would do so.  If you want a badge, join a law enforcement agency or a fire department...their badges are usually quite pretty. See Entire F.A.Q."
    },
    {
      "tag": "h1",
      "text": "Packing.org mug"
    },
    {
      "tag": "div",
      "text": "cached by Mcache::get from Dec 26, 2006 @ 07:45 pm"
    },
    {
      "tag": "h3",
      "text": "Glossary"
    },
    {
      "tag": "div",
      "text": "Can Carry In State Park Yes you can carry a Concealed Handgun in a State Park Automatic Pistol A term used often to describe what is actually a semi-automatic pistol. It ... more Condition 4 Pistol: Full magazine separate from gun, chamber empty. All glossary terms"
    },
    {
      "tag": "h3",
      "text": "Gun Blue Books"
    },
    {
      "tag": "div",
      "text": "The Gun Digest Book of the 1911 cached by Mcache::get from Dec 26, 2006 @ 07:44 pm begin ad"
    },
    {
      "tag": "h1",
      "text": "Advertisement"
    },
    {
      "tag": "div",
      "text": "Cheap Shots, Ambushes, And Other Lessons on Amazon: A Down And Dirty Book On Streetfighting and Survival About ads container end ad cached by Mcache::get from Dec 26, 2006 @ 07:40 pm"
    },
    {
      "tag": "h3",
      "text": "Survey"
    },
    {
      "tag": "div",
      "text": "Q: Which of the following statements best describes your opinion on the issue of \"Stopping Power\"? 1.  Big and slow is best! 2. Small and Fast is best! 3. Shot placement means the most! 4. I am not sure! 5. None of the above! See results <a href=\"http://www.amazon.com/exec/obidos/ASIN/031600023X/concealedca0f-20\">Worse than watergate</a> This link is provided for address collecting robots. Fight spam! leftcontent left <a href=\"http://www.amazon.com/exec/obidos/ASIN/031600023X/concealedca0f-20\">Worse than watergate</a> body"
    }
  ]
}