{
  "url": "http://www.pbc.org/dp/stedman/colossians/4022.html",
  "file_number": "630",
  "content_hash": "814458ae9d694b9989d733fc47992daf6532d94537d5c825d35492a5f6b55382",
  "total_blocks": 79,
  "retained_blocks": 17,
  "ignored_blocks": 62,
  "blocks": [
    {
      "tag": "div",
      "text": "Library series: 12 messages next message: The Great Mystery previous message: Master of the Universe formats: pdf , mp3"
    },
    {
      "tag": "h3",
      "text": "THE REASON FOR THE SEASON"
    },
    {
      "tag": "p",
      "text": "by Ray C. Stedman Most scholars feel that the magnificent description of Christ found in\nverses 15-20 of Colossians 1 represents an early Christian hymn which Paul\nis quoting. These verses may represent the very first of all Christmas\ncarols. If so; it is a hymn of two stanzas. The first concerns Jesus as\nLord of creation, i.e. the material universe, and all forces at work within\nit. The second stanza speaks of Jesus as Lord of the new creation, the new\nhumanity. We have lost the tune for this hymn, but we still have these\nwords which focus upon our Lord's overall supremacy. Here are Paul's words:"
    },
    {
      "tag": "blockquote",
      "text": "\"He is the head of the body, the church; he is \n  the beginning and the firstborn from among the dead, so that in everything he \n  might have the supremacy.\""
    },
    {
      "tag": "p",
      "text": "The church, of course, is the new creation. It is healthy to remind\nourselves of that because many churches seem to forget it. The church is\nsomething eternally new which the world has never seen before. It is quite\ndifferent from any other organization or organism among men. It is a sad\nthing to observe the loss of this concept among Christians. As Itravel\nabout Ihave noted the way people think about their church. Iam afraid\nthat the most widespread concept is that the church is a religious country\nclub, operated for the enjoyment and benefit of the members; it makes its\nown rules and exists for its own purposes. That is a far cry indeed from\nthe New Testament description of the church. Others look upon the church as a collection of emotional misfits who are\nwaiting for the first bus to glory. Ifear some of us give them good reason\nto think that! Then there are those, like the Colossians, who are a group\nof eager beaver religious fanatics, running after every new doctrine that\ncomes along, especially if it offers a good feeling and has a sense of\nmagic and mystery about it. That to many is the church. But here the apostle corrects these false ideas and declares that Jesus is\nthe Head of the body, which is the church. Paul relates the two together as\na head and trunk relate in a physical body. This is one of the most\nimportant statements in the New Testament about the church. God has\nactually given us a model to carry around with us (our own body), so that\nwe may understand how the church is to function. The church is a body, and\nwe all have bodies. The church has a Head, and we too have heads. To\nunderstand the church and how it should function, think about your own body\nand how it functions. If you stand in front of a mirror you will notice, Ihope, that there are \n  two divisions of the body. The knob up on top, with more or less hair, we call \n  the head. It is the control center of the body. The rest of the body, with its \n  appendages of arms and legs, etc., is all part of the trunk. That is a body---and \n  the head runs the body! Many churches seem to forget that. Think what would \n  happen to your body if somebody removed your head. It doesn't appear that any \n  of you has had that experience since most of you seem to be well attached. When \n  Iwas a boy growing up in Montana, we did not buy chickens at the grocery store \n  all nicely packaged in plastic. Ihad to go out and run one down, and then remove \n  its head. Achicken with its head cut off acts very strangely. It does not simply \n  quietly perish, but jumps and runs around, out of control for a minute or two, \n  before it finally dies. Churches that lose their awareness of the Head are like \n  that---they too go out of control. They do not know what to do. They run about \n  and become involved in things they ought not to have anything to do with. They \n  have, for all practical purposes, lost their Head. That was the trouble at Colossae. In chapter two Paul says they \"have lost\nconnection to the head.\" It is essential, therefore, that a church must\nhave its Head in place and functioning: supplying direction, maintaining\norder, giving it health, solvingits difficulties, coordinating its\nactivities, and supplying to every single member its own kind of life. That\nis what your physical head does, and that is what Jesus, as Head of the\nbody, desires to do.\nThis must find application on an individual basis. Oftentimes we fail to\nsee that a church consists of individuals. You are the church! It cannot\nact as a corporate body very often---it is not expected to. Yet, because we\nhave false concepts of the church, we often expect the corporation to act\nfor us. But Christ's body is not designed that way. Each individual is\ndirectly related to the Head. It is he who should direct each of us in our\nactivities through the week. That is where the church truly functions, not\nhere on Sunday morning. Here is where the church is taught by the Head,\nwhere we learn how to function. But we actually function away from here, in\nour homes and neighborhoods. There we must relate directly to the Head,\nexpecting him to open doors, provide energy, wisdom, comfort and\nforgiveness. That is where the church touches society on every side. Yet, despite the fact that we are to function as individuals, we must never\nforget that we belong to the whole, not only this local body but the whole\nbody of Christ all over the world. We are all related to one another. This\nmarvelous mystery of relationship constitutes one of the most exciting\nthings in the world today. When the church functions properly it is far and\naway the most powerfully effective body on earth. That is what Jesus means\nwhen he said, \"You are the salt of the earth; you are the light of the\nworld.\" As individuals we must remember that our part is to respond to\npersonal direction from the Head: to do as he says and obey his word. Now Paul tells us, in two marvelously descriptive phrases, exactly why\nJesus is the Head of the body. First, he says, \"he is the beginning.\" The\nbeginning of what? The beginning of the church! He is the One from whom the\nchurch gets its life. There are several \"beginnings\" in Scripture. The\nBible opens on that note: \"In the beginning God created the heavens and the\nearth.\" But that is not the beginning referred to here. There is\nanother\"beginning\"in the gospel of John: \"In the beginning was the Word.\"\nThat goes back even before creation. But that is not the \"beginning\" spoken\nof here either. The \"beginning\" here is the same one which John speaks of\nin his letter: \"We know him who was from the beginning.\" He is referring to\nthe beginning of the church, when the disciples saw Jesus, touched him and\nhandled him. From the risen life of Jesus flows the new life of the church.\nThat is what Paul teaches so clearly in 2 Corinthians 5: \"If anyone be in\nChrist he is a new creation. Old things have passed away, all things have\nbecome new.\" We are part of a new humanity that God is bringing forth upon\nthis earth, a humanity that is \"bought with a price\": \"You are not your\nown, you are bought with a price.\" Remember, \"He who knew no sin was made\nsin for us, that we might be made the righteousness of God in him.\" This should remind us of that simple, often misunderstood parable, that our\nLord told among several others, in Matthew 13. He says, \"The kingdom of\nheaven is like a merchant looking for fine pearls. When he found one of\ngreat value, he went away and sold everything he had and bought it.\"\nUnfortunately, that parable has been interpreted to mean that Jesus is the\npearl of great price, and that when we see what a valuable person he is we\nwill sell all we have and buy him. But that is entirely contrary to every\nother teaching of Scripture. We do not buy God. We cannot purchase him or\npurchase our salvation in any sense. We have nothing to offer him! We must\ncome, as the old hymn puts it, \"Nothing in my hand Ibring,/Simply to thy\ncross Icling.\" No, it is Jesus who is the merchant looking for a fine\npearl. And he finds one: it is the church! For it, \"he went away and sold\neverything he had and bought it.\" This is most instructive if you remember how a pearl is made. Apearl, you\nknow, starts out as an irritatedoyster! Agrain of sand gets under the\noyster's shell. To the oyster that feels like crackers in bed do to us. It\nis very uncomfortable, and the oyster sets about getting rid of it. What it\ndoes is to cover the irritating grain of sand with a beautiful nacre that\nhardens into a lustrous and gorgeous pearl. That is how the church was\nborn. It emerges from the wounded side of Jesus. It was the irritation that\nwe represent by our sinful lives that put him to death, and he covers it\nover and heals it, making it into a beautiful pearl of great value. That is\nthe church. That is what Paul is describing here: Jesus himself is the\nbeginning of the church. Then, secondly, Paul says, Jesus is \"the firstborn from among the dead.\"\nMany take that to mean he is the first one ever to be resurrected. That is\ncertainly true. The resurrection of Jesus is the only resurrection that has\never occurred on this earth. Lazarus, and all the others who came back from\nthe dead, were simply resuscitated: they came back to the same life they\nhad left. We may even feel a bit sorry for them because they had to come\nback to take it up again. But Jesus was truly resurrected. He was given a\nglorified life: he came from the grave at a far higher level than he went\nin. He returned in a glorified body, subject to different laws and governed\nby different principles. But that is not what is meant here. That is what\nPaul calls \"the first-fruits of them that slept.\" But here \"firstborn\"\nmeans what it does in verse 15. We have already seen that it means the\nowner, the possessor, of the old creation. Here then it means the owner,\npossessor, of the new creation. He is the One who alone possesses the\nresurrection life that he gives to each of us. That is what John is saying\nin his first letter, in chapter 5, verse 11: \"This is the testimony: God\nhas given us eternal life [deathless life, resurrection life], and this\nlife is in his Son. He who has the Son has life; he who does not have the\nSon of God does not have life.\" He may be moral, he may be a nice person,\nbut he does not yet possess the life of eternity, the resurrection life of\nJesus, because that life comes from Jesus alone. Now it is a clear biblical fact that Christians who have received Christ\nand been born into the new creation have this life. That is the reason they\ncan no longer excuse themselves for wrong behavior by saying, \"Well, after\nall, I'm only human.\" It is true you are human yet in the body, in the\nflesh, and that is why you are tempted, but because you also have a new\nlife it means you do not need to yield to that temptation; there is now a\nnew power within. Ifeel constrained to get this across to people. When you become a\nChristian you have a new source of power which the world knows nothing\nabout. Therefore, you are expected to live at a different, higher level.\nAnd you can. You cannot excuse yourself by saying, \"I'm only human.\" True,\nthat is why temptations come, but God has given us an ability to say no to\nthese and to say yes to the power of Christ. We will not feel powerful---we\nare never expected to---but we have the power to say no; that is what the\nnew creation is all about. Thus, because our Lord is Master of the old creation (the old, material\nuniverse all around us)---and also master of a whole new humanity that is\nnow coming into being, Paul goes on to say that he is both firstborn of the\nold and firstborn of the new \"in order that he might have the supremacy.\"\nThere is nothing left out of his control. One of the old Christmas carols\ncaptures this beautifully,"
    },
    {
      "tag": "blockquote",
      "text": "King of kings yet born of Mary, As of old on earth he stood, Lord of lords in human nature, In the body and the blood. He will give to all the faithful, His own self for heavenly food."
    },
    {
      "tag": "p",
      "text": "That is the difference that being a Christian makes: we have Christ himself \n  dwelling in us, and that enables us to be more than we once were. Paul now turns \n  from our Lord's position as Head of the body to his work as the reconciler of \n  all things."
    },
    {
      "tag": "blockquote",
      "text": "\"For God was pleased to have all his fullness dwell \n  in him, and through him to reconcile to himself all things, whether things on \n  earth or things in heaven, by making peace through his blood, shed on the cross.\""
    },
    {
      "tag": "p",
      "text": "Notice how carefully the apostle links together the reconciling work of\nChrist and his deity. Jesus had to be God to do what he did! At the Chicago\nConference on Biblical Application which Imentioned last week Iwas\nthrilled to hear Dr. Bruce Waltke make an impassioned plea that we who are\nworking with these great themes of Scripture find some way to reduce these\ntheological statements to contemporary terms, because, as he put it, \"the\nworld is lost without a sense of God. Men and women everywhere desperately\nneed to know that there is Someone in charge of life, and that there is a\nSource to whom they can turn for help and for deliverance. The world needs\nto know that Jesus Christ is God.\" He made the statement personal with\nthese words, \"If Jesus is not God, then Ido not have a Savior.\" That is\nsurely true. If Jesus is not God there is no bridge that can span the chasm\nbetween God and man. This is why Christianity is often offensive to people of other faiths. They\nsay, \"Why can't you recognize that all religions have leaders who can lead\nus into truth? Why do you claim that Jesus is different and above all the\nothers?\" That is often called \"the scandal of exclusivity,\" the exclusive\nclaim that only one religious founder is both God and man. As C. S. Lewis\nwell states,\nIf you had gone to Buddha and asked him, \"Are you the Son of Brahma?,\" he\nwould have said, \"My son, you are still in the vale of illusion.\" If you\nhad gone to Socrates and asked, \"Are you Zeus?\" he would have laughed at\nyou. If you had gone to Mohammed and asked, \"Are you Allah?\" he would first\nhave rent his clothes, and then cut your head off. If you had asked\nConfucius, \"Are you Heaven?\" Ithink he would have probably replied,\n\"Remarks which are not in accordance with nature are in bad taste.\" There is only One who claims that he is both God and man. This explains the\nname which the shepherds whispered when they came into the stable after the\nangels' announcement. They knelt in awe before the Babe lying there and\nbreathed the one word, \"Immanuel\" (God with us). He is the reason for the\nseason! Iwant to tell you it makes me angry to see the commercialization\nof Christmas. All this flim-flam about trees, and presents, and Santa Claus\ntends to obscure this marvelous truth: that Baby was \"God reduced to a\nspan/Incomprehensibly a man\" and he is the only hope we have out of the\nmess we find ourselves in. That is the glory of Christmas. But because Jesus is both God and man he is able to bridge the gap, \"to\nreconcile to himself all things.\" This verse has been used as a proof text\nto substantiate the idea of universal salvation; that ultimately every\nperson and every being is going to be redeemed. Even the devil and his\nangels (this concept maintains), and even the wickedest of men such as\nHitler and Stalin and those who are far worse because of spiritual evil are\nsomeday going to be redeemed. There may be a temporary punishment, but\neventually everything in the universe will be restored to God, and there\nwill be no hell and no eternal judgment. That is the teaching of\nuniversalism. It is true that the word \"reconcile\" upon which this whole teaching hangs,\ndoes mean salvation in the case of those who believe. It is used in that\nsense in the very next verses, where Paul goes on to say,"
    },
    {
      "tag": "blockquote",
      "text": "\"Once you were alienated from God and were enemies \n  in your minds because of your evil behavior. But now he has reconciled you by \n  Christ's physical body through death to present you holy in his sight, without \n  blemish and free from accusation.\""
    },
    {
      "tag": "p",
      "text": "That is clearly salvation in its fullest degree. But \"reconcile\" often\nmeans things other than salvation. This is where we must be very careful.\nHeresy can creep in at places where we do not expect it. It is wrong to\ntake a single meaning of a word and press it everywhere as its only\nmeaning. If you look elsewhere in Scripture you will find that \"reconcile\" is\nbroader than salvation. In Ephesians 2, for instance, Paul uses it of the\nhealing of hostility between Jew and Gentile. He says Jesus has come \"and\nbroken down the middle wall of partition and reconciled Jew and Gentile in\none body,\" by which he means the hostility is ended. Not that every Jew and\nevery Gentile will be saved, but they will be able to live in harmony; that\nis his point. In 1 Corinthians 7, the apostle says that husbands and wives\nare to be \"reconciled\" to one another. There may be some husbands and wives\nhere who need to have their hostility end and begin to live together in\npeace. Parents and children need reconciling at times. Friends often need\nit. Christmas is a time when reconciliation between estranged family\nmembers takes place more than it does at other times of the year. The basic\nmeaning of this word is \"to remove all impediments to peace\" so that\nharmony prevails. What does it mean, then, that Jesus shall \"reconcile to himself all things,\nwhether things on earth or things in heaven\"? It means a day is coming when\nthe hostility of evil against righteousness will be brought to a sudden\nhalt. Evil men and angels will find themselves unable to function in their\nenmity against God. They will be subdued, and will cease their rebellion.\nIt does not mean their punishment ends; it is their active hostility that\nwill cease. Then, at last, the terrible question that every one of us has\nasked at times, \"Why does God permit evil?\" will be answered. There is\ncoming a day, according to this verse, when all will be explained to us:\nWhy do the good suffer? Why do bad things happen to good people? Why does\ninjustice reign triumphant at times? Why are innocent children raped,\ntortured, and killed, or ruined in mind and body by drugs or molestation?\nWhy were six million Jews gassed to death in Germany? Why were millions of\nothers elsewhere shot, speared, drowned, burned or hanged by the tyrants of\nhistory? Why? We have all asked these questions. Why do accidents occur, ruining our\njoys? Why does insanity rage in so many? At last this question is to be\nanswered. At last we will learn why it was necessary to allow evil. Then we\nwill see it was part of the working out of God's program. Every hurt will\nbe resolved, every tear will be wiped away, every pain will be relieved. At\nlast the whole universe will live in peace and harmony with one another.\n\"Nothing shall hurt or destroy in all God's holy mountain.\" Read the great\npromises of Isaiah in this regard. What glorious language he employs to\npicture an earth where nothing is out of step, nothing is eccentric,\nnothing is out of balance; everything is in harmony with everything else.\nThat is what this declares. Surely this is what Paul is describing in that\ngreat passage in Philippians. An hour is coming when \"every knee shall bow\nand every tongue confess that Jesus Christ is Lord to the glory of God the\nFather.\" That is where history is headed. The marvelous thing about this is that it flows out of the death of Jesus\non the cross. It is the cross that has brought this to pass. That is why it\nhas been the central symbol of Christian faith since the very beginning. We\nput crosses up in our sanctuaries, not to make us think that the cross was\na beautiful piece of wood, for it was a dirty, bloody, rugged means of\ndeath. But out of that death has flowed life to all the universe. That is\nwhat this is telling us. We find it described very clearly in chapter two\nof this letter, in the words, \"And having disarmed the powers and\nauthorities, he made a public spectacle of them, triumphing over them by\nthe cross\" (2:15). It is the cross that is the center of all life. Christians should never allow themselves to forget that wonderful scene\nrecorded in the book of Revelation, where John is caught up into glory and\nsees the end of history, the end of all human affairs. Here is how he\ndescribes it:"
    },
    {
      "tag": "blockquote",
      "text": "Then Ilooked and heard the voice of many angels, \n  numbering thousands upon thousands, and ten thousand times ten thousand. They \n  encircled the throne and the living creatures and the elders. In a loud voice \n  they said: \"Worthy is the Lamb, who was slain, to receive power and wealth and \n  wisdom and strength and honor and glory and praise!\" Then Iheard every creature \n  in heaven and on earth and under the earth and on the sea, and all that is in \n  them, singing: \"To him who sits on the throne and to the Lamb be praise and \n  honor and glory and power, for ever and ever!\" The four living creatures said, \n  \"Amen,\" and the elders fell down and worshiped."
    },
    {
      "tag": "p",
      "text": "That is what Christmas initiates: it is the beginning of the great process\nthat shall end in the perfect harmony of all creation. We are privileged to\nhave a part in proclaiming this good news right now, and in our hearts to\ngive honor and glory to the Lord Jesus, even before the rest of creation\njoins in the song. Revelation closes with this reminder:"
    },
    {
      "tag": "blockquote",
      "text": "The Spirit and the bride say, \"Come!\" And let him \n  who hears say, \"Come!\" Whoever is thirsty, let him come; and whoever wishes, \n  let him take the free gift of the water of life... He who testifies to these \n  things says, \"Yes, Iam coming soon.\" Amen. Come, Lord Jesus. The grace of the \n  Lord Jesus be with all God's people. Amen. (Rev. 22:17ff)"
    },
    {
      "tag": "p",
      "text": "Catalog No. 4022 Colossians 1 18-20 Fourth Message December 21, 1986"
    },
    {
      "tag": "div",
      "text": "Library series: 12 messages next message: The Great Mystery previous message: Master of the Universe formats: pdf , mp3"
    },
    {
      "tag": "p",
      "text": "Copyright © 1986 Discovery\nPublishing , a ministry of Peninsula\nBible Church. This data file is the sole property of Discovery Publishing,\na ministry of Peninsula Bible Church. It may be copied only in its entirety\nfor circulation freely without charge. All copies of this data file must\ncontain the above copyright notice. This data file may not be copied in\npart, edited, revised, copied for resale or incorporated in any commercial\npublications, recordings, broadcasts, performances, displays or other products\noffered for sale, without the written permission of Discovery Publishing.\nRequests for permission should be made in writing and addressed to Discovery\nPublishing, 3505 Middlefield Rd. Palo Alto, CA. 94306-3695."
    }
  ]
}