{
  "url": "http://www.pbs.org/newshour/bb/health/july-dec04/odorico.html",
  "content_hash": "9bade4a2b7eea7b30d492ef9c133fc91298141f50adbec1ff380e10e928772bc",
  "total_blocks": 245,
  "retained_blocks": 3,
  "ignored_blocks": 242,
  "blocks": [
    {
      "tag": "div",
      "text": "<rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n         xmlns:trackback=\"http://madskills.com/public/xml/rss/module/trackback/\"\n         xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\n<rdf:Description\n    rdf:about=\"http://www.pbs.org/newshour/bb/health/july-dec04/odorico.html\"\n    trackback:ping=\"http://www.pbs.org/cgi-registry/trackback.pl/newshour/bb/health/july-dec04/odorico.html\"\n    dc:identifier=\"http://www.pbs.org/newshour/bb/health/july-dec04/odorico.html\" />\n</rdf:RDF> No Ad Zone defined for this page. header table document type (focus/forum/etc.) begin headline DR. \r\n        JON ODORICO end headline begin date August 9, 2004 end date begin summary paragraph"
    },
    {
      "tag": "p",
      "text": "As part of a report on the state of embryonic stem cell research three \r\n          years after President Bush limited federal funding for the effort, Health \r\n          Correspondent Susan Dentzer talked with Dr. Jon Odorico, a transplant \r\n          specialist and stem cell researcher at the University of Wisconsin. \r\n          The following is an extended transcript of their discussion. end summary paragraph The NewsHour Health Unit is funded by a grant from \r\n          The Henry J. Kaiser Family Foundation. link to realaudio transcript Online NewsHour Specials : Stem \r\n                Cell Research Adult \r\n                Stem Cells Extended \r\n                Interviews Dr. \r\n                Elias Zerhouni , Director, National Institutes of Health Dr. \r\n                Zerhouni and Dr. Ron McKay , National Institute of Neurological \r\n                Disorders and Stroke Dr. \r\n                Jon Odorico - University of Wisconsin Stem Cell Researcher Dr. \r\n                James Thomson - University of Wisconsin Stem Cell Researcher Dr. \r\n                Yuri Verlinsky , director of the Reproductive Genetics Institute U.S. \r\n                Rep. Dave Weldon U.S. \r\n                Rep. Diana DeGette Past Reports: April \r\n                8, 2002: Fred de Sam Lazaro of Twin Cities Public Television reports \r\n                on stem cell research in India . Aug. 10, 2001: A panel of ethicists and members of the scientific and medical \r\n                communities react \r\n                to the president's decision . April 12, 2001: Scientists may have found a way to use human \r\n                fat as a source of adult stem cells . More NewsHour coverage of health and science News for Students: First \r\n                Stem Cells Extracted from Cloned Human Embryo . 02.17.04 Lesson Plan : Stem \r\n                Cell Research Policy Lesson Plan: Create an Advocacy Brochure Embryonic \r\n                Stem Cell Research at the University of Wisconsin NIH \r\n                Human Embryonic Stem Cell Registry Reproductive \r\n                Genetics Institute Stem \r\n                Cell Fact Sheet from the White House begin transcript SUSAN DENTZER: Let's start by talking about \r\n        your life as a transplant surgeon, the kinds of things that you saw that \r\n        got you into this aspect of research. DR. ODORICO: Well, we transplant pancreas transplants and islet cell \r\n          transplants for patients with Type I diabetes. And although that's quite \r\n          successful in many cases, and patients can come off insulin, which they \r\n          normally need lifelong, there are many complications that are associated \r\n          with the transplants--surgical complications and long-term complications \r\n          which can be life-threatening. Patients have to take immunosuppressive \r\n          medications which make them more susceptible to infections and malignancies \r\n          or cancers are very common after transplantation, long term, unfortunately, \r\n          which really can foreshorten a patient's life span even though the organ \r\n          may function normally. So, in this, these are complications that are \r\n          really devastating to see, not to mention some technical complications \r\n          shortly after surgery. All those together add up to some problems in pancreas, and kidney, \r\n          and islet transplant patients that ends up being not a perfect treatment \r\n          for them. So there is a plus side and a downside to transplantation. \r\n          We certainly effectively treat many patients, but there are some patients \r\n          who don't do very well, so we're looking for better treatments. In addition, there's a shortage of pancreas organs or organs in general \r\n          from cadaver donors, and it doesn't meet the need of all the Type I \r\n          diabetics in this country. SUSAN DENTZER: So, when did you first say to yourself, \"There must \r\n          be a better way, and that way may have something to do with stem cells\"? DR. ODORICO: In 1995, Jamie Thompson, at the University of Wisconsin \r\n          here, derived Rhesus or monkey embryonic stem cells. And it occurred \r\n          to us at that time that, because of the incredible properties of embryonic \r\n          stem cells being able to differentiate into many different cell types \r\n          of the bodies and tissues, that this might be a potential source for \r\n          organs for transplantation in the future. SUSAN DENTZER: So you literally thought, wow, organ supply. DR. ODORICO: Immediately. Immediately, as did many others. There are \r\n          other attributes of the cells that really are important to understanding \r\n          developmental biology mechanisms and how tissues, and organs, and our \r\n          bodies form from single cells and early embryos, and there are some \r\n          very important roles of embryonic stem cells and finding out basic biology, \r\n          but also there is the application of embryonic stem cells to actually \r\n          treating patients. SUSAN DENTZER: I don't want to trivialize this, but of course in the \r\n          popular imagination, this has become the way people think about it--wow, \r\n          organs growing in lab dishes. Did you almost think that in '95, that \r\n          that was a possibility? DR. ODORICO: Almost, yes, although we have a long way to go yet to \r\n          get there, and it might be a little bit of a stretch of the imagination \r\n          to go from single cells to a complex organ. So many applications of \r\n          embryonic stem cells for treatment of patients is thought of now as \r\n          a cell-based therapy. You make the embryonic stem cells grow into groups \r\n          of cells that have a certain function, and then you transplant those \r\n          cells with an injection of cells to make new functions in the patient \r\n          to relax functions of those particular cells. And there are many diseases in humans that are characterized by the \r\n          loss of function of one or a few different types of cells, and those \r\n          diseases could be treated by some stem cell-based therapy. SUSAN DENTZER: So, in '95, how quickly did you think this would become \r\n          a reality, that you'd actually have therapies available for patients \r\n          based on stem cells? DR. ODORICO: Well, many people, including myself perhaps, thought \r\n          it might be just around the corner, might be a few years, but it even \r\n          took 3 years for Dr. Thompson to derive human embryonic stem cells. \r\n          And then a few years after that, certainly many people became excited \r\n          that treatments were just around the corner. But I realize that, although we have to give hope to patients, I realized \r\n          that it was going to be a long period of time. Medical therapies don't \r\n          happen overnight. They evolve a lot of basic science research needed \r\n          to be done and still needs to be done, but there are promising aspects \r\n          of the research already, and significant progress has been made, such \r\n          that I think it's very important to keep going. SUSAN DENTZER: Okay. You started working first on mouse embryonic stem \r\n          cells. Let's walk through what you did. I'm now speaking, of course, \r\n          about the work that was published in Diabetes. What did you do? What \r\n          did you get the mouse stem cells to do? DR. ODORICO: Well, we really merely observed what they can do. They \r\n          undergo spontaneous differentiation and culture--mouse ES cells do--and \r\n          we wanted to look for a particular type of cell that is important for \r\n          patients with diabetes, and that is Islets of Langerhans, which are \r\n          clusters of hundreds of thousands of cells that produce different hormones, \r\n          particularly insulin, which helps control blood sugars. So no one had really done that much before we began looking, although \r\n          other cell types had been detected to be differentiated from mouse embryonic \r\n          stem cells. So we were interested in looking for this particular cell \r\n          type. Unfortunately, the cells of this type are fairly bland in appearance, \r\n          and they don't just jump at you, so we had to do some gene expression \r\n          studies or look for gene expression, look for genes turned on, a particular \r\n          type and look for hormones produced and detected by staining of antibodies. So--and we saw those in the cultures, in the petri dishes, as the \r\n          cells go through a variety of stages of embryonic development, and they \r\n          go through stages of early pancreas to middle pancreas, to late pancreas \r\n          and actually insulin-producing cells under the certain conditions. SUSAN DENTZER: And so, in effect, you watched as these embryonic stem \r\n          cells became beta cells, correct? DR. ODORICO: Correct. SUSAN DENTZER: And you didn't do anything magic. You just watched what \r\n          normally happens in an embryo, in effect. DR. ODORICO: Yes. SUSAN DENTZER: Was there anything magic about the culture that you whipped \r\n          up for this to happen in? DR. ODORICO: No, the culture conditions were not very specific or \r\n          particular. We culture them in the presence of serum and allow them \r\n          to form what's called embryoid bodies. And these embryoid bodies are \r\n          groups of cells that look like an embryo--and that's why they're called \r\n          embryoid bodies--but they're not quite an embryo. They are abnormal. \r\n          They're not normal, but they have many of the features of embryos, and \r\n          that's why they're called embryoid bodies. They-- going through that phase, and then subsequent, allowing subsequent \r\n          to occur, then you can begin to see some of the cell types: pancreatic \r\n          precursor cells, and within clusters of those pancreatic precursor cells, \r\n          insulin-producing cells. SUSAN DENTZER: And what, in the end, is the significance of having demonstrated \r\n          this or having watched as nature, in effect, demonstrated this in mice? DR. ODORICO: Well, it's the first step really to getting towards a \r\n          therapy, and that is showing that embryonic stem cells can differentiate \r\n          or can become a particular cell type that produces insulin. That's important \r\n          for possibly treating diabetes in the future. There are many subsequent \r\n          steps. We have to show that they function and show that they function \r\n          in animals, in reverse diabetes in animals, and then we'd like to show \r\n          that, in preclinical models, these cells might have treatment potential. And then one needs to show that they are a safe treatment, that they \r\n          don't form tumors and that they're free of infection, risk, and then \r\n          one can think about some clinical trials or treating patients in an \r\n          experimental way. SUSAN DENTZER: So you haven't cured any mice of diabetes yet. DR. ODORICO: No, we haven't. No. And we don't know who well these \r\n          cells function. For instance, if they're going through different pathways \r\n          of development, it may be that some of them are stuck in an early pathway \r\n          of immaturity and are not fully functional, yet some of them may have \r\n          gone through that whole pathway and become fully functional. But, clearly, we need to learn about how better to get them because \r\n          only a rare few cells become of this type of pancreatic lineage. SUSAN DENTZER: And some bail out before they get to that stage. DR. ODORICO: Some choose other fates, in that they choose to become \r\n          heart muscle and neurons or maybe don't make it all the way towards \r\n          insulin-producing islet cells. So we need to figure out optimal culture \r\n          conditions to steer them or direct them--all the cells, not just some \r\n          of them--to the type we're interested in. SUSAN DENTZER: And what we understand, at the moment, about why some \r\n          cells differentiate one way and some the other way is basically nothing, \r\n          correct? DR. ODORICO: Very little. Very little. Only the beginnings of our \r\n          understanding of developmental biology, and particularly in mice and \r\n          other lesser species, very little in humans. SUSAN DENTZER: Let's stay with the mice for a moment. The next stage, \r\n          as you say, would be to essentially try to take some of these cells \r\n          and put them back into mice that either had diabetes or induced to have \r\n          diabetes and see what happens. When will you do that? DR. ODORICO: Well, at this point, since it's so few cells that produce \r\n          insulin, I think we need to generate enriched cultures first--a lot \r\n          of cells producing insulin. And then once we have many of those in hand, \r\n          test their function in a petri dish and them simultaneously or at the \r\n          same time put them into mice and see how they work, see if they're able \r\n          to cure diabetes. SUSAN DENTZER: So a mouse cure could be a couple years away. DR. ODORICO: Yes. SUSAN DENTZER: Plus. DR. ODORICO: Yes. SUSAN DENTZER: If it works. DR. ODORICO: Yes. SUSAN DENTZER: And if the mice don't develop tumors. DR. ODORICO: Yes. SUSAN DENTZER: And we don't know yet how to get the cells to turn off \r\n          and not make tumors, correct? DR. ODORICO: That is a big challenge. I think that would be a significant \r\n          challenge, but not insurmountable. When you differentiate ES cells to \r\n          cells that have specific functions, they lose some of the ability to \r\n          divide and proliferate, which is what tumors do--tumor cells do. So, \r\n          if you have those cells in hand and they don't have that ability to \r\n          proliferate, then they're less likely to develop tumors. There are also genetic ways of selecting or killing off the cells \r\n          that still have tumor potential, which are the undifferentiated ES cells \r\n          to start with. Once they become differentiated, they have less tumor \r\n          potential, it's thought. And I think, so that tumor potential may be \r\n          controllable, but still, for treatment, it's obviously a very important \r\n          safety issue. SUSAN DENTZER: Because you couldn't guarantee that you might--you couldn't \r\n          guarantee that you might not transplant one lousy cell into a mouse \r\n          that would create a tumor. DR. ODORICO: Well, there would be--have to be some strict safety standards, \r\n          I think. SUSAN DENTZER: Which means that when it comes to applying this to humans, \r\n          what? DR. ODORICO: It means doing some pilot studies in larger animals like \r\n          Rhesus monkeys perhaps or human models that are applicable and then \r\n          showing safety in that setting before ever treating a human. SUSAN DENTZER: So, again, not to dwell on this, but just so that we \r\n          can make it clear to the public how far away these therapeutic applications \r\n          could be, even if everything goes fabulously well, [it could be] 10 \r\n          years maybe, maybe more, before you're actually in human trials. DR. ODORICO: I think that's realistic. If you had to put a number \r\n          on it, although, in this business, it's hard to put a number on it. SUSAN DENTZER: And if we did, say, a numerical scale, where 100 is a \r\n          therapy for humans, and that's the state of the science that we have \r\n          to get to before we're actually routinely providing this therapy to \r\n          humans, where are we on that scale of zero to 100 at this point? DR. ODORICO: I would say we're at the very earliest stage, maybe 10. SUSAN DENTZER: Now, Ron Reagan said last night in his convention speech, \r\n          imagine if you could have a \"biological repair kit\" on deposit \r\n          at your local hospital of your own stem cells. Does the public have \r\n          unrealistic expectations at this point about how quickly all of this \r\n          will pan out? DR. ODORICO: Well, for some diseases it may be closer at hand. For \r\n          other diseases, we're still at the earliest stages. For Alzheimer's \r\n          disease, it may be challenging because we don't know a lot about what \r\n          causes Alzheimer's in the first place. For other diseases, like Parkinson's \r\n          disease or cardiac failure, there are relevant cell populations that \r\n          have already been derived from human ES cells and that function well. And early animal models are going on now. Early animal studies are \r\n          going on now such that I think the applications in those settings may \r\n          be sooner based on robustly functioning cells being derived from human \r\n          ES cells. Whereas, islet transplantation instead from ES cell-based therapy \r\n          is probably a little bit farther away because we haven't demonstrated, \r\n          no one has demonstrated, functional cells from human ES cells that are \r\n          able to cure an animal at this stage. On the other hand, cell-based therapies in general have been shown \r\n          to be successful in patients with Type I diabetes, and what I'm talking \r\n          about there is human cadaver donor, pancreases recovered and then islets \r\n          isolated from them and then transplanted to Type I diabetics. And that \r\n          cell therapy we know works. Whereas, in Parkinson's disease, Alzheimer's disease and heart failure, \r\n          other potential applications from ES cells, we don't know whether cell-based \r\n          therapies will have a beneficial effect. So, in that sense, there is \r\n          a precedent for cell-based therapies that can be ES cells and ES cell-derived \r\n          islet tissue can be immediately applied to humans if it shows to be \r\n          functional. SUSAN DENTZER: So that strengthens the case for this therapy actually \r\n          being applicable here. DR. ODORICO: Yes. SUSAN DENTZER: What work are you doing now on human embryonic stem cells \r\n          in this lab? DR. ODORICO: Well, we're working on a variety of fronts. One major \r\n          one is to find optimal culture conditions which allow directed differentiation \r\n          of human ES cells to islet tissue. SUSAN DENTZER: And by \"directed\" you mean you want to aim \r\n          for one particular type of cell. DR. ODORICO: Right. SUSAN DENTZER: You're asking what culture conditions do you need to \r\n          get the cell type you want. DR. ODORICO: Exactly. And that set of conditions is elusive right \r\n          now, and many other investigators around the country are working on \r\n          that, and that's a major effort right now, and I think the first next \r\n          step. Other things we're working on are using genetic selection methods \r\n          to select out the cell types of interest from a heterogenous mix of \r\n          cells or enriching cultures by sorting cells. SUSAN DENTZER: Here at Wisconsin you're working on authorized lines, \r\n          in effect, the five cell lines that have been derived here. So you don't \r\n          have a problem. You've got a good, steady in-house supply of stem cell \r\n          lines. So has the president's policy, as announced in August 2001, has \r\n          any of that precluded any research you might have wanted to undertake \r\n          or have you essentially been immune to this? Have you felt any impact \r\n          of this policy in a negative way? DR. ODORICO: We have, yes, because there are some experiments we'd \r\n          like to do which we are more cautious about and have not undertaken \r\n          yet, and that is some experiments which would--might be conditions which \r\n          might drive the cells to a particular type of cell and the cell type \r\n          we're interested in. And those are basic developmental biology studies which allow co-culture \r\n          or commingling of embryonic tissues that might have inducing or directed \r\n          differentiation properties, and commingling those tissues from embryos \r\n          with the embryonic stem cells or putting the embryonic stem cells in \r\n          an embryo of another species and seeing what they can become in that \r\n          setting. We haven't undertaken those experiments because of the questions of \r\n          introducing human ES cells into other species' embryos. SUSAN DENTZER: So just to make up an example, you might want to take \r\n          a human embryonic cell and essentially put it into a mouse embryo. DR. ODORICO: Yes. SUSAN DENTZER: And you're not sure if you can do that. DR. ODORICO: Right. SUSAN DENTZER: Because? DR. ODORICO: Because of the federal regulations of restrictions on \r\n          what types of experiments are done with human ES cells. They're in the \r\n          restrictions that you cannot introduce human ES cells into the embryo \r\n          of a human or another species. SUSAN DENTZER: So that's-- DR. ODORICO: Off limits. SUSAN DENTZER: Verboten. DR. ODORICO: Yeah. SUSAN DENTZER: So that's another aspect of the president's policy that \r\n          you would want to see changed. DR. ODORICO: Yes. SUSAN DENTZER: Have you asked that that be done? DR. ODORICO: No. SUSAN DENTZER: Why? DR. ODORICO: There are many other experiments to work on at this point, \r\n          and you know we have to live within the restrictions, current restrictions. \r\n          But I think it would be a benefit to understanding basic developmental \r\n          biology mechanisms and understanding how to direct differentiation to \r\n          certain cell types if those experiments could be carried out. SUSAN DENTZER: And why would it be necessary to introduce that into \r\n          another species to do that? DR. ODORICO: I think, ethically, I have difficulty introducing human \r\n          ES cells into human embryos, as many people might, but other embryos \r\n          of other species might have inductive properties that reproduce that \r\n          of all embryos, and if put in the right tissue in the right location, \r\n          the ES cells of humans might communicate with the chemicals and processes \r\n          that are going on in the other species' embryos. We might want to do \r\n          this because it would be easier to introduce them into embryos of other \r\n          species rather than human embryos. SUSAN DENTZER: Ethically easier. DR. ODORICO: For ethical reasons. SUSAN DENTZER: Let's assume for the moment the president's policy stays \r\n          in place for an unknown period of time, but some time into the future--five, \r\n          maybe even ten years--how much will that hurt progress in this, in the \r\n          field or will it make any difference? Can you progress with the existing \r\n          cell lines? DR. ODORICO: I think it will hurt progress because some of the existing \r\n          cell lines that were derived in 1998 are getting worn out. And what \r\n          I mean by that is they're developing chromosomal abnormalities or genetic \r\n          changes, mutations that will affect their ability, might affect their \r\n          ability to differentiate in cell types one is interested in. It may also make them have a greater tumor potential or greater propensity \r\n          to form tumors. So I think the cells that have been intermittently in \r\n          culture in a petri dish now for six years are starting to get worn out, \r\n          and we need fresh cells, I think. SUSAN DENTZER: And your colleague, Jamie Thomson, says that this happens \r\n          with all types of cells. He says that it is an issue that is overdone, \r\n          even in the scientific community, that these things happen, and you \r\n          can also regenerate cell lines. DR. ODORICO: Yes. All cells in our body age and senesce, embryonic stem \r\n          cells are particularly special in that category because they have a \r\n          much slower aging process and don't senesce like normal cells in adult--our \r\n          adult bodies. The--however, genetic changes can still occur, and there is selective \r\n          pressure of the cells when they're in the petri dish which can allow \r\n          abnormal cells to have a growth advantage and outgrow the normal cells. \r\n          And starting out with one cell over time, you get all the cells becoming \r\n          abnormal. So, even if the cells don't age as other adult cells, somatic cells \r\n          do, you can still get abnormal changes, and they have been documented \r\n          already, and I think that poses a long-term problem, and I think ultimately \r\n          some of the cells are going to be worn out to such a degree that they \r\n          become unusable. SUSAN DENTZER: And you can't just go back to the freezer and get the \r\n          original stock out and thaw them out and start growing a new generation? DR. ODORICO: Well, you can go back in some cases to what's called \r\n          an earlier passage, younger cells, and thaw them. However, once those \r\n          get used up, too--there's only a finite number of those--and once those \r\n          all get used up, we're talking about using cells with later and later \r\n          passage, which have been in culture in a petri dish for longer and longer \r\n          periods of time, and ultimately there have to be changes that occur, \r\n          there's no doubt in my mind, because culture conditions are abnormal \r\n          conditions, and some genetic changes might even--would even occur in \r\n          the embryo or in the body. So, over time, genetic changes can occur and mutations can occur, \r\n          and ultimately I think that's going to be a problem. So we need new \r\n          fresh lines to replenish the older, worn-out ones. SUSAN DENTZER: Let's talk about why you think it may be necessary to create \r\n          insulin-producing pancreatic cells from human embryonic stem cells. DR. ODORICO: In the U.S. about 1,500 pancreas transplants are done \r\n          every year and, on an average, about 100, if that many, islet cell transplants--50 \r\n          to 100 islet cell transplants--but that's growing exponentially. Pancreas transplantation has a little flatter curve of rise of numbers, \r\n          but you're talking about 30,000 new Type I diabetics or more every year \r\n          in the U.S, a million Type I diabetics existing, and the numbers of \r\n          organ donors in the United States, human cadaver organ donors is about \r\n          6,000 or so, 8,000. It doesn't even come close to meeting the need. SUSAN DENTZER: How many Type I patients would normally progress to the \r\n          state that they would need a transplant? DR. ODORICO: It depends on how severe they get, but you could argue \r\n          that ultimately all of them would benefit from a transplant because \r\n          what happens is that there are acute life-threatening events that can \r\n          occur from low blood sugars or high blood sugars that can cause seizures, \r\n          car accidents, coma, that cause mortality acutely or rapidly, and those \r\n          can occur in anybody, particularly though in the more brittle Type I \r\n          diabetics. And then many patients, but not all, get chronic problems, long-term \r\n          problems of many years of high blood sugars. It affects other organs \r\n          like the eyes, heart, blood circulation, nerves, and particularly the \r\n          kidneys. So patients have many, many complications, and it's very costly \r\n          for medical care. Fourteen percent of GNP in some countries is spent \r\n          on medical care for diabetes, and particularly in Western countries, \r\n          and it's a devastating, very debilitating disease. And it's not clear which patients at this point--it's hard to predict, \r\n          I should say, which patients, of all the Type I diabetics, what patients \r\n          will go on to some of these problems, but many of them do. SUSAN DENTZER: Why, ethically, do you think it's all right to do this \r\n          research on human embryonic stem cells when, clearly, some percent of \r\n          the population thinks it's anathema? Why do you think it's not anathema? DR. ODORICO: Well, I think the principle or the reason they say that \r\n          embryonic stem cell research should not be done is because the embryo \r\n          is an individual or a person, and that would be tantamount to killing \r\n          an individual person. However, an embryo, and particularly ES cells in culture, are not people. \r\n          They may have the potential to become an individual under the right \r\n          conditions, but it's that separation, that separating potential from \r\n          what is, is what I think separates something that should be protected, \r\n          as a human subject is in research, versus something that doesn't deserve \r\n          the same level of protection from the point of view of research. I like to use the analogy of the acorn and the oak tree. We all believe \r\n          that we should conserve oak trees and trees in general because of their \r\n          beauty, and their stature, and the good things they provide nature and \r\n          us. An oak tree comes from an acorn. There are lots of acorns running \r\n          around that have the potential to become an oak tree, yet we don't go \r\n          around conserving acorns. And I think that's why I think that if ES \r\n          cells represent the acorn in that analogy, then I don't think we need \r\n          to go around conserving ES cells or embryos that can become ES cells."
    },
    {
      "tag": "div",
      "text": "Beginning of health footer /includes/health_footer.html <body leftmargin=\"0\" topmargin=\"0\"> footer nav table REGIONS TOPICS RECENT PROGRAMS ABOUT US FEEDBACK SUBSCRIPTIONS / FEEDS: search table END search table END footer nav table footer table Support the kind of journalism done by the NewsHour... Become a member of your local PBS station. PBS Online Privacy Policy Copyright ©1996-2006 MacNeil/Lehrer Productions. All Rights Reserved. END footer table"
    }
  ]
}