{
  "url": "http://www.pbs.org/newshour/bb/terrorism/july-dec01/wolfowitz-9-14.html",
  "file_number": "636",
  "content_hash": "a6e2ee728975633d4156ab01e8d010caec69cae6cfe60e36728eda563e81beda",
  "total_blocks": 190,
  "retained_blocks": 3,
  "ignored_blocks": 187,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" #BeginTemplate \"/Templates/produced transcript.dwt\" <rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n         xmlns:trackback=\"http://madskills.com/public/xml/rss/module/trackback/\"\n         xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\n<rdf:Description\n    rdf:about=\"http://www.pbs.org/newshour/bb/terrorism/july-dec01/wolfowitz-9-14.html\"\n    trackback:ping=\"http://www.pbs.org/cgi-registry/trackback.pl/newshour/bb/terrorism/july-dec01/wolfowitz-9-14.html\"\n    dc:identifier=\"http://www.pbs.org/newshour/bb/terrorism/july-dec01/wolfowitz-9-14.html\" />\n</rdf:RDF> No Ad Zone defined for this page. header table document type (focus/forum/etc.) begin headline #BeginEditable \"headline\" PAUL \r\n        WOLFOWITZ #EndEditable end headline begin date #BeginEditable \"dateline\" September \r\n        14, 2001 #EndEditable end date #BeginEditable \"b-head\" #EndEditable begin summary paragraph"
    },
    {
      "tag": "p",
      "text": "#BeginEditable \"intro%20blurb\" The deputy secretary of defense \r\n          discusses the decision to call up 50,000 reservists and the capabilities \r\n          of terrorist groups to again attack the U.S. #EndEditable end summary paragraph #BeginEditable \"Video%20link\" #EndEditable #BeginEditable \"realmedia%20link\" #EndEditable link to realaudio transcript #BeginEditable \"NewsHour%20Links\" Online NewsHour Special Report: The Reponse: After the September 11 Terrorist Attacks Full \r\n                Coverage of September 11, 2001 Attack \r\n                on New York Attack \r\n                on Washington The \r\n                Investigation The \r\n                U.S. Response Sept. 13, \r\n                2001: Secretary of State Colin Powell predicts a long campaign \r\n                against global terrorism. Sept. 13, 2001: Senate Majority Leader Tom Daschle talks about emergency \r\n                funds for relief efforts. Sept. 12, 2001: Former Sec. of State Warren Christopher, Security Adviser Samuel \r\n                Berger, and Sen. Warren Rudman discuss possible responses to terrorist attacks. #EndEditable #BeginEditable \"Extra%20Links\" News \r\n                for Students: Terrorist Bombing Student \r\n                Forum Teacher \r\n                Lesson Plans #EndEditable #BeginEditable \"Outside%20Links\" U.S. Department of Justice U.S. Department of Defense U.S. Department of Transportation National Security Agency U.S. Senate The \r\n                Federal Emergency Management Agency Central Intelligence Agency FBI #EndEditable begin transcript #BeginEditable \"Introduction\" JIM LEHRER: Now a Newsmaker interview with the Deputy Secretary of \r\n          State [Defense], Paul Wolfowitz. It will be conducted by Margaret Warner. MARGARET \r\n          WARNER: Mr. Wolfowitz is the number two man at the Pentagon. He also \r\n          served in the Defense Department during the first Bush administration \r\n          and played a mayor role in planning the Gulf War. Welcome Mr. Secretary. PAUL WOLFOWITZ: Nice to be here. #EndEditable #BeginEditable \"Part%20intro%20pull%20quote\" #EndEditable #BeginEditable \"Part%20One%20subhead\" Resources \r\n        leverged #EndEditable #BeginEditable \"Part%20One\" MARGARET WARNER: First our condolences at your losses at the Pentagon. PAUL WOLFOWITZ: Iappreciate that. It's pretty grim. MARGARET WARNER: Let's start today with the President authorizing the \r\n          Pentagon to call up up to 50,000 reservists for homeland defense, he \r\n          said. What are they needed for? PAUL \r\n          WOLFOWITZ: Avariety of things. Perhaps the most important and Ithink \r\n          greatest in numbers is mobilizing air national guard units so that we \r\n          can maintain air defense protection over the country and particularly \r\n          over crucial locations, major cities. We're going to have, Ithink, significant draw on the National Guard \r\n          and reserve in helping to deal with the colossal tragedy in New York \r\n          City, everything from mortuary services to helping the New York authorities \r\n          in various municipal functions. That's basically the kind of thing we're \r\n          talking about. MARGARET WARNER: How many U.S. cities-- there have been conflicting \r\n          reports on this-- are being protected, essentially by this stepped surveillance? PAUL WOLFOWITZ: Idon't want to give a number. But the fact is that \r\n          we have capability to respond very quickly if there were another incident \r\n          reported. We responded awfully quickly Imight say on Tuesday. And in \r\n          fact we were already tracking in on that plane that crashed in Pennsylvania. \r\n          Ithink it was the heroism of the passengers on board that brought it \r\n          down, but the Air Force was in a position to do so if we had had to. MARGARET WARNER: What were the rules-- would the rules of engagement, \r\n          would they have allowed the Air Force to shoot down a civilian jetliner \r\n          if it appeared headed for a target? PAUL WOLFOWITZ: Ithink, again Idon't want to get into rules of engagement \r\n          but Ithink it was pretty clear at that point that that airliner was \r\n          not under the pilot's control and that it was heading to do major damage. \r\n          Ultimately it's the President decision on whether to take an action \r\n          as fateful as that. But thankfully, Imean we really have to say what \r\n          an incredible thing, and there have been so many great Americans doing \r\n          great things and the people on that plane are clearly among them. #EndEditable #BeginEditable \"Part%20One%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Two%20subhead\" Planning \r\n        for a new battlefield #EndEditable #BeginEditable \"Part%20Two\" MARGARET \r\n          WARNER: Does the U.S. Government have reason to believe that some terrorists, \r\n          members of perhaps the same group, or affiliated with them, are still \r\n          in the United States and are still intending violent acts against Americans? PAUL WOLFOWITZ: Ithink we have to operate on the assumption that there \r\n          may still be people from that group in this country. Ithink we have \r\n          to operate on the assumption that we haven't seen the end of this kind \r\n          of terrorism, but we also have to, Ithink, understand that what we've \r\n          saw on Tuesday completely transforms the problem. We have got to think \r\n          anew about this. The policies of the last 20 years, whether you think they were carried \r\n          out effectively or ineffectively, obviously don't work. This is not \r\n          going to be a problem solved by locking somebody up and putting them \r\n          in jail. It's not going to be solved by some limited military action. \r\n          It's going to take, as the President has said and Secretary Rumsfeld \r\n          has said, a broad and sustained campaign against the terrorist networks \r\n          and the states that support those networks. MARGARET WARNER: Secretary Rumsfeld and the President have both used \r\n          essentially the same term, 21st century battlefield, a war of the 21st \r\n          century. From where you sit, the military side of that, what is that \r\n          war going to look like? PAUL WOLFOWITZ: Well, first of all, it has to involve more than the \r\n          military. And when we talk about the full resources of the nation, we \r\n          mean obviously our military resources, which are awesome and can be \r\n          made even more awesome. We're talking about our intelligence capabilities, \r\n          which are impressive and can be made more impressive, but we're also \r\n          talking about our economic strength. We're talking about our diplomatic strength, Ithink the most important \r\n          weapon we have is the political will of this country. And Ithink we'll \r\n          find once again, as has happened before in history, that evil people, \r\n          because of the way they think, misread our system as one that's weak, \r\n          that can't take casualties, can't take bloodletting, can't carry out \r\n          a sustained operation. Hitler made that mistake. The Japanese made that \r\n          mistake. It looks like the people on Tuesday made that mistake. MARGARET WARNER: Of course many in the public and even on Capitol Hill \r\n          and the military have, up to now also thought the United States people \r\n          wouldn't accept casualties. Are you saying that the way you read it, \r\n          there is really a new mood in the country now? PAUL WOLFOWITZ: First of all, Ireject the idea that we don't accept \r\n          casualties. We went into the Gulf War ten years ago ready to take significant \r\n          casualties. The fact that it was miraculously low, Ibless, but the \r\n          American people were ready for it. But obviously there is a different \r\n          mood and obviously there is an understanding. Let's understand. Just \r\n          at the Pentagon alone more Americans were killed last Tuesday than in \r\n          the Gulf War itself. And that's a pale shadow of what happened in New \r\n          York. We think when the numbers come in, we'll find that more Americans were \r\n          killed on Tuesday than any single day in American history since the \r\n          American Civil War -- worse than any single war of World War I, any \r\n          single day of World War II. It's massive. And Ithink that focuses the \r\n          mind. It makes you think in a different way. It makes you think anew. \r\n          And if it doesn't do that, then people also ought to think that given \r\n          some of the weapons, kinds of weapons these terrorists are after, what \r\n          we saw on September 11th could be just the beginning. We've got to put \r\n          an end to it. #EndEditable #BeginEditable \"Part%20Two%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Three%20subhead\" To \r\n        catch a fox... #EndEditable #BeginEditable \"Part%20Three\" MARGARET WARNER: So go back, though, to the military side. And Itake \r\n          your point about the economic and the diplomatic side as well and Secretary \r\n          Powell was here last night and we talked about some of that, but from \r\n          the military side, give us an idea. PAUL \r\n          WOLFOWITZ: Well, first of all, I'll tell you what isn't going to work. \r\n          Imean we had two embassies blown up a few years ago and we responded \r\n          with some Cruise missiles that took out some targets of questionable \r\n          value. Obviously it did nothing to prevent the problem. Ithink the \r\n          President is the one who has ultimately got to decide what are the military \r\n          options that make sense. Ican tell you that at the Defense Department, both his senior civilian \r\n          advisors and senior military advisors are really thinking, Ihate to \r\n          use the Pentagon jargon, but thinking outside the box, recognizing that \r\n          the assumptions that went into military plans on September 10 just don't \r\n          apply anymore and that one has to think about, if necessary, larger \r\n          forces. One has to think about accepting casualties. One has to think about sustained campaigns. One has to think about \r\n          broad possibilities. And we're trying to present that full range of \r\n          possibilities to the President. He is the one, and Imust say I've been \r\n          very impressed in the discussions I've heard him in in the last few \r\n          days, at his grasp of the breadth of the effort that's required. MARGARET WARNER: When you speak about broad possibilities, you are \r\n          known, at least in the Pentagon during the Gulf War, as an advocate \r\n          of having gone further, not stopping the war when we did -- perhaps \r\n          going all the way to Baghdad. Are you talking about going so far as \r\n          occupying a foreign country? PAUL WOLFOWITZ: Well, Imean, if we want to get into the history, Inever thought we needed to occupy Baghdad. Ido think and Ithink former \r\n          President Bush himself has said that if he had known Saddam Hussein \r\n          was going to survive that massive defeat, he might have kept the war \r\n          going a bit longer. Ithink his people were on the verge of overthrowing \r\n          him. And that's something to remember in general, that most of the regimes \r\n          that support terrorism against us support terrorism against their own \r\n          people basically. They rule by terror. And one of our greatest allies \r\n          against them, whether it's in Iraq or in any other parts of the world \r\n          are going to be to defeat their own people. And as we develop strategies, \r\n          our target is not the people. Our target is the regimes and the people \r\n          are very often going to be our ally. #EndEditable #BeginEditable \"Part%20Three%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Four%20subhead\" Provoking \r\n        a war #EndEditable #BeginEditable \"Part%20Four\" MARGARET \r\n          WARNER: So if Iwere a leader of a country that-- Idon't want to put \r\n          it that way. Where on the continuum of supporting terrorists, which \r\n          we would all agree Afghanistan does, to harboring them, to maybe tolerating \r\n          them, where on that continuum does a foreign country now have to be \r\n          concerned about perhaps not just diplomatic and economic action by the \r\n          U.S. but military action? PAUL WOLFOWITZ: Well, let me put it this way. As you point out correctly, \r\n          Ithink every country in the world is examining where they are in that \r\n          continuum today. And if they tolerate it or don't -- are not sufficiently \r\n          cooperative in police work, I'm sure they're thinking about what the \r\n          Americans are going to come in asking and what FBI and Justice Department \r\n          are going to be looking for. If they're over at the other end where \r\n          they have been actively financing and training and providing logistics, \r\n          intelligence support to these terrorist networks, Iwould hope every \r\n          one of them is thinking about getting out of the business and getting \r\n          out quickly. And that's what a strategy has to look at is how to-- the objective, \r\n          Ithink, has got to be very ambitious. And Ithink the President has \r\n          stated an ambitious objective. And as Winston Churchill commented the \r\n          day after Pearl Harbor, that dictators underestimate American strength \r\n          but America is like a great boiler and once it gets fired up, the energy \r\n          it generates is enormous and when we commit ourselves to an ambitious \r\n          goal, we can achieve it. But that doesn't mean there is a single solution \r\n          for each one of these pieces. MARGARET WARNER: How careful does the United States have to be to not \r\n          provoke a backlash, particularly in the Muslim world? Imean isn't it \r\n          possible that Osama bin Laden, on some level, wanted to provoke the \r\n          United States? They don't seem to have covered their tracks very well. \r\n          It seems that whoever the perpetrators were, they've already been, many \r\n          of them have been identified on the planes. Is there a danger for the \r\n          United States that it might take actions that just inflame anti-American \r\n          sentiment in the Muslim world? PAUL \r\n          WOLFOWITZ: Well, Ithink there's danger of that. They would like nothing \r\n          more than to provoke us into an attack that proves totally ineffective, \r\n          as unfortunately most of our responses over the last 20 years have been. \r\n          And these people have thought a lot. Ithink we have to think about \r\n          the fact that they've painted such bright targets in certain respects, \r\n          maybe they want to us hit them, maybe they don't want us to hit one \r\n          that isn't painted quite as bright as that. But on the broader point Ithink it is very important -- we had a number \r\n          of memorial services at the Pentagon today. And one of them was by our \r\n          Muslim employees. This is not an Islamic act that was conducted. If \r\n          I'm not wrong, there are only two significant figures in the Muslim \r\n          world who have praised this attack, Saddam Hussein being one and the \r\n          leader of Hamas being the other. Even Yasser Arafat, even the Syrians, \r\n          Ithink even Qaddafi, has distanced himself from it, I'm not sure. But Iwas U.S. Ambassador to Indonesia, the largest Muslim population \r\n          in the world. Iknow every Indonesian that Iknow has got to be shocked \r\n          at people claiming that this is justified by the Muslim religion. Every \r\n          religion has its extremists and these are religious extremists that \r\n          we're dealing with. But one of our greatest allies in that struggle \r\n          has got to be the hundreds of millions of Muslims who do not believe \r\n          that that's the face of Islam. MARGARET WARNER: All right, Mr. Secretary, thanks very much. PAUL WOLFOWITZ: Thank you. #EndEditable #BeginEditable \"Part%20four%20pull%20quote\" #EndEditable"
    },
    {
      "tag": "div",
      "text": "footer nav table REGIONS TOPICS RECENT PROGRAMS ABOUT US FEEDBACK SUBSCRIPTIONS / FEEDS: search table END search table END footer nav table footer table Support the kind of journalism done by the NewsHour... Become a member of your local PBS station. PBS Online Privacy Policy Copyright ©1996-2006 MacNeil/Lehrer Productions. All Rights Reserved. END footer table"
    }
  ]
}