{
  "url": "http://www.pcworld.idg.com.au/index.php/id;1235678367;fp;512;fpid;1035602669",
  "content_hash": "441dc4d1b14cfad0ee7c5d46951449609a5dd4137868ecf2b65079026c72ae3a",
  "total_blocks": 189,
  "retained_blocks": 9,
  "ignored_blocks": 180,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" \"http://www.w3.org/TR/html4/loose.dtd\" Username Password | Signup | Forgotten Password Special Offer Close 2 Free Issues of PC World with any New Subscription Purchase a new subscription to PC World and you will receive 14 issues for the price of 12. That's right, two free issues when you subscribe now — for just $66* ! Offer expires on the 30th of September 2006 First Name Last Name Street Number Street Name Suburb State New South Wales Queensland ACT Northern Territory South Australia Western Australia Victoria Tasmania Postcode Email Wednesday  |  27 Dec 2006 Home Reviews Buying Guides Here’s How HelpScreen IT Jobs Books Current Edition Video Reviews Articles HelpScreen <iframe style=\"border: 1px solid red;position: absolute;right:0;bottom:0;width:100px; height:20px;background:none;filter: alpha(opacity=0)\" src=\"about:blank\" scrolling=\"no\" frameborder=\"0\"></iframe> Site Menu <script type=\"text/javascript\" language=\"JavaScript\">\n\t\tdocument.write(lhs_menu);\n\t</script> Home News + Reviews + Hardware + Digital Cameras (160) Advanced Compact Cameras (37) Compact Cameras (85) SLR Cameras (22) Ultra Compact Cameras (16) + Digital Video (93) Digital Video Cameras / Camcorders (66) Security Surveillance Cameras  (10) Video Input Adapters (1) Webcams (16) + Gaming (11) Game Consoles (1) Handheld Game Consoles (1) Other Peripherals (5) PC Gaming Peripherals (1) Playstation Peripherals (2) Xbox Peripherals (1) + Handheld Devices (14) PDAs (14) + Home Entertainment (2) Media Centres (1) Set Top Boxes (1) + Mobile Phones (164) 3G Mobile Phones (36) Mobile Phone Accessories (25) Mobile Phones (67) Smart Phones (36) + Monitors (55) LCD Monitors (55) + Networking (14) Modems (2) Routers (8) Security (2) Wireless (2) + Notebooks (130) All-Purpose Notebooks (58) Power notebooks (33) Tablets (10) Ultraportable Notebooks (25) Value notebooks (4) + PC Components (85) Graphics Cards (31) Motherboards (20) Processors (CPUs) (12) Sound Cards (2) TV Tuners (20) + PCs (26) Business PCs (2) Desktop PCs (7) Gaming PCs (10) Mac Desktops (3) Micro PCs (4) + Peripherals (30) Input Tablets (3) Keyboard (15) KVM Switches (1) Mice / Trackballs (11) + Portable Multimedia (41) Digital Music Players (18) Player Accessories (18) Portable Media Players (5) + Printers (115) Black & White Laser Printers (12) Colour Laser Printers (19) Inkjet Printers (6) Multifunction Devices (44) Photo Printers (34) + Projectors (56) Business Projectors (13) Home Theatre Projectors (33) Portable Projectors (10) + Scanners (20) In-Home Scanners (2) Office Scanners (5) Photo Scanners (13) + Security (1) Biometric (1) + Speakers (20) PC Speakers (20) + Storage (68) DVD-R/RW (19) Flash Media (2) Flash Media Readers (2) Hard Disk Drives (External) (19) Hard Disk Drives (Internal) (9) Network Attached Storage (NAS) (9) Removable Storage (Other) (1) USB Flash Drives (7) + Televisions (1) Plasma TVs (1) + Services + Photography (8) Photo Printing (8) + Software + Communications (10) IP Telephony / VoIP / Web Phones (7) Remote Access (2) Voice Recognition (1) + Content Management (4) Personal Information Management (4) + Databases (2) Database Software (2) + Development Tools (4) Visual Basic (1) Web Design Suites (3) + Education (11) Encyclopedias (3) Other (6) Typing (2) + Email & Messaging (3) Chat / IM (2) Email Clients (1) + Enterprise Applications (1) CRM (1) + Financial (5) Business Accounting (3) Home Accounting (2) + Graphics & Publishing (36) CAD / 3D (3) Design & Illustration (10) Desktop Publishing (2) Digital Photo Albums (3) Digital Photo & Image Editing (10) Digital Photo Utilities (1) Flowcharts & Diagrams (1) Optical Character Recognition (OCR) (1) PDF Utilities (5) + Internet (9) Browser Plug-ins (2) Browsers (5) eBay Tools (1) Online Privacy (1) + Office Productivity (12) Document Conversion Tools (3) Microsoft Office Plug-ins (1) Office Suites (8) + Operating Systems (8) Dual Boot (1) Linux (3) MacOS (1) Unix (1) Virtualisation (1) Windows XP (1) + Security (25) Anti-Spyware / Adware (6) Anti-virus (5) Firewalls (1) Security Suites (13) + Servers (1) Web Servers (1) + Systems Administration (1) Server Management (1) + Utilities (21) Backup (3) CD / DVD Burners (1) Desktop Search (3) Diagnostic / Optimisers (1) File Compression (1) System Tools (12) + Video & Audio (29) DVD Utilities (2) Multimedia Authoring Software (1) Music / Audio Editing (4) Music Managers (1) Rippers / Encoders (1) Video & Audio Suites (5) Video Editing (14) Video Utilities (1) + Features Digital Music Web & you + Opinions Harry McCracken Melissa J. Perenson Laura Blackwell Richard Baguley Oliver Rist Jon Udell Tom Yager + Here's How Linux Business Hardware Software + Guides Buying Guides HTML Developer's Guide PHP Developer's Guide Media Releases + HelpScreen Latest Ask a question + Categories Bugs & Fixes Digital Music Games Graphics & Digital Photography Hardware Internet Linux Mac Networking Novice Office Apps Office XP Other Processors Virus Windows 2000 Windows 9x Windows XP + Jobs Search for Jobs Build a Resume Sponsored Links Reviews"
    },
    {
      "tag": "h1",
      "text": "Create professional interactive multimedia with Director MX"
    },
    {
      "tag": "div",
      "text": "advertisement"
    },
    {
      "tag": "p",
      "text": "Jason Whittaker, PC World 18/08/2003 07:33:26 Long before Flash and Dreamweaver, Director was Macromedias premiere application for multimedia, providing extensive tools for designing animation and interactive programs that could be distributed on CD-ROM and, later, across the Web. The introduction  and roaring success  of Flash has resulted in something of a decline for Director. As Macromedia moved towards a standard interface across its MX suite (incorporating Flash, Dreamweaver, Freehand and ColdFusion), for a time it appeared that Director was going to be left behind, but the latest version has been integrated into the rest of Macromedias range. Unless you use OS X for the Mac, this release will probably seem much less substantial than version 8.5, which introduced a widely adopted 3D engine, although people who regularly use Macromedia products will welcome its improvements to the workspace. Leaving interface changes aside, perhaps the biggest differences in the latest release concentrates on integration with Flash. At a first glance, this brings you up against Directors main problem  interactivity  particularly across the Web. Flash is ubiquitous, offers small file sizes for downloads and, since the improvements to ActionScript in version 5.0, has moved towards becoming a usable tool for application development rather than just animation  all at a fraction of the cost of Director. Flash is far from perfect, however. The MX release included tools for video, but they are still inferior to those for Director, as is support for bitmap as opposed to vector images. In addition, Macromedia appears to be considering Director as a support for back-end control of advanced features in Flash, providing features such as copies of Flash Communications Server and Flash Remoting MX that are useful for video conferencing, and live control of Flash movies via ColdFusion or Microsofts .NET server. Beyond Flash, however, your reasons for upgrade will boil down to two things: do you need to provide multimedia applications on disc for the new Macintosh operating system as well as Windows, and how important are the (considerable) improvements to Directors interface to bring it in line with other MX programs? If you are using version 8.5 and are not particularly interested in using Director with Flash, or in producing applications for Mac, the changes introduced in the last release will probably be sufficient for your requirements. That said, changes to the interface should not be dismissed if you do a great deal of work with this program (see here for a screenshot). Anyone who uses Director MX is unlikely to wish to return to an earlier release, and Macromedias general work on interface design looks set to pay real dividends for multimedia professionals. These are also precisely the sort of people who are likely to use both Director and Flash for different applications, so integration between the two (as well as the rest of the MX range) will be greatly appreciated. Director still remains the best of breed for producing interactive multimedia for distribution on disc (DVD and CD) as well as online, with a price to match. However, the very success of Flash means that anyone seeking to enter into multimedia development will consider the cheaper program first. In brief: Macromedia Director MX If you need 3D or expect a lot of video and image work on disc, choose Director  but for everything else, Flash is generally the better option. Price: $2699; $899 upgrade from 8.0/8.5 Vendor: Macromedia Phone: 1800 001 014 URL: www.macromedia.com.au [ Printer Friendly Version ] [ Other stories about Macromedia , Microsoft ]"
    },
    {
      "tag": "div",
      "text": "Sponsored Links Current Edition In the magazine On the DVD Subscribe to PC World Books / See all books Upgrade IT: The 10-step guide to a better PC The beginner's guide to a better PC is perfect for anybody who has thought about upgrading but needs some help in taking the first step. It's also great for anybody starting a computer course, or who is just curious about what goes on inside that big box in the corner. Buy it now! Datastage Production Support Business Intelligence... ACCOUNT MANAGER Solution Architect Installation and Integration... GoodGearGuide Product Review Sony  Bravia KLV46X2000 (LCD TVs)"
    },
    {
      "tag": "p",
      "text": "Review: Good looks, good audio and excellent connection options do not make up ... Read review Technology: Display Brightness: 450 cd/m2, Contrast ratio: 7000:1, Screen size: 46.0 in,  ... View specs"
    },
    {
      "tag": "div",
      "text": "Keywords City or Suburb State Select... ACT NSW NT QLD SA TAS VIC WA Job seekers Get job alerts | Post your resume online | Interview tips | Ask Kate Advertisers Click here to advertise your jobs\nto thousands of job seekers\nmonthly. 2 Free Issues of PC World with any New Subscription"
    },
    {
      "tag": "p",
      "text": "Purchase a new subscription to PC World and you will receive 14 issues for the price of 12. That’s right, two free issues when you subscribe now — for just $66* ! Offer expires on the 31st of December 2006"
    },
    {
      "tag": "div",
      "text": "Subscribe Now! Upgrade IT: The 10-step guide to a better PC See all books The beginner's guide to a better PC is perfect for anybody who has thought about upgrading but needs some help in taking the first step. It's also great for anybody starting a computer course, or who is just curious about what goes on inside that big box in the corner. Buy it now! Send Us E-mail | Privacy Policy Corrections | Editorial Contacts | Advertising Information | Disclaimer | IDG Online Contacts Copyright 2006 IDG Communications. ABN 14 001 592 650. All rights reserved. Reproduction in whole or in part in any form or medium without express written permission of IDG Communications is prohibited. IDG Sites: GoodGearGuide | Australian GamePro | Computerworld Australia | CIO Australia | CSO Online | LinuxWorld.com.au | Australian Reseller News"
    }
  ]
}