{
  "url": "http://fp.arizona.edu/mesassoc/Bulletin/Pres%20Addresses/khalidi.htm",
  "file_number": "64",
  "content_hash": "1ff27114d32215e2abd3d654be52370d47767293b79d969a1675b9537e86f36a",
  "total_blocks": 34,
  "retained_blocks": 4,
  "ignored_blocks": 30,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "p",
      "text": "Is There a Future for Middle East Studies? (1994 Presidential Address) Rashid Khalidi"
    },
    {
      "tag": "div",
      "text": "Reprinted from the Middle East Studies\r\nAssociation Bulletin , July 1995 (with changes in orthography to HTML standards). Copyright 1995 by the Middle East Studies\r\nAssociation of North America"
    },
    {
      "tag": "p",
      "text": "SOME MAY ask why I have chosen this ominous-sounding title. For most of us, the MESA\r\nconference is a time for socializing, browsing among the latest books and hearing papers\r\non recent research, generally in that order. It is certainly not a time for serious,\r\nintrospective, potentially boring questions like this one. In the beautiful environment of\r\nthis resort, it is even harder to focus on such unpleasant matters. In one of my last acts\r\nas President of MESA, however, I have decided to spoil the party, if only for a few\r\nminutes. I want to speak on this subject for two main reasons. The first is that it has become\r\nclear in recent years that area studies in general are in serious trouble. This means that\r\nstudy of the Middle East is likely to face difficulties. We who deal with the Middle East\r\nhave two extra disadvantages which exacerbate the general problem which affects area\r\nstudies in general. The first is the unpopularity of the region we work on in the general\r\nculture: Middle Easterners are the people many Americans love to hate, and they clearly\r\nfeel that they can do this with impunity. This can be seen from any number of films,\r\nsongs, cartoons or other products of popular culture which denigrate and insult Middle\r\nEasterners. Secondly, with some notable exceptions, we have done a poor job of reaching\r\nout from the comfortable confines of the universities and research institutes where most\r\nof us are located to try to spread knowledge of the Middle East among the general public.\r\nThis sort of outreach is the only way to combat the widespread stereotypes which\r\ncaricature Arabs, Iranians, Turks, Muslims, and Middle Easterners in general, and by and\r\nlarge we are not doing it. The second reason for my concern is more prosaic and perhaps more subjective, although\r\nit is linked in some ways to the first. It is based on my belief that we in Middle East\r\nStudies have frequently failed to reach beyond our own area of interest to make\r\nconnections with those studying other regions, including neighboring ones with\r\ncharacteristics and problems quite similar to those of the Middle East—unlike Central\r\nAsia, Africa, South Asia and the Mediterranean. At the same time, many of us have failed\r\nto remain in touch with developments within our professional disciplines in the social\r\nsciences and the humanities. This has meant that in some measure we have become provincial\r\nand over-specialized, virtually incapable of speaking to those who do not speak our own\r\nnarrow technical language. Obviously, to some degree this specialization is unavoidable,\r\nand in some respects it is desirable. But recently, when reading applications for a major\r\nfellowship competition, I was struck by how much narrower the submissions by applicants in\r\nthe Middle East field were by comparison with those by applicants from other fields.\r\nIndeed, to someone who was not a Middle East expert, much in these proposals was\r\nunintelligible, and as a result utterly uninteresting: it spoke to no universal concern,\r\nand shared no common language with the non-specialist reader. We are obviously convinced\r\nthat this is a fascinating field, or we would not have gone into it. And yet we seem in\r\nsome measure incapable of communicating this fascination to others not already converted\r\nto the joys of studying the Middle East. To get an idea of why area studies are in trouble, let me refer to a recent article by\r\nStanley Heginbotham, Vice President of the Social Science Research Council 1994. He argues\r\nthat the transition from the Cold War era to a new one will have a profound effect on\r\ninternational scholarship in the United States, since in the past so much of the structure\r\nand funding of this scholarship was based directly or indirectly on the requirements of\r\nthe Cold War. He adds that the implication of these changes will be a de-emphasis on\r\nspecific areas and countries, and a shift to broader themes and greater sensitivity to\r\ncontext. In particular, he notes, funders are growing dissatisfied with area studies as\r\ntraditionally defined. Area studies scholars and area studies centers will survive,\r\nHeginbotham concludes, but only by focusing less than in the past on in-depth\r\nunderstanding of the culture, history and language of a single area, and more on training\r\nthose who work within other disciplines to understand how area specifics interact with\r\ntheir own broader concerns. However one may regard this analysis, it is a cause for worry that the kinds of themes\r\nwhich we can assume will drive funding in the future -- the shift to market economies, the\r\nprocess of democratization, the growth of \"civil society,\" the resurgence of\r\nnationalism, national identities and ethnic and religious rivalries -- are all trendy\r\nones. This is not to denigrate such concerns. Indeed, some of my own current research\r\nfocuses on one of those I just mentioned. It is just that at least two problems can be\r\nforeseen if we become even more dependent on this sort of flavor-of-the-month interest on\r\nthe part of funding agencies. The first is that many whose research interests have no\r\ndirect relevance to current problems -- those who deal with language, culture, religion,\r\nnon-modern history and other such topics—will either have trouble obtaining support, or\r\nwill have to pretend that their work is something that it isn’t in order to get funding.\r\nAnd for those whose research does relate to current issues, this trend has the potential\r\nfor seriously distorting research priorities. At least during the Cold War, it was\r\npossible to reject outright the priorities of the policy-makers, and still find a\r\nreceptive hearing among foundations and other possible sources of research support. It may\r\nbe that this will be less possible in the future. What are other symptoms of the malaise of area studies? A clear one is the stagnation\r\nof federal funding for international education generally. The overall federal budget for\r\neducation has not been rising in recent years, and, indeed, that part of it which we in\r\narea studies in the universities see through Title VI and other types of funding for\r\nforeign language education and National Resource Centers has been shrinking in real terms.\r\nThere seems every indication that given the environment which prevails in Washington after\r\nthe elections, this trend will accelerate. In the private sector, while Ford Foundation\r\nsupport for area studies declined long ago, there are signs today that other foundations\r\nwhich are more recent supporters of this field, such as the Mellon and MacArthur\r\nFoundations, while still deeply interested in international studies, are moving away from\r\n“area studies, as they are traditionally defined,” to quote a recent letter from\r\nthe Vice- President of the Mellon Foundation. Given these facts about money for area studies drying up, and the particular\r\nunpopularity of the Middle East in society at large, we are certainly not doing ourselves\r\nany favors by being holier-than-thou about outreach to the general community. This\r\nattitude is not restricted to the Middle East field. A senior academic in a position of\r\nresponsibility specializing in an area adjacent to the Middle East at a prestigious\r\ninstitution which shall remain unnamed said at a recent meeting I attended that the only\r\nreason we do outreach is because it is a priority in the federal guidelines for National\r\nResource Centers. This is a short-sighted and ultimately self-defeating point of view, not only because\r\nDepartment of Education officials are perfectly capable of telling when we are faking it\r\nas far as outreach is concerned and because this is therefore harmful to our relationship\r\nwith them. More importantly, it is reminiscent of an earlier era in education, when those\r\nin academia could assume that what they did was valued by society, and that society would\r\nsupport them, if not lavishly, then at least comfortably, without their having to justify\r\ntheir existence. If any of you are still in any doubt that these days are gone for good,\r\nlook around you: except for certain types of professional training, this society does not\r\nappear to value education. Look at the products of our public schools, and what they have\r\nbeen taught when they come to us as undergraduates; look at school teachers salaries, or\r\nyour own salaries, and compare them to the salaries of newly minted MBA s or lawyers; look\r\nfinally at the financial crisis facing both public and private universities. This is a\r\nsociety which has been disinvesting in education for well over a decade; it is a society\r\nwhich does not find the value of what most of us do in the universities to be\r\nself-evident. If we want society to continue to pay for what we do, we have to be much\r\nmore convincing in arguing publicly about how valuable it is. Given this situation, how important is it for us to do outreach? I would submit that it\r\nis crucial. Students who come to us from high school—and here I am talking of students\r\narriving at both private universities and small and large public ones— have on average\r\nno usable knowledge of a foreign language, know little or no geography, and have only the\r\nspottiest understanding of history, culture, politics and economics. In this situation, we\r\nin area studies or international studies generally are at a disadvantage. Obviously,\r\noutreach by itself cannot change the priorities of a nation whose best high schools cannot\r\nproduce graduates capable of speaking a foreign language passably. I learned this recently\r\nwhen I was a member of a committee which looked at the language qualifications with which\r\nfreshmen arrive at the University of Chicago. Most of them know nothing useful as far as\r\nlanguages go. Most had one or two years of a European language, which they could not use\r\nfor any practical purpose. This is not to speak of their ability to use English!\r\nNevertheless, active and committed outreach does produce results, as is shown by follow-up\r\nwith schools where teacher outreach has been done: more students become interested in\r\nlanguages, international studies and area studies. And since we operate under the\r\nparticular disadvantages of the hostility to the Middle East in the general culture which\r\nI mentioned earlier, we must work all the harder at it: even the prospects of peace\r\nbetween the Arab states and Israel will not suffice to erase this hostility, for although\r\nthe Arab-Israeli conflict probably contributed to enhancing it, this hostility antedates\r\nthe Arab-Israeli conflict by centuries. Let me move on to my second reason for concern regarding the future of Middle East\r\nstudies, our lack of connections to the study of other regions and the related problem of\r\nour lack of involvement with the professional disciplines. There are many benefits to be\r\ngained from connections with the study of other regions. Among them is the possibility of\r\nlearning about sophisticated approaches which may be of benefit to us, such as the\r\nSubaltern school and its critics in South Asian historiography, or the mutually beneficial\r\ninteraction between historians and anthropologists in African studies, or the shared\r\nattention to the intertwining between political economy, history and culture in Latin\r\nAmerican studies. These are only examples, and more could be offered, such as the\r\ninteresting way in which questions of gender, or identity or class are being treated in\r\nwork being done in several other regions. It is my strong impression that connections with\r\nother areas would benefit Middle East studies by bringing in some fresh ideas to what\r\nremains a rather cloistered preserve and at the same time would help us to understand the\r\nuniversal nature of at least some of the problems we study, which in itself is a benefit\r\nin a field which is perhaps too enamored of its own specificity. As for connections with the disciplines, here there are several grave problems in my\r\nopinion, some of which we can little control, and some which we could certainly deal with\r\nwere we to choose to do so. What we cannot perhaps do anything about is the disturbing\r\ntendency of some of the social sciences to ignore area studies in general and Middle East\r\nstudies in particular in their new appointments and in the way they think of their fields.\r\nSome in the social sciences talk disparagingly of area studies as no more than\r\n“real\r\nestate studies,” and some actively discourage the study of languages by their\r\nstudents, while still others argue that there is a dearth of theoretically interesting\r\nwork in the Middle East field. Whatever we may think of such attitudes, our options are\r\nlimited in face of the rejection by some disciplines of the study of the Middle East,\r\nunless we can show them that work of interest to the central concerns of these disciplines\r\nis being done in the Middle East field. This brings me to my main point, those things which we do control. Dealing with them\r\nwill not be an easy matter: it involves seeing what we do as part of the larger enterprise\r\nof the humanities and the social sciences, and more specifically as part of the individual\r\ndisciplines which make them up, not as a special, arcane branch of knowledge known as\r\nMiddle East studies, or Near East studies, or Oriental studies or whatever. Certainly\r\nparticular language training is necessary to study the Middle East, and of course this\r\nregion has a specific cultural and religious and historical make-up. But at base what we\r\nare studying is just one branch of human history, or human literature or human sociology,\r\nor whatever, and not a discipline in and of itself with its own language and its own\r\nrituals. I exaggerate a bit, but sometimes that is what I think I am listening to when we\r\ntalk to one another professionally. Let me put the same point differently for greater emphasis. If we do not get out of the\r\nhabit of seeing ourselves in this way, that is to say as almost a separate discipline, we\r\nare fated to go the way of the dodo and the dinosaur. Middle East studies is not a\r\nseparate discipline: like the term \"the Middle East\" itself, \"Middle East\r\nstudies\" is a recent and artificial construct whose underpinnings are currently\r\nslowly eroding for reasons which I have alluded to, and which are beyond our control.\r\nNevertheless, our future lies in being part of the departments of comparative literature,\r\npolitical science, history, or whatever and not in remaining in a Middle Eastern ghetto.\r\nIt may be argued, with some reasons, that many of these disciplines are constructs as\r\nartificial as Middle East studies; but they have either a longer pedigree, or more\r\npowerful institutional support, and most of them can legitimately claim to be more\r\nuniversal. That, in any case is where our future lies: in trying, for example, to bring an\r\nunderstanding of a society other than American society into the discipline of sociology as\r\nit is taught in this country, or understanding Middle Eastern literatures in terms of\r\nother world literatures, or doing whatever we do within the context of the discipline to\r\nwhich we rightly belong. This is necessary if we want non-specialists to obtain the benefit of what can be\r\nlearned from studying the Middle East. But it is also necessary to save us from\r\nstagnation, provincialism and, ultimately, extinction. The answer to the rhetorical\r\nquestion of my title is therefore ambiguous. If we fail to get out of our rut, fail to\r\naddress the general public, fail to address other areas, and fail to address our own\r\ndisciplines, we are doomed to increasing marginalization, and there is no future for\r\nMiddle East studies. If we fail, our marginalization will spread beyond the current level\r\nof policy and public discourse. At that level today, we who actually know something about\r\nthe Middle East, and have been there, and know the languages, are largely ignored, while\r\nill-informed sensationalists like Steven Emerson and Robert D. Kaplan hog the headlines\r\nand grace the podiums of think-tanks and lecture halls. If we fail, our marginalization\r\nwill go beyond this, and will extend into our own cherished preserve of academia, where\r\nold and sometimes distinguished units with names like the Departments of Near East\r\nStudies, Oriental Studies, Middle East Languages and Cultures and Near East Languages and\r\nCivilizations are being eyed with increasing eagerness by budget-conscious deans wielding\r\nlarge axes and planning big cuts. I cannot, of course, promise that we will escape the deans with their axes, any more\r\nthan will our compatriots in the academy facing identical challenges. If, however, we can\r\ndo all these things, most notably learn to speak the languages of our disciplines, as well\r\nas the language of ordinary people, we will at least be able to resist and hopefully to\r\nreverse our intellectual marginalization, both within the universities and without. There are peculiar things happening in some of the disciplines, and heaven knows some\r\nof these fads and trends are far better resisted than capitulated to. But there are\r\nexciting and revolutionary things happening as well in some disciplines, things which by\r\nand large do not penetrate the corridors of our Middle East departments and centers,\r\nalthough many similar units covering other regions have not missed them. In any case, we\r\nshould be part of the internal discourse within the disciplines whereby these new ideas\r\nare resisted or accepted, instead of standing outside, in splendid isolation, turning up\r\nour noses at such ideas. In other words, it is time for people studying the Middle East to\r\npartake of some of the excitement which characterizes many of their respective\r\ndisciplines, and to realize that the future of the field is ultimately there. While nothing is sure in this world, if we do all these things, I would venture to\r\nguess that Middle East studies does have a future. In the end, of course, it is up to us,\r\nteachers, students and others interested in this field, to determine which way it will go.\r\nThe future of Middle East studies is in our hands. Let us all hope that we decide wisely\r\nwhat to do with it. References. Heginbotham, Stanley J., “Rethinking International Scholarship,” Items 48(2-3):\r\n33-40, 1994."
    }
  ]
}