{
  "url": "http://www.performance-appraisal.com/intro.htm",
  "content_hash": "612ab4dbd3119f88a245c8ea43e1f771ac2c9b18c3037f88a766a609f5e50d37",
  "total_blocks": 25,
  "retained_blocks": 3,
  "ignored_blocks": 22,
  "blocks": [
    {
      "tag": "p",
      "text": "basic purposes appraisal methods benefits of appraisal reward issues conflict & confrontation common mistakes bias effects"
    },
    {
      "tag": "div",
      "text": "Introduction Performance Appraisal T he history\r\n        of performance appraisal is quite brief. Its roots in the\r\n        early 20th century can be traced to Taylor's pioneering\r\n        Time and Motion studies. But this is not very helpful,\r\n        for the same may be said about almost everything in the\r\n        field of modern human resources management. As a distinct and formal management procedure used in the\r\n        evaluation of work performance, appraisal really dates\r\n        from the time of the Second World War - not more than 60\r\n        years ago. Yet in a broader sense, the practice of\r\n        appraisal is a very ancient art. In the scale of things\r\n        historical, it might well lay claim to being the world's\r\n        second oldest profession! There is, says Dulewicz\r\n        (1989) , \"... a basic human\r\n        tendency to make judgements about those one is working\r\n        with, as well as about oneself.\" Appraisal, it\r\n        seems, is both inevitable and universal. In the\r\n        absence of a carefully structured system of appraisal,\r\n        people will tend to judge the work performance of others, including subordinates,\r\n          naturally, informally and arbitrarily."
    },
    {
      "tag": "p",
      "text": "The human inclination to judge can create serious\r\n        motivational, ethical and legal problems in the\r\n        workplace. Without a structured appraisal system, there\r\n        is little chance of ensuring that the judgements made\r\n        will be lawful, fair, defensible and accurate. Performance appraisal systems began as simple methods of\r\n        income justification. That is, appraisal was used to\r\n        decide whether or not the salary or wage of an individual\r\n        employee was justified. The\r\n        process was firmly linked to material outcomes. If an\r\n        employee's performance was found to be less than ideal, a\r\n        cut in pay would follow. On the other hand, if their\r\n        performance was better than the supervisor expected, a\r\n        pay rise was in order. Little\r\n        consideration, if any, was given to the developmental\r\n        possibilities of appraisal. If was felt that a cut in\r\n        pay, or a rise, should provide the only required impetus\r\n        for an employee to either improve or continue to perform\r\n        well. Sometimes this basic system succeeded in getting the\r\n        results that were intended; but more often than not, it\r\n        failed. For\r\n        example, early motivational researchers were aware that\r\n        different people with roughly equal work abilities could\r\n        be paid the same amount of money and yet have quite\r\n        different levels of motivation and performance. These observations were confirmed in empirical studies.\r\n        Pay rates were important, yes; but they were not the only\r\n        element that had an impact on employee performance. It\r\n        was found that other issues, such as morale and\r\n        self-esteem, could also have a major influence. As\r\n        a result, the traditional emphasis on reward outcomes was\r\n        progressively rejected. In the 1950s in the United\r\n        States, the potential usefulness of appraisal as tool for\r\n        motivation and development was gradually recognized. The\r\n        general model of performance appraisal, as it is known\r\n        today, began from that time. Modern\r\n        Appraisal Performance appraisal may\r\n        be defined as a structured formal interaction between a\r\n        subordinate and supervisor, that usually takes the form\r\n        of a periodic interview (annual or semi-annual), in which\r\n        the work performance of the subordinate is examined and\r\n        discussed, with a view to identifying weaknesses and\r\n        strengths as well as opportunities for improvement and\r\n        skills development. In\r\n        many organizations - but not all - appraisal results are\r\n        used, either directly or indirectly, to help determine\r\n        reward outcomes. That is, the appraisal results are used\r\n        to identify the better performing employees who should\r\n        get the majority of available merit pay increases,\r\n        bonuses, and promotions. By the same token, appraisal results are used to identify\r\n        the poorer performers who may require some form of counseling, or in extreme cases, demotion, dismissal or\r\n        decreases in pay. (Organizations need to be aware of laws\r\n        in their country that might restrict their capacity to\r\n        dismiss employees or decrease pay.) Whether this is an appropriate use of performance\r\n        appraisal - the assignment and justification of rewards\r\n        and penalties - is a very uncertain and contentious\r\n        matter. Controversy,\r\n        Controversy Few issues in management\r\n        stir up more controversy than performance appraisal. There are many reputable sources - researchers,\r\n        management commentators, psychometricians - who have\r\n        expressed doubts about the validity and reliability of\r\n        the performance appraisal process. Some have even suggested that\r\n        the process is so inherently flawed that it may be\r\n        impossible to perfect it (see Derven,\r\n        1990 , for example). At the other extreme, there are many strong advocates of\r\n        performance appraisal. Some view it as potentially\r\n        \"... the most crucial aspect of organizational\r\n        life\" ( Lawrie,\r\n        1990 ). Between\r\n        these two extremes lie various schools of belief. While\r\n        all endorse the use of performance appraisal, there are many\r\n        different opinions on how and when to apply it. There are those, for instance, who believe that\r\n        performance appraisal has many important employee\r\n        development uses, but scorn any attempt to link the\r\n        process to reward outcomes - such as pay rises and\r\n        promotions. This group believes that the linkage to reward outcomes\r\n        reduces or eliminates the developmental value of\r\n        appraisals. Rather than an opportunity for constructive\r\n        review and encouragement, the reward-linked process is\r\n        perceived as judgmental, punitive and harrowing. For example, how many people would gladly admit their\r\n        work problems if, at the same time, they knew that their\r\n        next pay rise or a much-wanted promotion was riding on an\r\n        appraisal result? Very likely, in that situation, many\r\n        people would deny or downplay their weaknesses. Nor is the desire to distort or deny the truth confined\r\n        to the person being appraised. Many appraisers feel\r\n        uncomfortable with the combined role of judge and\r\n        executioner. Such\r\n        reluctance is not difficult to understand. Appraisers\r\n        often know their appraisees well, and are typically in a\r\n        direct subordinate-supervisor relationship. They work\r\n        together on a daily basis and may, at times, mix\r\n        socially. Suggesting that a subordinate needs to brush up\r\n        on certain work skills is one thing; giving an appraisal\r\n        result that has the direct effect of negating a promotion\r\n        is another. The\r\n        result can be resentment and serious morale damage,\r\n        leading to workplace disruption, soured relationships and\r\n        productivity declines. On\r\n        the other hand, there is a strong rival argument which\r\n        claims that performance appraisal must unequivocally be\r\n        linked to reward outcomes. The\r\n        advocates of this approach say that organizations must\r\n        have a process by which rewards - which are not an\r\n        unlimited resource - may be openly and fairly distributed\r\n        to those most deserving on the basis of merit, effort and\r\n        results. There\r\n        is a critical need for remunerative justice in\r\n        organizations. Performance appraisal - whatever its\r\n        practical flaws - is the only process available to help\r\n        achieve fair, decent and consistent reward outcomes. It\r\n        has also been claimed that appraisees themselves are\r\n        inclined to believe that appraisal results should be\r\n        linked directly to reward outcomes - and are suspicious\r\n        and disappointed when told this is not the case. Rather\r\n        than feeling relieved, appraisees may suspect that they\r\n        are not being told the whole truth, or that the appraisal\r\n        process is a sham and waste of time. The Link\r\n        to Rewards Recent research ( Bannister & Balkin,\r\n        1990) has reported that\r\n        appraisees seem to have greater acceptance of the\r\n        appraisal process, and feel more satisfied with it, when\r\n        the process is directly linked to rewards. Such findings\r\n        are a serious challenge to those who feel that appraisal\r\n        results and reward outcomes must be strictly isolated\r\n        from each other. There\r\n        is also a group who argues that the evaluation of\r\n        employees for reward purposes, and frank communication\r\n        with them about their performance, are part of the basic\r\n        responsibilities of management. The practice of not\r\n        discussing reward issues while appraising performance is,\r\n        say critics, based on inconsistent and muddled ideas of\r\n        motivation. In\r\n        many organizations, this inconsistency is aggravated by\r\n        the practice of having separate wage and salary reviews,\r\n        in which merit rises and bonuses are decided arbitrarily,\r\n        and often secretly, by supervisors and managers. Back | Home | Email | Fax | Postal | Top | See License\r\n        Information to become a user of the Archer North Performance Appraisal System"
    }
  ]
}