{
  "url": "http://www.performance-vision.com/articles/art-reengineering-learning.htm",
  "file_number": "641",
  "content_hash": "77a700c71e2b53d36c12d3f7f0e5c184702e8f14f3c26890dea9985b905249aa",
  "total_blocks": 68,
  "retained_blocks": 1,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "p",
      "text": "People Articles Events Marginalia Genealogy Home Reengineering \r\n        Corporate Learning Stanley E. Malcolm, Ph.D . (Published in slightly different form as \"Reengineering Corporate \r\n        Training\" in Training , August 1992, pp. 57-61) Think back for a moment to the day you started your current job, or any \r\n        other job for that matter. Despite any formal training you may have received \r\n        prior to starting, did you feel fully competent? Fifty percent competent? Or put it another way. Of the skills you now recognize as critical to \r\n        success in your job, what percent of them did you learn in a formal, traditional \r\n        (read classroom) setting? I'll bet the percentage is pretty small. In \r\n        fact, numerous sources peg the average at something less than 20 percent. \r\n        Data on spending for education by US businesses suggest a similar proportion, \r\n        17 percent traditional; the rest occurring on the job, somehow. Okay, so 80 percent or more of critical job skill learning occurs on \r\n        the job. What do we know about most OJT programs? Well, for starters, \r\n        \"programs\" is often an overstatement. Typical OJT is unstructured or understructured, \r\n        inconsistent, and slow. How often have you heard accepted time-to-competency \r\n        figures of 18 months or longer? In the life insurance business, the industry \r\n        average is 75 percent turnover of the sales force in the first 36 months. \r\n        Now that's a very expensive revolving door. What are the numbers for critical \r\n        jobs in your business? Don't think in terms of annual turnover - look \r\n        at the period of time it takes to at least break even on your investment \r\n        in recruiting and development to competent performance. Now shift gears for a moment. Let's talk about the process of reengineering \r\n        work, as described by Mike Hammer. The essence of the case is that for \r\n        years and years we've been putting bandaids on old work processes - more \r\n        and more management layers, functional units, and automated traditional \r\n        processes - in the search for percentage point improvements in productivity. \r\n        Reengineering says let's take a clean slate approach; designing the work \r\n        and systems together to seek order of magnitude improvements in productivity, \r\n        not incremental change. Think about that for a goal. Ten times greater \r\n        productivity, not a few percentage points. And there are enough examples \r\n        in the literature today to say that it can work. It may not be easy - \r\n        minds dulled to the possibility of meaningful change, and an entrenched, \r\n        threatened bureaucracy will work against you - but reengineering works. What if we were to set out to reengineer corporate learning? What does \r\n        productivity mean for us? It seems to me we have two objectives: to minimize \r\n        the time it takes for staff to become competent, and to strive for higher \r\n        levels of competent performance than we have in the past. Finally we're getting to the point, and it's as simple as this. How can \r\n        we possibly hope for order of magnitude improvements in competency if \r\n        we barely influence the 80 or more percent of learning that always has \r\n        occurred, and probably always will occur, on the job? As step one, I'd propose that we begin designing what I'll call the \"100 \r\n        percent learning event\". I'd define that as one that includes some traditional \r\n        elements and a whole lot of support for application of skills on the job. \r\n        A good rule of thumb is to say that the learning \"event\" isn't over until \r\n        the skill has been successfully applied to real work. This has some very interesting implications for evaluation. For one thing, \r\n        it means you don't have to measure learning at all, you can measure task \r\n        performance. For another, you don't have to measure task performance; \r\n        that's the manager's job. . . but we'll come back to that. Step two, once you've bought into the notion of the 100 percent event, \r\n        is to recognize that there are alternatives to the old paradigm of filling \r\n        people up with skills and knowledge and then putting them to work. A series \r\n        of more or less synonymous terms, like \"problem-centered learning\", or \r\n        \"action learning\", or \"issue-centered learning\", all describe a 180 degree \r\n        shift from the old paradigm. Now we can talk about putting people to work \r\n        immediately, or at least much sooner, and supporting their learning as \r\n        they perform their jobs. A number of medical schools have taken this approach, \r\n        and I've heard of it in some MBA programs. Take the medical school example. The old paradigm for physician training \r\n        was a year or two of anatomy and physiology courses before students ever \r\n        saw a patient. The problem-centered approach has them seeing patients \r\n        - in teams, with a physician coach - in their first semester. They learn \r\n        the anatomy and physiology, but they do so in the course of solving real \r\n        world, diagnostic problems. The results so far have been physicians who \r\n        are recognizably better diagnosticians - who have a little more trouble \r\n        passing their board exams. But I ask you, which kind of physician would \r\n        you rather have treating you, the one who got higher marks on exams or \r\n        the one who gets it right when it counts? Now things start to get really interesting. If you apply the notion of \r\n        problem-centered learning in corporate setting, you begin to define \"events\" \r\n        which have real work outcomes, and learning as a secondary - but desired \r\n        and likely - outcome. Now staff are coming to the classroom, or the \"classroom\" \r\n        is coming to them, with an expectation that before they're done they will \r\n        have completed some real work task. Believe me, that expectation alone \r\n        does a lot to banish the notions of learning as a vacation, or of students \r\n        assuming they'll be \"taught\" while they sit passively by. Also, if you start with the assumption that at the end of your 100 percent \r\n        learning event, each person will walk away with a real work product, evaluation \r\n        of skill application becomes a far more manageable task. In the old paradigm \r\n        of fill 'em up and send them away to their jobs to apply their skills, \r\n        evaluation is a constant frustration. We tend to do one of several things. \r\n        We sometimes measure \"learning\" at the end of our traditional event. Sometimes \r\n        we don't even do that, for reasons that will become apparent. Either way, \r\n        we still have the problem of either trying to infer students' ability \r\n        to apply skills from a measure of what they learn, or of going back at \r\n        some point in the future - three to six months being typical - and asking \r\n        about application on the job. Neither is very satisfying. Why? It comes back to the 80/20 split. If \r\n        you're only influencing 20 percent or less of competency development, \r\n        there's a lot that can go wrong outside of your control. If students fail \r\n        to apply knowledge or skills, you have to feel that you've failed. And \r\n        even if they do succeed in application, down deep can you really take \r\n        the credit? What craftsman could take satisfaction in doing only 20 percent \r\n        of the job? On the other hand, application is intrinsic to problem-centered designs. \r\n        You'll know, and better still management will know, that students have \r\n        successfully applied new skills and knowledge by the end of the event. \r\n        How? Simply by examining the work products. And that explains my earlier \r\n        point. It's no longer necessary to measure learning when you've got a \r\n        direct measure of applied performance. And who better to do the measurement \r\n        than managers, who have the most direct stake in the results and the clearest \r\n        view of performance. Besides, I'd argue that even the best measures of \r\n        training ROI, if measured by trainers, are viewed by management as suspect \r\n        for their potential to be self-serving. They're analogous to the \"scientific \r\n        results\" advertisers use to sell us this product or that. Instead, give \r\n        managers the means to measure performance gains, and let them spread the \r\n        news of your joint success. Another characteristic of problem-centered learning is that it offers \r\n        the opportunity to bring together the various competencies and sub-disciplines \r\n        that make up any of today's complex jobs. Take the job of Casualty Claim \r\n        Representative for example. The job centers on the technical skills required \r\n        to investigate claims. But performing it well requires integrating computer \r\n        skills - using Aetna's claim systems; interpersonal skills to deal professionally \r\n        with claimants, agents, lawyers, and others; and resource management skills \r\n        - because average case loads for Claim Representatives run into the hundreds. \r\n        Teaching systems in isolation from the investigative tasks they support, \r\n        or teaching the skills to investigate one claim when the need is to learn \r\n        how to manage many simultaneously, leave new staff ill-prepared to face \r\n        the realities of daily job expectations. Problem-centered designs are \r\n        a natural means to accomplish the competency integration critical to success \r\n        on the job. At Aetna, our interactive video \"whole-job simulations\" do \r\n        just that. I can't elaborate here, but the way they work is that a small \r\n        group of new Claim Reps gather to work through the case in computer simulation, \r\n        supported by a claim trainer or supervisor. At every decision point options \r\n        are discussed and \"war stories\" are shared. The result is an incredibly \r\n        rich experience sharing in a very short period of time. (For more details, \r\n        see \"Whole Job Simulation\" in CBT Directions, July, 1991, pp 27-30.) There's another term I considered listing as a semi-synonym of problem-centered \r\n        learning, and that's performance support systems. More specifically \"Electronic \r\n        Performance Support Systems\" as articulated so well by Gloria Gery in \r\n        her book of the same name. Electronic or not, the idea is to put people \r\n        to work and provide whatever supports they need to perform competently \r\n        - whether or not they are competent in the traditional sense of the term. \r\n        Typical supports are task structuring, and access to information, advice, \r\n        and learning. The learning is usually in the form of \"granules\", not modules \r\n        or courses, and is focused on application - case studies and practice \r\n        exercises. Take Aetna's AMP Facilitator as an example. \"AMP\" stands for the Aetna \r\n        Management Process, the way we analyze problems and make decisions. It's \r\n        become our common language to such an extent that we now use AMP as a \r\n        verb: we AMP projects, for example. The 7-step process is superficially \r\n        simple: define your mission and critical success factors, scan the internal \r\n        and external environments, identify performance gaps, set objectives and \r\n        action steps, implement and monitor. But the analysis required is complex, \r\n        as becomes apparent when you start to look at the many sub-steps. Figure \r\n        1. The AMP Facilitator (20k) - A performance \r\n        support tool for decision-making designed to accomodate small-group as \r\n        well as individual use. Note the group process advice in the \"Guide\" \r\n        pop-up. Copyright Aetna, Inc., 1992. All rights \r\n        reserved. Used with permission ) The AMP Facilitator is software which provides performance support to \r\n        managers or teams who need to apply AMP to a business plan or project. \r\n        You need to know very little about the AMP process before using the software. \r\n        You bring a problem, the AMP Facilitator helps you structure the analytical \r\n        tasks, coaches you, provides examples and self-checks, and allows you \r\n        to print out your results in standard plan format. So when you're done \r\n        you've got a real work product - your plan - and have learned an awful \r\n        lot about AMP along the way. I said earlier that learning was a desirable, \r\n        and likely objective, but secondary to performance. Here you can see that \r\n        in action. I defy users of the AMP Facilitator not to learn about AMP \r\n        while using it to solve their business problems. But whether they do or \r\n        not doesn't really matter. All that matters is that the work output is \r\n        to a high standard. (For more on the AMP Facilitator, see \"Performance \r\n        Goes On-Line\" in Human Resource Executive, May, 1994, pp 24-27.) Performance support doesn't have to be electronic. Much can be accomplished \r\n        by putting some structure behind the traditional notion of on the job \r\n        learning. We can provide guides to help managers develop their staff, \r\n        and evaluate their progress. I'm not thinking here about lesson plans. \r\n        More like advice on how to determine performance gaps, with recommendations \r\n        for the kind of activities that can close them, and job-specific guidelines \r\n        for how to coach and critique staff to competent performance. And let's not forget the value of the traditional educational technologies \r\n        - computer based tutorials and simulations, direct broadcast satellite \r\n        and video tape, and combinations of these with text-based materials designed \r\n        for small groups working with local office or unit facilitators. All offer \r\n        consistent means to close the most common or critical performance gaps \r\n        - at the moment of need, anywhere. All shrink training delivery cycle-times \r\n        dramatically. In terms of CBT, my experience at Aetna suggests that emphasis be placed \r\n        on simulations, which have most of the advantages of problem-centered \r\n        designs without the risks of errors with real customers or dollars. Consider \r\n        computer-based simulations as performance support to managers in their \r\n        role as coaches. Used in small group settings, as we do with our interactive \r\n        video job simulations, every decision point becomes an opportunity to \r\n        share peer and supervisor experiences. What might be a one hour case study \r\n        when used individually, becomes a rich four hours of discussion and shared \r\n        \"war stories\" in a small group implementation. As for Direct Broadcast Satellite, the trick there is to make it truly \r\n        interactive and problem-based with a mass audience. From the technology \r\n        side we attack that by adding response keypads for every participant. \r\n        And in our best designs, like Managed Care College, no \"teaching\" at all \r\n        is done on the air - the focus is on teams learning together locally and \r\n        competing with other teams across the country via DBS. The \"problem\" they're \r\n        all solving is how to sell - more specifically, how to respond to realistic \r\n        customer requirements and objections which they themselves have generated. \r\n        The result has been sales reps telling management that they wouldn't have \r\n        sold such-and-such a case if they hadn't had this realistic experience. \r\n        And every Managed Care sale is a big deal in our business. If designing problem-centered, 100 percent learning events and performance \r\n        support are all it takes, why isn't everyone doing it? Remember what I \r\n        said about reengineering? It works, but it isn't easy. There are a whole bunch of potential barriers to success; some of them \r\n        uncomfortably close to home. If your staff define themselves as trainers \r\n        first, and designers second, you're likely to run into trouble. Frequently \r\n        in corporate training units, the career path is from instruction deliverer \r\n        to instruction developer. Is it any wonder that we tend to design traditional \r\n        events - trainer rather than learner driven? Perhaps it's time to turn the career path around to match the problem-centered \r\n        approach to learning. In other words, consider hiring (or rotating) trainers \r\n        from business units. Let their first assignments be in problem-centered \r\n        event development, supported by professional instructional designers, \r\n        and making full use of their recent business experience. Then only secondarily, \r\n        and only sometimes, should they ever set foot inside a classroom. After \r\n        all, if you're designing 100 percent events, you've got to place much \r\n        more emphasis on design and development relative to the 20 percent or \r\n        less of traditional delivery that remains to be done. Since learning technologies will play an important role in delivering \r\n        the 80 plus percent of on the job learning, special attention must be \r\n        placed on assuring that the infrastructure is there to support them. Consistent \r\n        hardware and software, well maintained, and available at or very near \r\n        the work site are essential. Our vocabulary is another potential barrier. The words we use - course, \r\n        event, program; trainer, instructor, teacher - all suggest traditional \r\n        definitions of how and where training (not learning) takes place. What \r\n        does registration mean if our learning product is an electronic performance \r\n        support system intended to be used as needed anytime? And how do we cost \r\n        our services if we blur the notion of a training event? How do we resist \r\n        the pressure - internally or externally applied - to \"count beans\": student \r\n        numbers or student days? Often too, we behave illogically in the matter of training cycle times. \r\n        We measure the time from an initial request through delivery of the first \r\n        post-pilot version of the event. Never mind that it may take an additional \r\n        one to three years to march everyone through. How can we continue to do \r\n        this. I mean, if the performance gap is so urgent, shouldn't we be targeting \r\n        closure in months, not years? With or without technology for delivery, \r\n        we can and should set cycle-time goals on the order of six months or less \r\n        - from the first day of the project until all have been trained and the \r\n        performance gap is closed. Getting managers to accept their role as coaches and evaluators is no \r\n        easy task either. You're going to need allies in high places - senior \r\n        management and human resources professionals. Rewards systems have to \r\n        demonstrate the value you place on the manager as coach. All your investment \r\n        in designing the 80% that occurs on the job is wasted otherwise. And speaking of allies, don't expect to create large scale electronic \r\n        performance support systems on your own - you'd find yourself in competition \r\n        with traditional system development professionals, a very uncomfortable \r\n        and unnecessary place to be. To be successful, design of electronic performance \r\n        support systems needs to be a collaboration of systems professionals, \r\n        interface designers, documentation specialists, business experts, and \r\n        learning technologists. The design team needs to be as integrated as the \r\n        system you're trying to create. Yes, there are a lot of potential barriers, but none are insurmountable. \r\n        Is it all worth it? You bet it is. When it works, it's a beautiful thing. \r\n        If you're still not convinced, try these words from Aetna's Chairman, \r\n        Ron Compton, delivered in his keynote address to the first Electronic \r\n        Performance Support System Conference several years ago: \"We've been looking at learning as an outcome, when learning is only \r\n        a byproduct. Performance is what we want. And by providing the supports \r\n        employees need to learn their jobs while they do their jobs, we'll get \r\n        competent performance faster and more consistently. \"As business managers facing a tough and unknowable future, we can't \r\n        afford the luxury of learning, when it's not accompanied by performing. \r\n        We have to radically change our organizations and our processes so that \r\n        automation finally gives us the gains in productivity that up to now have \r\n        been unkept promises. To achieve that, we as managers must show leadership \r\n        of the most radical kind, willing to develop and use the tools that make \r\n        us better workers, better listeners and better thinkers. And we must be \r\n        willing to provide the support, both human and electronic, that our workers \r\n        need to perform successfully.\" About the Author: Stan Malcolm serves as a coach to companies \r\n        wishing to develop or review their strategies for performance support, \r\n        learning technologies, and/or corporate learning issues generally. Formerly, \r\n        he headed learning technologies and performance support initiatives at \r\n        Aetna, Inc. He can be reached at Stan@Performance-Vision.com or 860-295-9711. People Articles Events Marginalia Genealogy Home"
    }
  ]
}