{
  "url": "http://www.preschoolrainbow.org/prek-fall.htm",
  "file_number": "653",
  "content_hash": "c62fab6ecd482cd44f5c8132200331652a87dedbd6fe928500d6202b3d86ad3c",
  "total_blocks": 91,
  "retained_blocks": 12,
  "ignored_blocks": 79,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\" More P r e s c h o o l Fall Theme Activities for Teachers \n      of Young Children Early childhood education ideas\nand lesson plans that enhance preschool education. Seasonal curriculum activities for fall,\nincluding songs for Fire Safety, Apples, and colorful\nleaves. This arrow will take you back to the first page of the Fall Activity Theme and \n      the schoolhouse will take you to Activity Central. Print\nthis Theme More! \n      Preschool Fall Activities"
    },
    {
      "tag": "p",
      "text": "Squirrel Counting Add fun to your early childhood \n        counting curriculum with this preschool activity by Jana M. Materials: Small dixie cups \n        , squirrel pattern and nuts. Description: Teachers take \n        a squirrel pattern and staple it to dixie cups. Write a number on each \n        squirrel.  Now, have the child count out how many nuts they need \n        for that squirrel.  Have a different number on each squirrel. You \n        can also have the child take nuts away from the squirrel, to see how many \n        he has left. Comments: Some  three's \n        I find are not quite ready for this. I find that by the end of the year \n        they're doing it much better. Take a look at\nthe expanded list of Fall\nPicture Books Year \n        'Round \"Seasonal Tree\" Share the ideas of the changing season with\nchildren just as Terry H. does. Materials: Large paper cut out of a tree\nwith bare limbs. Summer - - green leaves Fall - - colored leaves Winter - - Misc. items to be hung on tree\n(snowmen, mittens, hearts, Easter eggs) Spring - - green leaves Construction paper and tape. Description: We place a large brown tree\nwith bare limbs  on a vacant wall.  We begin the school year\nwith green leaves on this tree. Teachers can put children's name on individual\nleaves. The children enjoy seeing their names placed around the room. I\ngenerally put flowers at the base of the tree and a sunshine could be put\nup over the tree. FALL : \nGradually start changing the green leaves to fall colored leaves. Once they have all changed, have them begin\nto \"fall to the ground\" until the tree is bare.  We make pumpkins\nto put under the tree to replace the flowers and at halloween time add\nfaces to these pumpkins. WINTER: Explaining the seasons to the children, we tell them about summer and fall.  Since our tree is\nnow without leaves, during the winter we will add our own \"special\" things to\nthe tree. We make:"
    },
    {
      "tag": "blockquote",
      "text": "Snowmen in December Mittens in January Hearts in February Easter Eggs in March."
    },
    {
      "tag": "p",
      "text": "Then the leaves begin to reappear for the spring. New for this year, we're adding apple blossoms\n(made from tissue paper) to the tree in September and then change those\nblossoms to apples. Showing it as a fall apple tree  (before we do\nthe color change on the leaves). Comments: This was a new idea for last year.\nWe are going to use it this year to really discuss the changing seasons\nand also incorporate our apple lessons. Fire \n        Safety Song Try this Fire Safety Song  from Valerie\nW . during Fire Safety Month. Materials: Song on chart (song is below),\ndog puppet, white styrofoam cup, googly eyes, construction paper (red, white,\nblack) to make ears, (white construction paper), red tongue, red hat, and\nblack spots. Description: 1.  Using a dog puppet, sing this song\nto the tune of Popeye the Sailor Man ."
    },
    {
      "tag": "blockquote",
      "text": "Fire \n        Safety I'm Fire Safety Sam. (ruff,\nruff) I'm Fire Safety Sam. (ruff,\nruff)"
    },
    {
      "tag": "p",
      "text": "Please test smoke detectors 'Cause they're home protectors. I'm Fire Safety Sam. (ruff,\nruff) Substitute lines\n3 and 4 with the following words for new verses. It's important to say.. With matches, don't play. If there's smoke you should know, You'd better crawl low. Have a fire escape plan. Every family can. If there's a fire, get out. Use your escape route. Go to a neighbor's when alone, Then call 9-1-1 on the phone. Clothes on fire?  Here's your\ngoal: First stop, then drop, and roll! 2. Art activity Make a dalmatian Fire \n      Safety Sam Using white styrofoam cup inverted,\nadding eyes, ears, a red tongue, glued on spots and a red hat.  They stand\non their own and are adorable. There is an entire Fire \n        Safety Theme in the Rainbow Resource \n        Room. The Apple Tree A traditional fingerplay for Fall"
    },
    {
      "tag": "blockquote",
      "text": "Away up high in an apple tree. Point\nup. Two red apples smiled at me Form\ncircles with fingers. I shook that tree as hard as I could Pretend\nto shake a tree. Down came those apples. And mmmmmmm, were they good! Rub\ntummy."
    },
    {
      "tag": "p",
      "text": "An entire Apple \n      Theme is in the Rainbow \n      Resource Room! Fall Wreath This early childhood education activity\nby Lynn A . begins outdoors with a nature walk and then continues indoors. Materials: Pine cones, fall leaves in many\ncolors, nuts, acorns, etc. and cardboard or oak tag, and glue. Description: After going on a nature hike\nfor the above materials, cut a wreath shape out of cardboard.  Ask\nchildren to decorate their wreath with their own findings.  You may\nwant to have them put ribbon on it too. Comments: This wreath looks so nice when\ndone that it can be kept all year round. Take a look at\nthe expanded list of Fall\nPicture Books Color Song:  Leaves on the Trees During this Autumn activity \n        preschool children stand in a circle, sing this song and perform actions \n        to the tune of \"The Wheels on The Bus\"."
    },
    {
      "tag": "blockquote",
      "text": "The leaves on the \n        trees come tumbling down, Tumbling down, tumbling down. ( Children\nflutter their hands and fingers down to the floor each time the phrase\n'tumbling down' is repeated )"
    },
    {
      "tag": "p",
      "text": "The leaves on the trees come tumbling \n          down, All over town. ( Children\nflutter hands down, then turn around ) The leaves on the trees are red \n          red red, Red red red, red red red, ( Everyone\nwearing red clothes goes to the middle of the circle and shakes themselves ) The leaves on the trees are red \n          red red, All over town. The leaves on the trees \n          are green green green, Green green green, green \n          green green. ( Everyone\nwearing green goes to the middle of the circle and shakes ) The leaves on the trees are green \n          green green, All over town. Repeat for orange \n          and yellow leaves Lots of Color \n      Activities are in the Rainbow \n      Resource Room . Leaf Classification \n        Bar Graph This preschool education lesson \n        plan begins outdoors, takes advantage of Autumn's colors and encourages \n        young children's classification and sorting skills as they work with concrete \n        materials and compare amounts. You will need: Enough large paper bags for \n        half the children in your group, tape, glue/glue stick, craft paper and \n        a felt tip marker In advance explain to preschool children\nthat they will collect fallen leaves.  Remind children not to put\nleaves off plants, bushes or trees.  Only collect the leaves that\nhave fallen on the ground.  Encourage young children to use the \"buddy\nsystem\" when collecting (two preschoolers share each collection paper bag). \nAs the children collect leaves teachers use descriptive words, \"I see you've\nfound 3 orange leaves\" etc. Back inside the preschool classroom, during\nsmall group time, sort the leaves according to color, size or kind. \nTogether with young children count how many of each color, size or kind. \nAre there more brown leaves than green leaves? Creating a vertical bar graph will\nhelp children compare the leaves according to a classification category\nsuch as color etc. On craft paper teachers list the leaf colors. \nNext ask children to tape or glue leaves in the appropriate color column. \nDisplay on children's eye level and refer to the bar graph often during\nthe fall season. Do you have a Preschool \n          Fall Activity or idea that you'd like to share... E-mail \n          Gayle For more curriculum ideas \n          and preschool activities go to Or Search the Preschool \n          Rainbow Begin PicoSearch Text Link End PicoSearch Text Link"
    },
    {
      "tag": "div",
      "text": "Navigation"
    },
    {
      "tag": "p",
      "text": "Main \n        Fall Theme Alphabet \n        Theme Animal \n        Activities Back \n        to School Theme Black \n        History Theme Book \n        Themes Brain \n        Growth Counting \n        and Number \n        Theme Dinosaur \n        Theme Easter \n        Theme Fall \n        Theme Spring \n        Theme Summer \n        Theme Winter \n        Theme The Five \n        Senses Holiday \n        Craft Activities Home \n        Activities Large \n        Group and Circle \n        Activities Me, \n        My Family and \n        Friends Multicultural \n        Theme Outdoor \n        Play Resource \n        Room Rhyme, \n        Songs and Fingerplays Small \n        Group Activities Preschool \n        Links Toddler \n        Theme About Gayle Site Map Search the Preschool Rainbow Begin PicoSearch Text Link End PicoSearch Text Link <br"
    }
  ]
}