{
  "url": "http://www.reslife.net/html/faq-students.html",
  "file_number": "673",
  "content_hash": "91b363823f132e29127dc2d2d17954de55145a37f96c749a7310703c860b0d57",
  "total_blocks": 58,
  "retained_blocks": 7,
  "ignored_blocks": 51,
  "blocks": [
    {
      "tag": "div",
      "text": "#BeginTemplate \"/Templates/students.dwt\" DW6 Begin Banner Code End Banner Code #BeginEditable \"Heading\" #EndEditable"
    },
    {
      "tag": "p",
      "text": "BEGIN SEARCH FORM"
    },
    {
      "tag": "div",
      "text": "Search Reslife.net"
    },
    {
      "tag": "p",
      "text": "END SEARCH FORM #BeginEditable \"Games\" #EndEditable Begin Banner Code End Banner Code"
    },
    {
      "tag": "div",
      "text": "#BeginEditable \"Body\""
    },
    {
      "tag": "p",
      "text": "Frequently \n        Asked Questions Is it \n        better to live on or off campus during the freshman year? On campus \n        living has a number of benefits for new college students that off campus \n        living does not. Living on campus gives new freshmen the opportunity to \n        meet and live with many other college students. Obviously, such an arrangement \n        would provide you with ample opportunities to meet and make new friends \n        quickly. On campus living is also very convenient. Since you’re living \n        on campus, you’re close to classroom buildings and all of the other \n        facilities that house valuable university services and resources. It’s \n        easier to get involved on campus and attend university functions because \n        you’re \"close to all of the action\" on campus. Finally, \n        students living on campus have both student and professional staff members \n        who reside in the residence halls with them. These staff members provide \n        resources, assistance and support to students residing on campus. National \n        statistics show that students who live on campus tend to be more actively \n        involved on campus and achieve higher grades than those who opt to live \n        off campus. After a year or two on campus, you may choose to take a look \n        at off campus living, as you will have established a fairly strong social \n        network and solid study habits. Can Ihave guests visit me if Ilive on campus? Yes! You’re \n        certainly welcome to have friends, classmates, and family members visit \n        you in your residence hall on campus. The extent of this visitation varies \n        greatly from university to university. Some universities visitation policies \n        are more liberal while others are more conservative. You may attend a \n        university that allows guests in the residence halls 24 hours a day, 7 \n        days a week. Other universities may have limited visitation during the \n        week such as 8:00 a.m – midnight during the week and 7:00 a.m. – \n        2:00 a.m. on weekends or 7:00 a.m.- 2:00 a.m. during the week and 24 hour \n        visitation during the weekends. Some universities may have more strict \n        visitation policies. Visitation policies on campus may also vary from \n        residence hall to residence hall. Be sure to find out what type of visitation \n        policy exists on the college campus you will be attending. If you choose \n        to live on campus, you will want to be comfortable with the visitation \n        policies that are in place. What \n        is \"work-study?\" The Federal \n        Work-Study program is an important source of financial aid that provides \n        on-campus employment to students each year. Work-study awards are usually \n        for the fall and spring semesters. Astudent must submit a new financial \n        aid application for the summer semester. Students who are awarded work-study \n        should contact their financial aid office to learn how they need to go \n        about acquiring an on-campus job. Most campuses have a student employment \n        office that posts all of the openings for work-study and wage positions. How do \n        parents get a copy of their son/daughter’s grades? While policies \n        regarding student’s grades vary slightly from university to university, \n        most universities will tell parents that they must obtain these grades \n        from their students. Many universities send student grades to their permanent \n        address at the conclusion of each academic semester. Some universities \n        make final grades available to students on the Internet as well. Why do \n        textbooks cost so much? There are \n        many factors that affect the prices of a textbook. These factors include \n        author royalties, publisher costs, marketing, publisher and author taxes, \n        and bookstore expenses. Most universities try to offer textbooks to students \n        through their university bookstore at a lower markup. Be sure to check \n        with the university regarding its \"buy back\" policies. Some \n        universities will buy back textbooks from students at the close of the \n        semester for a portion of the original price. Is it \n        better to get a job on or off campus? While this \n        is certainly a personal choice for each student, there are a number of \n        benefits to locating employment on campus. On campus employers tend to \n        be more flexible with the student’s work schedule as they realize \n        that the student employee is a \"student\" first and an \"employee\" \n        second. On campus employment does not require any form of transportation. \n        Students can easily walk to and from work if they reside on or close to \n        campus. Finally, working on campus gives students the opportunity to meet \n        faculty, staff and students on campus. It’s a great way to network \n        and build connections on campus. Be sure to stop by your university’s \n        student employment office while you’re on campus for orientation. \n        You may be able to find a job before the fall semester begins. Are most \n        college campuses safe? You will \n        find that most colleges and universities have many resources in place \n        to make their campuses reasonably safe places for the students. Most universities \n        have university police officers or security officers on patrol 24 hours \n        a day. The number of officers on campus and the extent of their duties \n        varies greatly dependent upon the size and location of the particular \n        university. Most universities will also offer a great deal of preventative \n        safety measures including things like educational workshops, escort services \n        abd emergency phones on campus. Residence halls will offer students additional \n        security measures. Many residence hall policies and procedures are designed \n        with the student’s safety and security in mind. Do Ineed to have my own computer? Many students \n        choose to bring a computer with them when they go to college. This is \n        certainly ideal as it gives them the convenience of having a computer \n        at their disposal whenever they need it. Whether checking e-mail, doing \n        research on the Internet or writing a paper, a computer of your own can \n        come in handy. While convenient, students can be just as successful if \n        they do not have a computer of their own. It just may take a little extra \n        effort on the part of the student. Most universities offer a number of \n        computer labs on campus that are available for students to use. Some of \n        these labs are open 24 hours a day, seven days a week. So even if you \n        don’t have your own computer, you can visit a computer lab on campus \n        and complete your work there. Use of the computer labs is normally a cost \n        covered in your general tuition fees. If Ipurchase a computer for college should Ibuy a laptop or a desktop? This is \n        merely a matter of preference for each student. Some students like the \n        laptop computers as it gives them a great deal of mobility. They can bring \n        it with them to classes, to a study lounge in their residence hall or \n        take it home with them on the weekends. While this convenience has its \n        advantages it also can present the potential problem of loss or theft. \n        While a desktop does not offer this same level of mobility, it is usually \n        less expensive and is less likely to be lost or stolen. Some universities \n        have a preference regarding what type of computer you should purchase. \n        There are many universities that require the purchase of a computer before \n        you arrive on campus or include the cost of a computer in your initial \n        fees as a new student. Be sure to check with the university you are attending \n        to get details."
    },
    {
      "tag": "div",
      "text": "#EndEditable #BeginEditable \"CommentsLink\" Comments \n        on this article? Click \n        here . #EndEditable #EndTemplate"
    }
  ]
}