{
  "url": "http://www.rlapc.com/",
  "file_number": "680",
  "content_hash": "572f59fe2903336ba2bf5706f1571b682de30d269eb6b61a84f4a830f19073b7",
  "total_blocks": 153,
  "retained_blocks": 15,
  "ignored_blocks": 138,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" rlapc.com"
    },
    {
      "tag": "h1",
      "text": "Immigration firms in Virginia offering J-1 applications, State\r\n              30, national interest waivers, permanent residency, and Canadian\r\n              doctors and physicians."
    },
    {
      "tag": "div",
      "text": "physician immigration j-1 waiver applications state 30 canadian doctor\r\nnational interest permanent residency firms in virginia Immigration attorneys offering representation to obtain\r\n          H-1B work visas, labor certifications and J-1\r\n          waiver applications for foreign medical graduates and physicians. Physicians who receive\r\n          clinical medical residency training in the U.S. pursuant to a J-1 exchange\r\n          visitor visa are required to return to their home country for two years\r\n          before they are eligible to apply for an H-1B visa or permanent\r\n          residency . J-1 visa physicians need not complete this two-year home\r\n          requirement if they are approved for a waiver to deliver medical services\r\n          in a designated underserved area or at a VA hospital. In addition, the\r\n          United States Congress, under the leadership of Senator Conrad, has\r\n          mandated that all states (as well as the District of Columbia and certain\r\n          territories, such as Puerto Rico and Guam) may act as interested state\r\n          agencies ( State 30 Program), recommending up to thirty (30) national\r\n          interest waivers for J-1 physicians per state each fiscal year.\r\n          These waiver recommendations are available in addition to any VA, ARC\r\n          or DHHS waivers that may be issued for locations within that state.\r\n          Most J-1 Visa Waivers typically require a three year service obligation.\r\n          However, certain states, such as West Virginia, require a four-year\r\n          contractfrom a immigration\r\n          firm in Virginia . All waiver programs require a showing that the\r\n          employer has made efforts to recruit a U.S. physician and a Canadian\r\n          doctor prior to offering a position to a J-1 physician. work visas business immigration appalachian regional commission\r\nconrad waiver law firms in washington dc area naturalization robert lubin"
    },
    {
      "tag": "h1",
      "text": "Robert Lubin offers work visas, Appalachian regional commission,\r\n              Conrad waivers, naturalization of business immigration, and law\r\n              firms in Washington DC area."
    },
    {
      "tag": "div",
      "text": "Robert\r\n          Lubin & Associates, P.C. (formerly known as The Law Offices of Robert\r\n          Lubin, P.C.) was founded in 1988 and the firm focuses exclusively on work visas , Conrad\r\n          waivers , and immigration\r\n          law firm issues (with some business\r\n          immigration law services provided to immigration clients only). Naturalization is the process by which permanent residents can obtain U.S. citizenship\r\n          status. In some cases, dual citizenship may be retained. Since naturalized\r\n          citizens share practically all of the same rights as citizens born in\r\n          the United States, this is an important step to take to complete the\r\n          immigration process. Obtaining a J-1 waiver is a three-step process.\r\n          The first step is to obtain a recommendation for a waiver from an interested\r\n          government agency (IGA), like HHS or Appalachian\r\n          Regional Commission . This recommendation is then forwarded to the\r\n          United States Department of State Waiver Review Division in Washington,\r\n          D.C. (formerly known as the USIA), which in turn issues its recommendation\r\n          to the U.S. Citizenship and Immigration Services (USCIS), which provides\r\n          approval of an Application to Waive Foreign Residence Requirements (Form\r\n          I-612)."
    },
    {
      "tag": "h1",
      "text": "Immigration information for H-1b visas, foreign medical graduates,\r\n              Conrad 30, hardship waivers, nonimmigrant doctors, and adjustment\r\n              of status."
    },
    {
      "tag": "div",
      "text": "The H-1B is a nonimmigrant\r\n          visa classification used by an applicant who will be employed temporarily\r\n          in a specialty occupation. Requirements include a job offer in a qualifying\r\n          occupation, a bachelor's degree or equivalent at a minimum, and an offered\r\n          salary that meets prevailing wage requirements. The H-1B\r\n          visa is a popular tool for temporary employment of foreign\r\n          medical graduates . Hardship\r\n          waiver if the U.S. citizen or permanent resident spouse and/or child\r\n          accompanies the J-1 visa holder back to the home country for two years.\r\n          Therefore, a hardship waiver application must establish that the U.S.\r\n          citizen or permanent resident spouse and/or child will suffer exceptionally\r\n          as a result of returning to the J-1 visa holder's home country and remaining\r\n          in the U.S. without the J-1 visa holder for two years. The ARC program\r\n          is limited to doctors who\r\n          have completed residency training in a primary care field, which is\r\n          generally defined as internal medicine, family practice, general practice,\r\n          pediatrics, general psychiatry or obstetrics and gynecology, and the\r\n          physician must agree to practice such primary care. We also offer information\r\n          on Conrad 30 and adjustments\r\n          of status ."
    },
    {
      "tag": "h1",
      "text": "Immigration attorneys offering J-1 waivers, O-1 visas, and labor\r\n              certifications for international medical graduates, and foreign\r\n              doctors."
    },
    {
      "tag": "div",
      "text": "doctor immigration h-1b visa foreign medical graduate conrad 30 hardship waiver\r\nnonimmigrant adjustment of status Our immigration\r\n          attorneys offer O-1\r\n          visas are temporary nonimmigrant visas, available for highly talented\r\n          or acclaimed individuals in the sciences, education, business or athletics.\r\n          To qualify for an O-1 visa, the applicant must have extraordinary ability\r\n          \"demonstrated by sustained national or international acclaim.\" Extraordinary\r\n          ability means a \"level of expertise indicating that the person is one\r\n          of that small percentage who has risen to the very top of the field\r\n          of endeavor.\" The O-1 category is especially helpful to medical researchers\r\n          such as foreign doctors ,\r\n          athletes, and business people who may lack the qualifications or salary\r\n          required for the J-1 waiver program. In addition, to date, there have been no numerical limitations\r\n          reached on the J-1 program, thereby allowing any number of international\r\n          medical graduate applicants to qualify each fiscal year. In order\r\n          to apply for Labor\r\n          Certification (LC), an applicant must obtain an employer to sponsor\r\n          him/her through a job offer. The LC process consists of three phases\r\n          leading to permanent residency. The first phase involves obtaining a\r\n          Labor Certification from the Department of Labor (DOL). The second phase\r\n          involves obtaining an immigrant\r\n          visa petition approval from the U.S. Citizenship and Immigration\r\n          Services (USCIS) based on the DOL Labor Certification. The third phase\r\n          involves the applicant's application to either adjust status from non-immigrant\r\n          to permanent resident here in the U.S., or obtain an immigrant visa\r\n          at an American Consulate in the home country. j-1 waiver foreign doctor immigration attorneys international medical graduate\r\nlabor certification o-1 visa -SCRIPT INSZOOM- -END SCRIPT INSZOOM- USCIS Expands Premium Processing Service as of November 13, 2006 USCIS expands premium processing service as of september 25, 2006 RLAPC and INSZOOM-Working together to improve customer service Case Status on Labor Certification Applications at the U.S. Department of Labor Backlog Elimination Centers is now Available PERM J-1 Waiver Legislation Signed by President Bush on December 3, 2004 New Law signed by President Bush on December 8, 2004 Significantly Changes Aspects of the H-1B Program RLAPC is pleased to present its Spring 2004 Physician Immigration (and job opportunities)Seminar Information about the Proposed H-2C Program U.S. Citizenship and Immigration Services (USCIS) Reaches H-1B Cap Backlog for immigration\r\n        benefits has grown approximately 60% in last 3 years - <a href=\"news9.asp\" class=\"links\" id=\"white\">Suspension of the 30-day and annual interview requirements\r\nfrom the special registration process for certain nonimmigrants<br></a><br>\r\n\t  <a href=\"news7.asp\" class=\"links\" id=\"white\">PERM<br></a><br>\r\n\t  \t <a href=\"news8.asp\" class=\"links\" id=\"white\">U.S. Citzenship and Immigration Services (USCIS) begins posting processing times on USCIS Web Site<br></a><br>\r\n\r\n\t  <a href=\"news6.asp\" class=\"links\" id=\"white\">USCIS Electronic Filing (E-Filing)\r\n        Initiative<br>\r\n        </a><br><a href=\"news1.asp\" class=\"links\" id=\"white\">Removal of Visa and Passport\r\n        Waiver for certain landed immigrants of Canada<br>\r\n        </a><br>\r\n        <a href=\"news2.asp\" class=\"links\" id=\"white\">Special Registration<br>\r\n        </a><br>- elcome and thank you for\r\n      your interest in our firm. Robert Lubin & Associates, P.C. has been providing quality legal representation to employers and\r\n      foreign nationals in the field of immigration law since 1988. Our extensive expertise\r\n      in immigration law allows our clients to quickly and successfully navigate\r\n      the often times confusing and ever changing legal landscape, while avoiding\r\n      common pitfalls along the way. Let us put our experience to work for you. RLAPC’s goal is to provide first-rate representation to obtain successful\r\n      results within the shortest possible time frame. We offer our clients the\r\n      benefit of our wide-ranging legal experience at reasonable rates with unsurpassed\r\n      focus on personal attention. Moreover, we have a very liberal phone and\r\n      email policy, relieving you from the worry of having to set up an appointment\r\n      to talk to us each time you have a question or concern. We want to hear\r\n      from you whenever you have any issues or concerns. After all, communication\r\n      leads to results. We are glad you are visiting our Web site. Iassure you that I, as well\r\n      as my staff of thirty employees, will represent you to the best of our abilities.\r\n      We shall give you honest assessments of the likelihood of success at each\r\n      stage of the case, to avoid surprises for you. We look forward to working\r\n      with you to meet your immigration goals! Immigration services that RLAPC provides include,\r\n      but are not limited to:"
    },
    {
      "tag": "p",
      "text": "J-1, Exchange Visitor Waivers:"
    },
    {
      "tag": "div",
      "text": "J-1 Waivers for\r\n          Physicians to Deliver Medical Services in Designated Underserved Areas\r\n          or at VA Hospitals J-1 Waivers for\r\n          Physicians to Engage in Research of National or International Significance J-1 Waivers for Physicians\r\n          Due to Exceptional Hardship"
    },
    {
      "tag": "p",
      "text": "Nonimmigrant Visa Categories:"
    },
    {
      "tag": "div",
      "text": "H-1B, Specialty Occupations E, Treaty Traders and Investors L-1, Intracompany Transferees O-1, Extraordinary Ability <li class=\"text\"> <a href=\"#\" class=\"links\">TN, Trade NAFTA</a> </li>\r\n        <li class=\"text\"> <a href=\"#\" class=\"links\">B-1, Visitors for Business</a>\r\n          </li>\r\n        <li class=\"text\"> <a href=\"#\" class=\"links\">B-2, Visitors for Pleasure</a>\r\n          </li>"
    },
    {
      "tag": "p",
      "text": "Immigrant Visa Categories:"
    },
    {
      "tag": "div",
      "text": "Labor Certification Extraordinary\r\n          Ability National Interest Waivers for Advanced Degree Professionals <li class=\"text\"> <a href=\"#\" class=\"links\">Advanced Degree Professionals</a>\r\n          </li> Outstanding\r\n          Researchers or Professors Multi-National\r\n          Executives and Managers National\r\n          Interest Waivers for Physicians to Deliver Medical Services in Designated\r\n          Undeserved Areas or at VA Hospitals <li class=\"text\"> <a href=\"immigrant_investors.asp\" class=\"links\">Immigrant\r\n          Investors</a> </li> We are glad you have chosen RLAPC to assist you and\r\n        we look forward to working with you. The information and materials available through this Web site are subject\r\n        to certain terms and conditions. <img src=\"images/1x1.gif\" width=\"204\" height=\"1\"><br> User Name: Password Forgot your Used Id / Password? Atomz Search HTML for Robert Lubin &amp; Associates Robert Lubin & Associates, P.C. 505 Huntmar Park Drive, Suite 315, Herndon, VA 20170 Phone: (703) 883-0870 Fax: (703) 883-0861 rlapc@rlapc.com Terms and conditions <br><br>\r\n        <a href=\"resources.asp\" class=\"links\" id=\"gray\">Resources</a></td> Copyright \r\n      © 2003 Robert Lubin & Associates, P.C. All rights reserved."
    }
  ]
}