{
  "url": "http://www.rugbycoach.com/club/skills/cognitive.htm",
  "file_number": "684",
  "content_hash": "7ab0c18189c6b59d6f64f8596d11d54d00f40282d4c01d3aff5a1e9ba53a5fb5",
  "total_blocks": 84,
  "retained_blocks": 3,
  "ignored_blocks": 81,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation msnavigation"
    },
    {
      "tag": "p",
      "text": "Cognitive\r\n        Effort & Motor Learning Based on an article from Timothy D. Lee, Stephan P. Swinnen, and Deborah\r\n    J. Serrien . You can view or download the complete article\r\n    from the Free Download Page . Ihave\r\n    left references to other reseach articles and graphs out of this\r\n    page. Introduction Model\r\n    Skill Level and Observational Learning The\r\n    Guiding Influence of Augmented Feedback Error\r\n      Estimation and Temporal Delay Summary\r\n      Feedback Relative\r\n      Frequency A\r\n      Guidance Role for Augmented Feedback Contextual\r\n    Interference Cognitive\r\n    Effort A Caveat\r\n    for Instructors Introduction Recent\r\n    research on the role of practice variables during the acquisition\r\n    of motor skills is reviewed. These practice variables include\r\n    (a) the effects of a model's skill level during observation,\r\n    (b) how augmented feedback is provided two a learner and (c)\r\n    how practice conditions are arranged when learning multiple tasks.\r\n    The results of research in these areas suggest that cognitive\r\n    processes play an important role during the early stages of skill\r\n    acquisition. Moreover, the effort by which these cognitive processes\r\n    are undertaken is influenced by practice variables. Motor learning\r\n    is enhanced when these variables are manipulated to promote cognitive\r\n    effort by a learner. Despite their best intentions,\r\n    people sometimes tend to be lazy thinkers during practice. For\r\n    instance, hitting a bucket of golf balls at the driving range\r\n    can be monotonous. At times, the swing seems to go into \"autopilot\"\r\n    - the mind takes a short test, and individuals tend to repeat\r\n    previously determined goals without giving the swing pattern\r\n    much planning. On some days, much of the practice seems to be\r\n    conducted on autopilot. What are the consequences of this type\r\n    of practice? Early theoretical views\r\n    of motor learning suggested that the motor commands and the sensory\r\n    feedback that resulted from the movement were all that needed\r\n    to be stored in memory for learning to occur. By this view, thinking\r\n    was not too important for purposes or motor learning. More recent\r\n    views stress the role of cognition in motor skills. In general,\r\n    cognition refers to a collective group of thought processes.\r\n    The hockey goalie tries to predict the direction of a shot by\r\n    searching for perceptual clues that provide advance information.\r\n    The golfer without a clear shot to the green tries to remember\r\n    how to hit a controlled fade. The figure skater about to perform\r\n    a triple axle jump followed immediately by a triple toe loop\r\n    must prepare for this combined action with the flexibility in\r\n    mind to change the plan if something goes wrong. All of these\r\n    are examples of decision- making processes regarding the anticipation,\r\n    planning, regulation and interpretation of motor performance. Accepting that cognition\r\n    plays an important function in performing motor skills, the question\r\n    of the role of cognition during practice takes on more importance.\r\n    Motor learning involves more than storing sensory and motor information\r\n    that arises as a consequence of movement. Skill is highly cognitive,\r\n    and the cognitive processes that subserve movement must be practiced\r\n    as well. Our goal in this paper is to highlight some selected\r\n    issues of major learning research that illustrate the importance\r\n    of cognitive processes during practice. In this paper we present\r\n    the differences that arise as a consequence of different practice\r\n    conditions in terms of cognitive effort . In general, cognitive\r\n    effort refers to the mental work involved in making decisions.\r\n    In some cases, practice conditions result in more intense use\r\n    of processing resources. In other cases research suggests that\r\n    different types of decision-making processes are affected by\r\n    practice conditions. Using cognitive effort as a focal point,\r\n    one can view practice as an opportunity to either promote or\r\n    impede the decision-making processes that underscore movement. In this paper, we develop\r\n    the concept of cognitive effort from research on three distinct\r\n    areas or motor learning research. First, we review some recent\r\n    findings from research on modeling that watching an unskilled\r\n    model learn a motor skill can benefit the observer by providing\r\n    a vicarious opportunity to join the problem-solving process.\r\n    This section is followed by a review of some findings that augmented\r\n    feedback can sometimes be presented in such a way as to be detrimental\r\n    to learning. The final area of research suggests that, while\r\n    drill-type practice conditions can facilitate improvements during\r\n    practice, such conditions also result in poor retention and transfer.\r\n    Collectively, these three areas of research suggest that learning\r\n    is promoted when the practice conditions promote cognitive effort Model Skill Level and Observational\r\n    Learning Demonstrating a motor skill to class of students is one of\r\n    the fundamental tools in teaching. Despite a strong research\r\n    base that supports the use of models, there are many instance\r\n    in which the characteristics of the model determine its potential\r\n    usefulness. For instance, few would challenge the assumption\r\n    that experts in a motor skill make good models for the purposes\r\n    of demonstration. But are experts always the best models to use? Early theoretical support\r\n    for the use of expert models was offered by Sheffield. According\r\n    to his view, symbolic behavior could be coded and modeled by\r\n    means of a perceptual blueprint, a precise representation\r\n    of the perceptual demands or the task, The purpose of the blueprint\r\n    was to serve both as a representation of what to do and as a\r\n    referent for making corrections. Observation provided a means\r\n    by which the perceptual blueprint could be acquired, and Sheffield's\r\n    theory provided a rationale for the use of experts as optimal\r\n    models. The use of expert models\r\n    also has considerable pedagogical support, as one may discover\r\n    from a visit to the sports instruction section of a video store These tapes (on sports\r\n    such as, golf tennis, skiing, bowling, etc.) often feature a\r\n    repetitive view of top-level athletes demonstrating a particular\r\n    motor skill- But, are these types of video useful? There are\r\n    both theoretical and empirical reasons to be skeptical. In 1984, the United States\r\n    National Academy of Sciences was asked by Army Research Institute\r\n    to form a committee to investigate the value of various instructional\r\n    techniques. One of the techniques investigated was a series of\r\n    tapes known as SyberVision. The use of expert models from which\r\n    to learn sport skills such as tennis, golf, or bowling was justified\r\n    by their \"neuromuscular programming\" theory. According\r\n    to the documentation provided by SyberVision, \"the more\r\n    you see and hear pure movement, the deeper it becomes imprinted\r\n    in your nervous system … and the more likely you are to\r\n    perform it as a conditioned reflex\". However, the committee\r\n    found no specific evidence that supported these claims. These conclusions, should\r\n    not be all that surprising. The use of experts as models appears\r\n    to encourage more the process of imitation than true learning\r\n    through observation. When watching these videos, the observer\r\n    is encouraged to mimic what the model has demonstrated. Bandura,\r\n    a pioneer in the field of social modeling, discredits imitation\r\n    as a method that minimizes the power of modeling. In his words,\r\n    \"modeling imparts conceptions and rules for generating variant\r\n    forms of behavior to suit different purposes and circumstances.\r\n    In skill acquisition, modeling is more accurately represented\r\n    as rule learning than as response mimicry\". The repetitious nature\r\n    of the skills demonstrated by experts in these videos also appears\r\n    to imply that repeated exposure to a desirable performance will\r\n    \"stamp in\" a representation of consistent, errorless\r\n    performance. This assumption, however, appears to ignore the\r\n    fact that errorless practice and role repetition are poor learning\r\n    strategies. Although research suggests\r\n    that observational learning does occur using expert models, the\r\n    findings suggest that a novice who is learning a motor skill\r\n    can also be an effective model. Although most of this research\r\n    is recent, it was anticipated many years ago by Twitmyer. He\r\n    compared two groups of objects who learned to trace a pencil\r\n    maze while blindfolded. Subjects in one group (the learning models),\r\n    practiced the task on two different days. During his time, subjects\r\n    in is second group (the observers) watched and recorded (he results\r\n    of the learning models. These observers then performed the task\r\n    on a third day. Since the learning models performed without previous\r\n    observation of a model, their results were used as control data.\r\n    The performance of the observers was better than the models'\r\n    performance on the very first trial, and remained better throughout\r\n    the learning session. Although Twitmyer may\r\n    have done the first study using unskilled models in an observation\r\n    experiment, a study by Adams  has sparked the recent search\r\n    efforts. Similar to the Twitmyer method, a model practiced in\r\n    the presence of an observer, after which the observer practiced\r\n    the task. In Adams' study, the model practiced a movement timing\r\n    task for 50 trials and observed under one of two conditions.\r\n    The two groups of observers differed in terms the augmented feedback\r\n    provided while observing: one group received the movement time\r\n    augmented feedback that was delivered to the model whereas the\r\n    other group did not receive this additional information (this\r\n    feedback was crucial for the model to learn the task). Adams\r\n    found that the observers performed better than the models, with\r\n    the best performance achieved by the observers who also received\r\n    the models' augmented feedback. But how effective is\r\n    a learning model when directly compared to an expert model? Afew studies have made this comparison, but the results are mixed. Experiments by Weir and\r\n    Leavitt and by Pollock and Lee found no differences due to the\r\n    performance level of the model. For example, in the Pollock and\r\n    Lee study, subjects watched a model perform 15 trials on a computer\r\n    game that required pursuit tracking. The benefit due to previous\r\n    observation was evident on the first post-observational trial,\r\n    and this benefit remained throughout practise. There was no difference\r\n    due to the model's skill level. However, a study by McCullagh\r\n    and Caird did find that performance after watching a learning\r\n    model was better than after watching an expert model. McCullagh\r\n    and Cairds's task was similar to the task used by Adams. Subjects\r\n    conducted a series of six acquisition blocks. Each block included\r\n    watching five performances of a model, followed by five performance\r\n    trials. The different observation groups watched either an expert\r\n    model or a learning model. While watching the learning model,\r\n    groups of observers either received the model's augmented feedback\r\n    after each attempt or did not receive the feedback (similar to\r\n    Adam's method). The findings of the observers'\r\n    performance trials during acquisition, an immediate retention\r\n    test, a retention test 1 day later, and a delayed transfer test\r\n    (to a novel timing goal) are clear. Observation of the learning\r\n    model while also receiving the model's augmented feedback resulted\r\n    in the best observational learning. While studies comparing\r\n    the value of expert versus learning models in acquiring sport\r\n    skills has begun, we can conjecture that at a minimum, observing\r\n    a learning model will be no less effective than observing an\r\n    expert model. In some circumstances, it may even be more effective.\r\n    The skill level of the model has an impact on the observer's\r\n    cognitive effort to learn from the motor behavior that was demonstrated.\r\n    An expert model provides a precise representation of how a skilled\r\n    action should be performed. However, a learning model more actively\r\n    engages the observer in the problem solving processes that characterize\r\n    learning. The observer can clearly observe the movement behavior\r\n    of the model and the success of the model's subsequent attempts\r\n    to reduce performance error. Indeed, observers have reported\r\n    to us that it was difficult to suppress making comments to a\r\n    live, learning model when the model failed to make an obvious\r\n    correction of a movement behavior. On implication of this finding\r\n    is that observing the possible errors that can be made on a task\r\n    and the success of various attempts to solve these errors provides\r\n    a conceptual insight into the cognitive basis of the task to\r\n    be learned. Such a process seems well suited to the skill observation\r\n    process. The Guiding Influence\r\n    of Augmented Feedback Augmented feedback\r\n    refers to information that a learner does not normally receive\r\n    directly from the senses. For example, a tennis player will know\r\n    that the serve was not good because the ball hit the net. However,\r\n    the exact reason for this result my not be obvious. Augmented\r\n    feedback refers to making explicit something that might be difficult,\r\n    if not impossible, to know implicitly. Usually this information\r\n    is augmented by a teacher or coach using verbal statements or\r\n    by means of visual aids. In this way, the information is \"fed\r\n    back\" to the learner. For years, researchers\r\n    and educators seemed content with the following general view\r\n    on the role of augmented feedback in motor learning: The use\r\n    of augmented feedback is most effective whenever it is provided\r\n    as soon after performance as possible, as often as possible,\r\n    and in such a way as to reduce performance errors as efficiently\r\n    as possible. That view was challenged at few years ago by Richard\r\n    Schmidt and his colleagues. Schmidt made some rather\r\n    startling conclusions after reexamining some previously published\r\n    experiments and conducting new studies. The first conclusion\r\n    was that the general view on augmented feedback given above was\r\n    based largely on data gathered during practice. Schmidt argued\r\n    that this was weak methodology since changes during practice\r\n    reflected temporary influences on performance and not always\r\n    true learning effects. Abetter assessment of learning was provided\r\n    by retention and transfer tests after temporary effects no longer\r\n    exerted an influence on performance. The second conclusion was\r\n    that if the augmented feedback literature was re-evaluated using\r\n    retention and transfer data, the evidence pointed to a view that\r\n    was quite different from the prevailing view. We begin by considering\r\n    some of the augmented feedback variables and their effects on\r\n    learning, then describe Schmidt's ideas about the guiding role\r\n    of augmented feedback on motor learning. Error Estimation and Temporal Delay One view for\r\n    optimizing the benefits of augmented feedback was to present\r\n    the feedback as soon after movement as possible. Findings indicated\r\n    a different interpretation. In these studies, augmented feedback\r\n    was provided either instantaneously with the completion of a\r\n    movement or after an 8-second delay. Subjects that received this\r\n    short delay during practice either sat silently during the interval\r\n    or attempted to estimate the magnitude of the augmented feedback\r\n    that they were about to receive. Learning was assessed when subjects\r\n    again performed the task 10 minutes and 2 days after the practice\r\n    period. All groups performed without augmented feedback during\r\n    these retention tests. There was little difference\r\n    between the groups during the practice (acquisition) period.\r\n    However, a pattern of results began to emerge after 10 minutes\r\n    that was further clarified on the 2-day retention test. This\r\n    pattern of results indicated (a) relatively good retention following\r\n    practice in which estimation of the augmented feedback was made\r\n    during the delay period and (b) relatively poor results for the\r\n    group that was given instantaneous augmented feedback. The delayed\r\n    group performed at an intermediate level. These findings not\r\n    only argued against the prevailing view of providing feedback\r\n    as soon as possible after a movement but suggested that, in fact,\r\n    such a procedure could be detrimental to learning. Moreover,\r\n    the results suggested that estimating the magnitude of the error\r\n    prior to receiving the augmented feedback had an additional benefit\r\n    to learning beyond that of simply delaying the feedback. Summary Feedback Summary feedback\r\n    is related to the temporal delay of feedback discussed above.\r\n    In this method, feedback is delayed until after a series of trials\r\n    have been completed; feedback is then provided in a manner that\r\n    summarizes the receding trialsAn experiment by Schmidt, Young,\r\n    Shapiro and Swinnen illustrates the effects of summary feedback Subjects in this study\r\n    were divided into four groups according to the number of trials\r\n    that were summarized on a graph and presented to the subject\r\n    as augmented feedback. In the \"Sum 1\" group, feedback\r\n    was provided after every trial. In the \"Sum 5\", \"Sum\r\n    10\" and \"Sum 15\" groups, feedback was provided\r\n    on a graph about the 5, 10 or 15 preceding trials, illustrating\r\n    how performance either changed or remained consistent over trials.\r\n    Immediate and delayed teas of retention followed the practice\r\n    period. Two sets of findings\r\n    are important. First acquisition performance was negatively related\r\n    to size of the summary; the larger the summary the poorer the\r\n    acquisition performance. Second, delayed retention performance\r\n    was achieved by the \"Sum 15\" and \"Sum 10\"\r\n    groups, and the worst performance by the \"Sum 5\" and\r\n    \"Sum 1\" groups. These findings are particularly interesting\r\n    because or the opposite effects that the summary conditions had\r\n    on the practice performance and on learning and because of the\r\n    direct findings to teaching sport skills. Relative Frequency The frequency\r\n    of providing augmented feedback was another of the prevailing\r\n    views that was challenged by Schmidt. The belief was that the\r\n    absolute frequency of augmented feedback (i.e. the number of\r\n    times that feedback was provided) was a critical variable in\r\n    learning, but that relative frequency (the ratio of feedback-provided\r\n    trials to the total number of trials) was not an important variable\r\n    for learning. However, much of the evidence to support this view\r\n    was based on data from the practice period rather than from retention\r\n    tests. In their review of this literature, Salmoni et all. (1984)\r\n    found a few studies that included retention tests following relative\r\n    frequency manipulations. Surprisingly, these studies showed that\r\n    relative frequency might indeed be an important variable in learning\r\n    - that low relative frequencies might he better than high relative frequencies of augmented feedback. Subsequent studies\r\n    have since confirmed these effects. An interesting corollary\r\n    to the relative frequency effects has also emerged. Using a movement\r\n    timing task, Sherwood provided subjects with augmented feedback\r\n    only when their errors exceeded certain tolerance limits about\r\n    the goal. For one group of subjects, augmented feedback was provided\r\n    on every trial (a \"0% bandwidth\"). For other subjects,\r\n    augmented feedback was provided only when performance error was\r\n    greater than +/- 5%, or greater than +/- 10% of the goal. By\r\n    this manipulation, Sherwood also influenced the frequency schedule\r\n    by which augmented feedback was provided (since feedback was\r\n    not provided for trials on which performance was within the bandwidth\r\n    limits). Early in practice, when\r\n    many errors occurred, the relative frequency of augmented feedback\r\n    was fairly high. However, as performance improvements were made\r\n    over practice, the relative frequency became less frequent. Performance\r\n    on a retention test was best for the group that had received\r\n    the 10% bandwidth and poorest for the 0% bandwidth group, with\r\n    the 5% group performing at an intermediate level. At a minimum,\r\n    these findings are consistent with the effects of reduced relative\r\n    frequency, although it seems that the bandwidth manipulation\r\n    has an additional learning effect. The other similarity is that\r\n    \"fading\" the relative frequency of feedback over practice\r\n    (giving frequent feedback early in practice and infrequently\r\n    later) is both an effective strategy and one that occurs as a\r\n    natural consequence of the bandwidth procedure. A Guidance Role for Augmented Feedback Collectively,\r\n    these findings have been interpreted by Schmidt as evidence in\r\n    support of a guidance role (or augmented feedback. Although augmented\r\n    feedback can be useful under the right circumstances, providing\r\n    augmented feedback can be detrimental to learning under other\r\n    conditions. In general, these conditions occur (a) when augmented\r\n    feedback is necessary for learning to occur and (b) when augmented\r\n    feedback is presented such that it guides the learner toward\r\n    certain corrective actions. In these cases, the learner becomes\r\n    too reliant upon the augmented feedback to correct movement errors.\r\n    For example, the provision of instantaneous feedback during practice\r\n    tends to detract the learner from interpreting intrinsic sources\r\n    of feedback, such as vision and proprioception. Schmidt suggests\r\n    that it is these sources of feedback that one must learn to interpret\r\n    since they will always be available to the learner. Augmented\r\n    feedback (such as the feedback received from a teacher) will\r\n    not always be available (e.g., during a game). Indeed, the goal\r\n    in most learning situations is for the learner to become independent\r\n    of the teacher. Learning to rely upon the information provided\r\n    by these people will ultimately be detrimental to achieving independence. From a different perspective,\r\n    the Swinnen showed that encouraging subjects to estimate their\r\n    augmented feedback produced a benefit to learning beyond that\r\n    achieved by simply delaying the instantaneous provision of the\r\n    feedback. This suggests that the cognitive effort in attempting\r\n    to learn to interpret one’s own intrinsic feedback, in combination\r\n    with augmented feedback, can be a potent influence on learning.\r\n    Augmented feedback might be most beneficial to learning when\r\n    it serves to augment the cognitive efforts in learning self-evaluation\r\n    skills using the sources of information that will be available\r\n    during competition. Contextual Interference Another intriguing\r\n    research issue investigated in recent years is the contextual\r\n    interference effect. This finding was first studied by Shea and\r\n    Morgan and has been replicated many times since. In the Shea\r\n    and Morgan study, two groups of subjects each learned these simple\r\n    laboratory tasks. All aspects of the practice were identical\r\n    with the exception of the order in which the tasks were practiced.\r\n    Under the blocked order, all practice trials on one of the tasks\r\n    were completed before another task was undertaken. This procedure\r\n    is similar to practice \"drills\" because of the repetitive\r\n    nature of the practice. In contrast, the other\r\n    group practiced the tasks in a random order, such that they were\r\n    switching from one task to another throughout practice. The random\r\n    order resulted in considerably more interference between tasks\r\n    compared to a blocked order. Thus, it was not too surprising\r\n    that random practice resulted in much poorer acquisition performance\r\n    than blocked practice. What was rather surprising\r\n    were the results of these two groups on retention tests conducted\r\n    minutes and days later. On both retention tests the random group\r\n    performed better than the blocked group. These results resemble\r\n    the findings of the summary experiment earlier, in which the\r\n    same conditions that led to poor acquisition performance also\r\n    led to very good retention. However, in the case of random and\r\n    blocked practice orders, it was not the manipulation of augmented\r\n    feedback but the interference arising from the order by which\r\n    the tasks were practiced that produced the results. Hence, the\r\n    cause for the contextual interference findings has been discussed\r\n    in terms of different theoretical constraints than described\r\n    for the augmented feedback findings. One account for the contextual\r\n    interference effect is that random practice encourages a learner\r\n    to compare and contrast the methods and strategies used for performing\r\n    the different tasks. Switching between tasks during practice\r\n    provides the learner with better contrastive knowledge than the\r\n    drill, repetitive-type practice that occurs under a blocked order.\r\n    This contrast between tasks makes learning each task more distinctive\r\n    and memorable, resulting in the advantages seen later in retention. Another explanation for\r\n    the contextual interference effect can best be described using\r\n    an analogy. If you are asked to mentally multiply two numbers\r\n    (e.g. 34 x 26=?), it would take some work, but could be done\r\n    with effort. If the same question were asked a short time later,\r\n    the answer could be given right away if the solution from the\r\n    previous menial effort was still in working memory. If however, that answer\r\n    had been forgotten, then the question would have to be solved\r\n    again. Lee and Magill used a similar idea to explain the contextual\r\n    interteretice effect. Random practice requires a learner to approach\r\n    a task by developing a strategy or plan of action. However, such\r\n    a plan is inappropriate to maintain in memory since the task\r\n    on the next trial is different. Thus, a new plan of action needs\r\n    to be developed. By the time the previous task is performed again,\r\n    the plan that had been developed for it last time has been lost\r\n    from memory, and a new plan of action must be developed. This\r\n    process continues throughout random practice. In contrast, the\r\n    same plan of action can be used again and again during blocked\r\n    practice since the same task is practiced repeatedly. The consequence\r\n    is that having learned to develop a plan of action when necessary\r\n    (under random practice) makes the learning both more memorable\r\n    and better suited for novel performance simulations. Both theoretical orientations\r\n    to the contextual interference effect have received quite a bit\r\n    of empirical attention. It is also interesting to note that there\r\n    have been a number of experiments undertaken to examine the contextual\r\n    interference effect in acquiring sport skills, and the findings\r\n    appear to replicate the findings from laboratory experiments\r\n    quite well. Practice and retention /transfer findings showing\r\n    the \"typical\" blocked/random differences have been\r\n    found for learning badminton serves and in rifle shooting. Most of the laboratory\r\n    experiments and field tests of contextual interference effects\r\n    have been conducted using subjects who were unskilled at the\r\n    tasks to be learned. However, in a recent study. Hall, Domingues,\r\n    and Cavazos found interesting contextual interference effects\r\n    for athletes who had already achieved a high level of performance.\r\n    In this study, college-level baseball players received two sessions\r\n    of extra batting practice per week for 6 weeks. One group of\r\n    subjects received 15 curve balls, 15 fast balls and 15 change-ups\r\n    in a blocked order during each session. Another group of subjects\r\n    received the same number and types of pitches in a random order.\r\n    Acontrol group of subjects received no extra batting practice.\r\n    Scores (in terms of the number of solid hits) were recorded on\r\n    a random pretest, on two practice sessions (Sessions 5 and 8),\r\n    and on both a randomly ordered and a blocked ordered transfer\r\n    test. Several points of interest\r\n    from the Hall study are notable. First, the extra batting practice\r\n    improved performance as noted by the better performance on the\r\n    transfer tests by both the random and blocked groups, compared\r\n    to the control group. Second, performance during the practice\r\n    sessions was generally better by the blocked group than for the\r\n    random group. Third, transfer performance was better for the\r\n    random practice group than for the blocked practice group, regardless\r\n    of the order in which the transfer trials were conducted. The\r\n    most exciting aspect of these results however, was that this\r\n    \"typical\" contextual interference effect was found\r\n    for subjects who had previously achieved a high level of performance\r\n    on the criterion task. Cognitive Effort The three areas\r\n    of research discussed above provide rather diverse examples of\r\n    cognitive effort in motor skill learning. In each area of research\r\n    we have provided examples that illustrate how conditions of practice\r\n    either promoted or diminished the decision-making activities\r\n    of the subject learning a motor skill. Some instructors feel\r\n    that watching the expert execute the same sport skill time and\r\n    again, with flawless precision, should engender some type of\r\n    passive diffusion of that knowledge into the observer. The advantages\r\n    seen by observing a learning model suggest an advantage gained\r\n    through a rather different process. In this case, the observer\r\n    is watching the model attempt a performance. If the observer\r\n    is also able to receive some feedback about the success of that\r\n    performance, then the observer is in the position to judge, independent\r\n    of the model, what would be appropriate to do next. In short,\r\n    the observer becomes actively involved, albeit vicariously, in\r\n    the process of learning. The observer joins the learning model\r\n    in the trial-and-error process. Augmented feedback is\r\n    a means of supplementing the sources of feedback normally available\r\n    to an individual. As a source of information that complements\r\n    the always present sources, augmented feedback serves a restrictive\r\n    role. Optimally, augmented feedback should be used to help a\r\n    person to interpret the sources of feedback that are always available.\r\n    Augmented feedback should provide a knowledge referent, or \"reliability\r\n    check,\" to insure that intrinsic sources of feedback are\r\n    correctly being interpreted. For example, the reasons for an\r\n    errant golf shot are often available from watching the flight\r\n    of the ball. How to interpret this intrinsic feedback, however,\r\n    is something that must be learned. The optimal role of augmented\r\n    feedback is to assist the learner to correctly interpret this\r\n    intrinsic feedback. For augmented feedback\r\n    to serve its most useful role, it must be given in such a way\r\n    that it helps without discouraging the performer from learning\r\n    to interpret intrinsic feedback. Learning to interpret one’s\r\n    own intrinsic feedback requires cognitive effort. However, that\r\n    learning can he weakened if the augmented feedback serves a role\r\n    in which it undermines the effort to learn to interpret one’s\r\n    own intrinsic feedback. There is no need for the learner to try\r\n    to interpret the intrinsic feedback when augmented feedback is\r\n    provided instantaneously upon movement completion and when it\r\n    follows every trial. In a way, cognitive effort is suppressed,\r\n    yet performance improves quite well without it. Encouraging the\r\n    interpretation of performance, reducing the relative frequency\r\n    (combined with performance bandwidths), and increasing the summary\r\n    sizes of augmented feedback all positively impact the cognitive\r\n    effort to interpret intrinsic sources of information. Practice drills are good\r\n    procedures for learning skills. However, many motor skills that\r\n    are undertaken daily do not involve repetitive actions. This\r\n    problem became clear recently when one of us was teaching a boy\r\n    how to tie his shoes. The thought processes that he undertook\r\n    in tying his shoes were clearly evident by the slow and deliberate\r\n    actions of his fingers as work. These were repeated on the next\r\n    shoe, but to a far less degree. We wonder what would have happened\r\n    if he had been asked to keep practicing for 15 minutes. No doubt,\r\n    success would have come more quickly and easily. However, would\r\n    success have been achieved any easier the next morning? Evidence\r\n    regarding the contextual interference effect suggests not. Solving a problem by\r\n    recalling a recent solution bypasses the cognitive effort involved\r\n    in the decision-making process. When a task requires that these\r\n    decisions be learned, conditions should be arranged such that\r\n    these decisions are practiced. Arranging practice conditions\r\n    that serve to avoid this cognitive effort hinders the learning\r\n    process. Learning motor skills\r\n    involves also learning cognitive skills. We have provided three\r\n    instances of research that collectively suggest that the cognitive\r\n    effort expected during practice has a critical impact on the\r\n    learning process. The functional independence of students and\r\n    athletes lies in their ability to think and act on their own.\r\n    Promoting that purpose in practice and training sessions is compatible\r\n    with that goal. A Caveat for Instructors An interesting\r\n    question was recently posed by Robert Bjork: \"if the research\r\n    picture is so clear, then why are massed practice, excessive\r\n    feedback, fixed conditions of training and limited opportunities\r\n    for retrieval practice - among other non-productive manipulations\r\n    - such common features of real world training conditions?\".\r\n    There are several answers to the question. One could be that\r\n    the research picture is not all that clear. In this paper we\r\n    have built an argument for the role of cognitive effort in learning\r\n    motor skills based on a limited set of data. The generalizability\r\n    of these ideas await further research. If the research picture\r\n    is accurate however, then Bjork argues that nonproductive training\r\n    manipulations continue to be used for as least two further reasons.\r\n    One relates to the performance / learning distinction. Some of\r\n    the temporary benefits to performance seen during practice favored\r\n    the use of practice manipulations that actually resulted in poor\r\n    retention One example is contextual interference. If an instructor\r\n    were to value a practice manipulation in terms of how quickly\r\n    a standard of performance was achieved then blocked training\r\n    would be seen as a much better arrangement of practice orders\r\n    than random training. However, an appreciation for the assessment\r\n    of learning in terms of retention and transfer would produce\r\n    the opposite conclusion. Related to this same issue is the fact\r\n    that instructors of training programs may only he involved with\r\n    the learner for the period of time during which the practice\r\n    occurs. Perhaps they are satisfied with the benefits to performance\r\n    seen by their training methods, or perhaps they are not aware\r\n    of the impact their training regimes have on longer term retention\r\n    or transfer after their involvement with the learner has been\r\n    completed. The second reason given\r\n    by Bjork for the continued use of nonproductive training conditions\r\n    is due to the subjective experiences of the learner. Rapid improvements\r\n    on a motor skill are reassuring, and the learner may develop\r\n    illusions about time progress made on a skill as a result of\r\n    conditions of practice that favor rapid, short-term) benefits.\r\n    These incorrect subjective sometimes anecdotal assessments tend\r\n    so foster continued belief in the training programs. In contrast,\r\n    training programs that are structured to promote cognitive effort\r\n    during learning may not be given full value by the subjective\r\n    experiences of the learner because of the decelerated rates of\r\n    improvement that may occur. For these reasons the\r\n    instructor is faced with roles of both assisting the learner\r\n    with the skill to be learned and educating the learner about\r\n    learning. Get the full article\r\n    with references and graphs and stuff at the Free\r\n    Download Page . Timothy D. Lee is with the Dept. of Kinesiology al McMaster University,\r\n    1280 Main Street W., Hamilton, ON Canada L8S 4K1. Stephan P.\r\n    Swinnen and Deborah J. Serrien are with the Dept. of Kinanthropology\r\n    at the Catholic University of Leuven, Leuven Belgium. Last updated on webbot bot=\"Timestamp\" S-Type=\"EDITED\" S-Format=\"%d-%m-%y\" startspan 20-10-00 webbot bot=\"Timestamp\" endspan i-checksum=\"12142\" msnavigation"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    }
  ]
}