{
  "url": "http://www.scotclans.com/history/1879_tay.html",
  "content_hash": "a0e63d0c0f5529369d8916a8b3202ce4d257c901d8fca003c8a4533b727bd565",
  "total_blocks": 286,
  "retained_blocks": 11,
  "ignored_blocks": 275,
  "blocks": [
    {
      "tag": "div",
      "text": "start page container start top content A guide to the Clans and Tartans of Scotland: From Scottish Clan Information to Clan Merchandise, Handmade Kilts, Highland Outfits ... everything a true Scot should need and know. CLAN SEARCH A B C D E F G H I J K L M N O P Q R S T U V W X Y Z * end clan search A-Z start top navigation HOME CLANS A-Z WHAT'S MY CLAN HISTORY SHOPPING REGISTER HELP end top navigation end top content main container start left panel History Index Ancient Medieval Renaissance Unification Jacobean Modern #BeginLibraryItem \"/Library/side2.lbi\""
    },
    {
      "tag": "p",
      "text": "Some great offers \n              available now in our 'Shopping' section"
    },
    {
      "tag": "div",
      "text": "Handmade \n            Kilts. Be prepared for Tartan Day with a new Handmade Kilt Greenland \n            Sealskin Dress Sporran. Only £99.95 Tartan \n            Ties. Over 500 Tartans available, \n            only £10.99 Handmade Scottish Bears. Meet the McBear clan From £17.50 Antler \n            Horn Sgian Dubh. Fantastic dress \n            item £29.95"
    },
    {
      "tag": "p",
      "text": "We have many \n              more great product in our shop - everything a clan member could \n              want visit \n              the shop >>"
    },
    {
      "tag": "div",
      "text": "#EndLibraryItem end shop panel Kilts -\n\t\t\tScottish handmade kilts, great quality at amazing prices Kilt Outfits - save money! \n\t\t\tbuy the complete outfit end shop panel end left hand panel main content panel"
    },
    {
      "tag": "h1",
      "text": "1879 - The Tay Bridge Disaster"
    },
    {
      "tag": "div",
      "text": "Designed by Sir Thomas Bouch, \n                      the Tay Railway Bridge was opened in 1878."
    },
    {
      "tag": "p",
      "text": "The single-track bridge was a box construction with numerous \n                        box-section legs, up to 230ft apart, supporting the steam \n                        trains up to 88ft in the air as they snaked for almost \n                        two miles over the Tay and Perth-bound shipping. Bouch \n                        had not designed his structure with the estuary winds \n                        considered in his calculations, nor had the contractor \n                        been supervised to prevent his use of badly manufactured \n                        material. These points were discovered after the bridge’s \n                        central sections failed during the stormy night of 28 \n                        December 1879 while a train was crossing. The train, with \n                        seventy five passengers and crew, poured off the collapsing \n                        bridge into the icy river with all lives lost. Bouch, who was held entirely responsible, could not take \n                        the strain either and died shortly after the inquiry. \n                        When travelling on the 1887 replacement bridge over the \n                        Tay, the bases of the original’s supporting legs \n                        can be seen along the eastern side, reaching out of the \n                        cold water, a disturbing sight on a stormy crossing. William McGonagall remembers the night of the 28th well \n                        in his famous poem ‘Railway Bridge of the Silvery \n                        Tay’. Available \n                                    online now! Narrated Scottish History Boxed Set. \n                                    Around 3.5 hours of Narration, the history \n                                    of Scotland told in an entertaining, informative \n                                    and amusing style. A comprehensive guide to \n                                    Scotland's rich history. More information"
    },
    {
      "tag": "div",
      "text": "£27.50 \n                                    inc VAT Product Code HH-CD05 Story \n                                  of a Nation - by P. Hume Brown For many decades Hume Brown's work has stood \n                                  the test as one of the most authoritative histories \n                                  of Scotland. The text includes illustrations, \n                                  maps, a list of events, of sovereigns and genealogical \n                                  tables and is fully indexed. More information"
    },
    {
      "tag": "p",
      "text": "£10.95 Product Code LS-001 For Further Reading : McGonagall \n                        Online"
    },
    {
      "tag": "div",
      "text": "< return to \n                events end main content right blue margin quick shop links QUICK SHOP LINKS Kilts > Gents Kilts Ladies Kilts Childrens Kilts Kilt Outfits > Gents Kilt Outfit Boys Kilt Outfit (for boys kilt outfit please just fill in our enquiry form) Kilt Accessories > Sgain Dubhs Sporrans Buckles Shoes & Hose Jackets & Shirts Belts & Chainstraps Kilt Outfit Carriers Cufflinks Kilt Pins Gents Clothing > Tartan Ties Tartan Scarf Tartan Braces Tartan Caps Tartan Waistcoats Tartan Cummerbund Ladies Clothing > Tartan Wraps Tartan Tam Childrens Clothing > Tartan Ties Prince Charlie Jacket Argyll Jacket Jacobite Shirt Brogues & Hose Sporrans Material Shop > Tartan Ribbon Tartan Swatches Tartan Material Metalware > Quaichs Cointrays Tableware Flasks Trinket Boxes Scottish Books etc. > Scottish Books Scottish CDs Clan CD ROMs Scottish Maps Scottish Clan Items > Clan Crest Plaque Crest Cross Stitch Clan Embossed Items Clan Crest Badges Thistle Buckle with Badge bottom links About Us | Site Map | <a href=\"#\">Media Centre</a> | Terms & Conditions | Contact Us <tr>\n<td align=\"middle\" class=\"paleblue\">ScotClans is a registered trademark (RN 2,516,395)   1997 - 2004 Online Travel Corporation plc</td>"
    }
  ]
}