{
  "url": "http://www.senser.com/04-01-06.htm",
  "file_number": "699",
  "content_hash": "6f431ea16655710a1c725e03c678a962a29aad77447599fc2cfcabe1fa830a2b",
  "total_blocks": 21,
  "retained_blocks": 10,
  "ignored_blocks": 11,
  "blocks": [
    {
      "tag": "div",
      "text": "doctype PUBLIC \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "blockquote",
      "text": "Vol. IX, Bulletin No.1\r\n                                                    \r\nJanuary 6, 2004 Ignoring the\r\nDemand of Justice To Make Restitution More on Wage-Cheating in China At a toy factory in China, a management memo told workers how they\r\nshould prepare\r\nfor an upcoming inspection by an outside monitoring team. They were to\r\nmemorize\r\nfalse numbers for their wages and working hours, inflating the wages\r\nand lowering the hours in order to reflect standards under Chinese\r\nlaws. And\r\nthey were promised bonuses for lying to\r\nthe inspectors. That is among the revelations contained in a front-page article, \"Ruse\r\nin Toyland: Chinese Workers' Hidden Woe,\" published in the December 7\r\nissue of the New York Times as part of its series on \"The World's Sweatshop,\" China.  The\r\narticle focuses on a\r\nfactory near Hong Kong, Kin Ki Industrial, whose 850 workers, mostly\r\nteen-age girls, make the popular Etch A Sketch drawing toys for the\r\nOhio\r\nArt Company in Bryan, Ohio. Workers at the plant told the Times reporter, Joseph Kahn, that if the company were to pay legal wages,\r\ntheir pay for a month would more than double, to about $200 from\r\n$86. A senior Kin Ki executive first disputed these figures, but\r\nafter also claiming that the company complies strictly with all\r\nChinese laws, he acknowledged that its wages and benefits did fall\r\nshort\r\nof legal requirements.\r\nMoreover, Kin Ki company documents obtained by the Times , Kahn writes, \"show that it\r\nhas been\r\npaying below-regulation wages -- and seeking to fool foreign clients --\r\nfor years.\" Toy Industry 'Well Aware' of\r\nLaw-Breaking, U.S. Industry Chief Says If those and other damning facts detailed in the lengthy article were\r\nuntrue, they would be challenged by the international toy business'\r\nleading spokesperson, Tom Conley, president of the trade association\r\nonce\r\ncalled the Toy Manufacturers of America, which three years ago renamed\r\nitself the Toy\r\nIndustry\r\nAssociation (since 80% of\r\nall toys sold in the United States are manufactured in China). Instead\r\nof disputing Kahn's facts, Conley makes this admission in a letter\r\npublished in the December 14 Times :\r\n\"The toy industry\r\nis well aware that some Chinese toy factories are not complying with\r\nChinese laws.\" So what does he propose to do about the violations, especially those\r\nthat cheat workers out of their lawful wages? He offers only an\r\nexpanded\r\nprogram of independent inspections that \"leave no room for the kind of\r\ndeceit\" that the Times has\r\nrevealed. \r\nBut the problem is not merely deceit but cheating -- robbing workers of\r\ntheir wages over a period of years. Justice requires making restitution. Conley ignores that demand of\r\njustice. So does the code of conduct that he extols as \"the real\r\nsolution\" -- the International Council of Toy Industries' Code of\r\nBusiness Practices. Workers at the unionized plant of the Ohio Art Company in Bryan, Ohio,\r\nmade\r\nEtch A\r\nSketches for 40 years before its owners three years ago decided to move\r\nproduction to China. One reason, its executives told Kahn, was the\r\nsoaring cost of health insurance. In China the Kin Ki production\r\nworkers have no health insurance. They also have no union. Last\r\nsummer a brief strike caused Kin Ki to raise wages a few cents a\r\nday and improve canteen food slightly, but two strike leaders soon were\r\nno longer on the payroll.  According to management, they left\r\nvoluntarily. According to workers,  management fired them -- made\r\n\"fried squid\" out of them, in local parlance. The toy industry has a long history of highly profitable growth based\r\non\r\nexploiting young women from China's rural areas. See, for example, \" Our Children Don't Need\r\nBlood-Stained Toys ,\" published in HRFW eight years ago, and an article of mine, \" Toying\r\nwith Lives ,\"\r\npublished in American Educator a year ago. For highlights\r\nfrom a previous Kahn article in the Times series, see \" China Is\r\nWorld's Sweatshop -- Who Cares? \" How Killing Workers Goes Unpunished \"Workers decapitated on assembly\r\nlines, shredded in machinery, burned\r\nbeyond recognition, electrocuted, buried alive -- all of them killed,\r\ninvestigators concluded, because their employers willfully violated\r\nworkplace safety laws.\" Is that a description of avoidable workplace fatalities in China? \r\nNo, this is a scandal made in the USA. The deaths happen here at the\r\nrate of 100\r\nworkers a year as a result of \"intentional wrongdoing or plain\r\nindifference\" by employers. And, despite U.S. respect for the rule of\r\nlaw, the\r\noffending employers are almost never prosecuted. Those are among the startling findings of an intensive New York Times investigation that\r\nresulted in what the Times calls\r\n\"the first systematic accounting of how this nation confronts\r\nemployers who kill workers by deliberately violating workplace safety\r\nlaws.\" A few of the other findings disclosed in a December 22 article\r\nby David Barstow: Although causing the death of a worker by willfully violating\r\nU.S. occupational safety laws is a federal crime, from 1982 to 2002 the\r\nfederal\r\nOccupational Safety and Health Administration (OSHA) declined to seek\r\nprosecutions in 93% of the cases in which the agency itself concluded\r\nthat the workers had died because of \"willful\" safety\r\nviolations by employers. Moreover, repeat offenders got off easy. \"Having avoided\r\nprosecution once, at least 70 employers willfully violated safety laws\r\nagain, resulting in scores of additional deaths. Even these repeat\r\nviolators were rarely prosecuted,\" Barstow writes. In the OSHA bureaucracy \"victims' families are frozen out, but\r\ncompanies adeptly work the rules in their favor.\" Since 1990 OSHA has\r\nincreasingly bowed \"to employer demands that it replace the word\r\n'willful' with 'unclassified' in citations involving workplace\r\ndeaths...even for employers who have repeatedly shown a deliberate\r\ndisregard for safety laws, resulting in multiple deaths.\" In two decades OSHA's enforcement of the law has led to jail\r\nsentences totaling fewer than 30 years. In a single year, 2001, the\r\nEnvironmental Protection Agency obtained prison sentences totaling 256\r\nyears. Barstow's article, part of a series, \"When Workers Die,\" on how the\r\nU.S. government deals with the worst cases of death on the job, is\r\nsubtitled\r\n\"A Culture of Reluctance.\"  That's an understatement. It is a\r\nculture of cruel indifference and criminal malfeasance. For more details on \"When Workers Die,\" see an interactive feature,\r\nmore photographs, a video, and a slide show narrated by David Barstow\r\nonline at < http://www.nytimes.com/national >. Which Way To Go, Mr. CEO? Let's say you are a top management official at Wal-Mart, Nike, or\r\nanother major American corporation, and you have come to rely on\r\nworkers in the\r\nPeople's\r\nRepublic of China to make a large part of your company's goods and\r\nprofits. You used\r\nto deny that your products are made in sweatshops. Now you realize that\r\nthe on-site\r\nevidence is undeniable. You face pressure to\r\nmake your company \"socially responsible.\" So what to do? You seek guidance\r\nfrom lawyers and other experts. At root, however, the choices you face\r\nare two, exemplified by\r\nthe opposing approaches carefully delineated by two world figures. Here\r\nis\r\none\r\napproach, capsulized in this quotation:"
    },
    {
      "tag": "div",
      "text": "\"In [a free] economy, there is one and only one social responsibility\r\nof business -- to use its resources and engage in activities designed\r\nto increase profits so long as it stays within the rules of the game,\r\nwhich is to say, engages in open and free competition, without\r\ndeception or fraud.... \"Few trends could so thoroughly undermine the very foundation of our\r\nfree society as the acceptance by corporate officials of a social\r\nresponsibility other than to make as\r\nmuch money for their stockholders\r\nas possibl e.\" -- Milton Friedman, the distinguished professor of\r\neconomics, writing in his best-selling book \"Capitalism and Freedom\"\r\n(page 133, emphasis added). I call this the not-to-worry approach. It can be very comforting to sweatshop-plagued corporate\r\nleaders. It tells them, on the authority of a Nobel Prize winner, that\r\nin dedicating themselves to making as much money as possible for their\r\nstockholders they are\r\ndoing the right thing and also fighting to keep\r\nour society free. Then, there's another approach,\r\ncapsulized in these three propositions:"
    },
    {
      "tag": "blockquote",
      "text": "\"There exist acts which per\r\nse and in themselves, independently of circumstances, are always\r\nseriously wrong\" (that is, prohibited because they are \"always\r\nand without exception intrinsically\r\nevil\" [emphasis in original]). Among such evils are \"degrading conditions of work which treat\r\nlaborers as mere instruments of profit.\" \"So long as [such evils] infect human civilization they\r\ncontaminate those who inflict them more than those who suffer them\" --\r\nPope John Paul II in his encyclical letter Veritatis Splendor (para. 80) . I call this the you'd better worry approach. It prohibits treating workers as mere\r\ninstruments of\r\nprofit. Morally, it places a severe limitation on you even if the\r\nexisting rules\r\nof the game do not. It's your choice, Mr. CEO.  Which approach will you take? Global Norms Put Heat on Business The United Nations Commission on Human Rights will soon consider\r\nadopting a set of \" Norms\r\non the Responsibilities of Transnational Corporations \" covering\r\nenvironmental, labor, and human rights standards. The U.S. Council for\r\nInternational Business, very much in character, is vigorously opposing\r\nthem. The proposed norms, which will be on the agenda of the Human Rights\r\nCommission's annual meeting in March, were adopted by a subsidiary unit\r\nof the\r\nCommission in August, and since then they have provoked sharp\r\ncontroversy\r\nbetween its proponents and business representatives, often\r\nin the pages of the Financial\r\nTimes . In a letter published in that London-based newspaper on December 17, Thomas M.T.\r\nNiles, president of the U.S. Council, objected to the\r\nnorms because, if approved, they would \"create a new international\r\nlegal framework,\r\ncutting across virtually every area of business operations, with\r\ncompanies, rather than the governments that negotiated them,\r\nresponsible for implementing international treaties and\r\nconventions.\" Besides, the norms are unnecessary because \"most\r\ncompanies are already [taking human rights seriously].\" In a response published December 19, also in the Financial Times ,\r\nMary Robinson, former president of Ireland, former UN High Commissioner\r\nfor Human Rights, and now\r\nexecutive director of the Ethical\r\nGlobalization Initiative , wrote:"
    },
    {
      "tag": "div",
      "text": "\"Mr. Niles is right to say that many\r\ncompanies are committed to respecting human rights....But Mr. Niles\r\ngoes too far in suggesting that this is common practice. The great\r\nmajority of companies around the world have not thought carefully about\r\ntheir responsibilities in relation to human rights. \"A recent survey by the Organization for Economic Cooperation and\r\nDevelopment found that only one in five has adopted codes of conduct or\r\nshares compliance information with the public. Few companies even\r\nmention human rights in their codes of conduct.  Far\r\nfewer...employ third-party reporting systems. In more extreme cases,\r\ncompanies are directly responsible for, and complicit in, violations of\r\nrights, as recent expert reports of the UN Security Council on the Illegal Exploitation of Natural Resources\r\nand Other Sources of Wealth of the Democratic Republic of the Congo clearly\r\nshow.\""
    },
    {
      "tag": "blockquote",
      "text": "Breaking ranks from business opposition, seven companies, including\r\nABB, Novartis, and Barclays, have publicly stated their intentions to\r\n\"give serious consideration to the role these norms might play in their\r\nown work,\" according to the new Business Leaders'\r\nInitiative on Human Rights. Mrs. Robinson, who chairs that group,\r\nexpressed confidence\r\nthat there would be \"a steady increase in the number of companies that\r\nlook seriously at international human rights standards when making\r\ndecisions about their operating methods, personnel policies,\r\nprocurement, and investment decisions.\" Is that optimism justified?  It depends on many factors,\r\nincluding (but not only) the position of the U.S. government, which is\r\none of 53 government members of the UN Human\r\nRights Commission.  The Bush administration is hardly an advocate\r\nof expanding international obligations in the area of human rights,\r\nlabor, and the environment, and relies heavily on the views of\r\norganizations like the U.S. Council for International Business. Counseling the Council on Why To\r\nTake the High Ground The U.S. Council has not sought my advice, but here it is anyway: The norms draft does indeed contain a very broad set of\r\n(non-binding) obligations, mostly\r\nreflecting and clarifying standards that already exist in many\r\ninternational treaties and conventions. But it is only a draft, and\r\nsubject to revision. Instead of battling to bury the norms and all\r\nthey represent, you would be wise to use the Council's influence to\r\nmake the\r\nnorms workable and to render them conducive to promoting corporate\r\nsocial responsibility. The bad apples, which you know exist, spoil the reputation of\r\nall business. Worse, they spoil the business environment by inclining\r\nothers to follow their example. All too often, this\r\ncorrupting process goes on under a polite name: meeting\r\nthe\r\ncompetition . Governments actively protect the rights and interests of\r\nbusiness not only through domestic legislation but more and more\r\nthrough a network of international law and intergovernmental\r\norganizations. But there is a huge void in international safeguards\r\nthat\r\nprotect the rights and interests of labor. As global integration\r\nintensifies, and global communications increase, that void becomes more\r\nand more difficult to ignore,\r\nand more and more difficult to justify. Don't underestimate Mrs. Mary Robinson and the\r\npower of the idea she is promoting. Business' heavy dependence on the\r\nprotection of international law and intergovernmental organizations\r\nwhile vigorously opposing those benefits to others is increasingly\r\nbeing recognized as selfish, unbalanced, unfair, and untenable. Some businesses agree that they have the opportunity to do much\r\nmore to advance human rights, and in many other businesses there are\r\nexecutives who understand this opportunity and would like to seize it.\r\nYou ought to join them instead of fighting them. (Unfortunately, the Website of the U.N.\r\nCommission on Human Rights and the unit that approved the norms,\r\nits Subcommission on the Promotion and Protection of Human Rights, is\r\nnot user-friendly. The subcommission member who is most\r\nresponsible for drafting the norms, and whose eight years on the\r\nsubcommission end in March, David\r\nS. Weissbrodt , professor\r\nof law at the University of Minnesota, has\r\nmade the\r\ndraft norms available on the university\r\nWebsite. For background information, see the Website of the Business and Human\r\nRights Resource Centre and the current Human Rights Brief published\r\nby the Washington College of Law.) Diary: So Far, No Dumb Mistakes Breakfast finished, Mai, who will be three at the end of February, was\r\nwiggling to leave her highchair. \"Hold on,\" my wife said. \"I'll\r\nunplug\r\nyou.\" \"No, Grandma,\" Mai insisted. \" Unbuckle me. Unbuckle, please.\" At her present pace, in a few short years Mai should be ready to\r\ncopyread each edition of Human\r\nRights for Workers before I publish it on the Web. I live in\r\nmuted dread that I'll go final with a text that has some dumb mistakes.\r\nI make use of two kinds of spell checkers, and they catch most of my\r\ntypos. Careful reading, and rereading, catches others, the ones that\r\nthe mechanical systems miss. But spell checkers are blind to factual errors. Like the one I\r\nmade the other day in the annual Christmas letter I wrote early in\r\nDecember. In\r\ndescribing the family Christmas eve that we would\r\ncelebrate at our son's house in nearby Ashburn, Virginia, I located it\r\n\"close to where Lee crossed the Potomac, only to get beaten\r\nat Gettysburg.\"  After most of the letters were in the mail, I got\r\nan uneasy feeling about that sentence. I decided to check a map.\r\nOf course, Lee's army was actually defeated at Antietam , after crossing\r\nthe Potomac much farther upriver than I had said. Embarrassing errors,\r\nwhich would be far more embarrassing if they had gone out over the Web. I launched Human Rights for Workers in February 1996. During those eight years, an occasional typo or\r\npunctuation error has slipped through, but (to my knowledge) no really\r\ndumb mistake of substance. I'll try to continue that record in\r\nthe next eight years. But the sooner I get Mai's help the better."
    },
    {
      "tag": "div",
      "text": "* * *"
    },
    {
      "tag": "blockquote",
      "text": "My wife Dzung edits a Vietnamese literary magazine, Co Thom, which,\r\nloosely translated into English, means \"fragrant grass,\" a poetic\r\nVietnamese expression symbolizing the cultural basis of the quarterly\r\npublication.  Co Thom promotes Vietnamese literary, artistic, and\r\nhuman values, and has been doing so for eight years now, thanks to\r\nvolunteer help and donations from Vietnamese-Americans who want to keep\r\nthe Vietnamese language alive among the many Vietnamese who fled their\r\nnative land to escape Communism. After serving as the magazine's editor for three years, Dzung has just\r\nbeen named its publisher too, which among other things means promoting\r\nsubscriptions ($30 a year).  If you read Vietnamese, and want to\r\nsubscribe (as you really should), send me an email ,\r\nand I'll pass it on to my dear colleague."
    },
    {
      "tag": "p",
      "text": "Human Rights for Workers : Bulletin No. IX-1   \r\nJanuary 6, 2004 http://www.senser.com Robert A. Senser, editor Copyright 2004 (Send e-mail)"
    },
    {
      "tag": "blockquote",
      "text": "Back to Home Page"
    }
  ]
}