{
  "url": "http://www.shd.org.yu/HtDocs/SHD/SHD-publishing.htm",
  "content_hash": "7cc31b327ea50e19f2328532626bbd2be6b700586d06fa030259286247979da0",
  "total_blocks": 17,
  "retained_blocks": 3,
  "ignored_blocks": 14,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//w3c//dtd html 4.0 transitional//en\" PUBLISHING\r\nACTIVITY"
    },
    {
      "tag": "p",
      "text": "Early members of the\r\nSerbian Chemical\r\nSociety published their professional articles on chemistry in 1898 and\r\n1899 in Nastavnik (the Teacher) , a\r\njournal of the Teachers' Society.  However, already at the\r\nbeginning\r\nof 1899 the Society published a separate Bulletin under the name o f Minutes\r\nof the Serbian Chemical Society. From 1899 to 1906, 11\r\nissues\r\nof the Minutes were published.  In 1906 publication of the Minutes\r\nceased.  In 1914 a report by M. Stojiljkovic for the period\r\n1904-1906\r\nwas published in the Teacher.  Those were the first publishing\r\nactivities\r\nof the Serbian Chemical Society. In the Statute of the Society which\r\nwas passed in January 1927, several articles referred to the\r\nprofessional\r\njournal.  In article 5 dealing with the means of realizing the\r\ntasks\r\nof the Society, it was said that this would be achieved, among other\r\nthings, \"by\r\npublishing a professional journal\" . Three more articles of the\r\nStatute\r\nreferred to publishing magazines; article 34: \"The Administrative\r\nCommittee\r\nis to organize the publication of a professional journal as a\r\nperiodical\r\nof the Society,\" article 35: \"The Society will issue separate\r\nregulations\r\nabout editorial work and publication of the journal,\" article 36: \"The\r\nprofessional journal will be printed at a location which the\r\nAdministrative\r\nCommittee finds most suitable for the interests of the Society. All\r\nmembers\r\nof the Editorial Board need not necessarily be from the town where the\r\njournal is published, for they can communicate in written form.\" The\r\njournal\r\nof the Serbian Chemical Society was founded three years after the\r\nStatute\r\nhad been passed. However, already in the same year\r\nwhen, after the First World War, the restored Serbian Chemical Society\r\nstarted working, i.e. in 1927, several chemical papers were published.\r\nThe first two years, 1927 and 1928, the papers were published in a\r\njournal\r\nboth for chemistry and pharmacy: The Archives\r\nfor Entire Chemistry and Pharmacy which was published as a\r\nsupplement\r\nto Glas apotekarstva (the Voice of Pharmacy) ,\r\nthe journal of the Serbian Pharmaceutics Society.  The Journal was\r\nedited by A. Leko, P. Jovanovic and M. Mokranjac, as well as by the\r\nformer\r\nEditor of the Voice of Pharmacy M. Mirkovic. The first year three\r\nissues\r\nwere published and in the following year, 1928, one issue.  In\r\n1929\r\nthe Journal separated from the Voice of Pharmacy and was published\r\nindependently\r\nunder the name of Anali hemije i farmacije\r\n(Annals\r\nof Chemistry and Pharmacy) .  Only one issue was\r\npublished\r\nbecause in 1930 the Chemical\r\nSociety\r\nof the Kingdom of Serbs, Croats and Slovenes started its own scientific\r\nand professional publication Glasnik\r\nHemijskog\r\nDrustva Kraljevine Jugoslavije (The Journal of the Chemical Society of\r\nthe Kingdom of Yugoslavia). Nikola Pusin was entrusted with\r\nthe editorial work. He was Editor-in-Chief of the Journal till the\r\nbeginning\r\nof the Second World War.  The first editorial board was elected on\r\nMarch 25th, 1930. The last pre-war volume of the\r\nJournal, volume 10 in 1939, contained 15 papers, 3 reports, 4\r\ncommunications\r\nand 1 obituary on 219 pages. The last paper was received in\r\nmid-December,\r\n1940 which means that the last issue of that year was published either\r\nat the end of 1940 or, which is more probable, at the beginning of 1941. The first post-war volume of the\r\nJournal was published in 1947 under the name Glasnik\r\nhemijskog drustva Beograd (Journal of the Chemical Society of Belgrade). That year, two volumes were published: volume 11, designated 1940-1946,\r\nand volume 12 for 1947.  The Editorial Board for publication of\r\nthe\r\nJournal was named at the end of 1945, and constituted at the beginning\r\nof 1946.  Nikola A. Pusin remained on as Editor-in-Chief. At the beginning of 1957 the Administrative\r\nCommittee of the Society decided that from January,\r\n1957 papers could be published in English,\r\nGerman, Russian and French , with a short summary in the national\r\nlanguage.  The first paper written in English was published in the\r\ntriple issue 5-6-7.  It was the paper by Velimir Canic and Radmila\r\nDjordjevic, accepted on May 11th, 1957: The Basicities of\r\nPyridine-Monocarboxyllc\r\nAcid Ethyl Esters and the Equilibrium Between Dipolar Ions and\r\nUncharged\r\nMolecule in Solutions of These Acids. From 1957 the Journal has the title Documenta\r\nChemica Jugoslavica at the top of its covers. This was the\r\noutcome\r\nof long-term efforts of the Union of Chemical Societies of Yugoslavia\r\nto\r\nachieve some definite uniformity in publishing journals and in\r\npromoting\r\nthe scientific level papers published in Yugoslav chemical periodicals.\r\nOnly journals that agreed to respect an agreement about a number of\r\ntechnical\r\nquestion mostly, that papers could only be published after having been\r\ngiven at lea two positive reviews, were allowed to have this title. After 1957, that is, after volume\r\n22 had been published, the Journal due to the shortage of financial\r\nmeans,\r\nwas not published for almost three years.  By the beginning of\r\n1961\r\none special issue of the Journal had been published. That issue\r\ncontained\r\nthe author, subject and formula, indexes of volumes 1-10 (1930-1939),\r\npublished\r\nin 1958, and 6 issues of volumes 23-24 for 1958159.  At the\r\nbeginning\r\nof 1961 some means were obtained from the Fund\r\nfor\r\nPublishing Activities and the Council for\r\nCulture of Serbia . Some means were also obtained from\r\ninstitutions\r\nwhose members published their papers in the Journal. In order to\r\nregulate\r\nthe financial situation of the Journal, the Administrative Committee\r\ndecided\r\nto introduce advertisements in the Journal so that some money could be\r\ncollected in that way. The publishing house \"Nolit\" in 1961 agreed to\r\npublish\r\nparallel editions of the Journal in English with the assistance of International\r\nTechnical Funds. The number of printed copies in 1961 was\r\n1280, of which 70 copies were exchanged for foreign journals from 24\r\ncountries\r\nand 15 with domestic publishers. In 1963, due to the publication\r\nof the delayed issues of volume 27 for 1962, only issues 1 and 2 of\r\nvolume\r\n28 for 1963 were published; other issues were published in 1964. As the\r\ndelay in the publication of the Journal was longer and longer, the\r\nAdministrative\r\nCommittee of the Society was forced to change publishers. Volume 28 had\r\n59 papers. The Editors continued to encourage members of the Society to\r\nmore frequently send their papers to the Journal, because the\r\npublication\r\nof all 10 issues \"depended exclusively on their scientific activity.\" The appeal to authors for their\r\nintensive co-operation failed, and in 1964 the number of papers was\r\nreduced\r\nto 36. Consequently, the triple issue 8-9-10 contained only abstracts\r\nof\r\nthe 11th Annual Meeting.  During that year Djordje M. Dimitrijevic\r\nwas appointed new Editor.  The new Editorial Board issued new\r\nextended\r\nrules on how to prepare manuscripts for publication. In 1965 the number\r\nof papers decreased again - 33 papers on 337 pages. Beside 10 issues,\r\nvolume\r\n30 also had a separate supplement containing the Proposal\r\nof the Yugoslav Nomenclature of Inorganic Chemistry Made on the Basis\r\nof\r\nthe Recommendations of the International Union for Pure and Applied\r\nChemistry . \r\nThe Serbian version of the proposal was done by Prof. Vukic Micovi. In 1968 Aleksandar R. Despic was\r\nelected Editor-in-Chief.  In the triple issue 2-3-4 bibliographic\r\ncards appeared for the first time They contained summaries of published\r\npapers and universal decimal classification; these cards were published\r\nregularly till 1978.  The total of published papers was 45 in\r\nthree\r\ntriple issues (2-3-4, 5-6-7, 8-5-10). In 1972, apart from 5 double issues\r\nwith 36 papers, the jubilee issue of the Journal was published on\r\noccasion\r\nof the 75th anniversary of the Society.  In that issue Prof. \r\nDjordje Dimitrijevic, President of the Society, gave a detailed review\r\nof the history of the Society, which included both the foundation of\r\nthe\r\nJournal and its activities in former years. The Editor of the jubilee\r\nvolume\r\nwas Prof.  Dragomir Vitorovic. In 1976 Prof. Slobodan V. Ribnikar\r\nwas named Editor-in-Chief. The same year the Journal came out in a new\r\nmore modem outfit, and the authors were given new instructions on to\r\nhow\r\nto prepare their text.  The number of papers was suddenly\r\nincreased,\r\nwhich, to some extent, was a consequence of the more regular\r\npublication\r\nof the Journal.  The Journal was introduced into international\r\nclassification\r\naccording to which it was given the label YU-ISSN\r\n0017-0941 .  The Journal had 589 subscribers in\r\nYugoslavia\r\nand 38 abroad, and 134 copies were sent abroad to be exchanged. In June 1984 at the Annual Assembly of the Serbian Chemical Society, it was decided,\r\nbeginning from volume 50 for 1985, to have all papers published only\r\nin English , and to have the title of the Journal changed to the Journal\r\nof the Serbian Chemical Society .  The summaries\r\nwould\r\ncontinue being written in Serbian. In 1985 the Journal was published\r\nexclusively in English, 12 issues a year, under the new name and with a\r\ndifferent cover (designer Milan Jovanovic).  Eighty-three papers\r\nwere\r\nprinted on 582 pages.  Two more associates were included in\r\nediting\r\nthe Journal, Prof. Milica Misic-Vukovic and Prof.\r\nSvetozar Niketic , as Assistants to the Editor-in-Chief\r\nAcademician Dragutin\r\nM. Drazic was appointed Editor-in-Chief In 1986 he took over all\r\neditorial work together with the former Assistant Editors, Editorial\r\nBoard\r\nand Council. The Journal attained the largest\r\nscope in the course of 1995 on the 10th anniversary of being published\r\nunder its new name and in English when 142 papers by 322 authors (25\r\nforeign)\r\nwere published on 1201 pages. At the request of the Institute\r\nfor Scientific Information - SCI from Philadelphia (USA) a\r\ncontract\r\nwas made for the Journal to be included in their Genuine Articles\r\nDocument\r\nDelivery Service."
    },
    {
      "tag": "div",
      "text": "At a\r\nmeeting\r\nof the Administrative Committee of the Serbian Chemical Society in March\r\n1950 , at the initiative of Prof.  Aleksandar Leko and\r\nsome\r\nof his closest colleagues, it was decided to start the professional\r\njournal Hemijski\r\npregled (Chemical Review) primarily intended to spread\r\nchemical\r\nculture. The\r\nFirst Editors of the Chemical\r\nReview were Milenko Milic and Alfred Jeger. Of\r\nall the initiators of the Chemical\r\nReview, Prof.  Aleksandar Leko was the one who tended publication\r\nthe most and who dealt with all problems related to it, so it may be\r\nsaid\r\nthat he was in love with his creation - the Chemical\r\nReview .  To quote Prof.  A. Leko: \"I\r\nhave imagined the Chemical Review to be a journal of general chemical\r\neducation,\r\na journal to help all teachers, and especially those working in\r\nsecondary\r\nschools, to refresh their teaching and make it more interesting. \r\nIn my opinion, such a journal is badly needed and that was why I have\r\nstrongly\r\nsupported it and have worked not only to maintain it but to see it gain\r\nits proper place in our country.\" The Chemical\r\nReview was published regular bimonthly till 1956 ,\r\nand the following Editors were appointed: Milenko Milic, 1952, Milenko\r\nMilic and Cedomirr Jenic, 1953, Dejan Delic, Milenko Milic and Slavko\r\nRasajski,\r\n1955. However, due to the financial difficulties of the Serbian\r\nChemical\r\nSociety with the sixth volume of that year, its publication was\r\ninterrupted.\r\nAfter ten years the Chemical Review appeared again. At the beginning of 1967 the first volume came out\r\nunder\r\nthe supervision of its Editor-in-Chief, Prof. A. Leko, who again was\r\nthe\r\nmain initiator of the publication of the Review.  From that time\r\nsix\r\nissues have been published annually. To the general satisfaction of all\r\nmembers of the Society, Prof.  Leko continued editing the Chemical\r\nReview till 1976. After\r\nProf. A. Leko, Prof. \r\nMilosav Dragojevic 1977 was named Editor-in-Chief of the Chemical\r\nReview\r\nand he performed editorial duties till 1979 when Prof. Stanimir\r\nArsenijevic\r\nwas appointed Editor who is still performing this duty. In\r\norder to respond to all the\r\ntasks entrusted to the Review by its founders, and also to be well\r\ninformed\r\nof developments in science, the Editorial Board of the Chemical Review\r\ncontinues to follow modem achievements in chemistry as a fundamental\r\nnatural\r\nscience, its application new materials, modem chemical industry, as\r\nwell\r\nas to support the promotion of teaching chemistry at all levels. \r\nIt attempts to inform, not only members of the Serbian Chemical\r\nSociety,\r\nbut also other readers on novelties in chemistry and presents chemistry\r\nas a science which encompasses all parts of modem life. Chemistry is\r\nrightly\r\nexpected to contribute to the solution of many strategic problems of\r\nthe\r\nmodem world. The\r\n\"youngest\"\r\npublication of the Society are: The News from\r\nthe Serbian Chemical Society , or shortly, just News . \r\nThey started being published in the ninth decade of the Society's\r\nexistence\r\n( 1978 ) with the idea that all\r\nmembers\r\nshould be regularly informed of the many activities which are realised\r\nthrough the Society.  At the Annual Meeting Assembly held on\r\nJanuary\r\n16th, 1978, the decision to start publishing an informative newsletter\r\nwas confirmed.  It would be published quarterly and would be\r\ndelivered\r\nto all members free of charge.  The intention was that this\r\npublication\r\nbecome an interpreter and propagator of the basic goals of the Serbian\r\nChemical Society. Over\r\nthe past seventeen years 41\r\nissues of the News were published\r\n-\r\nin the first years three issues annually, and then mostly two issues a\r\nyear. The Editors of the News have been Teodor Ast, Radoslav Adzic and\r\nSmiljka Stevic, and since 1994 Dusanka Petrovic-Dakov. Apart\r\nfrom the three regular publications\r\ndescribed in detail, publishing activities related to publishing\r\npresentations\r\nfrom scientific and professional meetings organized by the Society, has\r\nbeen exceptionally great. There are books in the form of proceedings\r\nwith\r\ncomplete papers, books with extended summaries and books of abstracts.\r\nAs the Society has organised at least one and usually several meetings\r\na year in the last forty years, it ' is quite clear how enormous the\r\npublishing\r\nactivity has been. Among\r\nthe many published books\r\nexceptional useful ones are the Serbo-Croatian\r\nEnglish Dictionary - Chemistry and Related Sciences compiled\r\nby Prof. Slobodan Ribnikar who was induced by the mistakes in English\r\ntexts\r\nhe had come across during his thirteen years of experience of editing\r\nthe Journal\r\nof the Chemical Society Belgrade and Popis\r\nCasopisa (List of journals) from the field of pure and\r\napplied\r\nchemistry in libraries in Serbia (1958) which was compiled by\r\nProf. \r\nAleksandar Horovic. Home\r\nPage Journal Affiliates Sections History Library Membership Co-operation\r\nwith chemical organizations in the world Presidents\r\nof the Serbian Chemical Society"
    }
  ]
}