{
  "url": "http://www.sit.edu/sit40/conference.html",
  "content_hash": "6c022c28b00a080bf833687a258ca20f361e7ec72b07f333e913dc96469fb502",
  "total_blocks": 26,
  "retained_blocks": 7,
  "ignored_blocks": 19,
  "blocks": [
    {
      "tag": "div",
      "text": "SIT Home About Us Directory Site Map For Visitors For Current Students For Faculty & Staff For Alumni InstanceBeginEditable name=\"right\" InstanceEndEditable InstanceBeginEditable name=\"content\""
    },
    {
      "tag": "h1",
      "text": "SIT's 40th Anniversary Conference: Knowledge from Practice and Fieldwork"
    },
    {
      "tag": "p",
      "text": "Friday, May 27, 2005 School for International Training (SIT) Brattleboro, VT The vision expressed by SIT founder and president emeritus\r\n                  Dr. John A. (Jack) Wallace is today realized more than ever\r\n                  in education and training programs designed to build a global\r\n                  citizenry capable of effecting positive change. Indeed, SIT\r\n                  is now internationally recognized for its focus on practical\r\n                  skills, intercultural awareness and ethical attitudes for professionals,\r\n                  students and other citizens engaged in cross-cultural and international\r\n                  action/learning. Equally important is the substantive and unique\r\n                  body of knowledge generated by SIT alumni and others engaged\r\n                  in its programs. Next spring, SIT will cap the year-long celebration of its\r\n                  40th anniversary year by bringing together the experiences\r\n                  of alumni, faculty, staff and close colleagues in a groundbreaking\r\n                  conference focused on the knowledge generated through four\r\n                  decades of practice and fieldwork. Using the experiential learning\r\n                  cycle that continues to inform nearly every SIT program, the\r\n                  one-day conference will provide a forum for presenters and\r\n                  participants to reflect on experiences in various roles and\r\n                  professions, to generalize and synthesize new knowledge, and\r\n                  to share this knowledge with others in the process showcasing\r\n                  the unique and evolving ways SIT has made significant contributions\r\n                  to a more socially just, sustainable and peaceful world. Lessons learned during the Conference will be shared via electronic\r\n                  and/or print media, will become part of SIT's history, and\r\n                  will serve to enhance the institution's ability to fulfill\r\n                  its mission as we go forward. For more information, email SIT.conference@sit.edu To apply to present at the conference, download the Call\r\n                    for Proposals and the Proposal\r\n                    Cover Sheet ."
    },
    {
      "tag": "div",
      "text": "Call for Proposals (122\r\n                    KB, Adobe Acrobat PDF format, free\r\n                    reader required ) Proposal Cover Sheet (112\r\n                    KB, Adobe Acrobat PDF format, free\r\n                    reader required ) InstanceEndEditable"
    },
    {
      "tag": "p",
      "text": "World Learning"
    },
    {
      "tag": "div",
      "text": "The Experiment in International Living School for International Training SIT Study Abroad World Learning for International Development World Learning for Business"
    },
    {
      "tag": "p",
      "text": "Kipling Road, P.O. Box 676, Brattleboro, Vermont USA 05302-0676 Phone: (802) 258-3510    Toll Free Within the US: (800) 336-1616 TTY: 802-258-3388    Fax: 802-258-3500    \r\n\t\t\t\t\tEmail: info@sit.edu Search our website Copyright © 2006 World Learning"
    }
  ]
}