{
  "url": "http://www.southcarolinabedandbreakfast.com/by-laws.shtml",
  "content_hash": "86285a533d3a53243b4df1017e87768c4e1818c5eb39b93c5e62e8ec2486c249",
  "total_blocks": 197,
  "retained_blocks": 6,
  "ignored_blocks": 191,
  "blocks": [
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" U-Include=\"navigation-top.htm\" TAG=\"BODY\" startspan"
    },
    {
      "tag": "p",
      "text": "HOME | MEMBERSHIP | ASSOCIATES | CONTACT US"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" i-checksum=\"51092\" endspan webbot bot=\"Include\" U-Include=\"navigation-top-images.htm\" TAG=\"BODY\" startspan webbot bot=\"Include\" i-checksum=\"36426\" endspan webbot bot=\"Include\" U-Include=\"navigation-middle.htm\" TAG=\"BODY\" startspan webbot bot=\"Include\" i-checksum=\"56753\" endspan webbot bot=\"Include\" U-Include=\"navigation-middle-images.htm\" TAG=\"BODY\" startspan webbot bot=\"Include\" i-checksum=\"46117\" endspan South Carolina Bed and Breakfast\r\nAssociation By-Laws"
    },
    {
      "tag": "p",
      "text": "Includes Revisions made in 1993,\r\n1994, 1995, 1997, 2001 Article I  Purpose The South Carolina Bed & Breakfast Association\r\nis a non-profit, voluntary organization of bed and breakfast owners representing\r\nthose Bed & Breakfasts, Inns, and B&B Homestays in the State of\r\nSouth Carolina that are appropriately licensed.  Through cooperative\r\neffort, these innkeepers shall work closely with state and local governmental\r\nagencies to promote tourism, and to assure high standards of safety and\r\nservice within the bed and breakfast hospitality industry.  The Association\r\nshall act as a public resource for state and local regulatory agencies\r\nas they govern the growing B&B segment of the industry.  The Association\r\nwill further act as a professional regulatory body for all members of the\r\nAssociation. The primary goals of the Association are to: · Create greater recognition of Bed &\r\nBreakfasts as preferred accommodations sources within the hospitality industry. · Cultivate cooperation and communication\r\namong Bed & Breakfasts through out South Carolina. · Work within the industry to set standards\r\nfor the operation of Bed & Breakfasts. · Serve as a resource center for Association\r\nmembers. · Serve as a liaison between the Association\r\nmembership and the State of South Carolina, State Legislature, State, County\r\nand local agencies, and other organizations. · Work to obtain reductions in operating\r\nexpenses, such as group purchasing, for Association members. · Produce a newsletter, and other materials,\r\nto share information among Association members. · Produce and distribute an Association\r\nDirectory of members. Article II  Membership Section 1:     Members Any person(s):  (1) Who owns and operates\r\na Bed & Breakfast enterprise within the State of South Carolina (hereinafter\r\nreferred to as an innkeeper) and who meets the standards for Full Membership\r\nestablished in these By-Laws; or, (2) meets the standards for Associate\r\nMembership established in these By-Laws, who follows the procedures for\r\napplying and pays the appropriate dues, shall be eligible for membership\r\nin the Association. No applicant innkeeper shall be denied membership\r\nor be otherwise discriminated against in any way because of his or her\r\nrace, religion, sex, martial status, sexual preference, age, national origin\r\nor handicap.  The Association shall comply in full the Revised Code\r\nof South Carolina, Law Against Discrimination, and all corresponding\r\nfederal statues. Membership shall be held in the name of the Bed and Breakfast\r\nor Inn (hereinafter referred to as Inn or B&B).  Certain exceptions\r\nto this definition are defined elsewhere in these By-Laws. Section 2:     Membership\r\nshall be classified as follows: a)  Full Membership Those B & Bs and RSO (Reservation Service\r\nOrganizations) that meet the criteria for Full Membership, have completed\r\nand submitted all requested applications materials, and have currently\r\npaid dues shall be granted Full Membership.  These members shall: 1)   Have voting rights (one per B&B); 2)   Be  listed in the SCBBA directories,\r\nprint and/or internet, of approved B&Bs  and Inns 3)    Be entitled to use the Association Emblem within defined\r\nguidelines; 4)    Receive newsletters and other Association printed\r\nmatter; 5)    Be entitled to member discounts, if applicable, at\r\nAssociation sponsored conferences, meetings and workshops; 6)    Receive any available group health, property and business\r\nliability insurance rates; 7)    Be entitled to any group purchasing discount obtained\r\nthrough the Association; and, 8)    Be entitled to all such other benefits as may be provided\r\nby the Association. b)  Associate Membership Those B&Bs and other organizations and individuals\r\nthat qualify for Associate Membership, as hereinafter outlined, have completed\r\nand submitted all requested application materials, and have currently paid\r\ndues shall be granted Associate Membership.  These members shall: 1)   Be entitled to use the Association\r\n(Associate Member) Emblem within defined guidelines. 2)   Receive newsletters and other\r\nAssociation printed matter: 3)   Be entitled to member discounts,\r\nif applicable, at Association sponsored conferences, meetings\r\nand workshops: 4)   Be entitled to all such other\r\nbenefits as may be provided for Associate Members by The Association,\r\nand, 5)   Associate Members shall not have\r\nvoting rights within the Association. c)  Ex-Officio Membership Recognizing the valuable contributions that\r\nmay be utilized to enhance the development and  range of services offered by the Association by such extension\r\nof this special membership level: The Board of Directors may, at their discretion,\r\nextend ex-officio membership status to selected individuals.  These members\r\nmay be invited to (1) participate in any meeting  of  the membership,\r\nBoard of Directors or Executive Committee as deemed appropriate by the\r\nmeeting chairperson, (2) assist in the work of the Association, (3) will\r\nnot have voting rights and (4) will not be assessed any dues or membership\r\nfees. Memberships shall be considered pending until\r\n(a) all materials are submitted as requested, (b) and evaluative site visit\r\nis conducted, as applicable, and (c) the Board of Directors approve such\r\nmemberships.  It is expected that pending members shall become full\r\nmembers within a period not to exceed six (6) months.  Memberships\r\nleft pending by the applicant B&B, for a period of six (6) months or\r\nmore shall be denied, unless the applicant submits a written request for\r\napproval by the Board of Directors prior to the six month period after\r\nreceipt of initial application. Section 3:     Membership\r\nMeetings a)  Annual Meeting An Annual Meeting of the membership shall be held\r\nin either January or  February of each year to discuss general Association\r\nbusiness, review annual reports, elect directors and officers for the upcoming\r\nyear, approve By-Law revisions, and approve the proposed budget and dues\r\nfor the year.  Notice of the annual meeting starting date, place and\r\nhour shall be delivered to the membership no earlier than sixty (60) days\r\nprior to or no less than thirty (30) days prior to the annual meeting. \r\nEach Full Member B&B shall be eligible to cast one vote or written\r\nballot at membership meetings.  A quorum at an Annual Meeting shall\r\nbe the number of members present. b)  Special Meetings Special Meetings of the membership may be called,\r\nshould the need arise, by the President, by order of the Board of Directors,\r\nor by the Secretary upon the written request of not less than twenty-five\r\n(25) members.  At the direction of the persons calling the meeting\r\nwritten notice of a special meeting shall be delivered to the membership\r\nnot less than fourteen (14) days prior to the meeting.  A quorum for\r\nSpecial Meetings shall be the number of members present. Section 4:   Dues a)   To provide funding for printing,\r\nmailings, meetings, and other Association activities throughout the year,  the membership shall\r\npay annual dues as recommended by the  Board of Directors, with the\r\nassistance of the Association Treasurer.  The proposed dues structure\r\nfor the upcoming year will be approved by the membership at the annual\r\nmeeting.  Dues statements will be mailed by the Treasurer at least\r\nsixty (60) days prior to the annual meeting.  Dues are payable thirty\r\n(30) days after the sttement date, but no later than the Annual Meeting. \r\nMemberships are effective from Annual Meeting to Annual Meeting. b)   Should a member fail to pay the Associations dues on time,\r\nthe Treasurer shall contact that  member for payment.  Failing that, the members\r\nname shall be given to the President, who shall make further contact with the member for payment. \r\nIf payment is not made within two weeks following contact by the President,\r\nthe members name shall be removed from the roster of members in good standing and all\r\ncurrent certificates of membership and SCBBA Emblems shall be surrendered by the\r\nterminated member. Section 5:   Complaints Against\r\nMembers Three or more complaints against a member\r\ninn, received from any source, in a twelve month period concerning standards covered by Association membership shall\r\nserve as cause for review by the Board of Directors for possible action. Section 6:   Termination In the event that a member no longer meets\r\nthe standards for membership, does not meet its financial obligations to the Association, or otherwise is felt by a\r\nmajority of the Board of Directors to be detrimental to or at odds with the purpose of\r\nthe Association, such member may be removed from the roster of members in good standing Memberships may also be terminated by written resignation of the member\r\nat any time. In either event any dues paid will not be refunded.  Current certificates\r\nof membership and SCBBA Emblems will be surrendered by the terminated member. A member being considered for termination of membership,\r\nfor reasons other than failure to submit dues, shall be given the opportunity\r\nto appear in person before the Board of Directors before such determination\r\nof termination is made.  In the event the Board of Directors considers\r\nsuch termination of a member, such member shall be notified of a meeting\r\ndate no less than sixty (60) days prior to such meeting.  The member\r\nbeing considered for termination shall make a written request to appear\r\nat such meeting no less than thirty (30) days of the scheduled meeting\r\ndate.  When feasible, a mutually agreed upon meeting date should be\r\nscheduled, however, such meeting date will be set at the sole discretion\r\nof the Board of Directors. Article III  Board of Directors Section 1:   Nominations There shall be a minimum of TEN (10) and a maximum\r\nof  NINETEEN (19) members of the Board of Directors of the association,\r\nall of whom shall be elected at an Annual Membership Meeting and shall\r\nbe valid members of the Association.  There shall be the officers\r\nof the Board and up to FOURTEEN (14) directors, representing the official\r\nstate PRT districts.  Each Director shall represent no more than 20\r\nSCBBA members. Board membership is to be predominately filled by full member\r\nBed and Breakfasts innkeepers; therefore, no more than two (2) full member\r\nHistoric Inn/Hotel innkeepers may serve on the board at a time. \r\nA Nominating committee selected from the Board of Directors shall present\r\na slate of nominees or officers and additional directors to the membership\r\nat least (30) days prior to the annual meeting.  Nominations may also\r\nbe made in writing to the Nominating Committee with the written agreement\r\nof the nominee, qualifications for nomination and accompanied by signatures\r\nof three members of the Association at least thirty (30) days prior to\r\nthe annual meeting. Nominations will also be solicited from the general\r\nmembership via the Association newsletter or other general mailing to the\r\nmembership.  No nominations will be accepted from the floor at the\r\nAnnual Meeting. The Nominating Committee shall consider geographical\r\nrepresentation, population density, time for and interest in the governance\r\nof the Association, and needed skills in choosing candidates for the slate\r\nto be presented to the members. All candidates shall be contacted by the Nominating\r\nCommittee and must signify, in writing, their willingness to serve before\r\nthe Nomination Slate is submitted to the membership. Section 2:   Elections The membership shall elect a President,\r\n1st Vice-President, 2nd Vice-President, Secretary, Treasurer and additional directors to a maximum\r\nof fourteen (14) on the proposed slate.  Any director, either elected\r\nor appointed, may be removed from the Board of Directors or office by a\r\ntwo-thirds vote of the membership at an annual meeting or special meeting\r\ncalled for this purpose.  The outgoing President will be a member\r\nof the Board of Directors for one year immediately following his or her\r\nterm of office. Section 3:   Term of Office The term of office for directors and officers\r\nshall be two (2) years.  Directors shall serve on a staggered term\r\nbasis, with approximately one-half of the total number of directors being\r\nelected annually, and may be re-elected for an addition tern or terms. \r\nOfficers shall serve concurrently and may not serve more that two consecutive\r\nterms (total of four years) in any one officer position. Vacancies for an unexpired term or unfilled positions\r\non the Board of Directors may be, but are not required to be, except in\r\nthe case of officers, filled by the Board of Directors as long as there\r\nare no less than five current directors. In the event that the position\r\nof an officer becomes vacant, an Association Member, preferably an existing\r\ndirector, shall be elected by the Board of Directors at the next scheduled\r\nquarterly meeting to fill the position until the next Annual Meeting election\r\nof directors and officers. Section 4:   Meetings Meetings of the Board of Directors shall be held\r\nquarterly. These meetings are for the purpose of conducting business where\r\na vote of the general membership is not required.  A quorum for a\r\nBoard meeting shall be 50% or more of the current number of directors and\r\nofficers. A schedule of the quarterly meetings shall be\r\nmade available to the general membership in some appropriate form once\r\neach year.  No further notice is necessary unless the meeting schedule\r\nchanges. Board meetings are open to the general membership. \r\nAny Association Member may ask to be scheduled on the agenda at any board\r\nmeeting. At open meetings of the Board, general Association\r\nmembers may not participate unless a prior request to speak to a specific\r\nagenda item has been received by the Secretary. In no circumstance shall a general Association\r\nmember vote on any Board action. Section 5:   Voting Each Director on the Board of Directors shall\r\nhave one vote.  In the event of tie votes, the President shall vote or abstain from voting as\r\nneeded to break the tie. Section 6:   Attendance Each regional director and officer shall attend\r\nall regular meetings of the Association.  The reason for a planned\r\nabsence from any Board or general meeting must be submitted to the President\r\nor the Presidents designate before the beginning of each meeting. \r\nThe reason for an unplanned absence must be submitted no later than on\r\nweek after the missed meeting.  The Executive Board will review the\r\nreasons for absence and declare each absence either acceptable or unacceptable. Section 7:   Removal from Office In addition to other provisions of the By-Laws\r\n(Article III, Section 2), any officer or regional director may be removed\r\nfrom office for any of the following causes: a)   Failure to attend, without\r\nacceptable reason as determined by the Executive Board, two (2)\r\nconsecutive regular of special Board meetings or assigned committee meetings\r\nwithin any twelve (12) month period.   Removal for this cause will be\r\neffective when the Executive Board rules the second absence unacceptable. \r\nThe Board of Directors will consider a resignation to have been tendered\r\nand accepted. b)   Failure to fulfill the responsibility\r\nof the position as specified in the By-Laws. Removal for this\r\ncause must be determined by a 2/3 vote of the entire Board of Directors. c)   Wrongdoing or misconduct in handling\r\nAssociation affairs.  Removal for this cause must\r\nbe determined by a 2/3 vote of the entire Board of Directors Any officer or regional representative who is\r\nto be considered for removal due to causes identified in item b) or c)\r\nof this Section shall be entitled to: · Ten (10) days advance notice by mail\r\nof the proposed removal.  Such  notice must state the meeting\r\ntime and place at which such removal is to be voted upon by the Board of\r\nDirectors. · Appear before and be heard at the meeting\r\nof the Board of Directors where removal is considered. Article IV Duties of the Officers and Regional Directors Section 1: President The President shall preside over all meetings\r\nof the Association; shall have general and active management of the affairs of the Association and shall see that\r\nthe provisions of the annual budget and resolution voted\r\nby the membership or Board of Directors are carried out. The President shall appoint members of standing\r\ncommittees of the Board except the Executive Committee and the Nominating\r\nCommittee which is appointed by the Board of Directors. Section 2:  1st Vice-President The 1st Vice-President shall have the authority\r\nand responsibilities of the President in the Presidents absence. \r\nIt shall be the responsibility of this individual to attend all regular\r\nmeeting of the Association and to represent the Association throughout\r\nthe State, as the Associations business may require at the direction of\r\nthe President.  This individual will be responsible for membership\r\nof the association, both membership renewals and processing new member\r\napplications.  He/She is also responsible for By-Law revisions and\r\nmay be appointed as an ex-officio, voting member of those committees, as\r\ndeemed necessary by the President. Section 3: 2nd Vice-President The 2nd Vice-President shall have the authority\r\nand responsibility for insuring the inspection policies of the Association\r\nare followed and to recommend to the board any changes that are felt necessary. \r\nIt shall also be the responsibility of this individual to attend all regular\r\nmeeting of the Association and to represent the Association throughout\r\nthe state, as the Associations business may require at the direction of\r\nthe President.  He/She may be appointed as an ex-officio, voting member\r\nof those committees as deemed necessary by the President. Section  4: Secretary: The Secretary shall attend all meetings of the\r\nBoard of Directors and shall record all true minutes of each meeting and\r\nkeep them in good order.  Minutes of all meetings shall be available\r\nfor review by Association members with reasonable notice given for their\r\nperusal.  The Secretary shall also maintain membership roster with\r\nthe help of the membership Vice-President, and shall chair the Nominating\r\nCommittee which prepares the slate of nominees for the Annual Membership\r\nMeeting. The Secretary shall write and mail all meeting notices and correspondence\r\nfrom the board, and shall maintain all mailing lists.  The secretary\r\nshall be responsible for dissemination of the quarterly association newsletter\r\nand general membership announcements.  When possible, minutes or a\r\nsummary of Association Board meetings shall be included in any newsletter\r\nsent to the general membership. Section  5: Treasurer The Treasurer shall have custody of all Association\r\nfunds and shall keep complete and accurate receipts and disbursement records,\r\nas well as deposit all monies and other assets in the name of the Association,\r\nusing the services of a bank as designated by the Board of Directors. \r\nThe Treasurer shall provide all such records to the Association and shall\r\nreport the financial status of the Association to the Board of Directors\r\nquarterly and to the membership at the Annual Meeting. Each year prior to the Annual Meeting, the Treasurer\r\nshall prepare an annual budget with the direction of the Board of Directors. \r\nThis budget shall include the annual dues figures for the following year\r\nto be approved at the Annual Meeting.  The Treasurer shall mail out\r\ndues notices not later than November 1st for the following year. \r\nA roster of members with paid up dues will be those members listed in the\r\nannual directory and on the Associations website. Section   6: Regional Directors Each regional director shall be responsible for\r\ncommunications with the Association members in the representatives designated\r\narea.  It is the responsibility of each Regional Director to disseminate\r\nAssociation information to the designated Association members and to represent\r\ntheir interests at meetings of the Board of Directors. Specific job responsibilities shall be identified\r\nin an Association document titled Job Duties for a Regional Director. Article V - Committees Section  1: Executive Committee There shall be an Executive Committee which will\r\nconsist of the five officers of the Board of Directors as voting members\r\nand which may include the immediate Past President as an ex-officio, non\r\nvoting member.  The Executive committee shall have, and exercise\r\nin the intervals between meetings of the Board of Directors, all the powers\r\nof the board which may lawfully be delegated in the management of the business\r\nand affairs of the Association. Three voting members of the Executive committee\r\nshall constitute a quorum.  It shall meet at the call of the President. \r\nThe Secretary of the Association, or in his/her absence, a secretary pro-tempored\r\nchosen by the Executive Committee, shall keep a true record of all its\r\nproceedings.  Such records of these meetings shall always be received\r\nand approved by the Board of Directors. Section   2:  Committee Appointments\r\n& Minutes The President of the Board shall appoint all committees,\r\nexcept the Executive Committee, which is composed of the elected officers\r\nand the Nominating Committee which is appointed by the Board of Directors. \r\nSummary minutes of all committee meetings and work sessions shall be kept\r\nfor the record and filed with the Secretary within one (1) month of a given\r\ncommittee meeting or work session. Standing committees shall include one or more\r\ndirectors and may include members of the Association who are not directors. Section  3: Nominating Committee The Secretary shall serve as the chairperson of\r\nthe Nominating Committee, which shall represent all geographical areas\r\nin South Carolina.  Two additional members of this committee shall\r\nbe selected from the Board of Directors each year.  These members\r\nshould be selected at the prior Annual Meeting. Article VI  Reports Section 1: Fiscal Year The fiscal year shall begin on the first\r\nday of March and shall end on the last day of February. Section 2:    Financial Report A written Financial Report, based on the Treasurers\r\naudited accounts, shall be presented to the membership at the Annual Meeting. \r\nThe indicated audit shall be conducted by three current directors prior\r\nto the Annual Meeting. Section 3: Presidents Report The president shall present an annual oral and\r\nmake available a written report to the membership reviewing the year ended\r\nand make such forecast for the coming year as may seem reasonable. Section  4: Annual Budget A proposed annual budget shall be submitted to\r\nthe Board of Directors by the Treasurer at a meeting prior to the Annual\r\nMeeting for action by the membership at the Annual Meeting.  This\r\nshall include proposed dues figures for the coming year. Section  5: By-Laws Revision Any proposed revision of the By-Laws shall also\r\nbe submitted to the Board of Directors by an ad hoc committee established\r\nfor this purpose sixty (60) days prior to the Annual Membership Meeting\r\nfor action by the members. Section  6: Proposed Slate of Officers and\r\nDirectors A proposed slate of officers and directors for\r\nthe coming year shall be presented by the Nominating Committee to the Board\r\nof Directors sixty (60) days prior to the Annual Membership Meeting for\r\naction by the members. Article VII Execution of Instruments Section  1: Drafts, Checks and Orders All drafts and checks shall be drawn on an Association\r\naccount by the Treasurer via an authorized Check Requisition Form signed\r\nby the President prior to payment. Section  2: Execution of Contracts The President may execute any contract, conveyance\r\nor other instrument on behalf of the Association with the prior approval\r\nof the Board of Directors.  Such approval may be in the form of an\r\napproved budget item, a resolution voted approval at a membership meeting,\r\nor other authority that lies within the provisions of these By-Laws Section  3: Association Obligations and Loans No one officer or agent of the Association\r\nshall have the authority to obligate the Association for more than $200 in excess of a\r\nbudget line item without prior approval of the Board of Directors. No loans shall be made using Association funds\r\nand no evidence of indebtedness shall be issued in its name unless authorized\r\nby a vote of the membership as noted above.  All obligations must\r\nhave approval of at least one director, one member of the board, and the\r\nPresident. Article VIII By-Laws Amendments Section  1: Amendment Process These By-Laws may be amended or other By-Laws\r\nadopted by the written approval of two-thirds of the members present at\r\nthe Annual Meeting, or by approval of two-thirds of the full membership\r\non a mail-in ballot at times other than the Annual Meeting. Section   2:    By-Laws\r\nCommittee The 1st Vice-President will chair the ad-hoc By-Laws\r\nCommittee formed prior to the Annual Meeting each year.  Written requests\r\nfor By-Laws revisions will be received by the Vice-President and the By-Laws\r\nCommittee who will consider revisions to be presented at the Annual Meeting. Article IX Distribution of Assets on Dissolution No member, director or officer of the Association,\r\nnor any private individual, shall be entitled to share in the distribution\r\nof any of the assets of the Association upon dissolution of the Association. Upon dissolution, all the remaining assets of\r\nthe Association shall be distributed by the Board of Directors for identical\r\nuses and purposes to any other organization which would then qualify as\r\na similar non-profit hospitality association.  Any such assets not\r\nso disposed of, shall be disposed of by the Superior Court of the county\r\nin which the principal office of the Association is then located to any\r\nsuch organization which is operated as a non-profit hospitality association. Article X Idemnification of Directors and Officers Each director or officer now or hereafter serving\r\nthe Association, and each person who at the request of or on behalf of\r\nthe Association is now serving or hereafter serves as trustee, director\r\nor officer of any other association, whether for profit or not for profit,\r\nshall be indemnified by the Association against expenses actually and necessarily\r\nincurred by him/her in connection with the defense of any action, suit\r\nor proceeding in which he/she is made a party by reason of being or having\r\nbeen such director or officer. Appendix A These Appendices, SCBBA Full Membership Criteria\r\nand Associate Membership Criteria are herein incorporated under the provisions\r\nof these By-Laws. Appendix B Membership Application Procedure 1. Prospective members shall submit a written\r\napplication which includes: a) A non-refundable application of twenty-five\r\ndollars ($25.00) which shall be part of the Membership Dues submitted with\r\nthe application. b) As appropriate and if requested, photocopies\r\nof the B&Bs licenses and certificates. c) Permission for an initial and annual evaluative\r\nsite visit, by virtue of submission of an application or renewal application,\r\nfor an SCBBA Site Visit Team. d) Verification that B&B maintains appropriate\r\ncommercial insurance, including property and liability coverage, as lodging\r\nproperty. e) A photograph/s of B&Bs exterior (optional\r\ninterior photographs). f) A line drawing/illustration of the B&B.\r\n(optional). g) Five (5) brochures and rate cards/sheets. h) An up-to-date Data Form on file with the SCBBA. 2. On receipt of the application, the membership\r\nchairperson shall advise the appointed Site Visit Team of the needed site\r\nvisit.  This team shall, without delay, arrange a visit to the applicants\r\nB&B.  The inspection shall cover all standards for membership. 3. The application and report of findings from\r\nthe Site Visit Ream shall be reviewed and voted upon by the Board of Directors\r\nwith acceptance by a simple majority vote.  The applicant shall be\r\nnotified of the findings of the site inspection and the result of the vote. 4. Membership Expired or Lapsed: Memberships lapsed for one year or more will necessitate\r\nreapplication and inspection, with all required fees payable at time of\r\napplication. Articles I through III of this document prevail\r\nupon acceptance of the application by the Association or its representatives. 5.  Membership Transfer/Extension: In order for a member Inn to be eligible for membership\r\ntransfer or extension in the event of sale of the property: a) Property must closes in the first six months\r\nof the SCBBA fiscal year.  After that, new membership rules apply. b) Member inn must notify Association President\r\nand/or the Association Board of Directors of sale and closing date. c) Association President or Board of Directors\r\nwill submit letter defining criteria and rules for transfer to be presented\r\nto new owner at or shortly after the time of sale. d) All dues paid by original owner shall be considered\r\npayment for the fiscal year. e) New owner must submit application and fees,\r\nas appropriate, within 60 days of property closing, along with copies of\r\nall applicable licenses, zoning, inspections, etc., as required of new\r\nmembers. f) During the application period, the new owner\r\nwill be considered a pending member with all such privileges and restrictions\r\nentitled under that classification. Appendix C SCBBA Membership Renewal Membership renewal will be via submission\r\nof a renewal application, verification of appropriate commercial insurance, including property and\r\nliability coverage, as a lodging property, copies of new printed material\r\nand revised Date information, if applicable, and membership dues. \r\nAn annual evaluative site visit with a report to the Board of Directors\r\nfor membership renewal approval will complete the renewal process. Appendix D The address and telephone number of the South\r\nCarolina Bed & Breakfast Association is: South Carolina Bed & Breakfast Association PO Box 2020 Georgetown, SC 29442 Telephone 1-888-599-1234 URL: www.southcarolinabedandbreakfast.com -end-"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" U-Include=\"navigation-bottom.htm\" TAG=\"BODY\" startspan Find an Inn | Gift Certificates | Specials | Site | Directory | Membership Info | Associates | Links | Contact Us | Home webbot bot=\"Include\" i-checksum=\"12196\" endspan webbot bot=\"Include\" U-Include=\"footer.htm\" TAG=\"BODY\" startspan"
    },
    {
      "tag": "p",
      "text": "2006 South Carolina Bed & \r\nBreakfast Association PMB 307, 10120 Two Notch Road Suite 2 Columbia, South Carolina 29223 Email Us Site by AMS Web Services START OF WEBTRENDS LIVE TAG Copyright 2002 NetIQ Corporation For privacy concerns, check our Privacy Policy at http://www.webtrendslive.com/wtl_system/privacy_policy.htm END OF WEBTRENDS LIVE TAG webbot bot=\"Include\" i-checksum=\"13114\" endspan"
    }
  ]
}