{
  "url": "http://www.sphere.bc.ca/test/srbooks.html",
  "content_hash": "64e7972dc21de965fdcb5080dbf6ee25ede4947a23cdf9463ac6c97809e31de7",
  "total_blocks": 437,
  "retained_blocks": 76,
  "ignored_blocks": 361,
  "blocks": [
    {
      "tag": "div",
      "text": "This document was created with HomeSite v2.5 HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\" Welcome To The Sphere Research Slide Rule Site ! Slide Rule Books From K+E, Hemmi, POST, Faber-Castell and Others Updated May 29, 2006 Click REFRESH on your browser if pages seem unchanged Visit our amazing document server. Everything from Quotes and SciFi to Ethics. CLICK for WHAT's NEW Sphere Research Corporation 3394 Sunnyside Rd. Kelowna, BC, Canada V1Z 2V4 Phone: +1 (250) 769-1834 FAX: +1 (250) 769-4106 A great source for test equipment, repairs, calibrations,  useful metrology information, and of course, SLIDE RULES! JUST SCROLL DOWN TO SEE EVERYTHING The Slide Rule Universe Click to VISIT or RETURN Click Here To go back to the Slide Rule Marketplace Marketplace Navigation Go to the Auction Page Slide Rule Books Go to the Cheap Slide Rules Go to the Circular Slide Rules Go to the -NEW- Drawing & Measuring Tools Go to the Exotic Slide Rules Marketplace Navigation Go to the Full Sized Slide Rules Go to the New In The Box Slide Rules Go to the New-In-Box Pickett Slide Rules Go to the -NEW- Pins and Tie Clip Slide Rules Go to the Pocket Slide Rules Go to the -NEW- Slide Rule Cases Go to the Slide Rule Parts Marketplace Navigation ORIGINAL SLIDE RULE BOOKS & MANUALS Skip the INTRO, Go RIGHT to the CATALOG! To make your life easier, and help you find exactly what you want , we have broken the on-line slide rule catalogs into smaller sections. Just CLICK on the icon of the rule type you are looking for at the left , to see the matching catalog.  Large graphical catalogs are a bit SLOW , please give them time to load."
    },
    {
      "tag": "p",
      "text": "You can order anything here just by picking up the phone, and calling (250) 769-1834 during normal office hours, 8am to 5pm, PST .  We process VISA/MC orders immediately.  You can also send your order by FAX at: (250) 769-4106.  New Canada ExpressPost Rates, shipping and packing minimum of US$18/C$23 for any insured air shipment up to 1kg."
    },
    {
      "tag": "div",
      "text": "We have been lucky to find a wide variety of original slide rule manuals and hardcover books from all over the world. We have POST, K+E, Faber-Castell, and Hemmi manuals, plus some very useful general books to help you get the best value out of your favorite slide rule."
    },
    {
      "tag": "p",
      "text": "We have quite a bit of trouble finding good copies, especially of K+E hardcovers, and we can't always ensure we have all of these in stock, as locating them is a bit of a hit-and-miss thing.  What we have changes every month, so check this page regularly if you are looking for something you don't see today."
    },
    {
      "tag": "div",
      "text": "We accept Visa/MC or Int'l MO for orders. If we have your valid data on file, you can just click on the ORDER email link to place an order and indicate your approval to bill, and we will do the rest. If this is the first time you have dealt with us, you can phone (250) 769-1834 or FAX (250) 769-4106 the billing info, or send it by the email link, as you prefer. Personal checks have to clear before shipment."
    },
    {
      "tag": "p",
      "text": "The CATALOG will appear below shortly!"
    },
    {
      "tag": "div",
      "text": "CATALOG: JUST SCROLL DOWN TO SEE EVERYTHING ! Oughtred Society Slide Rule Reference Manual, Now In Stock and Available! The long-awaited OS Slide Rule Reference Manuals are NOW IN STOCK! CLICK HERE to see all the details! Limited first edition run of only 1,000 copies, have a look and order your copy while they last. An incredible, richly illustrated book, not to be missed! Ideal for beginners right through experienced collectors and operators. Cost is US$35 each, plus US$6 for regular airmail letter post shipping to the USA and Canada (uninsured envelope). US$18 for expresspost (insured) delivery, up to 3 copies. NOW IN STOCK! CLICK TO ORDER IMMEDIATELY by EMAIL USED SLIDE RULE BOOKS FOR SALE TITLE / PRICE DESCRIPTION QTY. IMAGE Faber Castell Stabrechnen mit Non-Duplex 2/83N und Duplex 2/82N S. Petry"
    },
    {
      "tag": "p",
      "text": "US$125"
    },
    {
      "tag": "div",
      "text": "NEW, MINT CONDITION! Copyright 1970, soft cover binding, BRAND NEW! . 118 pages with index , The definitive manual for the Faber Castell 2/83N and 2/82N duplex rules, in German. An exhaustive tour of every feature, complete with practice problems, a very rare volume, in perfect shape. 16 Chapters SORRY, SOLD Stabrechnen mit Non-Duplex 2/83N und Duplex 2/82N, Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Reinhold Nomography and Empirical Equations (2nd Edition) Dale S. Davis"
    },
    {
      "tag": "p",
      "text": "US$95"
    },
    {
      "tag": "div",
      "text": "Copyright 1962, second edition, hard cover binding, ex-library book . 261 pages with index , an exhaustive explanation of how nomographs, slide rules and visual mathematical tools are designed and made. Very good condition (library marks), includes original dust jacket. A fascinating book (for the math minded) that explains how to make everything from adding and subtracting charts to complex function slide rules and guides from raw data. Table of contents HERE and HERE . 12 Chapters and Log tables Just 1 Nomography and Empirical Equations Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE McGraw-Hill Nomography and Empirical Equations (1st Edition) Dale S. Davis"
    },
    {
      "tag": "p",
      "text": "US$69"
    },
    {
      "tag": "div",
      "text": "Copyright 1943, first edition, hard cover binding. . 200 pages with index , the original explanation of how nomographs, slide rules and visual mathematical tools are designed and made. Very good condition copies, black cloth bound with gold trim. A fascinating book (for the math minded) that explains how to make everything from adding and subtracting charts to complex function slide rules and guides from raw data. Table of contents HERE and HERE . 10 Chapters and Log tables Have 3 1943 Nomography and Empirical Equations Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Wm. C. Brown Slide Rule C. L. Johnston"
    },
    {
      "tag": "p",
      "text": "US$35"
    },
    {
      "tag": "div",
      "text": "Copyright 1960, soft cover spiral binding,well used . 110 pages with index , a self-study or classroom workbook for learning slide rule operation. Study material and practice problems , some marks from pervious owner, but very usable. Covers operation all the way to Log Log scales, and has an answer guide to the practice problems. 15 Chapters and index Just 1 Slide Rule, Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Hayden Using the Slide Rule in Electronic Technology Charles Alvarez"
    },
    {
      "tag": "p",
      "text": "US$65"
    },
    {
      "tag": "div",
      "text": "Copyright 1962, soft cover binding, programmed tutorial book with extensive illustrated lessons and examples, practice problems with answers, 108 pges with index , useful for all rules, used K+E rules for examples, explains inductance, parallel/series circuits, transformers, RC circuits, phase angle, etc. Ideal for self-instruction. Very good condition, unmarked. Hard for us to find. 20 Chapters SORRY, SOLD Using the Slide Rule in Electronic Technology Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Log Log Duplex Decitrig"
    },
    {
      "tag": "p",
      "text": "US$59"
    },
    {
      "tag": "div",
      "text": "K&E softbound instruction book, 68-2047/4187S/4081 factory number , 126 pages, very similar to hardbound book. ©1943, 1945, 1947, 1955, very informative for all K+E rules except the final Deci-lon rules. Excellent for 4081, 4181 as well as less complex rules.   Supports SRT and DI equipped 21 scale rules.  Very good condition.  By Kells, Kern and Bland. 6 Chapters. Have 1 K&E Log Log Duplex Decitrig Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Log Log Duplex Decitrig"
    },
    {
      "tag": "p",
      "text": "US$49"
    },
    {
      "tag": "div",
      "text": "K&E softbound instruction book, No. 4081 factory number , 101 pages (plus 1 catalog page), similar to hardbound book. ©1943, very informative for all K+E rules except the final Deci-lon rules. Excellent for early 4081 rules with alternate log log scale sets (20 scales). as well as less complex rules.   Generally very good condition, but this is a  used copy, and will have some minor marks or names inside/outside. These are the early salmon covers. By Kells, Kern and Bland. 6 Chapters. Have 2 K&E Log Log Duplex Decitrig Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Polyphase Slide Rules"
    },
    {
      "tag": "p",
      "text": "US$39"
    },
    {
      "tag": "div",
      "text": "K&E softbound instruction book, for the N4053 as well as most less complex mannheim rules, 85 pages.  Have two types, ©1938 and 1925, includes a brief catalog at the end.   Self-teaching manual with problems and answers.  Generally good condition, but this is a  used copy, and will have some minor marks or names inside/outside. By William Breckenridge, salmon cover. 8 Chapters. Just 1 K&E N4053 Mannheim Slide Rules Like this book? CLICK TO ORDER K&E Mannheim Slide Rules"
    },
    {
      "tag": "p",
      "text": "US$39"
    },
    {
      "tag": "div",
      "text": "K&E softbound instruction book, for the 4031, 4035, 4041, 4045, 4051, 4055, 4056,  and 4058  rules , 77 pages. ©1938 (sometimes earlier copies), includes a brief catalog at the end.   Self-teaching manual with a historical addition at the end.  Generally very good condition, but this is a  used copy, and will have some minor marks or names inside/outside. By William Breckenridge. 8 Chapters. Just 1 K&E Mannheim Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Log & Trig Tables"
    },
    {
      "tag": "p",
      "text": "US$49"
    },
    {
      "tag": "div",
      "text": "5 Place Log and Trig tables . Softbound reference book, 118 pages, VG/excellent condition. ©1935, very informative and useful. Prepared by Kells, Kern and Bland of slide rule manual fame. From McGraw-Hill. 3 Chapters. Just 1 Log and Trig Tables Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE International Textbook Company Trigonometry - Slide Rule Mechanics ICS Staff"
    },
    {
      "tag": "p",
      "text": "US$95"
    },
    {
      "tag": "div",
      "text": "Copyright 1936 and 1939,  small format hardbound This book has everything from the design and construction of rules to fold out illustrations, detailed scale explanations and instructions, plus tables, trig functions, and much more... Covers early wood rules right up to circulars. Part of a series by ITC, these beautiful, small format leather-bound books are packed with information, and very well thought out.  Ideal for self-instruction and reference, well illustrated and written, contains the 84 pages published individually as \"The Slide Rule\", plus 55 pages on Trigonometry, plus 29 pages on mechanics and machine elements . Excellent condition, a nearly mint copy. Difficult for us to find at any price, we have been out of stock almost a year. An exceptional reference book. 3 Books in one SORRY, SOLD Trigonometry - Slide Rule Mechanics Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE McGraw Hill Basic Slide Rule Operation (a program for self-instruction)"
    },
    {
      "tag": "p",
      "text": "W. S. Mittelstadt US$65"
    },
    {
      "tag": "div",
      "text": "A spiral softbound instruction book , for self-teaching slide rule operation. Much better condition than illustrated, very good. Uses K+E rules for illustration, covers all levels of operation, heavily illustrated, and well thought out, but has no answers to the problems posed. Copyright 1964. 161 pages. Just 1 Basic Slide Rule Operation Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Unifact Book Simplifying the Slide Rule"
    },
    {
      "tag": "p",
      "text": "Robert W. Marks US$19"
    },
    {
      "tag": "div",
      "text": "A softcover programmed self-instruction book , uses K+E rules for illustrations, but applies generally. Covers standard scales and trig operations (no LL scales), has answer guide for each quiz section, well thought out. Copyright 1964. Very Good condition. 139 pages. SORRY, SOLD Simplifying the Slide Rule Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Prentice Hall The Complete Slide Rule Handbook Joseph Norman Arnold"
    },
    {
      "tag": "p",
      "text": "US$59"
    },
    {
      "tag": "div",
      "text": "Copyright 1954,  softbound tutorial manual This book has extensive problems, examples and rule setting techniques, and an answer guide, 206 pages . Well thought out tutorial manual, uses K+E, POST and Pickett illustrations.  Ideal for self-instruction, well illustrated and written. Good condition, but some marks inside and on the front cover. 7 Chapters. SORRY, SOLD The Complete Slide Rule Handbook Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE TutorText The Slide Rule Saffold & Smalley"
    },
    {
      "tag": "p",
      "text": "US$95"
    },
    {
      "tag": "div",
      "text": "Copyright 1962, hardbound programmed tutorial book with extensive lessons and examples, practice problems with answers and error guide, 468 pages plus index , informative and useful for all rules. Ideal for unsupervised self-instruction. Very Good condition BUT NO dusk jacket unlike the pciture. One of my favorite slide rule self-instruction books, I used this myself when I was in jr. high school. Have one without dust jacket. 9 Chapters. SORRY, SOLD The Slide Rule Tutortext Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Slide Rules Jetlog and Decitrig, An Instruction Manual"
    },
    {
      "tag": "p",
      "text": "US$69"
    },
    {
      "tag": "div",
      "text": "The original K&E hardbound instruction book, 126 pages, see our review on the Slide Rule Universe of the later edition. ©1955, very informative for all rules except the final Deci-lon rules. Excellent for 4081, 4181 as well as less complex rules. We get this in two versions, a green colored cover (titled K+E Slide Rules, A self-Instruction Manual) and a tan colored cover with the Jetlog title, but the contents are the same .  Generally very good condition, but these are used copies, and may have some minor marks or names inside.  By Kells, Kern and Bland. 6 Chapters. Have 2 Early and 3 Late Hardbound! K&E Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Slide Rules Deci-Lon, An Instruction Manual"
    },
    {
      "tag": "p",
      "text": "US$79"
    },
    {
      "tag": "div",
      "text": "Back again! The most popular and complete K&E hardbound book, 186 pages, see our review on the Slide Rule Universe. ©1962, very informative for all rules, including the final Deci-lon rules. An outstanding slide rule reference, and very hard to find! This comes in both green and aqua colored covers. Very good condition, some minor marks. 7 Chapters. Email for stock check Hardbound! CLICK for REVIEW K&E Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE K&E Slide Rules Deci-Lon, An Instruction Manual SOFTBOUND!"
    },
    {
      "tag": "p",
      "text": "US$69"
    },
    {
      "tag": "div",
      "text": "Unusual Copy! The most popular and complete K&E book, 186 pages, see our review on the Slide Rule Universe. ©1962, very informative for all rules, including the final Deci-lon rules. An outstanding slide rule reference, and very hard to find! I have never seen a copy before this one, it's the hardbound book in softcover format , probably came with the very last production rules. 7 Chapters. SORRY, SOLD Softbound! CLICK for REVIEW K&E Slide Rules Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Bishop Slide Rule and How to Use It"
    },
    {
      "tag": "p",
      "text": "US$25"
    },
    {
      "tag": "div",
      "text": "Barnes and Noble softbound instruction book, for  mannheim, polyphase, trig and log log duplex rules , 149 pages, ©1955, 3rd edition.   Self-teaching manual with problems and answers, excellent illustrated explanations of many different rule styles.  Unusually useful for many rules. Very Good condition. By Calvin C. Bishop. 149 pages. SORRY, SOLD Bishop - Slide Rule and how to use it Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE POST VERSALOG Slide Rule Instructions"
    },
    {
      "tag": "p",
      "text": "US$65"
    },
    {
      "tag": "div",
      "text": "The most popular and complete POST hardbound book, very good condition."
    },
    {
      "tag": "p",
      "text": "The ORIGINAL edition (1951) back in stock (pic shown is the 1963 cover). The definitive POST reference for slide rules."
    },
    {
      "tag": "div",
      "text": "10 Chapters. Back again! ORIGINAL 1951 EDITION in stock! 3 Original 1 Later Hardbound! CLICK for REVIEW POST VERSALOG Slide Rule Instruction Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE POST VERSALOG II Slide Rule Instructions"
    },
    {
      "tag": "p",
      "text": "US$95"
    },
    {
      "tag": "div",
      "text": "The final POST softbound book for the Versalog II, very good condition, no names or other markings. Includes info on the Versalog II added A scale."
    },
    {
      "tag": "p",
      "text": "Copyright 1970, 194 pages total, from Teledyne Post."
    },
    {
      "tag": "div",
      "text": "10 Chapters. Hard to Find! Just 1 POST VERSALOG II Slide Rule Instruction Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE POST VERSALOG Slide Rule Instructions"
    },
    {
      "tag": "p",
      "text": "US$75"
    },
    {
      "tag": "div",
      "text": "The most popular and complete Versalog hardbound book, this is the 1963 Canadian Hughes-Owens edition, an excellent versalog training book."
    },
    {
      "tag": "p",
      "text": "A very uncommon HO edition of this book. Has owner's name inside front cover, otherwise near mint condition."
    },
    {
      "tag": "div",
      "text": "10 Chapters. SORRY, SOLD Hardbound! CLICK for REVIEW HO VERSALOG Slide Rule Instruction Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE ATS SLIDE RULE Simplified C.O. Harris"
    },
    {
      "tag": "p",
      "text": "US$69"
    },
    {
      "tag": "div",
      "text": "American Technical Society hardbound book, 270 pages plus index, see our review on the Slide Rule Universe. Very infomative for all rules, extensive study guide and practice problems, a really useful self-study guide. Excellent condition, various different color covers, copyrights 1944 and later, tell us if you want a particular one. 14 Chapters. Just 1 Hardbound! CLICK for REVIEW Slide Rule Simplified Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE Chemical Rubber Publishing Co. Standard Mathematical Tables 10th Edition"
    },
    {
      "tag": "p",
      "text": "US$95"
    },
    {
      "tag": "div",
      "text": "Another classic CRC book, crammed with 441 pages of useful numerical tables, including 5 place logs, squares, cubes, roots, trig functions, elliptic and hyperbolic functions, interest and mortality rates. Hardbound , but small size, 5x8 inches. Easy to carry treasure trove of data. Some age related marks, old owner's name inside, but still wonderful! 10th Edition, copyright 1931 through 1955 SORRY, SOLD CRC Math Tables Like this book? CLICK TO ORDER TITLE / PRICE DESCRIPTION QTY. IMAGE"
    },
    {
      "tag": "p",
      "text": "Hemmi Bamboo Mannheim Rule Manual & Catalog US$40"
    },
    {
      "tag": "div",
      "text": "The original full length Hemmi softcover instruction book, 67 pages. Covers the operation of all Hemmi Bamboo Mannheim rules with illustrations. Includes a wonderful illustrated Hemmi catalog at the end, covering all types, including a fold out illustration of the 20\" rules.  These have some  cover marks and aging. The best known and most complete printed Hemmi reference on their rule family, copyright 1955, revised 1958. Excellent condition. 67 Pages Just 2 left We Finally Got Some more! Hemmi Bamboo Mannheim + Catalog (A) Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi 257 Chemical Rule Manual US$25"
    },
    {
      "tag": "div",
      "text": "The original shortform Hemmi softcover instruction book, 8 pages. Covers the operation of this sophisticated chemical rule with illustrations. These are in good condition. 8 Pages SOLD OUT, reprint avail. for $5 copy cost One of the hardest to find! Hemmi 257 shortform Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi 135 5\" Pocket Darmstadt Rule Manual US$20"
    },
    {
      "tag": "div",
      "text": "The original shortform Hemmi softcover instruction book, 6 pages. Covers the operation of this pocket rule with illustrations. These are in good condition, some cover marks. 6 Pages Just 1 Hemmi 135 shortform Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi 40RK/26405 Mannheim Rule Manual US$20"
    },
    {
      "tag": "div",
      "text": "The original shortform Hemmi softcover instruction book, 8 pages. Covers the operation of these two rules with illustrations. These are in good condition, some minor cover marks. 8 Pages Just 7 Hemmi 40RK/2640 shortform Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi P280/P281 Slide Rule Manual US$15"
    },
    {
      "tag": "div",
      "text": "The original shortform Hemmi softcover instruction booklet, 8 pages. Covers the operation of these two rules with illustrations, folds to fit inside the plastic rule case. These are in good condition, some cover marks from old labels. 8 Pages Just 4 Hemmi P280/P281 shortform Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi 149A Pocket Rule Manual US$25"
    },
    {
      "tag": "div",
      "text": "The revised Hemmi softcover instruction book, 48 pages. Covers the full operation of this sophisticated log log pocket rule (similar to the pocket versalog 1461) in detail, plus general care instructions. These are in the best condition of those received, minimal marks and aging. 8 Chapters. SORRY, SOLD Hemmi 149A (A grade) Like this book? CLICK TO ORDER"
    },
    {
      "tag": "p",
      "text": "Hemmi 149A Pocket Rule Manual US$20"
    },
    {
      "tag": "div",
      "text": "The revised Hemmi softcover instruction book, 48 pages. Covers the full operation of this sophisticated log log pocket rule (similar to the pocket versalog 1461) in detail, plus general care instructions. These have some cover marks and aging. 8 Chapters. Just 4 Hemmi 149A (B grade) Like this book? CLICK TO ORDER Places to go in the Slide Rule Universe, people to see.... Click to visit! Buy a slide rule from our extensive on line marketplace , with restored classics, amazing new in the box rules, and low cost first student rules.  We have something for everybody, even a swap and sell area for visitors . Click to visit! Learn to operate and care for your slide rule with these on line manuals and directions .  Learn what scales mean, how to use them and how to restore or keep your rule in good condition. Click to visit! Tour our extensive archives of slide rule manufacturers and models from all over the world.  Find out who made what, and what became of them after they stopped making slide rules. See how slide rules survive today in the form of slide charts still made in the millions annually. Click to visit! Visit other slide rule places on the web with more slide rule data and information. From personal collections on line to (yes, it's really true) the international slide rule owners and collectors organization, the Oughtred Society. Click to visit! Nice things people have said about us in print and on TV, see the original articles. We always appreciate it! Click to visit! Visit our TEST EQUIPMENT site everything from Scopes, CRT's and DMM's to nixie tubes, HP and Tektronix spare parts. A little electronic something for everybody. E -mail us You are visitor number 53648 . Site Design & contents copyright 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005 by Walter Shawlee 2 & the ad hoc Godzilla Graphics Group."
    },
    {
      "tag": "p",
      "text": "Return to Sphere's Home Page"
    }
  ]
}