{
  "url": "http://www.stanford.edu/dept/news/report/news/january13/nie113.html",
  "content_hash": "3b82eec9760a4e2400b872a0a4077c3717c69489cb005846ad25ef5c3f3ae8c4",
  "total_blocks": 49,
  "retained_blocks": 4,
  "ignored_blocks": 45,
  "blocks": [
    {
      "tag": "div",
      "text": "This document was created using BeyondPress(TM) 2.0.5 -432416. HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "p",
      "text": "webbot bot=\"ImageMap\" startspan\r        rectangle=\" (16,189) (102, 210)  ../policy.html\"\r        rectangle=\" (15,168) (126, 188)  ../city.html\"\r        rectangle=\" (13,143) (92, 164)  ../work.html\"\r        rectangle=\" (15,119) (109, 140)  ../students.html\"\r        rectangle=\" (16,96) (131, 117)  ../medical.html\"\r        rectangle=\" (10,73) (94, 91)  ../academics.html\"\r        rectangle=\" (12,47) (88, 66)  ../research.html\"\r        rectangle=\" (14,7) (98, 25)  ../news.html\"\r        src=\"../gifs/News.gif\" border=\"0\" width=\"149\"\r        height=\"226\" webbot bot=\"ImageMap\"\r        i-checksum=\"52825\" endspan Issue of January 13, 1999"
    },
    {
      "tag": "h2",
      "text": "webbot\r        bot=\"ImageMap\" startspan\r        rectangle=\" (307,0) (366, 11)  ../../features/features.html\"\r        rectangle=\" (220,0) (294, 11)  ../../classifieds/classifieds.html\"\r        rectangle=\" (164,0) (212, 12)  ../../events/events.html\"\r        rectangle=\" (103,0) (158, 12)  ../../opinion/opinion.html\"\r        rectangle=\" (45,0) (93, 12)  ../../people/people.html\"\r        rectangle=\" (3,4) (37, 10)  ../news.html\"\r        src=\"../../gifs/Nav.sm.gif\" border=\"0\" width=\"367\"\r        height=\"13\" webbot bot=\"ImageMap\"\r        i-checksum=\"57782\" endspan"
    },
    {
      "tag": "p",
      "text": "Nie to head new institute\r        studying impact of technology on society BY KATHLEEN O'TOOLE For the first time in my\r        career, I don't know what to think about what is going\r        on,\" a slightly exasperated Professor Stephen\r        Chaffee admits, when asked to summarize the Internet's\r        impact on society. \"There is a lot of speculation,\r        tons of books and predictions, but when you look at the\r        evidence, it's very sketchy.\" Not surprisingly then,\r        Chaffee, a Stanford professor of communication who has\r        been tracking the influence of television on politics\r        over 35 years and is starting to pick up signs of\r        Internet influence, was delighted to learn recently that\r        an esteemed social scientist, business executive and\r        well-placed high-tech entrepreneur was coming to campus\r        for the purpose of tracking \"what's going on.\"\r        He is Norman Nie, former chair of the University of\r        Chicago's political science department, longtime study\r        director of that university's National Opinion Research\r        Center, and co-founder and former chief executive of\r        SPSS, one of the world's leading software companies. Nie\r        has traded in those roles to direct a new research\r        institute, the Stanford Institute for the Quantitative\r        Study of Society (SIQSS). Its central mission is to apply\r        survey research data to the analysis of broad social\r        changes, especially those prompted by information\r        technology and educational attainment. \"Norman is sincere,\r        and he knows how to do this,\" Chaffee says. \"Norman is a very\r        energetic research entrepreneur,\" adds economics\r        Professor Emeritus Victor Fuchs, \"and that's good\r        because the question of how technology is changing our\r        society is a fascinating one. He is also interested in\r        the role of education, and if you think about it from one\r        point of view, education and information technology are\r        not that far apart. We often confuse the education\r        process with its product, and we may be doing the same\r        with this new technology.\" Computer-based information\r        technology might turn out to be as influential as\r        Gutenberg's press, which is said to have necessitated the\r        creation of nation states and modern warfare, says\r        Chaffee. But it's also possible its influence will be\r        more modest, such as that of the telegraph, which, along\r        with railroads, brought us \"a country 3,000 miles\r        wide that functions as a single unit,\" he says.\r        \"All we know is that every time there has been\r        widespread adoption of a new communication technology\r        there have been lots of consequences and that adoption of\r        this latest one is coming on really fast.\" So fast that Nie worries\r        the country is missing the boat -- failing to collect\r        baseline data on social trends that are the subject of\r        widespread speculation. Who hasn't had a conversation\r        lately about how technology is changing jobs, family\r        life, community, commerce or politics? \"There is currently\r        no study going on that is capable of tracking the social,\r        economic and political consequences of [information\r        technology] outside the workplace,\" Nie said\r        recently between bites of leftover cheese and crackers, a\r        make-do lunch on a day crammed with appointments.\r        \"There just hasn't been the right combination of\r        fundraising, scholarship and focus. That's what I've come\r        here to do, and to get if off the ground as quickly as\r        possible.\" For Nie, Stanford was a\r        logical location once he resigned his other posts. He's\r        an admirer of President Gerhard Casper, who was his\r        provost at Chicago; his intellectual friendships here\r        date back to his graduate student days in the late 1960s;\r        the campus is closer to his home in Sun Valley, Idaho,\r        than was Chicago; and his Encina Commons office is, of\r        course, in the heart of the Silicon Valley, information\r        technology's home base. \"I think it's just\r        fascinating that with all the money generated by the IT\r        industry and all their belief, if you listen to their\r        advertising, that they are revolutionizing work and\r        social life, that there have been so few, if any, quality\r        studies of these phenomena funded by the high-tech\r        industry,\" he says. The industry often paints\r        a glowing portrait of information technology, calling the\r        Internet in particular a tool for greater democracy,\r        freedom, social connectivity and financial opportunity.\r        Perhaps the industry doesn't want studies that might find\r        some holes in that picture, a reporter suggests to Nie,\r        who immediately shakes his head. \"The gentlemen who\r        sit out on Sand Hill Road and the founders of the\r        companies they sponsor very much should want to know the\r        social impact of what they are doing,\" he says.\r        Besides, he points out, bad research projects will be\r        done on a shoestring and, in the absence of quality\r        studies, will unduly influence public opinion. Take, for example, the\r        study on the \"Internet blues\" that made\r        front-page headlines in late August. Nie grimaces at the\r        mere mention of that study's primary finding: Too much\r        Internet surfing makes people depressed. \"Here's a study that\r        starts with a group of people, follows them for a few\r        months, measures their use of the Internet and their\r        level of depression, and shows that as their Internet use\r        increases their depression increases, and they conclude\r        that the causal arrow goes from Internet usage to\r        depression. Now, would you be surprised to know that\r        depressed people also watch more television than\r        non-depressed people? I'd simply say it was interesting,\r        but it doesn't tell you the causal direction.\" Quality studies are being\r        conducted on the effects of computers in the workplace\r        and on firms, Nie says. \"What is missing is a\r        systematic approach to how information technology affects\r        the boundaries between work and family life, how it\r        affects the very concept of collegiality and informal\r        face-to-face relations. One of the ways to view this\r        technology is as a wonderful communications and consumer\r        tool. Another way is to look at it as the latest step in\r        the long chain of the crisis of modernity, which is a\r        series of technological changes that remove people\r        further and further from the supporting ligatures and\r        interpersonal communities of first the village and\r        neighborhood, the extended family, then the nuclear\r        family, and now the broken nuclear family.\" Nie's interest in these\r        subjects dates back to his undergraduate days at George\r        Washington University in St. Louis, where he was the\r        \"favorite\" student of Ken Prewitt, today's U.S.\r        Census director, recalls Gabriel Almond, Stanford\r        professor emeritus of political science. Prewitt\r        recommended him to Stanford for graduate work, where Nie\r        turned out to be \"statistically extremely\r        sophisticated and with an early ambition to specialize in\r        quantitative research,\" Almond says. \"I was one of Sid\r        Verba's research assistants here at Stanford,\" Nie\r        reminisces, \"and we were working on citizen\r        participation. We had this flood of data coming in from\r        hour-and-a-half-long interviews from eight countries of\r        every continent. . . . I knew that the then-current\r        tabulation equipment -- counter sorters and plugboard\r        machines -- were simply not up to it.\" So Nie built a\r        \"boxcar inside a shoebox,\" writing computer\r        code for a 7090 mainframe of the mid-1960s that permitted\r        the researchers to manipulate their data with\r        sophisticated statistical techniques. Today, the\r        follow-on development of that code is the leading\r        research tool for university social scientists as well as\r        marketing and polling organizations. But as a student in\r        1968 and for years afterward, Nie says, \"I had no\r        idea that it would be commercially viable. Timing in life\r        is a lot of the story.\" If Nie has his way, the\r        Stanford Institute for the Quantitative Study of Society\r        will draw researchers from across campus who will turn\r        those tools loose on new data. He wants them to have\r        access to systematic surveys of random, representative\r        cross-sections of Americans in order to see emerging\r        patterns. Raising the financial resources for ongoing\r        surveys is one of his paramount tasks as director.\r        Besides Fuchs and Chaffee, other faculty who have become\r        involved in the institute include political scientists\r        David Brady, Doug Rivers, David Epstein and Shanto\r        Iyengar, and visiting professor Sharyn O'Halloran. \"We are funding small\r        projects by individual faculty members with grants of\r        $5,000,\" Nie says, adding that he soon will announce\r        a program of $25,000 grants for larger studies of social\r        change. \"There are no good one-man-band\r        institutes,\" he says, explaining why the institute\r        is also hosting faculty seminars and a public lecture\r        series. Nie also wants to study\r        the impact of formal schooling on society. He is among a\r        growing number of social scientists who question the\r        reigning paradigm about the ever-increasing returns to\r        education. Education, or more specifically, years of\r        schooling, has proved to be the best predictor social\r        scientists have been able to isolate for success in life. \"If you read the\r        literature in all the social science disciplines on\r        education -- education and citizenship, education and\r        earnings, education and belonging -- you see arguments\r        for a predominantly human capital model of education's\r        role: the more education, the better,\" he says. But you also will see that\r        as authors work with later 20th century data in\r        industrialized countries, they increasingly make\r        arguments for exceptions to maintain the premise.\r        \"They will say, 'Well, income would have continued\r        to go up except for this,' or 'Citizen engagement would\r        have gone up except for the contravening forces of\r        television or the death of political parties.' I think we\r        have rushed far too far with this notion that education\r        produces better citizenship, more income for everybody, a\r        better occupational structure, more organizational\r        engagement. Its effects seem to vary from outcome to\r        outcome enormously.\" Take the conventional\r        wisdom that a college degree leads to community influence\r        and political participation, a subject that Nie and two\r        co-authors addressed in their prize-winning 1996 book, Education\r        and Democratic Citizenship in America. \"If it took a B.A.\r        degree 25 years ago to get you in the front seat of the\r        town meeting through your occupational profile or your\r        position in the community and your inevitable leadership\r        in organizational networks, what does it take\r        today?\" Nie asks. \"Certainly, a B.A. puts you\r        nowhere near the front of the ongoing town meeting, and\r        that says to me that power and influence is not easily\r        expandable. It may take long periods of time and great\r        social invention to expand them. I mean, you can multiply\r        by 1,000 the number of messages that citizens send to\r        their government, but you can't multiply by anything like\r        1,000 the number of messages that the government can\r        respond to.\" There are also\r        \"anomalies in the system\" that purports to\r        tells the economic story, he says. \"We rank last\r        among industrialized societies in terms of the\r        quantitative knowledge we produce in our college and high\r        school graduates, for example, but the Silicon Valley is\r        not in Germany; it's right here.\" One possibility,\r        Nie says, it that the late Harvard economist Fred Hirsch\r        was right when he observed that \"more education for\r        everybody leaves everybody in the same place.\"\r        Sometimes education is more of a \"sorting\r        machine\" than a creator of human capital, he says,\r        but to figure out when education is most worthwhile\r        requires data that the census and other national\r        databases don't gather, such as where Americans went to\r        school and what they majored in. Not everyone involved in\r        the institute has the same concerns as Nie, he and others\r        say, but they see value in the joint enterprise.\r        \"The social sciences have taken the road to\r        balkanization about as far as it can go,\" Nie says.\r        \"I count every day when I go into one of these\r        seminars or meetings how many disciplines we've managed\r        to bring out.\" Whatever the outcome of\r        these long-range studies, it's evident that Stanford is\r        the right place for Nie, since his life is inextricably\r        linked both to education and the study of information\r        technology. Caught in Palo Alto pre-lunch traffic on the\r        day he was interviewed for this story, he used his cell\r        phone several times to escape the consequences of missed\r        appointments, and he synced his personal digital\r        assistant with his computer so he could continue to\r        conduct institute business from a remote location -- a\r        hospital, where he planned to welcome his first\r        grandchild in person. \"You can do an awful lot of\r        things on the net,\" he explained, between sips of\r        Diet Coke, \"but you can't look someone in the eye,\r        you can't shake their hand and you certainly can't give\r        them a hug and a kiss.\" SR webbot bot=\"ImageMap\"\r        startspan\r        rectangle=\" (288,2) (337, 68)  ../../features/features.html\"\r        rectangle=\" (228,4) (284, 68)  ../../classifieds/classifieds.html\"\r        rectangle=\" (175,0) (229, 68)  ../../events/events.html\"\r        rectangle=\" (129,1) (179, 68)  ../../opinion/opinion.html\"\r        rectangle=\" (73,0) (124, 65)  ../../people/people.html\"\r        rectangle=\" (10,3) (72, 68)  ../news.html\"\r        src=\"../../gifs/navwh.gif\" border=\"0\" width=\"354\"\r        height=\"69\" webbot bot=\"ImageMap\"\r        i-checksum=\"54523\" endspan"
    }
  ]
}