{
  "url": "http://www.stripers247.com/canadastripers.htm",
  "file_number": "730",
  "content_hash": "da8d5027bbb62a2196cfdf03cc947582b2104be0017efb7de08edd57b48c8401",
  "total_blocks": 168,
  "retained_blocks": 4,
  "ignored_blocks": 164,
  "blocks": [
    {
      "tag": "p",
      "text": "| NOAA Tides | Marine Weather | Water Temperatures | Plug\r\n              in your Zip Code Weather Home | Message Board | Cabelas\r\n    Product showcase | Game\r\n              Room | Contact\r\n              Us | World\r\n            Record Striped   Bass Beginners\r\n            clinic Cabelas product Line Weather\r\n            and sea   conditions Gallery"
    },
    {
      "tag": "div",
      "text": "Glossary\r\n            of Fishing   terms Hybrid\r\n            striped bass Knot\r\n            Tying Length\r\n            to weight   chart Links-\r\n          Resources Map Tech\r\n            Server Mariner\r\n            Information Site\r\n            Map State regulations   and Fish and Wildlife State Striper\r\n            fishing   records Strategies\r\n            and Tips Striper Guides Striper Fishing\r\n    News Striper\r\n            Record   Pictures Tides for Eastern   Canada Tennessee River   System U.S. Army Corps   Lakes Gateway World Sportfishing   Records Web Cams"
    },
    {
      "tag": "p",
      "text": "Stripers\r\n                247 Canadian\r\n            Striped Bas s Fishing Rockfish, striper, linesider. More than 300 pages dedicated to your favorite fish, the striped bass Click\r\n              Here for The Striper Room Nova\r\n              Scotia Licensing St. Johns\r\n          New Brunswick Tide predictor Nova Scotia boat Ramps The record Canadian striped\r\n              bass was caught in Nova Scotia by Gordon Strong - Mira River,\r\n          Cape Breton Co. 1994.  It weighted 54.06 lb. Spawning In Canada, spawning occurs in May\r\n                    and June in fresh water, usually just above the head of tide when\r\n                    sea water warms to 15-18 oC. Eggs and milt are released directly\r\n                    into the water column, and after about 72 hours fertilized eggs\r\n                    hatch into free-swimming yolk-sac larvae. The duration of spawning\r\n                    is brief, lasting about two weeks, after which time spent fish\r\n                    return to sea. During summer and fall, adult and juvenile fish\r\n                    undertake wide ranging feeding migrations along the coast, often\r\n                    traveling several hundred kilometers beyond their natal rivers.\r\n                    In late fall Striped Bass ascend the rivers to over-winter in fresh\r\n                    water, in order to avoid low lethal marine temperatures. Site selection\r\n                    for over-wintering sites appears to be unrelated to spawning sites,\r\n                    and may be opportunistic, dependent on the geographic location\r\n                    of the fish at the onset of winter. In other words, Striped Bass\r\n                    do not necessarily over-winter in their spawning rivers. Males\r\n                    generally spawn for the first time at about age three or four,\r\n                females at age four or five Five self-sustaining (i.e. spawning) populations\r\n            of Striped Bass are known to have existed in Canadian waters. Four\r\n            of these were in Atlantic Canada, with documented spawning activity\r\n            on the Northwest Miramichi and Saint John rivers in New Brunswick\r\n            and on the Shubenacadie and Annapolis Rivers in Nova Scotia. The\r\n            fifth population spawned in the St. Lawrence River, Québec.\r\n            Self-sustaining Striped Bass populations from the Annapolis, the\r\n            Saint John, and the St. Lawrence rivers are believed to be extirpated.\r\n             ( a wildlife species\r\n            that no longer exists in the wild in Canada, but exists elsewhere\r\n            in the wild .) There are currently only two sites in Atlantic\r\n            Canada where Striped Bass reproduce, the Northwest Miramichi River\r\n            estuary (this is the Southern Gulf of St. Lawrence stock) and the\r\n            Shubenacadie-Stewiacke River estuary (this is the Inner Bay of Fundy\r\n            stock). These two populations are genetically distinct and both are\r\n            genetically distinct from Striped Bass found in US waters (Bradford\r\n            et al 1999). Although Striped Bass still occur widely in Atlantic\r\n            Canadian waters, some of the fish that are present are likely migrants\r\n            from populations that spawn in US waters. The following S-ranks for\r\n            both Nova Scotia and New Brunswick refer to the status of the two\r\n            remaining spawning populations in those provinces, both of which\r\n            are of some conservation concern. Currently in New Brunswick, a spawning population\r\n            of Striped Bass exists only in the Northwest Miramichi River, representing\r\n            the northern-most self-sustaining population of Striped Bass in North\r\n            America. The home range of the Miramichi-spawning population extends\r\n            throughout the entire southern Gulf of St Lawrence from Percé,\r\n            Québec to the Margaree River, Nova Scotia. This southern Gulf/Miramichi-spawning\r\n            population remains at low abundance and the population has declined\r\n            from a high of 50,000 spawning fish in 1995 to about 4,000 during\r\n            1998 to 2000 (Douglas et al 2001). This population exhibits large\r\n            annual fluctuations that are attributed to overfishing and year-class\r\n            failures caused by adverse environmental conditions (Bradford and\r\n            Chaput 1997). The commercial fishery for Striped Bass was closed\r\n            in 1996 but they are still taken as bycatch in a number of fixed-gear\r\n            commercial fisheries in the Miramichi system. The southern Gulf of\r\n            St. Lawrence stock has persisted, however, in spite of high harvest\r\n            mortality over many decades (Bradford et al 1999). There has been no evidence of spawning on the Saint John River since\r\n            1979; surveys conducted in 1992 and 1994 were unsuccessful in collecting\r\n            eggs, larvae or juveniles (Jessop 1995). Adult Striped Bass still\r\n            occur in the Saint John River and throughout the Bay of Fundy, however\r\n            these are seasonal migrants that originate from rivers in the eastern\r\n            US or from the Shubenacadie River (Bradford et al 1999). Habitat\r\n            degradation and loss is believed responsible for the extinction of\r\n            the Saint John River Striped Bass spawning population. Construction\r\n            of the Mactaquac Dam, with subsequent impediment of access to spawning\r\n            grounds, and unnatural fluctuations in water velocity and volume\r\n            spilled from the dam, is considered to be the greatest factor leading\r\n            to extirpation of the spawning population in the Saint John River. The Annapolis River spawning stock of Striped Bass\r\n            is believed to be extirpated, since viable spawning activity has\r\n            not been reliably documented since 1976. A remnant population of\r\n            adult fish greater than 20 years of age may still be extant in the\r\n            Annapolis River, as Striped Bass are quite long lived. These fish\r\n            may spawn but survival beyond the egg stage in the Annapolis River\r\n            is very low or negligible (Jessop 1990). The failure of naturally\r\n            spawned eggs to yield viable offspring may be a result of poor water\r\n            quality or alterations to the physical circulation of the estuary,\r\n            probably due to impacts from tidal power development and agricultural\r\n            runoff (Bradford et al 1999). The Shubenacadie-Stewiacke population of Striped Bass has not been\r\n            formally assessed, although sampling with icthyoplankton nets and\r\n            beach seines suggests that Striped Bass spawn annually in the Shubenacadie\r\n            - Stewiacke River system (DFO 1999). The spawning, rearing and habitat\r\n            requirements of Shubenacadie Striped Bass have been fully determined\r\n            and their home range is virtually unknown, and may extend beyond\r\n            the Bay of Fundy and the Gulf of Maine to the northeastern US. Though\r\n            limited retention of Striped Bass as bycatch from fisheries in the\r\n            Inner Bay of Fundy is permitted, precise levels of exploitation of\r\n            the Shubenacadie spawning stock in Canadian and US waters cannot\r\n            be determined (Bradford et al 1999). Striped Bass in Prince Edward Island\r\n            reflects the fact that a non-breeding population occurs in the province.\r\n            Bass occur occasionally in a number of Prince Edward Island Rivers,\r\n            including the Hillsborough, Dunk and Morell, where they are often\r\n            taken as bycatch in the Gaspereau fishery. However, as seine sampling\r\n            in Prince Edward Island has failed to demonstrate the presence of\r\n            juvenile bass, the Prince Edward Island Striped Bass population is\r\n            considered to be from external origin, most likely from Miramichi\r\n            spawning stock. Facts About Striped Bass § A striped\r\n            bass weighing 28.6 kg (62.9 lb) was caught near Reversing Falls in\r\n            the Saint John River, New Brunswick, in 1979. § The world\r\n            record (angling) striped bass weighing 35.6 kg (78 lb) was caught\r\n            at Atlantic City, New Jersey, in 1982. The record Canadian striped\r\n            bass was caught in Nova Scotia in 1994. It weighted 54.06 lb. § A striped\r\n            bass tagged and released in the Saint John River, New Brunswick was\r\n            recaptured 36 days later in Rhode Island, U.S.A., 805 km (503 mi)\r\n          away! (22.4 km/day or 14 mi/day) § Surveys\r\n            show the average striped bass angler on the Annapolis River, Nova\r\n            Scotia, spends about 50 hours for each fish caught. § Striped bass have\r\n            been introduced to parts of Europe and Asia. Nova\r\n                Scotia Fishing Web Site Stripers and salmon fishing in Nova scotia Gaspereau striped bass fishing Shubenacadie River and Lake ,\r\n            and the Annapolis\r\n            River are  waters on the Canadian shores of the canadian Gulf\r\n            where the striper attracts attention as a game fish, anglers visiting\r\n            the St. John are far more interested in salmon. Neils Harbor N.S. Data\r\n              on the spawn courtesy of the atlantic Canada Conservation Centre NOAA\r\n      Tides | Marine\r\nWeather | Water Temperatures | Plug\r\n              in your Zip Code Weather | Message Board | Fantasy\r\n              Sports | Game\r\n        Room | Contact Us | Thank you for visiting us Why don't you join in on the message\r\n  board"
    },
    {
      "tag": "div",
      "text": "WEBBOT bot=\"HTMLMarkup\" startspan ALT=\"Site Meter\" Copyright (c)2005 Site Meter WEBBOT bot=\"HTMLMarkup\" Endspan ----------\r\nThis page created \r\nRevisions:\r\n----"
    }
  ]
}