{
  "url": "http://www.subclub.org/darkroom/splitter.htm",
  "file_number": "732",
  "content_hash": "9da3c1424272bc1cb155a3c51614d7163a9edbd8e63eb39bbf1c86afc80b5606",
  "total_blocks": 34,
  "retained_blocks": 2,
  "ignored_blocks": 32,
  "blocks": [
    {
      "tag": "h2",
      "text": "SPLITTING FILM"
    },
    {
      "tag": "p",
      "text": "Since many film types were only available from the film manufacturers in\n35mm stock, several submini camera manufacturers designed film splitters\nto allow cutting a smaller strip of film from 35mm stock. With a film slitter,\nyou can get some amazing film into your submini, such as 2475 recording film,\nB&W or color infrared film, Tech pan, Agfapan 25 and Ektar 25.\n Sometimes called film slitters -- and NOT to be confused with film\nSPLICERS -- these devices came in various styles to cut different size strips.\nSome cut a 35mm strip in half to produce two 17.5mm strips for cameras that\nused that size film. Others would cut 16mm strips, 9.5mm strips and even\n8mm strips. Some of the companies that made these slitters were GaMi, Minolta,\nYashica, Ricoh, Mikroma, Microtec, Acmel, and Varitype. There are undoubtedly\nmore. They basically work the same way. Using razor blades, of some type,\nthey cut out smaller strips of film from 35mm film. These items are no longer\nbeing made and are very difficult to find. If you want a ready-made slitter, we suggest you check out: If you prefer an older model, check out the SWAPMEET section of the SUBCLUB. If you are handy or determined, you might even want to built your own slitter.\nAll you need are a few small pieces of wood, a couple of razor blades, some\nbasic tools, a little ingenuity and time.  Here are some pictures of\na completed splitter. With this slitter, you place a bulk roll of 35mm film\non the part that looks like a black handle. The film is pressed down onto\nthe cutting block and a removeable pressure plate is screwed on top. Then\nthe film is pulled through the slitter and rolled up on the other side. Two\npieces of felt on either side of the film keep it from getting scratched. You can use various materials in the construction of your slitter.  The\ndecision on material is up to you.  Wood is normally easier to work\nwith if you just have standard tools, but other materials may offer advantages,\nif you are familiar with them and have the necessary tools.  In building\nyour own slitter, one big problem you will come across is that the film is\nmeasured in millimeters, but American building materials are normally cut\nin inches. To complicate matters even more, when you add in the razor blades\ninbetween the wood blocks, the width is increased very slighly, but it can\nbe enough to through off careful measurements. Here are some helpful\nmeasurements: 3/8\" wood = .375 inches = 9.525mm -- A piece of wood this thick will need\n    to be sanded down somewhat to produce the size of the Minox film (9.2mm). 5/8\" wood = .625 inches = 15.875mm -- A piece of wood this thick (plus the\n    added thickness of the razor blade) should be just right for 16mm film. 11/16\" wood = .6875 inches = 17.4625mm -- A piece of wood this thick (plus\n    the added thickness of the razor blade) should be just right for 17.5mm film. 1 3/8\" wood = 1.375 inches = 34.925mm -- Pieces of wood that total to this\n    thickness (plus the added thicknesses of the razor blades) should be just\n    right for the total width of the 35mm film. If you need just a little extra spacing, pieces of construction paper will\n    probably work fine.  If you need a little less spacing, sand down the\n    wood with fine sand paper, measuring as you go. Here are a few diagrams to use depending on the type and size of film you\nplan to slit.  The diagrams are NOT to scale. If you are using 35mm unperforated\nfilm . If you are using standard 35mm perforated\nfilm . If you are using 16mm film, regardless of\nthe perforations . You can see from these diagrams is that if you only use one size of film\nto slit from (ex. 35mm) and one size of film to slit to (ex. 16mm) your job\nwill be easier.  If you plan on slitting from different film sizes (ex.\n35mm AND 16mm), or slit to different film sizes (ex. 16mm AND 9.5mm) your\nwork is more involved.  You will need to make different film slitters\nor make a slitter with different slitting block pieces.  It's up to\nyou to decide which is the best route to take. Before you get started, here are few points to ponder. Making a slitter takes time even if you are familiar with hand tools.  The\nmeasurements must be precise and the pieces of material are small, making\ncutting difficult.  It also makes it easy to cut yourself, so watch\nout! The more planning you do up front the better your results will be and the\neasier the job will be.  The plans outlined here are generic plans and\nneed to be modified depending on the type of film you plan to slit, the type\nof film you want to produce, the type of materials you plan to use and the\nfeatures you want to built into the slitter.  You will first need to\nspend time designing your slitter using these diagrams as a starting point.\n If you have trouble designing your slitter, it's best not to build\none yourself. The amount of wood used in the project is very small.  Becasue of this\nyou can probably afford to move up from a soft wood, like pine, to a harder\nwood, like oak.  Your slitter will last longer, but your saws and drill\nbits won't.  Harder woods are trickier to work with. The SUBCLUB can assume no responsibility for the success of your splitter,\nnor for any damage you do to yourself or your camera during its construction\nor use.   In other words, you're on your own.  If you have the\nslightest doubt about building a slitter, you probably shouldn't built one. If you are working with wood, the tools you will need are: electric drill and bits screwdriver hammer sander and sandpaper wood glue C-clamps saw pliers ruler pencil The materials you will need will vary depending on size of the slitter you\nmake and the design and features you build into it. wood (see diagram to design and measure your own pieces) screws (flat head will probably work best) bolts (there are several kinds available) wing nuts (to go with the bolts) washers (to go under the wing nuts) felt (available at any fabric store) dowels (depending on your plans) razor blades (many types are available) If your are a Minox user, you can see some great plans on this site. And here's another site with some super ideas for a slitter. Whether or not you are a Minox user, here are some generic plans with instructions and diagrams for\nthe slitter in the pictures at the top of this page. This guy has figured out how to turn a cheap\n35mm camera into a film slitter . If you have any ideas, suggestions or comments about these pages, please\ncontact the Sub Club at the FRONT\nDESK. To return to the main index for the Sub Club click here. COPYRIGHT @ 1995, 1996, 1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005 by Joe McGloin . All Rights Reserved."
    }
  ]
}