{
  "url": "http://www.surgeongeneral.gov/news/speeches/alcohol_02122004.htm",
  "file_number": "736",
  "content_hash": "68971e8363ee71ef5eda51e42dace531a4bc9cd6166e896773eea4e5f1c93698",
  "total_blocks": 99,
  "retained_blocks": 12,
  "ignored_blocks": 87,
  "blocks": [
    {
      "tag": "div",
      "text": "<p align=\"right\" class=\"print\"><img src=\"/images/system/printicon.gif\" alt=\"Print Version\"> <b><a href=\"#\">Print Version</a></b></p> Frequent Questions <p class=\"headtext\">HHS is the U.S. Government's principal agency for protecting the health of all Americans and providing essential human services, especially for those who are least able to help themselves.</p> <table border=\"0\" cellspacing=\"0\" cellpadding=\"0\" width=\"100%\">\n  <tr>\n    <td valign=\"top\" width=\"110\"><img src=\"/images/eaglefoot2.jpg\" width=\"110\" height=\"40\" alt=\"HHS Logo Bottom\" border=\"0\"></td>\n    <td valign=\"top\" width=\"100%\" nowrap><table border=\"0\" cellpadding=\"0\" cellspacing=\"0\" width=\"100%\">\n        <tr>\n          <td style=\"background-color: #F5CD64;\" nowrap><img src=\"/images/spacer.gif\" width=\"1\" alt=\"spacer image\" height=\"7\"></td>\n        </tr>\n        <tr>\n          <td align=\"right\" nowrap>\n\t\t<div align=\"right\">  \n        <div style=\"font-family: verdana; font-size: 0.65em; padding-top: 10px;\">\n\t\t<a href=\"http://www.surgeongeneral.gov/index.html\">Home: Surgeon General</a><br>\n\t\t<a href=\"http://www.surgeongeneral.gov/contactus.html\">Contact Us: Surgeon General</a><br>\n\t\t<a href=\"http://www.surgeongeneral.gov/search.html\">Search: Surgeon General</a><br><br>\n</div>\n          </td>\n        </tr>\n      </table>\n    </td>\n  </tr>\n</table> Home: Surgeon General Contact Us: Surgeon General Search: Surgeon General begin content area"
    },
    {
      "tag": "p",
      "text": "Remarks as prepared; not a transcript Vice Admiral Richard H. Carmona, M.D., M.P.H, FACS United States Surgeon General U.S. Department of Health and Human Services National Medical Leaders Meeting Thursday, February 12, 2004 Washington, D.C. \"Prevention and Treatment of Alcohol Abuse: Vision and Strategies\" Thanks for that terrific introduction, Dr. Runge. (Dr. Jeffrey Runge, \nAdministrator, National Highway Traffic Safety Administration) Dr. Runge has done a great job of describing the problem of impaired driving. \nId like to back up for a few minutes and describe for you the fundamental \nlarger problem in our country: that of alcohol abuse and alcohol dependency, \nwhich can lead to impaired driving and a variety of other psychological, social \nand health problems. The great American writer F. Scott Fitzgerald, himself an alcoholic, said \nthis of his addiction: \"First you take a drink, then the drink takes a drink, \nthen the drink takes you.\" Alcohol dependency and alcohol abuse The Substance Abuse and Mental Health Services Administrations (SAMHSA) 2001 \nNational Household Survey on Drug Abuse estimates that 16.6 million Americans 12 \nor older — 7.3% of our population — are dependent upon or abuse either alcohol \nor illicit drugs. Drug and alcohol abuse and dependence affect individuals of all ages, from all \ngeographic areas, and all ethnicities, education and employment levels. No one is immune, and we cannot assume that any particular patient is not \nalcohol dependent when we see him or her in an emergency room, or any other \nclinical setting. For example, alcohol-related consequences of heavy drinking — depression, heart \nfailure, and frequent falls — can be mistaken for medical or psychiatric \nconditions common among the elderly. We need to continue to educate all people about the risks of alcohol dependency. \nI'm convinced many people — young people especially — think they are immune. HHS Secretary Tommy Thompson has charged me with improving health literacy in \nAmerica, and nowhere is this more important than in the area of substance abuse. Rates for illicit drug and alcohol dependence and abuse are highest among \nAmerican Indians/Alaska Natives at 12.6 percent; followed by Hispanics (7.8 \npercent); Caucasians (7.5 percent); Blacks (6.2 percent); and Asians, Native \nHawaiians, or other Pacific Islanders (3.7 and 4.9 percent, respectively). Dependency on alcohol is exhibited by the following symptoms: Craving alcohol; \nan inability to stop drinking once one has started; a physical dependence, as \nevidenced by withdrawal symptoms experienced once drinking is stopped, and a \nhigh tolerance for the substance. Those who abuse alcohol are a slightly different category, including those who \nare dependent on it, as well as others who might not have produced the effects I \ndescribed that would result in them being diagnosed with alcohol dependence, but \nwho may drink too much, too often, or in situations that increase the risk of \nharm. What are the public health effects of alcohol abuse? Science has proven that the abuse of alcohol and alcohol dependency can \nadversely affect physical and mental health, both in the individual who drinks, \nand those around them."
    },
    {
      "tag": "div",
      "text": "Accidents — Alcohol-related motor vehicle crashes kill someone every 30 \nminutes and injure someone every 2 minutes. 41% of all traffic-related deaths \nare alcohol related. Americans self-report 120 million episodes of alcohol \nimpaired driving each year! 17,419 of those episodes resulted in death in 2002. \nWhile weve made significant progress since the 1980's in reducing drunk \ndriving, the number of alcohol-related fatalities is again trending upwards. Violence — Perpetrators of family violence are often using alcohol or drugs \nwhen they lash out at their victims. Increase in birth defects — Alcohol can have a number of harmful effects on a \nbaby: including mental retardation, learning and behavioral problems. Co-morbities of depression, other mental health disorders — People who use or \nabuse alcohol often suffer from depression or other mental illness. 37% of those \nwho are dependent upon alcohol have a co-occuring mental disorder. Reduced quality of life: inability to meet work, school or family \nresponsibilities — Most adults — about 75% — with substance dependence or abuse \nare employed full or part time. But they are not completely functional, and \noften lose work time to alcohol-related illness. Drinking-related medical conditions — Those who are alcohol dependent run a \nhigher risk of liver disease, and various forms of cancer, including breast \ncancer. They are also more likely to be injured by falling."
    },
    {
      "tag": "p",
      "text": "We can all quote \nnumbers and statistics until weve completely lost track.  But those numbers \nsignify real lives and real families.   These people are our sons and \ndaughters, our neighbors, friends and colleagues. We've got \nto do what we can — government and the medical community in partnership — to restore those lives and dreams, and prevent the tragedy from \noccurring in as many lives and families as possible. The problem of alcohol abuse and/or alcohol dependency is \nparticularly troubling in young people. Teenagers use alcohol more frequently and heavily than all \nother drugs combined.  And it starts early.  41% of ninth graders report \ndrinking in the last month. And 42% of tenth graders report having been drunk at \nleast once. They view it as a rite of passage.  Weve got to let them know \ndrinking excessively is not a rite of passage. According to research by NIH's National Institute on \nAlcohol Abuse and Alcoholism, kids who drink are more likely to be victims of \nviolent crime, to be involved in alcohol-related traffic crashes, and to have \nserious school-related problems. Tragically, there is also a strong link between alcohol use \namong adolescents and attempted suicide. 40% of children who begin using alcohol before age 13 will \neventually become alcoholics. That is not a legacy I want for America's children or their \nchildren.  In America, we want the best for our kids.  We want them to have the \nbest there is — the best opportunities, the best education, the greatest \nhappiness. We want them to be better off than we are.  As the father \nof four, I feel this with my whole heart, my very being. My parents both struggled \nwith alcohol.  Those addictions caused our family suffering, hardship and \ndeception.  Each and every family touched by addiction, knows the heartbreak of \nbroken dreams. Drugs and alcohol are thieves, and liars.  They steal their \nvictims' spirits.  Few American families are immune.  I would venture a guess \nthat every person in this room knows someone who has fallen victim to alcohol \ndependency or alcohol abuse. P revention — stopping drug and alcohol abuse before \nthey start — is the best strategy for reducing the tragic public and individual \nhealth consequences they bring about. I like to tell audiences that I am a 'recovering surgeon.'  \nTwo or three out of every four cases I cared for as a trauma surgeon in Arizona \non any given night — falls, car accidents, shootings, domestic violence - were \npreventable. We can only do so much for a victim once he or she is in \nthe emergency room.  We need to do more to prevent them from getting there in \nthe first place.  Weve got to reach people early, in middle school and even \nbefore. When President Bush nominated me to be \nSurgeon General, he asked me to speak regularly to the nation, particularly \nstudents, about alcohol and drug abuse, and the tremendous toll they take on our \nsociety. And that's what I \nam doing.  Last year I started my 50 Schools in 50 States initiative to \nvisit at least one school in each of the 50 states, Washington, D.C. and Puerto \nRico during my tenure as Surgeon General. I tell the kids my own story of overcoming hardship in a \npoor family where there was alcoholism. Because alcohol addiction \nis such a complex and pervasive health issue, we must continue to strengthen our \npublic health approach to addressing it. Such an approach must \ninclude extensive efforts in the areas of prevention, as I've mentioned, and \neducation, early intervention, treatment, and research. Many agencies at HHS are \ndealing with the problem, including SAMHSA, CDC, NIH, and NIAAA. We fund treatment \nprograms for the addicted, conduct research on the effects of alcohol among \nvarious populations, and provide information to the public about what they can \ndo to get help if they have a problem, or someone they love has a problem. But government, alone, \ncan only do so much.  We need the partnership of the medical community.  The \npeople you represent — health care providers from all settings — can all play a \nrole in fighting this pervasive public health problem. Certainly, laboratory \nalcohol screening is a good early intervention tool in many settings. In the event there are \nnot the funds for this type of screening, health care providers still have the \nopportunity to screen by asking about alcohol use; assessing the \nlevel of severity, advising and assisting , and arranging for follow-up. This can be done by \npediatricians, nurse practitioners, psychologist, and social workers — anyone \nwho provides services to a person at risk for alcohol abuse, which, as we know, \nis nearly everyone. And those of us who are \nhealth practitioners have the power to intervene and prevent virtually every \ntime we see a patient.  And we can help close the health literacy gap — the \ndifference between what we know as medical professionals and what our patients \nunderstand — in every visit. A teenager might not know \nhe's at risk for alcoholism; he thinks it's cool to drink. A pregnant woman might \nthink it's OK to have the occasional glass of wine, unaware that even small \namounts can cause birth defects. And the elderly may not \nknow they are at greater risk for fractures with each and every drink they \ntake.  We can help equip them to make better decisions. Those of us in leadership positions have an additional \nresponsibility.  The decisions we make today will have an impact on the future \ncourse of alcohol abuse and alcohol dependency in this country. Many of you already have programs within your organizations \nto fight alcohol abuse and dependency, and that's great.  Keep thinking, and \nstriving. It's too easy to give in to the temptation to view alcohol \nabuse as 'routine,' as an 'old problem.' Certainly there are other public health issues that get \nhigher billing in the newspapers and on television. But alcohol abuse and dependency are still serious public \nhealth problems in America that require our best efforts to fight. Thank you. ### Last Revised: April 27, 2004"
    },
    {
      "tag": "div",
      "text": "end search result content item end content area begin news column"
    },
    {
      "tag": "h4",
      "text": "Surgeon General News"
    },
    {
      "tag": "div",
      "text": "November 15, 2006 New Family Health History Projects Focus on Alaska Native, Appalachian Communities full story November 9, 2006 Medical Reserve Corps Approves 500 th Unit full story June 27, 2006 New Surgeon General's Report Focuses on the Effects of Secondhand Smoke full story All Surgeon General News"
    },
    {
      "tag": "h4",
      "text": "Features"
    },
    {
      "tag": "div",
      "text": "U.S. Surgeon General's Family History Initiative Hurricane Preparedness 2005 Hurricane Season 50 Schools in 50 States Initiative PHS, MRC, and Medical Volunteer Letters from the Gulf Region PHS Officer Reports from Tsunami Rebuilding Efforts 2005: \"The Year of the Healthy Child\""
    },
    {
      "tag": "h4",
      "text": "Links to Related Websites"
    },
    {
      "tag": "div",
      "text": "Office of Public Health and Science U.S. Public Health Service Commissioned Corps Medical Reserve Corps HealthierUS HHS Task Force on Drug Importation end news column end content area"
    },
    {
      "tag": "p",
      "text": "HHS Home | Questions? | Contact\n\t\tHHS | Site Feedback | Site Map | Accessibility | Privacy\n\t\tPolicy | Freedom of\n    Information Act | Disclaimers The White House | FirstGov | Helping America's Youth U.S. Department of Health & Human Services · 200 Independence Avenue, S.W. · Washington, D.C. 20201"
    }
  ]
}