{
  "url": "http://www.theonering.com/docs/18895.html",
  "file_number": "751",
  "content_hash": "d59c6a8c82714f21a445f5176fec9118defc28951449fadd5ab74d244c4c3103",
  "total_blocks": 46,
  "retained_blocks": 4,
  "ignored_blocks": 42,
  "blocks": [
    {
      "tag": "div",
      "text": "›The Movies The Hobbit Petition - Bring Back Peter Jackson as The Director of The Hobbit Petition - Let Another Director Helm The Hobbit The Fellowship of the Ring The Two Towers The Return of the King The Complete List of Film Changes General Changes The Fellowship of the Ring The Two Towers The Return of the King Fan Film Reviews ›News Movies Literature Events Games About Tolkien ›Gallery Highest Rated Gallery Items Movie Images The Fellowship of the Ring The Two Towers The Return of the King Behind the Scenes Cast Professional Artists The Hobbit The Fellowship of the Ring The Two Towers The Return of the King The Silmarillion Fan Art ›Messageboard Welcome Welcome! Adoptions Literature The Books - Tolkien The Books - Other Authors Language Virtual Tolkien Study Group Movies Movies - Lord of the Rings Movies - Lord of the Rings (Fandom) Movies - Other Games - Tolkien and More The Age of Man - Experiencing Tolkien Today Events Tolkien Inspired Art and Collecting Writing - The Scriptorium of Imladris Our Community The Lighter Side - Tom's House Talk - The Bird and the Baby Philosophy - Councils of Manwe Music - The Choirs of Eru Role Playing - The Prancing Pony (Tolkien's Middle-earth Only) Role Playing - The Green Dragon Inn (Fantasy That Influenced Tolkien) Alliances and Guilds - The Peoples of Middle-earth The One Ring - Administration The Vaults of Minas Tirith - Archived Forums Adoption Attic The Library - General Archive Fandom Archives ›Membership Join TORC! Become a Premiere Member View Your Premiere Member Info Cancel Premiere Membership ›Reading Room Stories Poetry Humour A Tolkien Virgin ›The Store ›Quotes ›About Us Contact Us Mission Statement Terms of Service Privacy Policy ›Home"
    },
    {
      "tag": "h1",
      "text": "The One Ring"
    },
    {
      "tag": "h2",
      "text": "Page not found"
    },
    {
      "tag": "p",
      "text": "Sorry, but the page you were looking for could not be found. Please use the menu or the search box to help you find what you are looking for. COPYRIGHT 1999-2006 - The One Ring ... The One Ring is administered by everyday fans of J.R.R. Tolkien and Lord of the Rings. The One Ring is not affiliated with the Tolkien Estate\nor Tolkien Enterprises. Certain materials such as books, films, articles and other promotional materials are held by their respective owners and is allowed\nunder the fair use clause of the Copyright Law. Certain design elements of this webpage are copyright John Howe, and can be found here ."
    }
  ]
}