{
  "url": "http://www.theusbroker.com/newsletters/",
  "content_hash": "89cfb9a8574a695d22b645172dd12a8f668bf3833a11b6ec584b0916e1b8d6ca",
  "total_blocks": 252,
  "retained_blocks": 5,
  "ignored_blocks": 247,
  "blocks": [
    {
      "tag": "div",
      "text": "Start of Header End of Header HOME PRODUCTS ANNUITIES FORMS NEWSLETTER COMPANY Start of Breadcrumbs Home > Products > Newsletter \r\n      - Imploding UL's End of Breadcrumbs Start of Left Navigation TheUSBroker \r\n                  Home Annuity \r\n                    Rate & Commission Info Products MoneyGuard \r\n                  - UL & LTC Allianz \r\n                  Life LTCi Refund \r\n                  Term - ROP Life \r\n                  Settlements Americo Mort Protection Senior \r\n                  Protection Life Lincoln \r\n                  PRO Term Lincoln \r\n                  GTO Term : E-Ticket AIG \r\n                  Horizon Fixed Annuities Chase Insurance Life VA Recovery Program NEW Annuity \r\n                  Appointment Grid SPIAs - hot products! Aviva \r\n                  Life - Top Annuities Allianz Life Equity Indexed Annuities Allianz Life Annuities F&G Life Loyalty Rewards - 12% \r\n                  Bonus & 8% comp BonusDex \r\n                  Elite AIG \r\n                  UltraMYG Deferred Annuity USFMG \r\n                  Annuity Search Engine & Forms High Net Worth Clients Services Lead \r\n                  Generation Services Broker \r\n                  Product Kits Licensing \r\n                  & Applications Insurance \r\n                  Web Links Tax \r\n                  Advice: Bean Counter Newsletter Current \r\n                  Newsletter Archived \r\n                  Newsletters Company About \r\n                  Us Management \r\n                  Team Contact \r\n                  Info End of Left Navigation Start of Content Area Imploding UL's - A Big Problem and Big Opportunity for Whole Life By: Ted Kowal, jtkowal@ftlife.com Farmers and Traders Life Insurance Company of New York"
    },
    {
      "tag": "p",
      "text": "see our current BeanCounter CPA info"
    },
    {
      "tag": "div",
      "text": "How to Avoid Tax Time Problems Tax Swaps & Exchanges (Code Sec. 1031 & 1035) Irrevocable Election of IRAs (Code Sec. 2039) IRS Adds New Private Debt Collectors New 401(k) Investment Option Social Security Number Verification Process"
    },
    {
      "tag": "p",
      "text": "The following Case study is an  actual case with the names changed for privacy compliance. Robert, a well  respected agent with over thirty-five years in the business and twenty years  with Farmers and Traders, had a very worrisome problem. In the late 1980’s he  placed a $500,000 Universal Life Policy with another quality company on one of  his best client’s, George. George was in his 40’s at the time and owned a very  successful business. Robert had also placed $1,000,000 in term on George. The UL  policy performed well in the interest rate environment of the time. It was so  successful that based upon illustrations, George stopped making premium  payments and the cash values still grew. Fifteen  years later, George, who continued to prosper, went to one of the leading  Estate Planning Attorneys in town. The lawyer invited Robert to participate in  the planning and coordinate any insurance changes if needed. Robert asked for  re-proposals on George’s UL policy. Much to his chagrin the NAIC re-proposal  showed that, despite the fact that there was still $180,000 in cash in the  policy, the values were decreasing and the policy would run out of cash when  George was in his 70’s. The combination of George’s age and the low UL interest  rates of recent years had created this situation. Paying additional premiums  was an option, but not very attractive to George. A 1035 exchange to a no lapse  UL was a possibility, but that would basically tie up that cash from any other  use. The attorney had recommended that George create an Irrevocable Life  Insurance Trust (ILET) as part of a comprehensive estate plan. In addition to  the $500,000 of permanent insurance on George’s life, the plan called for a  $1,500,000 second to die policy in the trust. The attorney tossed the problem of  how to fund this plan to Robert. The client feels he has paid enough life  insurance premiums. What does Robert do now? Robert  called Farmers and Traders to see if we could help. After some thought, the  best answer appeared to be a 1035 Exchange of the UL to a Whole Life Policy.  Whole life in general is a good answer for imploding UL policies, particularly  on older clients, because the mortality charge is fixed and does not go up as  the client gets older. Farmers and Traders, like some other whole life  carriers, also has a “Paid-Up Additions” rider on our Whole Life policies that  allows for deposits of cash into Whole Life policies, just like deposits into Universal  life policies. We prepared a  proposal to replace the UL with a Whole Life policy. We did not use just any  policy, but selected our Flagship Life II, which is a high premium, high cash  value product. It is a Life Paid up at age 85 policy. The base policy applied  for was only $250,000, but with the additional death benefit purchased with the  $180,000 dump in, it brought the total death benefit of the policy over the  $500,000 mark which allowed for a legal 1035 Exchange. Based upon current  dividend projections, no additional premiums were necessary. In addition the  cash value seemed to increase at an impressive rate, so seeing this fact we  tried one additional step. The premium on  the Second-to-Die policy from another carrier was $7,200, so we illustrated  that amount of premium coming out of the policy also. The withdrawals for that  policy ran to age 100. We even showed the dividend at 75% of current  projections and the policy sill supported itself and the Second-to-Die premium  until George was in his late 80’s. The framework of  the Estate Plan was now set. George applied for the Flagship II policy and once  approved the existing UL policy was surrendered under IRC Sec. 1035 to the new  policy. The new policy was then transferred to the newly created trust (ILIT).  The only risk item was the gifting of the policy to the ILIT, but that was  better then just cashing in the UL and paying tax. At Robert’s request,  George’s attorney wrote a disclosure letter stating that if George died within  three years the policy proceeds would be brought back into the estate for  estate tax purposes. Since George was in good health that was deemed an  acceptable risk. The Trustee of the ILET applied for the Second-to-Die policy.  Once that was approved and issued the procedure was set up for the Trustee to  withdraw the amount of the Second-to-Die premium every year. Robert advised (in  writing) George, his attorney, and the Trustee that the future dividend and  interest rate performance of both policies in the trust should be reviewed  every few years to see if the plan would perform. The ultimate resolution of  the Estate Tax may also change things. Robert felt  relieved that a serious potential problem (and E&O claim) had not only been  avoided, but that things had sorted out into an extremely successful estate  plan. Additional commissions on the two new policies were just icing on the  cake. Despite all the new things that come down the road in our industry, going  back to one of the earliest building blocks in insurance, the Whole Life  Policy, can still solve modern problems that newer products cannot. TheUSBroker Representative Van Albanese, CLU, ChFC 877-341-3342 ph 315-655-4784 fax valbanese@theusbroker.com"
    },
    {
      "tag": "div",
      "text": "Start of Content Area Start of Right-Hand Column Email Newsletter Subscribe to TheUSBroker newsletter to be updated monthly on industry trends and new products. E-mail: Name: Privacy Policy Contracting TheUSBroker provides instant access and full-service capabilities for contracting and future policy utilization. To find out more information\r\n\t\t\t\t\t\t\t\t\tcomplete our online form and one of our agents will contact you. Archived Newsletters Long Term \r\n                  Care Annuity: A Marriage of Two Good Ideas Successful \r\n                  Marketing with MoneyGuard's Long Term Care Life MEC/Annuity \r\n                  Alternative - Expanded Inheritance MoneyGuard Alternative \r\n                  - Medically Underwritten Immediate Annuity Long-Term \r\n                  Care - The Brave New World Approaches MEC - \r\n                  A Wealth Transfer Product For The Senior Market Brave \r\n                  New World of Long Term Care Life Senior \r\n                  Settlements - Sell Your Life Insurance Term \r\n                  Wars - Agents Fight Back with Refund Term End of Right-Hand Column Start of Footer 2006  TheUSBroker, All Rights Reserved Contact Info | Privacy Policy End of Footer"
    }
  ]
}