{
  "url": "http://www.thiaoouba.com/see_aura_color.htm",
  "file_number": "756",
  "content_hash": "29161062cf53d109a0e88367816698f74f258c4b8ad719d0df310eaa8f615f76",
  "total_blocks": 35,
  "retained_blocks": 5,
  "ignored_blocks": 30,
  "blocks": [
    {
      "tag": "div",
      "text": "Global \nWarming: Can Earth EXPLODE? There will be no second chance... See \nthe latest scientific discovery #BeginLibraryItem \"/Library/auralinks.lbi\""
    },
    {
      "tag": "p",
      "text": "See your aura Part 1 - What is aura Part 2 - Eye exercises Part 3 - Watching auras Part 4 - Improving auras Kirlian or not? Aura - conscious control Self healing Astral travel Spiritual teachers Guru or not Guru? Lonely? Drug Free Society Japan's best kept secret Meditation Levitation Thiaoouba - Frequently Asked Questions Bookshop Bioelectrography Bioresonance Workshops & Retreats Can Earth EXPLODE? Home Contact us"
    },
    {
      "tag": "div",
      "text": "#EndLibraryItem How to see and READ \nthe AURA: Part 3"
    },
    {
      "tag": "blockquote",
      "text": "Seeing the Aura This exercise is designed to see Aura for the first time and/or practice seeing \nAuras. Choosing good conditions is important: not only you see the Aura better, \nbut also to gain a confidence about what you see. Situate the person in front of a very softly illuminated PLAIN WHITE background. \nA color background will change Aura colors, so you need additional knowledge about \ncombining colors. Some combinations of background and Aura colors may cause misinterpretation \nproblems. Choose ONE SPOT to look at. The middle of the forehead is VERY GOOD. This \nis a location of so called Brow Chakra or the Third Eye. In some cultures (India) \nthey put a mark on a forehead. Such a mark in ancient times could mean the invitation \nto look and see the Aura. Look at this spot for 30 to 60 seconds or longer After 30 seconds analyze surroundings with your peripheral vision, while still \nlooking at the same spot. Continuing the concentration is most important. \nResist temptation to look around. You should see that the background \nnearby the person is brighter and has a DIFFERENT color than the background further \naway. This is your own perception of the Aura. The longer you concentrate, the \nbetter you will see it. Remember, concentration on one spot increases your sensitivity \nby accumulating the effect of the Aura vibration reaching your eyes. Taking a SNAPSHOT of an Aura. After concentrating long enough to see the aura, close your eyes. For a second \nor two you will see the Aura ONLY. Be prepared. You have only one second or two \nuntil your photosensitive cells will stop vibrating and sending visual sensations \nto the brain. And if you miss is, you have to start concentrating again. Try to \nexperiment how fast or slow you should close your eyes."
    },
    {
      "tag": "p",
      "text": "Observing auras of other people The best is to look directly at someone's brow chakra (third eye or wisdom eye, \nwhich is located @1.5 cm above the nose, between eyes) and aim to achieve the \nstate of mind similar to the concentration technique described above for at least \n30-60 seconds. I have tried also looking at throat and heart chakras with similar \nresults. However, if you concentrate on someone's chest it looks so unusual that \nthe person concerned is usually very uneasy about it. When you look into someone's \nbrow chakra you can actually continue conversation. Again, VERY softly illuminated background, with no shadows is best. With practice, \nany uniformly illuminated background (such as a blue sky for example) will suffice. How to see your own Aura Stand about 1.5 m in front of a good size mirror. In the beginning it is best \nif the background behind you is plain white and there are no shadows. Illumination \nshould be VERY soft and uniform not bright. Follow instructions above for seeing \nAuras. PRACTICE for at least 10-15 minutes each day to increase your sensitivity and \ndevelop Auric sight. Remember that practice is required to develop Auric sight. Auric sight and after-images One of the most frequently asked questions during my workshops is: \"Tom, \nare my eyes playing tricks on me ?\" The answer is no, you have just learnt \nto pay attention to what your eyes are capable of. Light sensors in our eyes (Red \nGreen and Blue) are vibration sensors which are highly non-linear and they have \nmemory. The consequence of memory is that they can oscillate for up to several \nseconds after the visual stimulation has been discontinued. This memory of visual stimulation is frequently perceived as afterimage. Afterimages \nhave a precisely the same shape as original images. Afterimage of an object surrounded \nby its Aura is larger than the original image. The increase in such afterimage \nis due to the vibration of an Aura and actually represents a \"snapshot\" \nof an Aura. It is therefore essential to focus at one spot when watching the Aura \nand resist temptation to change the point of focus, otherwise an image of the \nAura may become confused with the afterimage of an object. Meaning of Aura and its colors The Aura is a reflection of our True Nature at any given moment. At this point \nit is perhaps necessary to explain what do I mean by \"True Nature\" and \nwhy some effort is necessary to \"discover\" it. Our society seems to \nemphasize symbols, stereotypes, habits, manners, superficial behavior, pretending, \nfollowing others and submitting free will to some \"leaders\". Our \"education\" \nseems to be based on views and expectations of people who try to control the flock. Our True Nature is what is left when we recognize and discard all our habits, \nstereotypes, manners, and pretending, superficial behavior and become fully conscious, \ntruly natural and spontaneous. Note that some people are so attached to their \nmanners and habits that it is very hard, if not impossible, to discover who they \nreally are. The only way to get an instant insight into their personality seems \nto be by watching their Aura, because the Aura shows their True Nature, behind \nany facade of superficial behavior. In general, the more colorful, cleaner and brighter the Aura, the better and more \nspiritually advanced is the person. Also, the more uniform the energy distribution \nin the Aura, the healthier and more balanced the person is. Distribution of the energy in the Aura seems to have the potential of a powerful \nmedical diagnostic tool , but usually requires using a complex equipment. The \nscope of this article is to concentrate on what we can easily see with our eyes. Our Aura surrounds the entire body, but the interpretation of colors below relates \nto the Aura around the head only. Meaning of colors around the head presented \nbelow suggested in the literature has been confirmed by the author. When you learn \nto see Aura well, you can verify it for yourself, by concentrating on certain \nthoughts while watching your Aura, or telling people what their thoughts are when \nyou see their Auras. Usually, people have one or two dominating colors (strong points) in their Aura. \nThese colors (or their Auric pairs) will be most likely their favorite colors. In addition to dominant colors, the Aura reflects thoughts, feelings and desires, \nwhich appear like \"flashes\", \"clouds\" or \"flames\", \nusually further away from the head. For example a flash of orange in the Aura \nindicates a thought or desire to exercise power and control. Orange as a dominant \ncolor is a sign of power and general ability to control people. Quickly changing \n\"flashes\" indicate quickly changing thoughts. Meaning of Clean Colors of the Aura (colors of the rainbow, bright, shiny, monochromatic colors): Purple: indicates spiritual thoughts. Purple is never a strong \npoint in the Aura. It appears only as temporary \"clouds\" and \"flames\", \nindicating truly spiritual thoughts. Blue: Balanced existence, sustaining life, eased nerve system, \ntransmitting forces and energy. People with blue strong point in their Aura are \nrelaxed, balanced and feel ready to live in a cave and survive. They are born \nsurvivors. Blue thought is a thought about relaxing the nerve system to achieve \nthe balance of the mind or a thought about surviving. Electric blue can override \nany other color in the Aura, when the person is receiving and/or transmitting \ninformation in a telepathic communication. For example Michel Desmarquet, author \nof \" Thiaoouba Prophecy \", frequently \nglows with the electric blue during his lectures, especially when he answers questions \nfrom the public. Turquoise: indicates dynamic quality of being, highly energized \npersonality, capable of projection, influencing other people. People with turquoise \nstrong point in their Aura can do many things simultaneously and are good organizers. \nThey feel bored when forced to concentrate on one thing. People love bosses with \nturquoise Auras, because such bosses explain their goals and influence their team \nrather than demand executing their commands. Turquoise thought is a thought about \norganizing and influencing others. Green: restful, modifying energy, natural healing ability. All \nnatural healers should have it. People with a green strong point in their Auras \nare natural healers. The stronger the green Aura, the better the healer. They \nalso love gardening and usually have a \"green hand\" - anything grows \nfor them. Being in a presence of a person with a strong and green Aura is a very \npeaceful and restful experience. Green thought indicates a restful state and healing. Yellow: joy, freedom, non-attachment, freeing or releasing vital \nforces. People who glow yellow are full of inner joy, very generous and not attached \nto anything. Yellow halo around the head: high spiritual development. A signature \nof a spiritual teacher. Do not accept spiritual teachings from anyone who does \nnot have such a yellow halo. Buddha and Christ had yellow halos extending to their \narms. Today it is rare on Earth to find a person with a halo larger than 1 inch. \nYellow halo appears as a result of a highly active brow chakra (which can be seen \nglowing with violet by many people at my workshops). Highly spiritual people stimulate \nthe brow chakra continuously for many years, because they always have intensive \nspiritual thoughts in their minds. When this chakra is observed when highly active, \na yellow (Auric pair) halo appears around it, surrounding the entire head. Yellow \nthought indicates a moment of joy and contentment. Orange: uplifting and absorbing. Inspiring. A sign of power. \nAbility and/or desire to control people. When orange becomes a strong point, it \nusually contributes to a yellow halo, which then becomes gold, indicating not \nonly a spiritual teacher, but a powerful spiritual teacher, someone capable of \ndemonstrating his/her unique abilities. Orange thought is a thought about exercising \npower or a desire to control people. Red: materialistic thoughts, thoughts about the physical body. \nPredominantly red Aura indicates materialistically oriented person. Pink (=purple+red): love (in a spiritual sense). To obtain a \nclean pink, you need to mix the purple (the highest frequency we perceive) with \nred (the lowest frequency). Pink Aura indicates that the person achieved a perfect \nbalance between spiritual awareness and the material existence. The most advanced \npeople have not only a yellow halo around the head (a permanent strong point in \nthe Aura) but also a large pink Aura extending further away. The pink color in \nthe Aura is quite rare on Earth and appears only as a temporary thought, never \nas a strong point in the Aura. Meaning of Dirty colors: (colors appearing darker than background more like a smoke than a glow) Brown: unsettling, distracting, materialistic, negating spirituality. Gray: dark thoughts, depressing thoughts, unclear intentions, \npresence of a dark side of personality. Sulfur (color of a mustard): pain or lack of ease, anger White: serious disease, artificial stimulation (drugs). Why does \nthe white color in the Aura indicate problems? White color is like a noise, rather \nthan a set of harmonious tones (monochromatic colors). It is impossible to \"tune\" \nthe noise to an orchestra playing harmonious music, hence the white Aura indicates \na lack of harmony in the body and mind. Nature, which we are a part of, is harmonious. \nThis harmony comes in discrete vibration \"tones\" or harmonics, partially \ndescribed by the modern quantum physics. Several hours before the death, the Aura becomes white, and greatly increases \nin intensity. For this reason in most cultures \"death\" is depicted in \nWHITE (not black), because in the past, people could actually see a white Aura \nbefore death. It seems that our ancestors knew much more than we are prepared \nto admit. Amplifying your Aura vibration and bio-energy Things which can greatly amplify your aura are: Meditation (purifying \nyour mind from any thoughts) Concentration exercise with \nthe cross Matching your aura with \nthe environment Our eyes <- Back Next \n-> Matching your aura with environment"
    }
  ]
}