{
  "url": "http://www.trainingexpert.com/mtip.htm",
  "file_number": "759",
  "content_hash": "519d5362976b65a7587d43030e9bfbb39299bebcd0f7b2ac961b30d246dda376",
  "total_blocks": 54,
  "retained_blocks": 18,
  "ignored_blocks": 36,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation mstheme mstheme msnavigation mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "Meeting planner free tips on speakers, training programs\r\n      & seminars mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme Meeting Planner, speakers,\r\n        conference, convention\r\n        training seminars, training tips.\r\n        Convention, conference speaker, meeting planner sales training, keynote sales speaker, conference\r\n        speaker, conference training program, meeting planner tips, convention\r\n        meeting planner, speaker\r\n        bureau, conference speaker, national sales meeting planner, event planning ideas, training\r\n        meeting programs, free meeting \r\n        tips, conference training program, sales training seminar, workshop,\r\n        in-house training meeting, national training meeting speaker, trainer,\r\n        speaker bureau. mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "\"Are COLD\r\n      CALLS a problem for your sales staff? We've got some proven strategies\r\n      to help your sales organization achieve it's sales goals, starting\r\n      now!\" Click here now!"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "------------------------------------------------------------------- mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "How to run effective\r\n      training\r\n      meetings I'd like to share on this page some\r\n      successful ideas and strategies that have been very helpful to me in\r\n      training business skills to countless men and women over the years. The best training programs and material\r\n      will fall flat unless the training environment and presentation are done\r\n      properly. ~ Ted Tate"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "------------------------------------------------------------------- mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme"
    },
    {
      "tag": "h3",
      "text": "mstheme How to keep your sales training programs\r\non target! mstheme"
    },
    {
      "tag": "p",
      "text": "Ted Tate Let's take a look at why some training sessions are producing really\r\ndynamite results while others leave participants wondering what the point of the meeting\r\nwas. 1. W. I. I. F. M. (What's in it for me!) In some meetings participants\r\nare there because it's expected of them, attending because they feel obligated or the boss\r\ntold them they had to attend. As an old saying goes, \"You can lead a horse to water\r\nbut you can't make him drink.\" Some companies and organizations fail to\r\n\"sell\" participants on the benefits of training sessions, they assume they\r\nalready know. Big mistake. Be sure people understand the point of each training event and\r\nspecifically how the new knowledge benefits them. 2. Long winded people discussing the interior of a ping-pong ball! Iknow it's a temptation to use knowledgeable industry people and in some cases, necessary.\r\nUnfortunately many people who normally don't speak in public are generally boring. The\r\nlonger their presentation, the duller it gets and people in the audience\r\n\"turn-off\" mentally. Another great training opportunity slips away. The solution of course is to use people with experience in training or\r\nat the least, speaking before others. Not only are they more interesting to hear, they\r\nunderstand how to pace the meeting and most importantly, when to stop making a point. 3. Irrelevant information. People going to meetings expect to enjoy\r\nthemselves, be entertained and learn new ideas in a positive atmosphere. Information\r\npresented at training sessions must be carefully distilled to the essential points. If a\r\nstory is told, an example given or even a joke is used it must be relevant to the issue at\r\nhand. Additionally the material must be presented in an orderly fashion so participants\r\ncan follow along. Finally, it needs to be current material, not a rehash of tired old\r\nideas. Before you permit someone to do training, make sure they have a focused\r\noutline or curriculum in writing to follow and have done this before. Working from notes\r\non scraps of paper or worse, from memory, produces poor programs with attendees mentally\r\nturned off long before the program finishes. This isn't the place to practice. 4. Keep it upbeat. Training sessions require a positive ambiance, the\r\nfeeling that learning is not only pleasant, but the knowledge contributes to the\r\nparticipants success. The person who facilitates should be upbeat and able to communicate\r\nthe benefits of the training to the participants in a positive way. When people feel they\r\nare learning something that will help them and in a positively charged environment, the\r\nlearning comes easy!"
    },
    {
      "tag": "div",
      "text": "mstheme mstheme mstheme mstheme"
    },
    {
      "tag": "p",
      "text": "------------------------------------------------------------------- mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme"
    },
    {
      "tag": "p",
      "text": "2006 by Ted Tate mstheme"
    },
    {
      "tag": "div",
      "text": "mstheme Meeting Planner, speakers,\r\n        conference, convention\r\n        training seminars, training tips.\r\n        Convention, conference speaker, meeting planner sales training, keynote sales speaker, conference\r\n        speaker, conference training program, meeting planner tips, convention\r\n        meeting planner, speaker\r\n        bureau, conference speaker, national sales meeting planner, event planning ideas, training\r\n        meeting programs, free meeting \r\n        tips, conference training program, sales training seminar, workshop,\r\n        in-house training meeting, national training meeting speaker, trainer,\r\n        speaker bureau. mstheme mstheme mstheme msnavigation msnavigation"
    }
  ]
}