{
  "url": "http://www.treasury.govt.nz/forecasts/prefu/1999/summary.asp",
  "file_number": "761",
  "content_hash": "b5dc24bb33ec6fed8a2f4572b9f62393f746bdb0751937d49a8136f00d6b330f",
  "total_blocks": 323,
  "retained_blocks": 27,
  "ignored_blocks": 296,
  "blocks": [
    {
      "tag": "div",
      "text": "About Treasury New Zealand Economy Budgets & Forecasts Careers Financial Statements Debt Management Working Papers Tax ECO Managing the Public Sector HOME | Contact Us | About this Site | Publications Index | Disclaimer <ul style='margin-left: -15'> Budget Policy Statement 2007 Budget 2006 Previous Budgets Budget Process Latest Forecasts SNA Forecasts Forecasting Process Previous Forecasts Search Pre-Election Economic & Fiscal Update 1999"
    },
    {
      "tag": "p",
      "text": "<Previous Contents"
    },
    {
      "tag": "h2",
      "text": "Executive Summary (continued)"
    },
    {
      "tag": "h3",
      "text": "Summary of Treasury’s Pre-election Economic and Fiscal Forecasts"
    },
    {
      "tag": "p",
      "text": "This summary sets out the economic and fiscal outlook for the next\r\n      three years. A number of risks to the outlook may lead to a significant\r\n      change in the growth path. Scenarios for higher and lower than forecast\r\n      growth provide illustration."
    },
    {
      "tag": "h4",
      "text": "The Economic Outlook"
    },
    {
      "tag": "h5",
      "text": "Steady export-led growth on the back of a positive world outlook."
    },
    {
      "tag": "p",
      "text": "Figure 1 – GDP growth Sources: Statistics New Zealand, The Treasury Despite contracting in the June 1999 quarter, the economy is set for\r\n      solid expansion with quarterly growth expected to run somewhat above trend\r\n      over the early part of the forecast period. Annual average growth is\r\n      expected to be around 2½% in the year to March 2000, 3½% in the\r\n      following two years, and 3% in the final year of the forecast period. Conditions for growth remain positive. Stronger world demand and a more\r\n      competitive exchange rate mean exports now count for a greater proportion\r\n      of growth than at Budget time - although overall growth in the out years\r\n      remains little changed. Figure 2 – Trading partner growth Sources: Consensus Forecasts Inc, The Treasury Global growth prospects have improved through this year. Trading\r\n      partner growth is now expected to be 3% in both 1999 and 2000. For 1999\r\n      this marks a doubling on the growth expected at the start of the year.\r\n      Monetary conditions also remain stimulatory with low interest rates and a\r\n      competitive exchange rate. Robust growth in manufactured exports and tourism activity is expected\r\n      to continue, underpinned by stronger global demand and a competitive\r\n      exchange rate. The America’s Cup and the Sydney Olympics give an\r\n      additional boost to the tourism sector. Commodity exporters are expected\r\n      to shake off the effects of the droughts and gain from recovering world\r\n      commodity prices."
    },
    {
      "tag": "h5",
      "text": "Boost from strengthening labour market partly offset by price and debt\r\n      pressures."
    },
    {
      "tag": "p",
      "text": "Figure 3 – Employment and unemployment Sources: Statistics New Zealand, The Treasury Household spending is supported by steady employment and wage growth.\r\n      Firms are expected to lift their demand for staff in line with a steadily\r\n      growing economy. Employment growth peaks at an annual 2.7% in 2001. The\r\n      unemployment rate falls to below 6% in 2001/02. Incomes receive an\r\n      additional fillip in the March 2001 year from the planned tax cuts. Figure 4 – Household debt and debt servicing Sources: Statistics New Zealand, The Treasury However, in the near term households feel the pressure of rising oil\r\n      prices. Over the medium-term, increasing debt levels and rising debt\r\n      servicing costs see spending growth slow and savings modestly rebuilt."
    },
    {
      "tag": "h5",
      "text": "Modest tightening in monetary conditions."
    },
    {
      "tag": "p",
      "text": "The economy is likely to run into capacity constraints by around late\r\n      2000. However, a modest monetary tightening wards off inflationary\r\n      pressures. This keeps the economy on a sustainable growth path. Figure 5 – Consumers price index excluding credit services Sources: Statistics New Zealand, The Treasury Short-term interest rates are forecast to climb to 7.0% by the 2002\r\n      year and the exchange rate is expected to show a modest rise. The\r\n      continuing large current account deficit is assumed to limit the rise in\r\n      the exchange rate. Rising oil prices are largely behind a spike in annual inflation to\r\n      2.7% in the year to March 2000. This is not, however, expected to lead to\r\n      more sustained inflationary pressures. Figure 6 – Current account Sources: Statistics New Zealand, The Treasury In the near term, the oil price rise and some one-off large imports,\r\n      such as a frigate, and higher returns to foreign direct investment in New\r\n      Zealand, see the current account deficit increase to 8.3% of GDP. That is\r\n      expected to improve over the forecast horizon, falling to 5.8% of GDP by\r\n      the end of the period."
    },
    {
      "tag": "h4",
      "text": "The Fiscal Outlook"
    },
    {
      "tag": "h5",
      "text": "Operating balance grows with revenue growth outpacing expense growth."
    },
    {
      "tag": "p",
      "text": "Figure 7 – Operating balance Source: The Treasury The 1998/99 operating balance of $1.8 billion was boosted by large\r\n      one-off items including gains on sale of assets. Excluding the one-off\r\n      items, the operating balance was around $150 million. The 1999/2000 operating balance of $14 million reflects: the absence of any similar large one-off items lower SOE and Crown entity surpluses, with the recognition of the\r\n          ACC outstanding claims liability (around $500 million) expense growth, mainly in social welfare, health and education\r\n          (around $800 million) These effects are partly offset by: growth in tax revenue (around $1,200 million) arising from the\r\n          economic recovery. Beyond 1999/2000 the operating balance rises, with revenue growth\r\n      (averaging 4.8% a year) outpacing expense growth (averaging 2.8% a year). As a percentage of GDP, expenses fall between 1999/2000 and 2002/03\r\n      from 35% to 33%. Figure 8 – Expenses ($ and % of GDP) Source: The Treasury In dollar terms, over the same period, expenses increase from $36\r\n      billion to $39 billion reflecting: growth in the provision for future initiatives of $1,460 million,\r\n          providing for the cost of future policy decisions CPI indexation and beneficiary growth of around $800 million– most\r\n          growth is after 2001 when the New Zealand Superannuation (NZS)\r\n          eligibility age settles at 65 health and education spending increases of $800 million."
    },
    {
      "tag": "h5",
      "text": "Net debt is stable in dollar terms, but falls as a percentage of GDP,\r\n      over the forecast period."
    },
    {
      "tag": "p",
      "text": "Figure 9 – Net debt (% of GDP and $) Source: The Treasury In 1998/99 net debt was $21.7 billion. Net debt rises in 1999/2000 and\r\n      2000/01 before falling to slightly below its 1998/99 level. The rise reflects: an operating cash deficit increased capital investment for health, education and capital\r\n          investment for At Work Insurance (1999/2000 only). Improving operating cash-flows drive the fall in 2001/02 and 2002/03. As a percentage of GDP net debt falls from 21.8% to 17.8% between\r\n      1998/99 and 2002/03 as nominal GDP grows."
    },
    {
      "tag": "h5",
      "text": "Net worth grows over the forecast period."
    },
    {
      "tag": "p",
      "text": "Figure 10 – Net worth Source: The Treasury In 1998/99 net worth fell from $10 billion to $6 billion. The fall\r\n      reflects ARCIC’s recognition of the future cost of already accepted ACC\r\n      claims ($6.1 billion), partly offset by a $1.8 billion operating surplus. Beyond 1999/2000, net worth increases in line with operating balance\r\n      surpluses."
    },
    {
      "tag": "h5",
      "text": "Compared to Budget, the operating balance is largely unchanged, but\r\n      net debt and net worth improve."
    },
    {
      "tag": "p",
      "text": "The operating balance forecasts are largely unchanged from the Budget.\r\n      The balance is $50 million higher in 1999/2000, $6 million higher in\r\n      2000/01 and $155 million higher 2001/02, reflecting: higher nominal GDP forecasts, increasing tax revenue and slightly\r\n          reducing benefit spending the removal of the contingency expense provision for legal\r\n          liabilities ($100 million a year). These effects are largely offset by: a downward revision to the estimated 1998/99 corporate tax base\r\n          following higher than forecast overpayments of corporate tax. This\r\n          impacts on all years. tax rate reductions. By the end of the forecast period these are\r\n          largely funded from the provision for future initiatives. The\r\n          remainder lowers the operating balance by $245 million, $165 million\r\n          and $85 million in 2000/01, 2001/02 and 2002/03 respectively. Net worth forecasts, however, are stronger by between $650 million and\r\n      $830 million over the forecast period largely reflecting the lower ACC\r\n      outstanding claims liability valuation at 30 June 1999. Net debt forecasts are lower by between $100 and $300 million. These\r\n      improvements largely reflect a better starting position in 1998/99 than\r\n      forecast in the Budget and stronger dividend flows from SOEs in 1999/2000."
    },
    {
      "tag": "h4",
      "text": "Risks and Scenarios"
    },
    {
      "tag": "p",
      "text": "The Central Forecast embodies a steady export-led expansion. As always\r\n      there are risks and uncertainties surrounding this central track, raising\r\n      the prospect of the economy following quite different growth paths to that\r\n      presented here. Stronger world growth, for example, could see additional\r\n      strength in our economy over the first part of the forecast period. The\r\n      economy would hit capacity constraints sooner, producing a sharper cycle\r\n      than forecast. Figure 11 – Real GDP growth Sources: Statistics New Zealand, The Treasury But there are also risks around the sustainability of the current\r\n      global recovery: most prominently, the possibility of a sharp correction\r\n      in equity prices in the US. Slower world growth would undermine the\r\n      strength of New Zealand’s recovery leading to a more modest growth path\r\n      than envisaged here. There are also risks associated with the domestic economy. The June\r\n      quarter GDP outturn has raised the possibility of some near term weakness.\r\n      Over the medium term it is by no means certain how consumers will react to\r\n      higher debt. If any of these circumstances were to develop differently than allowed\r\n      for in the Central Forecast, they could produce outcomes where economic\r\n      growth is stronger or weaker than embodied in the Central Forecast. This\r\n      would have flow on effects for the fiscal forecasts. Examples of a high growth (Stronger World Economy) scenario and a low\r\n      growth (Weaker World and Household Sector) scenario help illustrate some\r\n      of these risks. Figure 12 – Operating balance Source: The Treasury Alternative economic scenarios lead to alternative fiscal outcomes,\r\n      mainly because of differences in the outlook for nominal GDP, a key driver\r\n      of tax revenue. The Stronger World Economy scenario leads to a stronger\r\n      operating balance throughout the forecast period. In contrast, the Weaker\r\n      World and Household Sector scenario sees the operating balance record\r\n      modest deficits in the first two years of the forecast period, but return\r\n      to surplus over the final two years."
    },
    {
      "tag": "h4",
      "text": "Economic Outlook [1]"
    },
    {
      "tag": "p",
      "text": "(Annual average % change, March years) 1999 Actual 2000 Pre-EFU 2001 Pre-EFU 2002 Pre-EFU 2003 Pre-EFU Private\r\n            Consumption 1.3 1.7 2.7 2.9 2.1 Public\r\n            Consumption (0.4) 6.4 (3.7) (0.9) 1.0 Total Private\r\n            Investment 2.0 11.2 5.3 9.3 9.4 Exports 2.1 3.2 8.2 5.2 4.6 Imports 3.4 10.2 2.9 6.4 6.9 GDP\r\n            (Expenditure Measure) (0.8) 3.4 3.5 3.3 2.9 GDP\r\n            (Production Measure) (0.2) 2.3 3.5 3.3 2.9 Unemployment\r\n            Rate 2 7.2 7.0 6.3 5.7 6.0 90-day Bill\r\n            Rate 3 4.5 5.0 6.0 7.0 6.5 CPIX\r\n            Inflation 4, 5 1.0 2.7 1.8 2.1 1.6 Nominal GDP\r\n            (Expenditure) 0.6 3.9 5.6 5.2 4.6 Current\r\n            Account Balance (5,699) (8,557) (6,957) (6,909) (6,970) - % of GDP (5.8) (8.3) (6.4) (6.1) (5.8) TWI 3 57.6 56.3 57.5 58.7 60.0"
    },
    {
      "tag": "h4",
      "text": "Fiscal Outlook [1]"
    },
    {
      "tag": "p",
      "text": "($ million,\r\n              June years) 1999 Actual 2000 Pre-EFU 2001 Pre-EFU 2002 Pre-EFU 2003 Pre-EFU Total\r\n              Revenue 36,357 35,755 37,156 39,089 40,912 Ratio to\r\n              GDP (%) 36.5 34.4 33.8 33.9 33.9 Total\r\n              Expenses 35,825 36,183 37,019 38,054 39,190 Ratio to\r\n              GDP (%) 35.9 34.8 33.7 33.0 32.5 Contribution\r\n              from SOEs and CEs 1,245 442 659 624 619 Operating\r\n              balance 1,777 14 796 1,659 2,341 Ratio to\r\n              GDP (%) 1.8 0.0 0.7 1.4 1.9 Crown\r\n              Balance 6,022 6,079 6,875 8,534 10,875 Net Crown\r\n              Debt 21,701 23,322 23,650 22,852 21,455 Ratio to\r\n              GDP (%) 21.8 22.4 21.5 19.8 17.8 Sources: Statistics New Zealand, The Treasury Notes: 1.  Economic projections were finalised on 1\r\n      October, fiscal projections on 11 October 1999. 2.  Percentage of the labour force, March\r\n      quarter, seasonally adjusted. 3.  Quarterly average. 4.  Annual percentage change, March quarter. 5.  CPIX refers to the Consumer Price Index\r\n      excluding credit services. <Previous Contents © Crown Copyright . The Treasury, 1 The Terrace, PO Box 3724, Wellington, NEW ZEALAND. Tel: +64 4 472 2733. Fax: +64 4 473 0982. Email: Treasury Webmaster ."
    }
  ]
}