{
  "url": "http://www.tripadvisor.com/Hotel_Review-g147275-d151573-Reviews-Hotel_Club_Kawama-Varadero_Beach_Cuba.html",
  "content_hash": "fabe05bf6c3db33e9c181ffb2eec01e36e417014f6fe4e18aa67c4601fff3b49",
  "total_blocks": 638,
  "retained_blocks": 32,
  "ignored_blocks": 606,
  "blocks": [
    {
      "tag": "div",
      "text": "web18w.tripadvisor.com PRODUCTION PRODUCTION HEADER"
    },
    {
      "tag": "h1",
      "text": "Hotel Club Kawama"
    },
    {
      "tag": "div",
      "text": "Sign in • Sign up END HEADER Home > Caribbean > Cuba > Varadero Beach > Varadero Beach Hotels > Hotel Club Kawama Varadero Beach tourism: Overview Hotels Flights Attractions Deals Forums Maps, etc. Search (e.g., Boston hotels, Las Vegas, Paris art museum) Varadero Beach Varadero Beach Overview Varadero Beach Hotels Hotel Club Kawama All Varadero Beach Hotels Flights to Varadero Beach Varadero Beach Deals Varadero Beach Attractions Varadero Beach Forums Varadero Beach Maps Varadero Beach Discount Hotels Free Newsletter Interested in Hotel Club Kawama and Varadero Beach ?"
    },
    {
      "tag": "p",
      "text": "We'll send you updates with the latest deals, reviews and articles for Hotel Club Kawama and Varadero Beach each week."
    },
    {
      "tag": "div",
      "text": "Hotel Club Kawama Cuba e-mail this page to a friend"
    },
    {
      "tag": "h2",
      "text": "Deals on Varadero Beach Hotels"
    },
    {
      "tag": "div",
      "text": "Tryp Peninsula Varadero Barcelo Solymar Sol Palmeras Hotel Palma Real Melia Varadero Hotel Club Kawama Barlovento Hotel Gran Caribe Hotel Varadero Internacional Arenas Blancas Hotel"
    },
    {
      "tag": "h2",
      "text": "More Varadero Beach Hotels"
    },
    {
      "tag": "div",
      "text": "Iberostar Varadero Iberostar Tainos Melia Las Americas Blau Varadero Hotel Sandals Royal Hicacos Paradisus Varadero Playa Alameda Varadero Iberostar Bella Costa Paradisus Princesa del Mar Resort & Spa SuperClubs Breezes Varadero Sol Cayo Santa Maria Gran Caribe Club Hotel Barlovento Playa Caleta Hotel Los Delfines Coralia Club Playa de Oro Varadero Barcelo Marina Palace Hotel Villa Cuba Riu Las Morlas Brisas del Caribe LTI Tuxpan Playa Varadero 1920 Paradiso & Puntarena Resort Beaches Varadero Hotel Arenas Doradas Mercure Cuatro Palmas Club Amigo Varadero Riu Turquesa Mansion Xanadu Sol Sirenas-Coral Resort Villa Tortuga Islazul Hotel Pullman Hotel Sunbeach Islazul Mar del Sur Aparthotel Islazul Canimao Hotel Islazul Hotel Dos Mares Islazul Oasis Hotel Club Tropical Club Karey Islazul Villa La Mar Islazul Villa Sotavento Traveler Reviews Write a review . What was your experience with Hotel Club Kawama? Tell others what's hot and what's not. Varadero Beach Hotel Club Kawama Calle 1 Reparto Kawama Cuba Read more"
    },
    {
      "tag": "h2",
      "text": "Varadero Beach tourism"
    },
    {
      "tag": "h1",
      "text": "Hotel Club Kawama"
    },
    {
      "tag": "div",
      "text": "Average price*: $ 155 #40 of 202 hotels in Cuba Calle 1, Reparto Kawama, Cuba Rooms: 235 TripAdvisor traveler rating: Candid traveler photos Map this hotel Sponsored links *"
    },
    {
      "tag": "h2",
      "text": "Best deals: Hotel Club Kawama"
    },
    {
      "tag": "div",
      "text": "Hotel Club Kawama : \n          Book Now - Pay on Checkout! Venere.com Buying Direct Means Lower Prices. Hotel, B&Bs, Apartments and More."
    },
    {
      "tag": "h2",
      "text": "Related search results: Cuba"
    },
    {
      "tag": "div",
      "text": "Book it Yourself and Save www.book-it-yourself.com Huge Savings on Holidays and Hotels by Booking with Operators Direct. Club Kawama directholidays.co.uk Check out the holiday prices at another direct travel supplier Havana : \n          Book Now - Pay on Checkout! Venere.com Buying Direct Means Lower Prices. Hotels, B&Bs, Apartments and More. All results: View all deals for Cuba --> TripAdvisor Traveler Reviews Have you stayed here? Rate this hotel. Terrible Okay, but some problems Average Above average Excellent Language: English first French first German first Italian first Spanish first Sort by: Date: Newest first Date: Oldest first User rating: Highest first User rating: Lowest first Next Reviews in English\n            (1-10 of 93) Nov 30, 2006 \"Neneong and Ian in Kawama!!!!\" Neneong , Stoke on Trent Well, like a lot of people, I was worried when I read the reviews.DON'T PANIC, KAWAMA IS FAB!!!!!!Room great, location great, pool great, beach great, nightclub great. Food is same old, same old as... Oct 4, 2006 \"Best holiday ever\" harmera , Wales This was the best holiday ever, the staff were brilliant and did everything they could to help. the rooms were clean and comfortable, the food was at time a little strange, but bear in mind that they had... Ad Tags: hserver\nkeyword=Hotel_Club_Kawama\nsite=TA.US.NONE\narea=NA.Caribbean.Cuba.Varadero_Beach\npool=B\npagetype=Hotel_Review\nPageID=9560781\nacc_random=943076011\nAAMSZ=300X250 Sep 23, 2006 \"Excellent hotel where you're guaranteed to relax and have fun\" alexa1977 , scotland Wow!! Just back from Kawama and we had a fantastic time!!! I had been really worried about going after reading some of the reviews but we couldnt have enjoyed it more.  Ok, so the room wasnt great - but... Sep 10, 2006 \"One holiday i will never forget\" shekat , ontario I was on hoilday with a friend at the resort for 7 days. I was not empress at all. The day we arrived we were at Hotel Club Kawama At noon.  They had 2 girls on the front desk and 3 bus's all came in at... Aug 18, 2006 \"give it a try\" katiejayne , england Went not expecting what we got, beautiful hotel, very friendly staff and a view! Felt very safe as there were security present 24hrs a day. The food was quite plain but good,go early for a good choice.... Jun 20, 2006 \"I will be back!\" A TripAdvisor Member , Edmonton, Alberta, Canada I got back from Club Kawama on June 5th. I had tears in my eyes when I left!The people were incredibly friendly, my room was gorgeous and right next to the pool. All the staff would smile and say hi as... May 27, 2006 \"great place,best people\" fredrikfalcon , england just back from long flight,must say kawama is great.maybe needs the decor tiding up but the staff are excellent, service good and beach breathtaking.i must disagree about the food,after five days eating... May 3, 2006 \"We Love Kawama\" callmecraazy , Kitchener, Ontario Hi, my sister and I spent a week at Club Kawama and loved every minuite of it.  We can't understand how anyone would have anything bad to say about this resort.The food was good, always lots of selection,... May 1, 2006 \"great vacation despite the front desk staff\" POP_Princess , Ottawa, ON, Canada I just returned from a week stay at the Hotel Club Kawama in Varadero Cuba. Although quite nervous before the trip due to many negative reviews I decided to go to this hotel with an open mind. The... Apr 28, 2006 \"prisoner cell block h\" A TripAdvisor Member , ENGLAND Just arrived back from 2 weeks of what can only be described as the worst holiday hotel on planet earth.Miserable staff,Cold food,drink shortage,shabby accomadation,cockroach fly & mosquito infested &..."
    },
    {
      "tag": "p",
      "text": "1-10 of 98 Next"
    },
    {
      "tag": "div",
      "text": "Sponsored links *"
    },
    {
      "tag": "h2",
      "text": "Best deals: Hotel Club Kawama"
    },
    {
      "tag": "div",
      "text": "Hotel Club Kawama : \n          Book Now - Pay on Checkout! Venere.com Buying Direct Means Lower Prices. Hotel, B&Bs, Apartments and More. All results: View all deals for Cuba --> From Around the Web: Hotel Club Kawama Expert Guidebooks (2) Title Source \"Hotel y Villas Kawama\" Frommer's \"Kawama\" This is Travel Related Web Comments (2) Title Source \"Hotel Club Kawama - Varadero\" Debbie's Caribbean Resort Reviews \"Club Kawama\" caribline.com Varadero Beach Travel Guide TripAdvisor Inside™ Written by real travelers like you. Transportation, things to do, dining out and more Created and updated all the time by real travelers Better than an outdated guidebook! Explore Varadero Beach Now! What's a wiki? Forums Get candid advice from real travelers! Title # of Replies Most Recent Reply \"Mardi- your opinion?\" 3 replies 6:42 pm, today \"Snorkelling at Paradisus Varadero\" 1 reply 3:39 pm, today \"Bella Costa - Since Renos\" 2 replies 2:57 pm, today Go to the Varadero Beach Forum Post a forums topic about Hotel Club Kawama Share your travel savvy! Join a discussion... Title # of Replies Time/Date Posted \"Snorkelling at the Barlovento , Varadero\" no replies 7:04 pm, today \"parasdiso\" no replies 5:53 pm, today \"arenas blancas\" no replies 4:38 pm, yesterday Browse Varadero Beach discussions Varadero Beach Varadero Beach is featured in the following goLists. Title Date Author Sunny Cuba May 2, 2006 Houdekova Cuban Carry - on May 1, 2006 Charlieo View all Varadero Beach goLists Create your own Varadero Beach goList"
    },
    {
      "tag": "h3",
      "text": "Research Other Varadero Beach Hotels"
    },
    {
      "tag": "div",
      "text": "Hotel Club Kawama not what you're looking for? Find out about other Varadero Beach hotels , or check out Varadero Beach hotel deals !"
    },
    {
      "tag": "h3",
      "text": "More Information on Travel in Cuba"
    },
    {
      "tag": "div",
      "text": "#?#TOP_CITY_HOTELS#?# Explore our site to find travel information and unbiased reviews on Varadero Beach tourism , attractions , maps and much more. Review Summary Based on 98 reviews worldwide"
    },
    {
      "tag": "p",
      "text": "Traveler Rating"
    },
    {
      "tag": "div",
      "text": "Overall"
    },
    {
      "tag": "p",
      "text": "What to expect"
    },
    {
      "tag": "div",
      "text": "Rooms Service Value Cleanliness Pool"
    },
    {
      "tag": "p",
      "text": "Recommendations"
    },
    {
      "tag": "div",
      "text": "Budget travelers Couples/romantics Families with young children Older travelers Young singles Sponsored links *"
    },
    {
      "tag": "h2",
      "text": "Hot deals: Cuba"
    },
    {
      "tag": "div",
      "text": "Santiago de Cuba : Book Now - Pay on Checkout! Buying Direct Means Lower Prices. Hotels, B&Bs, Apartments and More. Venere.com Havana : Quality hotels for less. Let the journey begin. Book and save with Opodo. Opodo.co.uk Iberostar Daiquiri : Best Price Guarantee! 24/7 Customer Support Great Hotels, Lower Prices! hotelopia.co.uk Melia Cayo Santa Maria : Quality hotels for less. Let the journey begin. Book and save with Opodo. Opodo.co.uk View all Cuba deals Free Newsletter Interested in Hotel Club Kawama and Varadero Beach ? Subscribe to our weekly TripWatch newsletter! Get the latest Hotel Club Kawama deals, reviews, and articles. Hotel owners: expand your listing About TripAdvisor™ TripAdvisor™ provides unbiased reviews, articles, recommendations and opinions on Hotel Club Kawama , Varadero Beach. Recommendations for hotels, resorts, inns, vacations, travel packages, travel guides and lots more! Visit TripAdvisor's international sites: About Us | Membership | Site Map | Become an Affiliate | Top Cities | Hotel Reservations | Hotel Deals | TripAdvisor™ Gear Popular Hotels: 1 , 2 , 3 , 4 , 5 , 6 , 7 , 8 , 9 , 10 , 11 , 12 , 13 , 14 , 15 , 16 , 17 , 18 , 19 , 20 , by city TripAdvisor™ Recommends: Las Vegas hotels , London hotels , Paris hotels , Rome hotels , New York City hotels , Chicago hotels , Orlando hotels © 2006 TripAdvisor LLC All rights reserved. TripAdvisor Terms of Use and Privacy Policy . * TripAdvisor LLC is not a booking agent and does not charge any service fees to users of our site... ( more ) This site has been tested in Internet Explorer 6.0, Mozilla Firefox 1.5, Netscape 7.1 and  AOL Explorer 9 on Windows Operating System and Safari 2.0 on Mac Operating System. TripAdvisor LLC is not responsible for content on external web sites."
    }
  ]
}