{
  "url": "http://www.unison.ie/irish_independent/index.php3?ca=35&issue_id=3433",
  "content_hash": "3948dd482941d9c262b37b029c2f9ce9e791a5dc846988b10a6619586c579b6d",
  "total_blocks": 215,
  "retained_blocks": 3,
  "ignored_blocks": 212,
  "blocks": [
    {
      "tag": "div",
      "text": "Advertisement Hi  7°C Lo  2°C You are here: Home > News > Irish Independent > Business Today's Date: Wed December 27th 06 Login Email Password Remember me? <a href=\"\" onclick=\"document.regional.submit();\"><font color=\"#000000\" size=\"2\"><b>Go</b></font></a> | Help? Newspapers >> - - - - - - - - - - - - - - - - - - National >> Irish Independent - - - - - - - - - - - - - - - - - - Sunday >> Sunday Independent - - - - - - - - - - - - - - - - - - Regional Newspapers >> Anglo Celt Bray People Carlow People Corkman Drogheda Independent Enniscorthy Guardian Fingal Independent Gorey Guardian Kerryman Meath Chronicle Nenagh Guardian New Ross Standard Offaly Independent Sligo Champion Southern Star The Argus Tuam Herald Westmeath Examiner Westmeath Independent Wexford People Wicklow People - - - - - - - - - - - - - - - - - - World >> New Zealand Herald London Independent IOL South Africa Issue Date Mon, Nov 27 00 <div align=\"center\">start main table Jobs Property Cars Shopping Travel Place My Ad Irish Independent National News Weather International News Business Sport Analysis Classifieds Archives World News Regional News Breaking News Mobile Services Digital News Services Weather News Feeds Football GAA Football Hurling Rugby Golf Motor Sport Horse Racing Other Sports Book Tee Times Ryder Cup 2006 Irish News European News World News IT Sector Personal Finance Farming News SSIA Guide Stock Quotes Currency Rates Budget 2007 TV General News Film Music Health Lifestyle Food & Drink Listings Mobile Madness Crossword Horoscopes E-Cards Lotto Dating Gaming Shopping News Travel Advice 48 Hours In Information Technology IT Literacy Business Studies Personal Development Office Productivity Project Management Ryder Cup 2006 Budget 2007 Education Eureka Register Surf Safe PC Support Mobile Madness Directory Free Content Tutorial start main content area spacer TR ROW start main content section TABLE start of news column START TOP BOX TOP STORIES TOP STORIES Business EU ministers fight over tax veto change FINANCE Minister Charlie McCreevy joined several EU colleagues in opposing any change to the national veto on tax policy, when EU finance ministers began a two-day meeting in Brussels yesterday. read on >> Citywest presses go 'live'  ahead of schedule INDEPENDENT Newspapers has begun printing from its  new 50m colour production plant one month ahead of schedule. read on >> Central Bank warns on three investment firms THE Central Bank has named three investment firms it says  are conducting unauthorised business in Ireland. read on >> Are you entitled to benefit from pre-1953 pension changes? If you were paying Social Welfare contributions before 1953, you may qualify for a special pension, writes Jim Aughney read on >> TOP 2 CONTENT BOXES Vodafone BEGIN: AdSolution-Redirect-Tag 4.3 : IND - BUSINESS / Business Content Box END:AdSolution-Tag 4.3 For more information click here . Dell FactoryOutlet Dell Outlet is a division of Dell products WIN A DELL OUTLET INSPIRON NOTEBOOK ENTER PRIZEDRAW NOW and you could WIN a Dell Outlet notebook Great prices on all refurbished Dell Products! Buy online now - www.dell.ie/outlet/unison or call our Telesales line on 1850-964-312 end right column advert banner/buttons END TOP BOX CONTENT BOXES RIGHT STORIES Budget 2007 For all you need to know about Budget 2007, visit our special feature section here Gift Guide"
    },
    {
      "tag": "p",
      "text": "You'll have to do better than socks this year... With our gift guides there are no excuses! Fashion for all | Beauty For the home | Charity gifts Gadgets | Games Toys | Educational toys Books | DVDs | CDs The DIRT scandal: why they don't think it's all over THIS week sees the resumption of hearings at the Public Accounts Committee. There is a tendency to think that having heard in detail about the behaviour of various financial institutions and arms of the state on the mechanics of DIRT fraud, that is the end of it. read on >> Strike ballot at Ulster Bank STAFF at Ulster Bank have given their trade union the  go-ahead for a strike ballot over what they claim are proposals to cut pay and get rid of hundreds of jobs. read on >> IDA park at Greystones  could provide 7,000 jobs A LARGE new business park in Greystones, Co. Wicklow  could generate up to 7,000 jobs, the Sunday Times reports. read on >> EasyJet car rental firm faces inquiry into 'damage rip-off' The car rental firm set up by the no-frills airline easyJet is being investigated by the Office of Fair Trading after receiving dozens of complaints from customers that they had been ripped off. read on >> B&B to sell ISAs online via link-up with FundsHub Bradford & Bingley, the former UK building society which is coming to the stock market with a stg1.2bn-1.5bn price tag next week, is poised to unveil plans to launch its own funds supermarket selling ISAs and unit trusts over the Web. read on >> Solution in a box for Sainsbury's home deliveries headache Delivering internet-ordered goods to customers' homes when they are out is one of the central problems facing business-to-consumer e-commerce companies, but it is starting to be tackled from a variety of angles. read on >> Prescott to act as water industry restructuring threatens standards Deputy Prime Minister John Prescott is becoming increasingly concerned about the number of water companies in the UK working on plans to separate the ownership and management of their assets and is considering launching a wide-ranging review of the structure of the whole industry. read on >> Start-ups not fazed by gloomy business outlook, says 3i survey Start-up companies in the UK and Continental Europe are still confident about their own prospects, with a considerable number planning to list on the stock market despite the recent market declines. read on >> This woman's watching you, Big Brother MI5, fax marketeers, nosey employers: Elizabeth France keeps an eye on them all. As Data Protection Commissioner in the UK, she makes no secret of her zest for protecting privacy. read on >> Blair promises to cut business red tape Prime Minister Tony Blair will today announce plans to cut the burden of regulation on British business. News Update, 27/11/00, 14:22 read on >> Tobacco giant's profits hit by black market Cigarette black marketeers who smuggle to evade high levels of duty are responsible for flat UK profits at Imperial Tobacco, it said today. News Update, 27/11/00, 14:24 read on >> Bank of England accused of \"illegal\" sackings The Bank of England is being taken to an industrial tribunal over the sacking of six staff who refused to sign new \"inferior\" contracts. News Update, 27/11/00, 14:33 read on >>"
    },
    {
      "tag": "div",
      "text": "end of news column end main content section TABLE start gap between top and bottom TR ROW end gap between top and bottom TR ROW start bottom text links TR ROW Bookmark Unison.ie | About Unison.ie | Surf Safe | Corporate Services | Contact Unison.ie User Agreement | Terms And Conditions | Privacy Policy © Copyright Unison.ie Designed and hosted by Internet Ireland"
    }
  ]
}