{
  "url": "http://www.uniteddesign.com/idea_workshop1_97.html",
  "content_hash": "018f16fd1ec85d5085f981a5fbf2e8d95e5f5d63e42238bf57fe8aa524166554",
  "total_blocks": 20,
  "retained_blocks": 3,
  "ignored_blocks": 17,
  "blocks": [
    {
      "tag": "div",
      "text": "Zoned Heating and Cooling Systems"
    },
    {
      "tag": "p",
      "text": "From the first blast of winter through\rthe dog days of summer, it is a domestic power struggle more fierce than\rthe competition for the television remote control. When one thermostat\rcontrols the temperature for an entire house, it produces predictable results\rthat pit husband against wife and basement playroom against upstairs office\rin \" The Battle of the Thermostat \". The\rwar begins when dad turns the thermostat down because the family room is\rtoo warm. A few minutes later mom turns up the thermostat because the bedroom\ris too cold. Eventually, someone is opening a window or closing a vent\rto get the temperature just right, and no one is really comfortable. But\rthere's a better solution than family feuds or dressing in layers. Zoned heating and cooling systems\rallow you to control the temperature of each room individually. By\rusing a series of motorized dampers and thermostats that work independently,\rzoning can eliminate hot or cold rooms found in almost every home, while\rcutting energy by up to 25 percent, according to Anne Drake, a spokeswoman\rfor Honeywell's zone control systems. \" People like to save energy ,\rbut they don't like to sacrifice comfort,\" said Drake. \"Energy savings\rused to be the key thing in people's minds when it came to air conditioning\rand heating, now comfort is also a major consideration . When you\rsit down and explain to people what zoning does from a cost efficiency\rstandpoint, you are basically them comfort in their home.\" Simple\rlaws of physics illustrate why it is virtually impossible to keep an\rentire house at a consistent temperature without zoning. Warm air rises\rwhile cold air sinks, leaving upstairs rooms six to ten degrees warmer\rand basements six to ten degrees cooler than ground level rooms. A single\rthermostat keeps the temperature balanced in the room where it is located,\rbut can't tell if the temperature has changed in other rooms of the house.\rZoning helps maintain a consistent temperature throughout the house by\rproviding different levels of air distribution to different areas of the\rhome. Zone controlled systems divide a\rhome into areas with common heating and cooling needs during specific parts\rof the day. Air flow is controlled in each area by a separate thermostat.\rInstead of sending the same amount of heated or cooled air into all room\revery time the furnace or air conditioner is turned on, the system sends\rconditioned air only to the zones that need it. Temperaturs can be kept\rat an ideal comfort level when the family is up and about, then changed\rto an energy-saving temperature overnight or when the family is away. For example, in a typical two-story\rhouse, the main floor with the living room, kitchen and dining area, is\rusually occupied during the evenings. Bedrooms are occupied mostly at night\rand in the early morning. With zoning, you can cool or heat one area\rof the house at a time. You can also select different temperature settings\rfor each zone of the house. In most homes, a two or three zone system is\rsufficient. Rarely does a home equire more than three zones. Most homes can be zoned according\rto room occupancy , but unique exposure factors may require a different\rzoning strategy. A room with large amounts of glass facing south or west\rwill have more heat gain than other rooms in the home. A separate zone\rmight be required for that room alone! At an average price of $1,200, zone\rcontrol systems provide a cost efficient alternative to dual air systems\rthat require separate air conditioners and furnaces for different areas\rof the house, according to Ron Reinhardt of Research Products Corporation.\r\"It justs makes sense. You become more comfortable in your home, and you\rsave money.\" Zone control is especially effective\rin homes that have multiple levels, spawling designs, large glass windows,\ror large open areas such as an atrium or solarium . Existing homes with\rfinished basements, attic spaces and additions are also good candidates\rfor zoning. Almost all forced air systems can be converted for zone control,\raccording to Reinhardt. \"A control panel, thermostats, dampers and the\rproper duct work are all it takes.\" Builders are still learning about zone\rcontrol systems, even though HVAC contractors have been installing them\rfor the last five years or more. Zoning is still be introduced in some\rregions of the United States and has been well received by the home-buying\rpublic. \"Almost every time I sat down to write\rcontract with a home buyer, the first thing they wanted added to their\rhome was zone heating and air conditioning,\" said Dennis Belk, a division\rmanager for Dobson Builders in Greenville, South Carolina. Dobson has made\rzoned controlled heating and air a standard feature in homes priced over\r$120,000. While still in it's infancy, zoning is\rto heating and cooling what the light switch is to lighting. Virtually\rall homes come equipped with more than one light switch, and one day soon,\rhomes may come with more than one thermostat. Sharon Ray is a freelance writer\rbased in Atlanta, Ga. Copyright © 1996-99 Good Cents\rEnergy Services"
    },
    {
      "tag": "div",
      "text": "UDA\rIdea Workshop Journal Thank you for your interest\rin UDA Ideal Home Plans TM . To learn more, Subscribe to the Free UDA eNewsletter and receive informative\rarticles on Home Design and Planning, as well as updates on New Plan Releases\rand Special Offers. For further information, our DesignConcepts\rCatalog features over 100 Best-Selling Designs, plus innovative ideas\rfor planning your next home. For questions or comments please\rcontact UDA Customer Service at info@uda1.com Sales & Service 1-800-700-UDA1\r(8321) www.uniteddesign.com Copyright © 1996-2001\rUnited Design Associates, Inc. All Rights Reserved."
    }
  ]
}