{
  "url": "http://www.unitstudy.com/articles/Giving%20Thanks.htm",
  "file_number": "777",
  "content_hash": "83e72ae0fb977da5671d5584fb4481ed3613be84c84a86af44f7a0c106eb1988",
  "total_blocks": 17,
  "retained_blocks": 5,
  "ignored_blocks": 12,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation msnavigation"
    },
    {
      "tag": "p",
      "text": "Home Giving Thanks! Copyright 2003 Amanda Bennett -- All Rights Reserved This is the time of year that the warm\r\n      weather is waning, you begin to notice the smell of burning leaves and\r\n      ripening apples. The clear cool breeze is on your face first thing in the\r\n      morning, and the children have new energy and interest in the season.\r\n      Autumn is here and isn't it beautiful? Atime for harvesting, canning,\r\n      preserving and getting stocked up for winter -- and the perfect time for\r\n      reflecting on the many things for which we should be thankful. Inumber among these: God,\r\n      our family, our home, our love and our great country. We have indeed been\r\n      blessed in this country, as were our forefathers and the early celebrants\r\n      of that first Thanksgiving in America -- both the Pilgrims and the Indians\r\n      that shared the meal and celebration together. At our house, we use this\r\n      time of gratitude and counting our blessings to study that first\r\n      Thanksgiving as an integral part of our homeschool studies. As with any unit study topic,\r\n      Itry to pick out all of the important subtopics, crossing the curriculum\r\n      spectrum many times. For example, when studying Thanksgiving, there is\r\n      plenty of historical information to examine, along with geography (ocean\r\n      crossings, continents, climates), science (plant varieties, growth,\r\n      propagation, some of the sicknesses of the time, animal life in the\r\n      region), art (N.C. Wyeth's paintings, clothing of the time, crafts), and\r\n      reading (both fiction and nonfiction books). When Ifirst began preparing\r\n      a unit study on Thanksgiving, Ihad the incorrect notion that my\r\n      understanding of that period of American history was fairly complete. Iwas certainly proven wrong as we progressed through our study! Ihad not\r\n      realized the extent of the sacrifice made by the Pilgrims over that 13\r\n      year period, traveling to Holland for years, and then finally returning\r\n      to England to take part in the colonization of America. Inever really\r\n      knew or understood the origin of the \"King James\" version of the\r\n      Bible and how it was connected to the Separatists. Each year, we focus on\r\n      different aspects of the event. This year, we will take a look at what was\r\n      involved in their survival in a new land -- when we started making our\r\n      list of what we would do if we were the Pilgrims, my son chimed in\r\n      \"find a Walmart!\" The reality of being in the middle of nowhere\r\n      to maintain your religious beliefs, giving up what was so familiar and\r\n      comfortable to go to an unknown destiny was pretty amazing to them. This\r\n      was exactly the concept that Iwanted them to understand -- that\r\n      sacrifices are oftentimes made for what you believe in, and to trust in\r\n      the Lord to lead and protect you. As we work our way through this study , we have many, many activities and studies that we enjoy. For\r\n      example, a popular question has been over the difference in Indian corn\r\n      and table corn, as we know it. This opens the door to an opportunity to\r\n      help them learn more about the differences in plant varieties and about\r\n      the gardening practices of both the Pilgrims and the Indians. Not only are we looking at\r\n      some of their survival gardening, we are also trying to get a better\r\n      understanding of what types of shelter they built, what kinds of sickness\r\n      they had to deal with and why we don't have those illnesses today. There\r\n      are many aspects of their daily living that we can't easily relate to from\r\n      our own experience, and it is important for the children to\r\n      \"see\" what life was like then, the tools they used, the things\r\n      they did without, the responsibilities of each family member, and the\r\n      importance of their faith and trust in God to provide for their needs. One of the books that opened\r\n      my eyes to a broader view of the politics and history of the Pilgrims'\r\n      journeys was Saga of the Pilgrims: From Europe to the New World ,\r\n      by John Harris (published by Globe Pequot Press). This book, written for\r\n      the seventh grade and up, is very interesting reading and certainly\r\n      presented a new perspective on these religious outcasts. Irecommend that\r\n      both parents and the older children read this one -- it is a very\r\n      informative and interesting book to share and discuss. For the younger\r\n      children, a comparable book might be If You Sailed on the Mayflower in\r\n      1620 , by Ann McGovern (published by Scholastic). As we study the Pilgrims and\r\n      the people involved in this \"new beginning\", the characters of\r\n      the people and some of the flavor of their hopes and dreams, ideas, work\r\n      ethic, and humor come to light, and are appreciated by those involved in\r\n      the study. When their first winter is reflected upon, one can't help but\r\n      feel the loss of so many loved ones on a personal level. The resourcefulness and\r\n      foresight of these religious outcasts helped lay some secure and strong\r\n      foundations for our country. When they took the time and painstaking\r\n      effort to write and bring to acceptance the Mayflower Compact, they\r\n      unknowingly developed the long-lasting concept of freedoms and rights that\r\n      we Americans enjoy and expect. People tend to develop a much deeper\r\n      appreciation of these freedoms when they get some hands-on exposure to\r\n      just exactly what prices have been paid to obtain and protect those\r\n      freedoms, and it is my goal that this study will help the children develop\r\n      a solid understanding and appreciation of these principles and ideals. As you begin a unit study\r\n      about Thanksgiving, try to include as many interesting books and\r\n      activities as possible. Consider writing to the living history museum,\r\n      Plimoth Plantation, for additional materials and ideas. Their address is\r\n      Plimoth Plantation, Public Relations Department, P.O. Box 1620, Plymouth,\r\n      MA 02360. If you cannot visit Plimoth Plantation in person (some of us\r\n      live a bit FAR to do that!), there is a video that many libraries carry\r\n      titled: \"Plimoth Plantation: A Visit\" , produced by\r\n      VideoTours in their History Collection. Enjoy this season of giving thanks and bringing the harvest home. There is\r\n      so much to be thankful for, and as homeschoolers, we have even more to be\r\n      thankful for -- the chance to really know our children and walk the walk\r\n      with them, sharing and caring and motivating and learning beside them.\r\n      Enjoy the adventure, and may you and your family be abundantly blessed! Copyright 2005 Amanda Bennett PLEASE NOTE: This article is copyrighted, and may NOT be used or \r\ncopied without written permission of Amanda \r\nBennett . It is NOT in the public domain, and is protected by copyright laws. Thanks for your cooperation & understanding! Register your email \r\n\taddress to receive Amanda's free Unit Study Newsletter: msnavigation"
    },
    {
      "tag": "div",
      "text": "msnavigation msnavigation"
    },
    {
      "tag": "p",
      "text": "\"To every thing there is \r\na season, and a time to every purpose under heaven.\" Ecclesiastes 3:1 Copyright 2006 Amanda Bennett Contact Us Phone: 423-554-3381 AABennett Books, Inc. 595 Hope Lane Dunlap, TN 37327"
    },
    {
      "tag": "div",
      "text": "msnavigation"
    }
  ]
}