{
  "url": "http://homepages.tcp.co.uk/~maya/thug/thug7.html",
  "file_number": "78",
  "content_hash": "c82183dd10692ee456831be5704f88c65a1c8c7beb07c5d1691a725191cb21ec",
  "total_blocks": 1,
  "retained_blocks": 1,
  "ignored_blocks": 0,
  "blocks": [
    {
      "tag": "pre",
      "text": "August meets the Cult\r\n--------------------------\r\n\r\nAugust enters from the street outside.\r\n\r\nAugust has arrived.\r\n\r\nDen of the Red Moon\r\n    The scent of a sandalwood-like incense assaults the senses as one enters the main room of the\r\nRed Moon. A long, polished bar stretches out before the far wall, its back wall shelves littered\r\nwith bottles, jars, boxes, and tiny tins, as well as a large brass moon, similar to the one over the\r\noutside door. A number of low tables lie scattered about before the bar, with pillows set around\r\nthem for seats. Beaded curtains lead to a number of side rooms, which appear to be lounges of\r\nsome sort, with pillows scattered about the rooms for reclining upon. A narrow spiral staircase\r\nleads to an upper floor.\r\n    As the sun begins to sink away behind the near inner wall of the city, the red and violet panes\r\nof glass along the walls slowly fall dark. The bartender casually sets aglow a number of small\r\ncandles nestled within decorative red jars. A few young women sit in one corner of the room,\r\ntaking turns at inhaling cool, pale smoke from a hooka. Several older women hold a lively\r\nconversation in one of the side rooms, while nibbling on tiny pastries.\r\n\r\n(August)\r\n     Startling emerald eyes flash brightly from a face carved of slightly flushed mahogany, as\r\nringlets of long midnight hair frame an aquiline nose, high cheekbones and a smile of polished\r\nivory. Two golden hoops dangle from the man's left ear. The neatly trimmed fringe beard\r\nexaggerates the squareness of his jawline.\r\n     He moves with a feline grace and his voice is deep and vibrant.\r\n     A tabard of soft brown leather scales studded with bronze is stretched tight against August's\r\nbroad chest and dangles to his knees. Under the tabard is worn a blousey silk tunic of brilliant\r\ngreen and sheer black leggings tucked into knee high boots of soft black leather.\r\n     A round bronze pauldron, embossed with a stylized phoenix, gleams at August's right\r\nshoulder. From it to his left hip is slung a wide swordbelt of black leather from which depends a\r\nwickedly curved sabre. Padding and decorating the swordbelt is a fringed sash of bright greens\r\nand dazzling golds.\r\n     The pauldron also clasps an ebon cloak of silk-lined serge which drapes from his right\r\nshoulder. The fingers of August's right hand glitter with rings of precious stones and metals.\r\n\r\nA few men are leaning in the more shadowy corners, in grubby pale clothing, sipping from bowls\r\nof tea.\r\n\r\nYou paged August with 'Are you just wandering in blind, or have you been putting out word that\r\nyou want to \"talk\"?'.\r\n\r\nAugust enters briskly, smiling and nods familiarly to Jeskha. His bright smile dims, but doesn't\r\nfade as he notes the grubby men drinking tea. Walking towards the bar he flicks his cloak casually\r\nover his shoulder.\r\n\r\nAugust pages: Sorta blind..have IC reasons to look into you gentlemen...but haven't put out any\r\nword.\r\n\r\nThe eyes of the men follow him, but they make no move as yet.\r\n\r\nAugust sits down at the bar.\r\n\r\nOne mutters to another, low-voiced, and makes a twisting gesture with his hand.\r\n\r\nAugust speaks softly to Jeskha, and she whirls away into the storerooms for a moment. Eyes\r\nflickering to the long mirror over the bar, August settles comfotably into his stool.\r\n\r\nEventually the first man rises, and approaches August, soft-footed. He folds his hands and bows.\r\n\"Gracious jewelled peacock, a moment of your time.\"\r\n\r\nJeskha returns with a bottle of strange liquor and fetches a glass from behind the bar, filling it as\r\nshe nervously watches the exchange. The Peacock turns slowly on his stool to face the man, his\r\nmouth streched in a thin smile. He nods. \"Of course, what can I do for you, my good man?\"\r\n\r\nHe bows again. \"I speak of matters of interest to all men, noble lynx upon the prowl. Matters of\r\nfaith.\"\r\n\r\nAugust nods, eye's twinkling. \"An odd place, one might think, for such a topic. But such matters\r\ndo get my attention at times. Please, will you join me?\"\r\n\r\nThe man shakes his head. \"I had rather stand, noble sir. My questions are few enough: are you\r\ntrue and faithful to the truth?\"\r\n\r\nAugust inhales slowly, and nods. \"Indeed.\"\r\n\r\nHe nods, with an air of satisfaction. \"Do you acknowledge the Unicorn?\"\r\n\r\nAugust nods a second time. \"That I do.\"\r\n\r\nThe man folds his hands and bows again. \"Faithful one. Are you against the Whore of Chaos?\"\r\n\r\nThe corner of August's mouth twiches slightly, his smile subdued but his eyes alight yet with good\r\nhumor. \r\n\r\nAugust says \"I can't say as I've met her, sir.\"\r\n\r\nHis eyes darken. \"I refer to the Whore of the Lords of Chaos, the Shifter in the guise of the\r\nRightful Queen who sits above this city, most noble peacock of the sunset.\"\r\n\r\nAugust pages: How many of you?\r\n\r\nYou paged August with 'Two or three in the corners, plus the one questioning you.'.\r\n\r\nAugust pages: Thanks :)\r\n\r\n\r\n\r\n\r\nAugust's eyes flash angrily. \"I'm sure I misunderstand you sir. Is it our place to doubt the\r\nUnicorn's wisdom is choosing who rules here? Do you think the Queen could attain such a place\r\nif it was against the wishes of the Unicorn?\"\r\n\r\nThe man hesitates. \"It is well known that women are by nature devious and treacherous.\" His\r\nvoice becomes more certain. \"It is our place to act for the course of righteousness, as directed by\r\nthe Illuminated One.\"\r\n\r\nAugust shrugs. \"I do not find it my place to second guess the nature or will of the divine. I am a\r\nbut a man, and know my vantage point is low.\"\r\n\r\nAnother man in the corner finishes his tea, thoughtfully.\r\n\r\nThe first man bows again. \"It is our hope that you will find the truth, jewelled peacock of the\r\ndawn.\"\r\n\r\nAugust takes the glass from the bar, then sets it down and returns his attention to the nearest man.\r\n\"What wisdom has the Illuminated One imparted to you? As I am clearly impoverished in spiritual\r\npossessions, I would humbly ask for you to share this with me.\"\r\n\r\nThe man preens slightly. \"He has revealed to us the protection of the Unicorn upon her humble\r\nchildren, and set us to share this truth with others.\"\r\n\r\nAugust smiles, warming slightly. \"Ah, perhaps a blessing is visited upon us? What form does this\r\nprotection take? Or is it occult and beyond the sight of common men?\"\r\n\r\nThe man makes a twisting gesture before his forehead. \"It is of the soul. We shall sit in glory.\"\r\n\r\nAugust nods slowly. \"If a man wished to meet with this voice of the Unicorn, this Illuminated one,\r\nwhere would he travel?\"\r\n\r\nHe hesitates. \"Word may perhaps be taken, jewelled one.\"\r\n\r\nAugust stands slowly, his drink forgotten. He smiles. \"I pray you send word to him for me, a\r\nmessage can be left here, I shall surely receive it. My name is Sir August.\"\r\n\r\nThe man bows one last time. \"It shall be done. The Unicorn watch over you, jewelled peacock.\"\r\n\r\nAugust nods. \"And you as well, my friend.\"\r\n\r\nHe turns, and drifts towards the door, and is gone.\r\n\r\nJeskha shakes her head in annoyance, and August notes her at last. He produces a few coins and\r\nsets them on the counter. He turns towards the door."
    }
  ]
}