{
  "url": "http://www.vgib.com/faq.html",
  "content_hash": "747087aaa10e6ff6578c80ab099b1ac9d9db0107e77de3ab0e5e6cb5a7577f65",
  "total_blocks": 761,
  "retained_blocks": 3,
  "ignored_blocks": 758,
  "blocks": [
    {
      "tag": "div",
      "text": "#BeginTemplate \"/Templates/FAQ.dwt\" fwtable fwsrc=\"VG_Child01Screen.png\" fwbase=\"vg_child01screen.png\" fwstyle=\"Dreamweaver\" fwdocid = \"742308039\" fwnested=\"0\" #BeginEditable \"TitleGraphic\" #EndEditable < back | forward > #BeginEditable \"Content1\""
    },
    {
      "tag": "p",
      "text": "Frequently \r\n        Asked Questions We \r\n        strongly believe in educating our clients so they can be involved and \r\n        help us to better serve their needs. The more you understand what we do \r\n        and shy, the more pertinent information you will know to give us concerning \r\n        your organization. This not only helps us ascertain your exposure to loss, \r\n        but also helps us to present your organization to the insurance company \r\n        underwriters in the very best way possible. Therefore, \r\n        we hope we have answered most, if not all of your questions here. If not, \r\n        please email us at insurance@vgib.com ."
    },
    {
      "tag": "div",
      "text": "Q. Who \r\n            do I call when I have a question? Real \r\n            live people will handle your call during our business hours of 8 AM \r\n            to 5 PM, Monday through Friday or leave a voice mail at: 408-947-7111 Q. What \r\n            is Business Insurance? Property, \r\n            Liability, Workers' Compensation, Professional & Cyberspace Liability, \r\n            Crime, Bonds, Fiduciary, Business Auto, Marine, Aviation, etc. insurance \r\n            for your business Q. What \r\n            is Employee Benefit Insurance? Group \r\n            Health, Life, Dental, Vision, Travel Accident and 401K coverage for \r\n            you and your employees. Q. When \r\n            do I need Business Insurance coverage? As \r\n            soon as you have decided to be a business. There are many details \r\n            from signing a business lease, leasing equipment, providing Workers' \r\n            Compensation coverage for your first employee, insuring your products \r\n            - to Errors and Omissions coverage for your Directors and Officers \r\n            - Call VALLEY GLOBAL and we will help guide you through the intricacies \r\n            of insurance for your new business - or call us to ascertain the best \r\n            level of business insurance for your already established Company. Q. When \r\n            do I need Workers' Compensation coverage? to \r\n              top In \r\n            California, as soon as you hire your first employee. Q. When \r\n            do I need Professional/Cyberspace liability coverage? If \r\n            your company provides professional advice or services to others there \r\n            is always a chance of an unintentional error or omission being made \r\n            by you or one of your employees. Professional Liability provides coverage \r\n            for economic loss (as opposed to General Liability coverage which \r\n            covers Bodily Injury or Property damage to third parties) and usually \r\n            includes defense costs coverage as well. Q. How \r\n            does an insurance broker/agent obtain insurance quotations on my company's \r\n            behalf? Your \r\n            broker or agent receives permission from you to send out specifications \r\n            of insurance to various insurance carriers. These specifications describe \r\n            your business and your exposures to loss. The underwriter from the \r\n            insurance carrier and your agent negotiates coverage and cost for \r\n            your business insurance needs. Your broker/agent proposes coverage \r\n            and cost based upon the negotiated terms, conditions and pricing to \r\n            you, for a final decision. Q. How \r\n            do I obtain a quotation on my Personal Automobile and Homeowners insurance? to \r\n              top We \r\n            provide personal insurance coverage through various carriers. If you \r\n            are interested in quotes, please fill out \r\n            the forms and fax them back to us. We can usually turn indication \r\n            around in 48 hours. Q. How \r\n            do I know if my broker or agent is doing his/her job? Service \r\n            is the fist clue - and the most important aspect. Claims handling \r\n            is also important, not to mention favorable terms and conditions in \r\n            your insurance contract, comparison shopping of your renewal coverage \r\n            and pricing. Q. When \r\n            should I change my brokers or agent? When \r\n            you are unhappy with the service or expertise provided, or not provided, \r\n            by your existing broker or agent. Q. Should \r\n            I have more than one broker or agent? Generally \r\n            start-up companies have one to three business insurance brokers because: \r\n            1) they don't understand how the process works, or 2) insurance isn't \r\n            a priority until the costs start increasing, or 3) one of the investors \r\n            has a friend who is an insurance broker. As the level of a Company's \r\n            sophistication rises they realize the inadequacies of this type of \r\n            system and generally have one broker for Business Insurance and possibly \r\n            one other broker for Employee Benefit insurance. This enhances the \r\n            buying power and ability of each broker to negotiate favorable terms \r\n            and conditions for your two insurance programs. to \r\n              top Q. What \r\n            does assigning markets mean? If \r\n            you decide to have more than one broker or agent obtain quotations \r\n            on your behalf it is wise to assign each one, the specific insurance \r\n            markets they may approach. Generally the top three or four choices \r\n            made by the broker/agent are assigned to the agent or broker that \r\n            chooses them, if there is no conflict with the other brokers or agents. Q. Should \r\n            I buy an insurance program based on lowest cost? Not \r\n            necessarily. Bottom line costs up front are not always an accurate \r\n            reflection of total costs over the policy term. 1. For instance, poor \r\n            claims handling can substantially increase your indirect costs this \r\n            year and your indirect costs over the next four years under a Workers' \r\n            Compensation policy. 2. Another factor might be an auditable policy \r\n            based on sales or receipts which increases your total costs far beyond \r\n            expectations by the end of the year. Q. How \r\n            do I know if the insurance carrier quoting my insurance is financially \r\n            stable and responsive to claims submitted? to \r\n              top In \r\n            order to determine financial stability and claims paying history of \r\n            a property/casualty insurance company you can look them up on www.ambest.com \r\n            and look under - Rating Information - Rating Search - by insurance \r\n            company name. This rating gives you a good idea of the insurance company's \r\n            ability to pay claims in the event of a covered loss, and a good indication \r\n            of their financials for future stability and claims paying ability. Q. What \r\n            limits of insurance do I need to carry? Minimum \r\n            Limits of Liability for a start-up organization should be at least \r\n            $1,000,000 and preferably $5,000,000. As a start-up - you don't want \r\n            to go out of business before you really get started - which could \r\n            happen in the event of a loss. 1) As your organization grows larger \r\n            and becomes more successful the possibilities of loss become greater \r\n            because the organization usually has more clients/customers and therefore \r\n            usually more exposure. It is not unusual for mid-sized organizations \r\n            to insure their liability for limits in excess of $50 Million. 2) \r\n            At a given point - as the organization begins to see the cost of insurance \r\n            as a large expense item, they start taking measures to better control \r\n            their losses, hire an insurance risk manager and perhaps even look \r\n            into self-insurance. Q. What \r\n            is Professional Liability? Covers \r\n            economic loss and is designed to protect your company against actual \r\n            or alleged breach of duty, negligent act, error or omission committed \r\n            in rendering, or the failure to render, professional services as identified \r\n            in the application and the policy. Q. What \r\n            is Cyber Liability? to \r\n              top Covers \r\n            errors and omissions in providing internet related services, as well \r\n            as for claims of copyright for content or trademark infringement, \r\n            computer virus and unauthorized access. Q. What \r\n            is Loss Control? Loss \r\n            control services provided by your insurance carrier and or your broker \r\n            reduces your company's exposure to loss. The services vary by coverage, \r\n            risk and carrier and can sometimes be unbundled meaning bought separately. Q. What \r\n            is an Additional Insured and who requires them? An \r\n            Additional Insured (AI) is just that, and is usually required by the \r\n            lessors, lenders, loss payables, clients, customers and contractors \r\n            that have an interest in the insureds business. 1) Insurance carriers \r\n            may charge an additional fee in order to name a party as an additional \r\n            insured on the insurance contract. 2) In addition, many of the Additional \r\n            Insureds require other terms and conditions that are not acceptable \r\n            to the insurance carrier. It is best to check with your agent or broker \r\n            to see if the insurance carrier will extend the coverage to the AI, \r\n            before obligating your company to the provisions requested. to \r\n              top #EndEditable #BeginEditable \"BlueNavPic\" #EndEditable #EndTemplate"
    }
  ]
}