{
  "url": "http://www.wagingpeace.org/articles/1997/05/06_menuhin_letter.htm",
  "content_hash": "24eb0b9b98fc77a705a2700141226741f8c60b8f9d81974686bf74cc2e2351fd",
  "total_blocks": 75,
  "retained_blocks": 5,
  "ignored_blocks": 70,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\" InstanceBegin template=\"../../../Templates/2_column.dwt\" codeOutsideHTMLIsLocked=\"false\" Home Issues Programs About Shop Resources InstanceBeginEditable name=\"printable version\" Printable Version InstanceEndEditable InstanceBeginEditable name=\"main text\""
    },
    {
      "tag": "p",
      "text": "Letter to Heads \n                of State of the European Union by Lord Yehudi Menuhin, May 6, 1997 T he following letter to Heads of State of \n                the European Union, calling for the creation of a European Cultural \n                Assembly, was sent by Lord Yehudi Menuhin, the great violinist, \n                conductor, and humanitarian who received the Nuclear Age Peace \n                Foundation's 1997 Distinguished Peace Leadership Award. In my opinion there is one element missing in the general concept \n                of the European Union -- It is the representation of the rich \n                diversity of European Cultures. The peoples aspiring to national sovereignty must \n                be offered the alternative of cultural autonomy. We cannot afford \n                a proliferation of atom bombs and terrorists, nor can we deny \n                any group its own distinctive identity, its needs, traditions \n                and habitat. The powers of globalization in science, in communications, \n                in commerce, the need to combat global menaces-- disease, pollution, \n                drought, famine-- through more effective and broader cooperation \n                amongst peoples must be compensated by cultural affinities conceived \n                on the scale of the human being. Until now the sovereign state acted as the responsible \n                monolith for both functions; now they must each be represented \n                on the European stage by 1) the European Parliament, 2) the Assembly of Cultures. To this end I am engaged in establishing a representation \n                of cultures at the level of a greater Europe. The representatives, \n                either designated or chosen, would have to enjoy the confidence \n                and trust of their group, but they would also have to speak with \n                the aim of reaching agreement.. The discussions, conducted in the presence of a \n                member of the European Court of Justice, would result in resolutions \n                or in further discussions, in arbitration or legislation. The \n                discussion concluded, the individual would return to home and \n                habitual work. The mission, if successfully accomplished, would \n                entitle the spokesman or woman to become a member of the full \n                meetings of the Assembly of Cultures. Full meetings of the Assembly \n                would be held once or twice a year in Brussels or Strasbourg. \n                The Cultures would also remain in constant touch with each other. \n                This would lead to a renunciation on the part of any given culture, \n                of sovereign national and territorial ambitions. Gradually national \n                police and military requirements would take on a European character, \n                as great world powers would no longer be required to defend a \n                self-reliant Europe. My foundation in Brussels is already furthering \n                this project with an office and a qualified gentleman in charge. Europe would thus have another chamber of representatives: \n                the one elected by the citizens-- the European Parliament-- and \n                the other as a counterweight -- a forum of the different cultures. Both houses would fully consider each other's attitudes \n                and propositions. As I see it, Mr. Prime Minister, this is the next \n                stage in the constant evolution and development of our democracies. I am convinced that an Assembly of Cultures can \n                play a decisive role in the emergence of a genuine European conscience, \n                which would constitute the best defense of its peoples and of \n                the community. The inclusion of cultures in Eastern Europe would \n                release a process of acclimatization whereby good neighborliness \n                and trust would permeate our Assembly of Cultures of greater Europe, \n                preparing them gradually for fuller membership in the Community, \n                a membership for which they are not qualified as yet, either economically \n                or, even more importantly, psychologically. We cannot include in the evolved community of western \n                Europe wherein territorial ambitions have been outgrown, those \n                other peoples whose mentality still reverts to territorial control \n                and expansion. They are still psychologically unevolved and unprepared \n                for European Union. This evolution could be immediately begun with \n                cultural contacts and expressions in every field, including the \n                political, of which evolution neither the political Parliament \n                of States, which are never completely free of mistrust, nor the \n                economic dictates of profitability in a free market are capable. \n                (See my letter to the Governor of Moscow.) Up until now our European Union has not shouldered \n                its role of Guardian of cultures which would protect a human being, \n                his heritage, his rights, his creativity. Europe will not survive on its past record alone, \n                however great are its contributions to democracy, to the arts, \n                the sciences and the social sciences; only when it will finally \n                give a shining example of a balanced, rich, diverse, multicolored \n                and harmonious society may other powers wish to emulate it rather \n                than destroy it. Also, whilst keeping our powder dry, our hands \n                and our minds and doors must be open, generous and sharing. For these reasons, Mr. Prime Minister, I would \n                ask you with a full heart to support the principle of the creation \n                of this representation of Cultures, and I would be very happy \n                if among the many issues you will discuss you could agree upon \n                two points: 1)that the European Union should be called 'The \n                European Union of States and Cultures' and 2)that the European Union declares itself the 'Guardian \n                of European Cultures.' In setting your sight high, even upon the unattainable, \n                you will attract the vast majority of people to your side, for \n                you will have given them to understand that vision and that a \n                future do exist; that clear and inspiring, noble purposes can \n                still be pursued -- and not only garages to repair outworn, outdated \n                mechanisms, reflexes and obsessional thoughts, narrow, timid, \n                and vulgar. As Prime Minister you are spokesman for and to \n                all your people -- rich, poor, old, young, of all colors and denominations \n                -- and of all political parties, for, of course, as soon as you \n                confine yourself to one political party or to an alliance you \n                will be opposed by others, several of which may have valid attitudes \n                and arguments. Will you allow me to say that neither the purposes, \n                nor the measures, nor the problems, nor all that which may link \n                these problems together, are presented with clarity and against \n                their backgrounds of weights and forces, which it would be essential \n                to do if you really want to convince a people, critical, experienced, \n                tested and tried, a people of essentially good character, yet \n                wary and cynical. The measures which you feel obliged to take consist \n                in part of responses to financial and economic problems, which \n                relate to social and civil ones, which in their turn are connected \n                to Europe, to foreign affairs, but very specially to the quality \n                of education, to health, physical and intellectual, to a creative, \n                moral code based on a consensus of values, heritage and traditions, \n                which are at the very heart of a civilization, however complex \n                it may be. Your own poor, suffering, aged, young, sick, the \n                sad unemployed, all the frustrated, the malcontents, the drugged, \n                the ill-informed and violent, this living tinder cannot be ignored-- \n                a multitude rarely considered by political parties, except gingerly \n                at election time. Solemn personal promises will not suffice. May I suggest that the very words are : to work \n                towards a civilization founded on a positive reciprocity, on the \n                balance of right with responsibility, and on duties and obligations \n                incumbent on all. As a rule I would say that rights belong to those \n                at the mercy of others and who lack an official voice. Thus, for instance, children (who, within their \n                capacity, safety and well-being should also exercise responsibility) \n                or the sick, or trees, would have rights in respect of their helplessness, \n                while, on the other hand, others by virtue of authority, knowledge, \n                skill, experience and influence should carry the responsibilities; \n                thus, the passenger has rights, where the chauffeur has specific \n                responsibilities; the patient has the right, the surgeon the responsibility. Our task is to build a civilization of positive \n                reciprocity. An education for reciprocity would concern itself \n                with the teaching from earliest infancy of the voice, by song \n                and speech, with everything which is absorbed and learned by example \n                and imitation-- dance, mime, a body language, a use of hands, \n                mind, heart and fantasy, in crafts, arts, in thoughts and speech, \n                in poetry, in compassion, in wonder. In this way the abstract \n                studies, beginning with reading and writing, can more easily sprout \n                on a humanely fertilized soil or soul. As you know, this is exactly the description of \n                what I pursue through the works of my Foundation (The International \n                Yehudi Menuhin Foundation) (the project is called MUS-E) in the \n                more difficult schools (violent and prejudiced) in Europe. We \n                now have a formal working arrangement with the Ministers of Culture \n                and Education in Spain and Portugal. This improved society based \n                on reciprocity, on the mutuality of services, on the recognition \n                of our interdependence and upon our desire to learn, would tend \n                largely to reduce our exaggerated dependencies on money itself. I would maintain that everyone, including the unemployed, \n                have the right to a lifelong education, to music and opera, to \n                theater and to sports, as well as to the basics of life-- even \n                holidays (a \"change of air\") -- provided in part by \n                special electronic credit cards, by mutual services and the venues, \n                facilities, theaters and schools, provided by the state, by private \n                funds, and maintained by the people with free time. The financial \n                field of action could thereby be substantially reduced. People \n                would have the obligation to live without hurting their neighbor, \n                whilst enjoying a reciprocal liberty and serving, as they can \n                and may be inclined to, the needs of others. On such a basis a \n                healthy capitalism could flourish, never exceeding the limits \n                imposed by pollution, by the abuse of nature, of our mother earth, \n                of our resources, never breaking all bounds in the sale of arms, \n                drugs, children, nor in poisons of all sorts which apparently \n                share our economies. I would propose that salaries be related not only \n                to the employer's resources but also to a given, regional, national \n                (a European) income. Thus salaries would adjust to the given well-being \n                of a country. We must rethink basic rights and responsibilities. \n                These are all to life, ours and all other lives and all life upon \n                which we depend, and not to money alone. Forgive me if I allow myself to seize one of those \n                rare moments of historical opportunity to urge you to engage upon \n                a renewal of options and at the same time a return to certain \n                codes pronounced some two thousand and more years ago. Respectfully, Yehudi Menuhin"
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable Nuclear Age Peace Foundation 1998 - | Powered by Media Temple InstanceBeginEditable name=\"related articles\""
    },
    {
      "tag": "p",
      "text": "Related Articles"
    },
    {
      "tag": "div",
      "text": "Article \n                Archive InstanceEndEditable InstanceEnd"
    }
  ]
}