{
  "url": "http://www.washingtonpost.com/wp-dyn/content/linkset/2005/04/11/LI2005041100587.html?nav=pq",
  "file_number": "799",
  "content_hash": "ceacfb8d25f7d83db2281ad0ef09e90563dc75bc80979549924449d472abfe25",
  "total_blocks": 477,
  "retained_blocks": 22,
  "ignored_blocks": 455,
  "blocks": [
    {
      "tag": "div",
      "text": "SiteCatalyst code version: H.7.Copyright 1997-2006 Omniture, Inc. More info available athttp://www.omniture.com /DO NOT REMOVE/ End SiteCatalyst code version: H.7. *** NEEDED FOR REG *** *** /NEEDED FOR REG *** *** HEADER TOP *** Hello Change Preferences | Sign Out Sign In | Register Now Print Edition | Subscribe *** /HEADER TOP *** *** DROPDOWN NAVIGATION *** Politics Business Education Real Estate Nation Technology KidsPost Obituaries World Entertainment Religion Corrections Metro Health Post Magazine Archives Politics Blog Congress Polls Elections House/Senate Votes Federal Page Key Races White House In Depth <tr>\n\t\t\t\t<td colspan=\"3\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Columns & Blogs Feedback Cartoons & Videos Outlook Editorials Message Boards Redskins D.C. United Columns/Blogs NBA Nationals Capitals College Football NHL Wizards High Schools Local Colleges NFL <tr>\n\t\t\t\t<td colspan=\"4\" class=\"adbox\">old ad <a href=\"http://midatlantic.comcastsportsnet.com\" target=\"_blank\" onClick=\"sa_onclick('http://www.washingtonpost.com/wp-adv/tracking/textlink/homepage/comcast');\">Ad: SportsNite 10pm Comcast SportsNet</a></td>\n\t\t\t</tr> Style Movies Travel Fashion & Beauty Horoscopes City Guide Television Books Home & Garden Comics Entertainment News Food & Dining Museums Theater & Dance Crosswords Ad: Click here for Travel Specials & Deals Tues., Jan. 2, All Times ET K Street, 1 NFL Insider, 11 Today's Schedule Life at Work, 11 Post Politics, 11 Weekly Schedule Media Backtalk, 12 Opinion, 1 Transcripts START OF EXTRA STUFF \n<tr>\n<td><a href='http://www.washingtonpost.com/wp-dyn/content/discussion/2006/12/22/DI2006122200365.html?nav=topnav'><nobr>Lean Plate Club, 1 p.m.</nobr></a></td>\n<td><a href='http://www.washingtonpost.com/wp-dyn/content/discussion/2006/12/22/DI2006122200629.html?nav=topnav'><nobr>D.C., Maryland and Virginia Politics, 2 p.m.</nobr></a></td>\n<td>&nbsp;</td>\n</tr>\n<tr>\n<td><a href='http://www.washingtonpost.com/wp-dyn/content/discussion/2006/12/19/DI2006121901073.html?nav=topnav'><nobr>Freedom Rock, 2 p.m.</nobr></a></td>\n\nEND OF EXTRA STUFF Multimedia: Being A Black Man Day in Photos Photos:   Eye On Entertainment News Video Videos: A Living HIV Quilt Documentary Video *** KEEP AD LINK ROW BELOW COMMENTED OUT WHEN NOT USED *** <tr>\n\t\t\t\t<td colspan=\"2\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Search D.C.-area events and locations. Find movies, restaurants, bars and clubs. <tr>\n\t\t\t\t<td colspan=\"1\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Merchandise Pets Death Notices Personals Rentals Legal Notices <tr>\n\t\t\t\t<td colspan=\"3\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Find a Job Post a Job News & Advice Employer Login <tr>\n\t\t\t\t<td colspan=\"2\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Buy a Car Experts & Advice Dealer Specials Sell a Car Coupons <tr>\n\t\t\t\t<td colspan=\"3\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> Buy a Home Sell a Home Property Values Find a Rental Rent Your Place Rentals Section <tr>\n\t\t\t\t<td colspan=\"3\" class=\"adbox\"><a href=\"\">Ad: Link Goes Here</a></td>\n\t\t\t</tr> *** /DROPDOWN NAVIGATION *** *** SEARCH *** SEARCH: washingtonpost.com Web <div class=\"sponsor\"><img src=\"http://www.washingtonpost.com/wp-srv/yahoo/articleIcon_yahoo_165x15.gif\" border=\"0\" width=\"202\" height=\"15\" alt=\"Powered by Yahoo! Search\"/></div> | Search Archives *** /SEARCH *** washingtonpost.com > Columns only technology articles will display the technews branding Print This Blog E-Mail This Blog Bottom Toolbox Advertisement Goes Here /wp-adv/ssi/toolbox/article/bottom/index.html"
    },
    {
      "tag": "h2",
      "text": "RSS News Feeds"
    },
    {
      "tag": "div",
      "text": "Top News What is RSS? | All RSS Feeds end of logic for Article, Blog and Discussion Type"
    },
    {
      "tag": "h1",
      "text": "Sexual Politics"
    },
    {
      "tag": "div",
      "text": "By Howard Kurtz"
    },
    {
      "tag": "p",
      "text": "Washington Post Staff Writer Friday, December 22, 2006; 8:50 AM"
    },
    {
      "tag": "div",
      "text": "plsfield:description"
    },
    {
      "tag": "p",
      "text": "Are we having a presidential election or a group therapy session? Does the whole country need to get on the couch just because Hillary Clinton is running?"
    },
    {
      "tag": "h2",
      "text": "About This Column"
    },
    {
      "tag": "div",
      "text": "Sign Up for RSS Feed Media Notes Archive How RSS Works"
    },
    {
      "tag": "h2",
      "text": "Media Notes Extra"
    },
    {
      "tag": "div",
      "text": "Sexual Politics Bush's News Vacuum The Finger-Pointing Game Bayh Bayh Time for a Change More Stories"
    },
    {
      "tag": "h2",
      "text": "Save & Share Article What's This?"
    },
    {
      "tag": "div",
      "text": "Digg Google del.icio.us Yahoo! Reddit Facebook"
    },
    {
      "tag": "p",
      "text": "I feel the need for some serious shrink time myself after reading the new Mother Jones cover story on HRC: \"Why she stokes our deepest fears and darkest hatreds.\" I understand, of course, that White House contests are not just about nine-part plans to improve port security. They're about personality and character as well, and the country finding someone it feels comfortable with. And I get the fact that Hillary brings a forklift's worth of baggage from the '90s into the race, and conjures up memories of Whitewater and Monica and all of that. Fair enough. No candidate can run from his or her biography, especially with the root-canal job that the media inflict on presidential contenders. And it's hard not to miss that there's also the first-woman question, and the what-to-do-with-Bill question, and all the associated weirdness of a former president's wife trying to become president. But it seems to me that this Mother Jones piece by Jack Hitt goes way beyond those debates. Put it this way: the story prominently features that quote from Sharon Stone saying of Senator Clinton that \"a woman should be past her sexuality when she runs.\" And he notes that Clinton's hapless GOP opponent, John Spencer, had basically said she was ugly and accused her of having \"millions of dollars\" in plastic surgery. Now either Hitt has had the gumption to commit to glossy paper what millions of Americans have been quietly buzzing about, or he has done a triple-gainer off the high board into fantasyland. Here are some excerpts: \"Most men . . . long before they get to her politics, they gossip about her comeliness, and the judgment is always harsh. Busting Hillary back down to mere dame, and a rejected one whose sexual allures fail, seems to be a necessary preamble to any discussion of her . . . \"Hillary is an avatar of an existential dread skulking in the hearts of every couple who've tried to put together a life since the feminist revolution. This anxiety explains why the darkest question a liberal feminist can ask is: Why didn't she leave the [SOB]? And it's why the coarsest question a conservative man can ask is: Who would do the [B-word]? . . . Hillary has come to embody a dark fear in the hearts of modern men: the wife who neglects the joys of the bedroom for her career . . . \"The flip side to Hillary's ambition evokes every career woman's greatest fear. How fragile is marriage? It can come apart as quickly as that girl delivering the pizza can snap her thong . . . \"It's why the kind of anger liberal women feel toward Hillary always circles back around to the issue of why she stayed in the marriage. Why didn't she take a stand against male grossness ? . . . \"To the right, she stayed not for any principle or for Chelsea but because she's a clawing shrew who will suffer any ignominy to attain power. To the left, she had a chance to take a stand for all the women who've been humiliated, and she didn't.\" Gulp. Should be an interesting couple of years. CBS's Dick Meyer also goes deep in sizing up the former first lady: \"Sen. Clinton's psychological quest is just too obvious and determinative for most us. What exactly drives her we cannot know, which itself is frustrating. Is it redemption? Or resurrection? Would being leader of the free world erase the public indignities she suffered due to her husband? Does she have a messianic thing going on? Did she ever have a desire to completely escape public scrutiny and dissection altogether? I'm agnostic on these therapeutic queries. But the sense people have that Sen. Clinton's drive is overly determined by her emotional issues is, I suggest, fatal. \"This is not sexist. Al Gore has a similar problem. Richard Nixon had that problem; he didn't solve it -- but George Wallace solved it for him. There is a balance between ambition, drive, earned confidence and reluctance that voters are comfortable with. For many voters, Sen. Clinton doesn't have that balance. Sen. Clinton is also emotionally inscrutable. That adds a layer to the question of 'what makes her tick?' that is very uncomfortable. In public, she's a robot. No compelling and satisfying account of her private side exists. In every election since 1972, the presidential candidate who gave the appearance of being the most emotionally available won. Sen. Clinton will never be that candidate.\" M.J. Rosenberg sees a bright spot: \"I just watched Hillary Clinton on 'The View.' And I realized something. Every time she lets go a little (like when she jogged into the room), she is very appealing. And every time she discusses things like engaging in 'a national conversation' about whatever the hell it was, she is terrible.\" Monica Lewinsky, meanwhile, has graduated from the London School of Economics . Is Barack Obama not black enough ? I missed this last month, but via Captain Ed, here's what Stanley Crouch says in his New York Daily News column: \"When black Americans refer to Obama as 'one of us,' I do not know what they are talking about. In his new book, 'The Audacity of Hope,' Obama makes it clear that, while he has experienced some light versions of typical racial stereotypes, he cannot claim those problems as his own -- nor has he lived the life of a black American. \"Will this matter in the end? Probably not. Obama is being greeted with the same kind of public affection that Colin Powell had when he seemed ready to knock Bill Clinton out of the Oval Office. For many reasons, most of them personal, Powell did not become the first black American to be a serious presidential contender. \"I doubt Obama will share Powell's fate, but if he throws his hat in the ring, he will have to run as the son of a white woman and an African immigrant. If we then end up with him as our first black president, he will have come into the White House through a side door - which might, at this point, be the only one that's open.\" The Washington Post ran a piece the other day saying it will be tough for Rudy to win GOP primaries with his pro-choice and pro-gay rights views; the Washington Times begs to differ: \"Social conservatives -- contrary to conventional wisdom -- will seriously consider supporting the Republican presidential aspirations of Rudolph W. Giuliani even though he's a pro-choice, anti-gun New Yorker, political analysts and operatives say. \"Republicans in the early primary states in the South and the West may disagree with Mr. Giuliani's stance on abortion and gun control, but they admire his response to the September 11 attacks and, more importantly, they think he can win in November.\" Alan Hevesi is out as New York comptroller and will plead guilty to a felony charge for using state funds to have his wife chauffeured around. Virginia's Virgil Goode keeps digging himself deeper: \"Amid a political storm that now includes threatening phone calls, U.S. Rep. Virgil H. Goode Jr. reiterated yesterday that he will not apologize for a letter he wrote that laments the influx of Muslims to America and the use of the Quran in Congress. \"In a news conference at the Franklin County courthouse where a contingent of deputies guarded the doors, Goode, R-5th, told reporters that he will not back down from the views he expressed in the letter, which include his fear that one day 'many more Muslims' may be 'elected to office and demanding the use of the Koran.' \" So let me get this straight: The Donald gives a second chance to Miss USA as she heads into rehab, there to join Mark Foley, Mel Gibson and a long line of others. Rosie goes on \"The View\" and attacks Donald. Trump goes on every available show and slams Rosie. And he doesn't give a second chance to Miss Nevada for some photos-- TMZ has them --that, let's just say do not set a shining example for America's youth. \"Hard-partying Miss USA salvaged her tiara by heading off to rehab yesterday - as Miss Nevada USA was fired by Donald Trump's pageant for some raunchy photos,\" says the New York Daily News . As if that weren't enough, \"it came a day after Miss Teen USA Katie Blair was dumped as Mothers Against Drunk Driving's national spokeswoman for her underage drinking in New York bars.\" What Kevin Drum calls \"The Iraq Straddle\" is continuing. The Washington Monthly blogger has a new nominee: \"Jonathan Singer reports that the 'Up for Reelection in 2008/Change of Heart on Iraq' Caucus has a new member: \" Sen. Norm Coleman, R-Minn., said today after a two-day trip to Iraq that he would not support an increase in the number of soldiers in Baghdad . . . \" He suggested the Iraqis meet certain benchmarks within a timeframe, such as moving the Iraqi military to the frontlines. If those benchmarks aren't met, he said U.S. troops should accelerate pulling back -- but not withdrawing from the country -- and repositioning within Iraq. \"This has got to be the most puerile position imaginable on Iraq. Withdrawal I understand. 'One Last Push' I understand, even though I disagree with it. But just leaving things the way they are, even though they clearly aren't working, and then 'repositioning'? The fence-sitting cynicism involved in this position is staggering.\" Chris Wallace can be a very aggressive interviewer, as Bill Clinton can attest. So I was somewhat surprised in looking over a transcript of his \"Fox News Sunday\" interview with Lynne Cheney that a certain followup question wasn't asked: WALLACE: It's been well publicized that you're going to have an addition to the Cheney family. Your daughter, Mary, is going to give you, I think you're sixth grandchild? CHENEY: That's exactly right. WALLACE: What do you make of all the fuss about this? CHENEY: Well, I think that it's just very lucky for me that I enjoy being a grandmother and I get to do it for the sixth time. And we're very much -- Dick and I both very much looking forward to this new baby. WALLACE: And your thought about Mary being a mother. CHENEY: Well, she'll be a great mom. She really will. Nothing on the administration's position on the rights of same-sex parents? In fact, you wouldn't know from watching the interview that Mary Cheney was part of a same-sex couple. If there's one issue that's burning up the righty side of the blogosphere, it's the latest on the man whom Rush Limbaugh has taken to calling Sandy Burglar. We lead off with National Review's Jay Nordlinger : \"Call me a right-wing paranoid -- it's been done before! -- but I think that, if Sandy Berger were a conservative Republican, the story of his criminality would be a really, really big deal. Bear in mind that the man was national security adviser. Do you know about his criminality? You may read about it here. Let me provide just a taste: \"In October 2003, the [inspector general's] report said, an Archives official called Berger to discuss missing documents from his visit two days earlier. The investigator's notes said, 'Mr. Berger panicked because he realized he was caught.' The notes said that Berger had 'destroyed, cut into small pieces, three of the four documents. These were put in the trash.' \"As I said, that's just a taste. \"If Berger were a Republican, the word 'Nixonian' would be making a big, big comeback -- at a minimum.\" Betsy's Page also chides the press: \"More news has come out about Sandy Berger's theft of national security documents from the National Archives. And it's even clearer now than it was earlier that he was deliberately stealing certain documents. When he was first caught, he had a story about how he was inadvertently removing documents, but now that more of the information has been revealed, it's clear that he got off way too easily . . . \"This story seemed to go nowhere in the media. Bill Clinton laughed about it and said that it sounded just like the type of thing a sloppy guy like Sandy would do. The excuse that all the Clinton guys had for Berger was that his desk was always a mess so it was no jump in the imagination to think that he put national security documents in his briefcase. Yeah, right. And I guess it was just typical of the National Security Adviser to just place classified documents in a construction site. \"Shouldn't the media have been more interested in knowing why he took such a risk in stealing classified documents? What was in those documents? Why did this story go nowhere at the time and we're just finding out these new details because the Associated Press filed a FOIA request? Why didn't all the media outlets want to know that information? after all, these were documents that he was reviewing in order to talk to the 9/11 Commission about security measures taken in the time before 9/11. No one really seems to have cared that there was something that Berger wanted to steal and destroy regarding that period. \"Shouldn't people be outraged about this? Why did the Bush Justice Department let him get away with just a slap on the wrist? What about the whole idea that top officials should be punished more severely when they break the law as an example to other potential malefactors? Would some less exalted person who stole classified documents and destroyed them get away with a fine, community service, and a three-year loss of his national security clearance? I doubt it.\" Some on the liberal side of the spectrum, such as Matthew Yglesias , aren't rushing to Berger's defense: \"With what I consider a great deal of justification, I tried to rigorously ignore the story of Sandy Berger poaching documents when it was first being pushed by conservatives who wanted to use it as a lever to continue grossly failed foreign and domestic policies. That said, it's a long way from Election Day and, seriously, a new Inspector General report says he 'removed classified documents from the National Archives, hid them under a construction trailer and later tried to find the trash collector to retrieve them, the agency's internal watchdog said Wednesday.' Hid them under a a trash collector! \"One assumes this will make it difficult for Berger to obtain any high-level executive branch appointments in the future.\" One assumes."
    },
    {
      "tag": "div",
      "text": "Print This Blog E-Mail This Blog RSS Feed /wp-adv/ssi/toolbox/article/left/ placeholder"
    },
    {
      "tag": "p",
      "text": "» Related Topics & Web Content » Top 35 Most Viewed"
    },
    {
      "tag": "div",
      "text": "start the copyright for the articles © 2006 Washingtonpost.Newsweek Interactive end the copyright for the aricles start the copyright for the secions end the copyright for the secions monday:http://www.washingtonpost.com/wp-adv/ssi/ad_links_right/google/article/opinion http://www.washingtonpost.com/wp-adv/ssi/textlinks/article/default.html ****************************** Featured Advertiser Box Begins ******************************"
    },
    {
      "tag": "h2",
      "text": "Featured Advertiser Links"
    },
    {
      "tag": "p",
      "text": "Refinance Rates As Low As 2.9% - FREE QUOTES! $200,000 Loan for only $896⁄mo. Bad Credit OK. $200,000 Loan for only $667⁄mo. Bad Credit OK. $40,000 Home Equity Loan for only $287⁄mo fixed. Redskins Tickets , Wizards Tickets , BCS Championship Malpractice Lawyer , Birth Defect Lawsuit , Trasylol Promotional Pens , T-shirts , Custom Hats Cool Gadgets, Great Deals, Visit CircuitCity.com 7 Funds at Vanguard to BUY; 10 to SELL--Free! Travel downtown to downtown only on Acela."
    },
    {
      "tag": "div",
      "text": "script>\ndell_ran = Math.floor(Math.random() * 1000000);\ndocument.write('<A HREF=\"http://ad.doubleclick.net/jump/N296.wp/B1926983;sz=234x60;ord='+dell_ran+'?\"><IMG SRC=\"http://ad.doubleclick.net/ad/N296.wp/B1926983;sz=234x60;ord='+dell_ran+'?\" BORDER=0 WIDTH=234 HEIGHT=60 ALT=\"Click Here\"></A>')\n</script ****************************** Featured Advertiser Box Ends ****************************** SEARCH: washingtonpost.com Web <div class=\"sponsor\"><img src=\"http://www.washingtonpost.com/wp-srv/yahoo/articleIcon_yahoo_165x15.gif\" border=\"0\" width=\"202\" height=\"15\" alt=\"Powered by Yahoo! Search\"/></div> NEWS | OPINIONS | SPORTS | ARTS & LIVING Discussions | Photos & Video | City Guide CLASSIFIEDS | JOBS | CARS | REAL ESTATE"
    },
    {
      "tag": "p",
      "text": "washingtonpost.com: Help | Contact Us | About Us | Advertisers | Site Index | Site Map | Make Us Your Homepage | mywashingtonpost.com | Work for Us | Mobile | RSS The Washington Post: Subscribe | Subscriber Services | Advertisers | Electronic Edition | Online Photo Store | The Washington Post Store | About The Post | National Weekly The Washington Post Company: Information and Other Post Co. Websites © Copyright 1996- The Washington Post Company | User Agreement and Privacy Policy | Rights and Permissions"
    }
  ]
}