{
  "url": "http://ideonomy.mit.edu/whatcan/things071-080.html",
  "content_hash": "070fd6328624cd79a6ec59c5ce21d6a66799dded19d9e1cfcd12d391e3e2af95",
  "total_blocks": 167,
  "retained_blocks": 4,
  "ignored_blocks": 163,
  "blocks": [
    {
      "tag": "h2",
      "text": "What Ideonomy Can Do"
    },
    {
      "tag": "div",
      "text": "Back\nto the Homepage"
    },
    {
      "tag": "h3",
      "text": "Advance the Foundations of A Subject"
    },
    {
      "tag": "p",
      "text": "Our knowledge of the logical and natural foundations of many field is\nslight, or at least dubious or imperfect. Certainly subjects differ\ndrastically in the relative strength of their foundations, or in the\napparent fundamentality of their concepts, methods, principles,\ntheories, achievements, research, language, logic, etc. Ideonomy can compare the foundations of different disciplines to\ndiscover analogies, differences, commonalities, interdependences, contradictions,\nredundancies, interpenetrations, convergences, common goals and needs,\nunities, etc. It can use these to suggest omissions, errors, common\nopportunities for research or discovery, ways to redescribe the foundations\nof one subject in terms of the foundations of another, reciprocal problems\nand fallacies, equivalent principles and entities, joint ignorance, new\ntests and experiments, higher standards, useful priorities, strategies\nof theory, etc. It can suggest ways in which to combine or transform certain concepts\nor dimensions so as to generate or define 'all' possible or important concepts\nor things, or the spaces and manifolds thereof. Contained or implicit within\nsuch sets, spaces, and manifolds may be concepts or other things that can\nsupplement or deepen the foundations of the subject to which they pertain. Moreover, examining or merely experiencing such enlarged perspectives\nupon what is possible may lead to the realization that what has been taken\nto be fundamental within a subject is not really fundamental; or at least,\nthat the foundations--or supposed foundations--of the subject are not as\nfree of assumptions, problems, inelegant features, superfluous elements,\ndiscrepancies, idiosyncratic aspects, etc as has been thought. Since ideonomy seeks to discover all of those natural concepts, dimensions,\nrepresentations, entities, phenomena, laws, principles, relationships,\netc that are supremely universal, fundamental, important, essential,\nminimal, logical, generative, necessary, transcendental, and pantological,\nit is in a privileged position to advance the foundations of arbitrary\nfields. It is in fact a principal goal of ideonomy to make all sciences more\nscientific, and among the best ways of doing this are by rectifying, enlarging,\nand extending the foundations of these subjects. There is a hint that ideonomy may be on the verge of discovering some\nunsuspected category of being that is more fundamental than either ideas\nor things, or that transcends what is meant by both the \"mental\" and \"physical''\naspects of reality. By placing all of the things and phenomena in a subject upon basic scales--as\nof duration, time, Population, importance, complexity, or entropy--ideonomy\ncan call the mind's attention to what is only naturally the most and least\nfundamental in a subject, to the way in which things derive their greater\nor lesser fundamentality from one another, to the direction in which that\nwhich is truly or most fundamental is apt to be found, or to the properties\nthat fundamentals or foundations are likely to or must have. Knowledge or theory of the foundations of many subjects is impaired\nby a conscious or unconscious failure to identify, define, characterize,\nor emphasize the most fundamental, central, or final topic, concept, phenomenon,\nsubstance, law, entity, goal, or the like of the subject (or the set of\nsuch things). Then again, the supreme topic or whatever may have some terrible\nunsolved problem or difficulty associated with it. Thus the supreme concern of physics is no longer clear, the arch concern\nof sociology is in dispute, the goal of psychology is in flux, the essential\nnature or defining properties of life are unknown to the science of life\n(or to biology), and even the basic object of study of mathematics (it\ncannot be number , though the nature of number is an enigma in any\ncase), cosmology (what is the described or effable 'universe' itself a part of?), and ideonomy ( ideas , as hinted above, may not be sufficiently\nfundamental) is mysterious. Ideonomy can be used to define concepts in new and ever more fundamental\nways, and it has already been used to define life, or to reduce it to a\nset of ninety-two fundamental properties. The set of 8,464 possible dyadic\ncombinations of the primary properties have demonstrated such extraordinary\ninterest that they promise to revolutionize theoretical biology, something\nwhich at once illustrates the importance of clarifying fundamentals and\nsuggests that the traits that were used to define the phenomenon of \"life\"\nwere indeed fundamental. On the other hand, the same bit of ideonomic research also highlighted\nthe problems that plague all efforts to resolve fundamentals or to get\nat the genuine foundations of a subject; for it was found that the same\nset of ninety-two basic properties of \"life\" have either analogs or exact\nequivalents in the supposedly inanimate phenomena of subjects other than\nbiology. Thus forms or analogs of procreation, natural selection, and evolution\neither may or do exist in fields such as physical chemistry, geology, psychology,\nand cosmology. The implication may variously be that life is not limited\nor peculiar to biology, that life must be otherwise defined or defined\nvia other properties, that the essential phenomena of biology should include\nmore than organisms, or that biology should be recast into a superscience\nincorporating many other sciences or that--like mathematics--applies to\nall science. An old way of advancing the foundations of a subject is by improving,\nformalizing, or axiomatizing its logic; and a new or just now emerging\nway, by giving the subject cognitive form, which means the form of thought\nitself. Ideonomy can help with both of these approaches, particularly in\nconjunction with computer software and hardware. Erect Frameworks For Thought To think about anything one needs some manner of conceptual framework,\na schema upon which to hang ideas or in which to develop, interweave, and\nexperiment upon different concepts. Ideonomy, in effect, can enable such conceptual schemes, structures,\nand systems to be mass produced; it can widen their scope, diversify them,\nenhance their power, increase their connectivity or interrelatedness, greaten\ntheir mobility within and between fields, enlarge their rationality or\nmake their logic more explicit, give the individual the power to freely\nmanipulate them, etc. The concept of mental frameworks is so important to ideonomy\nthat it needs to be expanded upon. By it we mean an open-ended set of :\nschemes, structures, systems, and 'machines' of : ideas, relations,\nprinciples, presuppositions, facts, arguments, thoughts, beliefs, values,\npurposes, perspectives, methods, strategies, gestalts, analyses, attitudes,\npercepts, images, definitions, explanations, dimensions, symbols, criteria,\nrepresentations, models, heuristics, postulates, generalizations, theories,\nprocedures, wisdoms, stories, memories, analogies, rules, mental associations,\netc : serving or for furthering thought. Such mental schematizations of : experience, the environment,\nreality, behavior, human existence, or possibility : can be : conscious\nor unconscious : formal or informal : specific, general, or universal ad\nhoc or perpetual (evolutionary) : deductive or inductive : empirical\nor theoretical : categorical or experimental : developing or inert : etc. The diverse values and uses of cognitive frameworks include :\nmental simplification; clustering, grouping, and classifying of ideas and\nfacts; explication and coordination of different purposes and goals; structuring\nof memories in hierarchies, series, networks, trees, vergences, rings or\ncycles, foliations, meta-stories, etc-that are especially dynamic, powerful,\nnatural, efficient, dense, optimal, etc; recursive, self-developing, nucleative,\nand self-correcting properties or effects; the multidimensional mental\nparallax given by a multitude-of such frameworks; provision of a stable\napparatus for developing and maintaining mental skills; standardization\nwithin the mind ( à la worldwide industrial and scientific\nstandardization); provision of bases for tests, evaluations, investigations,\nand experiments; limitation of thought to what is necessary and obviation\nof trivial and repetitive thought and creativity; bases for communication\namong different minds and for comparisons of their contents; enabling of\nmore precise and rigorous thought; codification of though! acceleration\nof thought; enabling of overviews of experience, the world, one's conduct,\nand the mind; greater mental flexibility and self-control; readier learning;\nquick or more powerful structuring of materials, subjects, problems, or\nsituations; automation of mental habits and of ideation; heightened clarity\nof mind; etc. Frameworks for thought can enable a topic to be taught, mastered, or\ntreated more deeply or completely. They can provide clues for probing the\nnature of a thing. They can enable more imaginative or less prejudiced\nthought. They can help one to prepare for a more serious intellectual endeavor.\nThey can help one relate one perspective to another, or permit one to grasp\na new thing by analogy to an old or familiar thing. Enumerate the Functions of\nA Thing Things may, and usually do, have far more numerous and diverse functions,\nroles, and importances than people realize or would even imagine. If\nthis is true, it has great significance: Features of our world may be carelessly eliminated or altered by the\nignorant march of progress or change; All existing things may have a web\nof ecological relationships that merit study and respect; Things may all\nbe beneficiaries of many more things than has been thought; There may be\nan unsuspectedly great number of ways to change and improve the world or\nits things; etc. Among the possible generic functions of things are : Mediation;\nPrevention; Protection; Connection; Transportation; Communication; Symbolization;\nTesting; Facilitation; Amplification; Imitation or substitution; Extension;\nGeneralization; Specialization; Correction; Improvement; Balancing; Sublimation\nor domestication; Counteraction; Elimination; Supplementation; Complementation;\nExploitation; Coping; Hiding or deception; Showing; Production; Concentration\nor confinement; Combination or integration; Separation, division, or liberation;\nOrdering; Maintenance or supply; Storage, holding, preservation, or conservation;\nPreparation; Initiation; Control or management; Adjustment or modulation;\nTranscendence, circumvention, or obviation; Orientation; Reduction or economization\n(enhancement of efficiency); Transformation; Etc. Ideonomy can help answer such questions about functions as: How do functions overlap? What functions are competitive? What functions are cooperative, complementary,\nor synergistic? What functions are illusory, misleading, or ambiguous? What are all of the degrees of functions of things? What are the maximal,\nminimal, and optimal functions of things? What are all of the intermediate\nfunctions of things? What functions are absolute or relative? What makes them absolute or\nrelative? What are all of the ways in which they are absolute and relative?\nWhat are all of the absolute and relative functions of a thing? What functions conflict with, contradict, or negate what other functions? How do things acquire--and lose--their functions? How do or could functions\noriginate, develop, evolve, diminish, or disappear? How do different functions compare? What are all of the ways of comparing\nall functions? What functions are identical, equivalent, analogous, or\nrelated to what other functions? What functions differ or diverge from,\nor are opposite to, what other functions? What are all of the degrees,\nbases, circumstances, and implications of these things? What are not the functions of things, and what functions do not exist\nor are impossible? What are all of the generic and specific : properties, dimensions, elements,\nmechanisms, effects, signs, manifestations, criteria, etc of all\ngeneric and specific functions ? What functions are arbitrary or necessary? What functions are artificial\nor natural? What are the degrees and causes of these things? How can the : prediction, classification, recognition, examination,\nevaluation, explanation, creation, development, application or use, intercorrelation,\nsynthesis, differentiation, description, definition, modification, control\nor government, etc : of the functions of arbitrary things be mechanized\nand automated in the future , when the needed technology and methodology\nemerges7 How can different functions, and different species and genera of functions,\nbe combined to synthesize novel, desirable, or arbitrary functions--or\nsystems of functions--or to enlarge, transform, or relocate old functions? What functions of familiar or known things have been neglected ,\nforgotten about, or overlooked? What are the idiosyncrasies of the\nways in which people in general, or certain groups of people, classify,\nperceive, rank, or utilize the classes of functions of classes of things?\nWhat is good, bad, or simply significant about these idiosyncrasies? What are the characteristic and comparative ratios of our ignorance\nabout to our knowledge about different (key or comprehensive) functions\nof different (key or comprehensive) things in different (key or comprehensive)\nsituations? What are all possible or important categories of ignorance and knowledge\nabout functions? What are the actual extent, qualities, and forms of our\nignorance, knowledge, and skills within each of these vergent categories?\nWhat are the total-known or hypothesizable--costs, values, consequences,\nand implications thereof? In what meta-structures : series, networks, hierarchies, trees,\nlattices, rings, circuitries, vergences, knots, line-clumps, 'crystals'\n(e.g. of intersecting hyperdimensional planes or curved surfaces), plexures,\n'soils', matrixes, clusters, 'blobs', conoids, helicoids, aegagropilas\nor Peano curves, 'onions', fractals, chaoses, paths, 'catastrophes', tessellations\nor 'jigsaw puzzles', topological monsters, etc : do or could functions : exist, originate, operate, interact, develop, metamorphose, vanish, combine,\ncoalesce, reproduce, cooriginate, coevolve, invert, exhibit singularities,\netc? How do such meta-structures themselves : behave, associate, interact,\nevolve, originate, function, etc? How could or must the meta-structures of functions be used to describe,\nexplain, discover, manipulate, create, alter, etc : particular or arbitrary\nfunctions? What are all the particular or recurrent : goods, bads, defects,\nimperfections, limitations, etc.: of all functions of all things ? What are all known or possible functions of a single, particular or\nrandom, thing--and how are they structured inter se ? Conversely, what are all of the actual or possible things that have\nor could have a single, random or specific, function? What do they have\nor not have in common, that explains or relates to their shared function--or\nthat does not do so? What are all of the self-functions of things? What set of questions should be asked when treating functions? How should\nthey be ranked in relative importance? In what order should they be asked-or\nset of orders, depending on particular circumstances? What explains their\ndiverse importance? Which of these questions are and are not currently\nasked; or how efficient is the asking and answering of these questions?\nWhat decision-tree should govern the use of these questions, and what are\nits proper and possible anastomoses? What are the ways in which some of\nthe questions can and should be iterated? As results piled up worldwide from the habitual, ubiquitous, and standardized\nuse of such an encyclopedic, all-purpose, or universal questionary, how\ncould they be systematically and efficiently compiled, collated, colligated,\npromulgated, and exploited? Illustrative examples of functions include the function or functions\nof : Telephones in creating commercial nexuses; Human skin\nmicroflora in (hypothetically) preempting sites upon which pathogens\ncan establish themselves and from which the pathogens can invade the macrosymbiontic\nbody; Ball bearings in minimizing frictional contacts of overpassing\nsurfaces; Lightning in maintaining biogeochemical cycles and (by\ndeflagrating forests and prairies) ecological successions; Clowns in lighting up the hearts of children; Taverns in sublimating life's\nhorrors; Axons of neurons in shuttling and multiplying data in the\nbrain; Grammar in inducing neural impulses, data, or patterns to\norganize themselves into vergent hierarchies in the brain; Expletives in dissipating, condensing, or civilizing excessive emotions; Sidewalks in keeping pedestrians and children off streets-and cars off the former; Marriage in stabilizing, reproducing, and subdividing society; Rugs in simulating grass, creating thermal barriers (conserving heat or coolness),\nand stopping sound (perfectirig-privacy); Buildings' foundations in stabilizing and economizing frames; Spiders' webs in trapping\nflying, hopping, and climbing insects who do not notice them or who mistake\nthem for stems, giving their creators' midair nests inaccessible by lumbrous\npredators, and telegraphically or resonantly forewarning their seismoceptive\noccupants of the approach of more funambulatory enemies; Cloud cover in regulating terrestrial insolation and Earth's albedo--and hence in stabilizing\nclimate to the advantage, or conceivably in the Gaian service, of the bios; Money in mediating, stabilizing, equalizing, universalizing, codifying,\nrecording, rationalizing, virtualizing, coordinating, lubricating, temporally\nbroadening, quantizing, algebraizing ( sensu making more perfectly\ndistributive, associative, transitive, commutative, etc), institutionalizing,\nformalizing, unifying, mechanizing, 'vocalizing', 'intellectualizing',\netc the exchange of goods and services; Cosmetics in role-playing,\nseduction, intrasexual competition, feminization, and beautification of\nthe social landscape; Maps in collation, abstraction, and communication\nof geographic data; Roots in recovering rainwater from the sponge-like\nsoil; Stars in manufacturing larger atoms and animating planets\n(or at least one planet); Windows in half-admitting the outdoors\ninto buildings; Rulers, in quantizing the dimensions of objects; Dolls in preparing children for adult life, as surrogate parents,\nand as mirrors enabling kids to look upon themselves or to explore the\nworlds of intersubjectivity; Glue as an ersatz nail (at once cheap,\nnondestructive, hammer-less, all-size, always-singular, etc); Genes in remembering, immortalizing, transmuting, and 'generalizing' organisms; Etc. Many things can be done to functions; they can be : Enlarged or\ndiminished; Multiplied and diversified-or the reverse; Created or or ended;\nBroadened or narrowed; Sophisticated or simplified; Connected or disconnected;\nIntegrated or unified; Differentiated within or from other functions; Obviated;\nTemporarily suspended; Redirected or realigned; Molded or modified; Replaced\nby others; Relocated or rearranged with respect to other functions; Extended\nto include other things; Combined; Permuted; Transelemented; Redefined;\nFacilitated; Perpetuated; Perfected; Fixed (frozen); Slowed or quickened;\nElevated or reduced in importance -or made central or peripheral; Modulated;\nEtc. Foster Wisdom About the Future There are many ways in which one could be wise or wiser about the\nfuture ; e.g. one could simply attend to it more closely, or\nappreciate better the fleeting nature of the present or of things as they\nnow are; one could systematically examine the range of future possibilities ;\none could visualize the various alternative courses the world might\ntake in the future, and the things apt to determine which\nparticular set of courses the world will actually follow; one could identify the world's needs in advancing into the future, and endeavor to provide for those needs and wants; one could help to educate all present and future humanity to deal with the future; one could attempt\nto influence the actual course the world will take tomorrow, or\nto push it toward what would be good and away from what would be evil or\ninferior; one could labor to produce general methods for foreseeing\nor altering the future; etc. Of course the future being referred to need not be that of the world\nas a whole or represented by the future in its entirety, but on the contrary\nmight be arbitrarily modest: one's own future lifetime, perhaps, or tomorrow's\nevents or the events of the next minute, or the momentary or instantaneous\noutcome of a scientific experiment that someone is performing or whose\nperformance is simply being contemplated. Becoming wiser about the future might mean nothing more than divesting\noneself of prejudicial ideas, attitudes, beliefs, or world views, becoming\nfriendlier--or more hostile--to innovation, reducing the irrational inertia\nof institutions, or paying more attention to the patterns and lessons of\nhistory that might be analogous or relevant to the future. Among the fallacies that diminish wisdom about the future, and that\nideonomy could help to combat, are that : the future will simply repeat\nthe past; the course of the future is predetermined and inalterable; the\nworld of the present represents the best of all possible worlds; human\nknowledge and wisdom are nearly complete and perfect--and our ignorance\nsmall and unimportant; the future is too complex or esoteric for us to\nanticipate its character or possibilities--and past failures and inability\nto correctly foresee the future were unavoidable, and should be looked\nupon as a warning that all prophecy is folly; etc. Ideonomy could be used to : devise new, or suggest all possible,\nmethods for studying future possibilities; survey, describe, compare, evaluate,\ncriticize, correct, extend, integrate, and transcend all past and present prophetic methods, endeavors, and results; identify the totality of things\nthat can or should have their future possibilities considered; predict\nthe future interrelationships and interactions of these things; indicate\nthe future's most fundamental dimensions, structure, forces, elements,\npatterns, laws, etc; formulate principles for treating the future; develop\nnovel means for representing and dramatizing the future's possibilities\n(e.g. diagrams, organons, computer software and simulations new types of\nbooks, special language and idea spaces, artificial intelligence programs,\netc); suggest all possible causes, effects, and conditions of future possibilities;\nrank the relative and absolute probability and importance of all future\npossibilities; indicate the different roles and functions that things are\napt to have in the future; and so forth. Some of the specific questions and other issues that ideonomy could\nhelp to address are : What should be maximized and minimized in the\nfuture? What new rights may become political issues in the future? What\nhuman freedoms must ultimately be restrained for the good of all? What\npresent concerns of government will be retired and what new concerns will\ntake their place? What means are there for maximizing the future diversity\nand complexity of civilization? What were the laws of history, insofar\nas they apply to the future as well? How ambiguous is the future or are\nits possibilities? What meta-structures are applicable to the study of\nthe future or will actually describe its possibilities: incl. chains, series,\ntrees, networks, hierarchies, vergences, etc? What elements of the present\nwill disappear or endure in the future? What new discoveries, inventions,\ncreations, and other innovations are possible, probable, or certain in\nthe future? What developments can continue ad infinitum and which\nmust have limits? In what ways is the future apt to surprise us? What are\nall the future possibilities of a single, random or particular, thing?\nWhat future possibilities would be synergistic or antagonistic? In what\norder must different things happen? Illustrative examples of specific future possibilities are : Elimination\nof the need for sleep; Chinese democratic revolution; Life discovered elsewhere\nin the cosmos; Legalization of prostitution; Replacement of stores by teleshopping\nand robotized delivery of goods to homes; Evolution of a single panhuman\nlanguage; Reduction of physics to 'pure' logic; New age of dirigibles;\nExploration of a single cave 'pushed' to 100,000 kilometers (using miniature\nhumanoid teleoperators); Mechanical pets and computer- simulated plants\nmore popular than biological organisms; Family car replaced by a flying\nequivalent; irrefutable scientific proof of the existence of 'God'; Temporal\nmetric system adopted; War fought using beams of elementary particles so\nexotic that they have not yet been imagined; Time's apparently unique and\nirreversible flow shown to be a physical illusion; Mining of Earth's mantle;\nEvery organism on Earth transformed into a different species; New human\nsexes added to the traditional two; Complete obsolescence of the family;\nLamps made to last centuries; immortality made compulsory; Ethics remade\ninto an exact science; Deliberate suicide of the human race, subjectively\nrendered irrelevant by its own transhuman mechanical creations; Ideonomy\ntaught at all grade levels in all schools; War everywhere ended by the\nintroduction of \"peace pills\" (irenic psychopharmaceuticals); Etc. Generalize Notions One can use ideonomy to help to generalize or even universalize any\nand all notions and things. Over time things often prove to be insufficiently generalized. That\nis, the essential idea or set of ideas associated with them turn out to\nhave greater meaning, scope, or application than what is initially --or\nperhaps than is ever at any finite moment--thought to be the case. Actually it is probably true that in some sense the generality of all\nconcepts, and all concepts of things, must always be at once inadequate\nand excessive. But according to an ideonomic principle it is of the utmost importance\nthat the generality of all concepts constantly be enlarged over time, or\nadvanced toward infinity. Naturally in the course of such progressive generalization\nthe concepts will undergo fundamental metamorphoses, yet a form of semantic\ncontinuity may be apparent in retrospect that was prospectively invisible\nor even meaningless. It could be said that all concepts are inherently infinite in meaning,\nand even that this infinite aspect is close to their essence. To generalize - according to the dictionary - is to make general reduce\nto general laws : give a general form to; to derive or induce (a general\nconception or principle) from particulars; to derive or induce a general\nconception, principle, or inference from; to make general (as by existential\nor universal qualification) : render applicable to a wider class; to give\ngeneral applicability to; to modify or eliminate (nonessential details)\nfor emphasizing some particular feature; to portray or emphasize general\nrather than particular features and characteristics of. Illustrative examples of generalizations of ideas and things :\nHistorically, the generalization of the legal concept of a person to include corporations and other organizations, even though these contain\nmany human beings; Energy has been generalized to include mass;\nSome quantum physicists would generalize the concept of a physical phenomenon to include the apparatus used to measure the phenomenon, the observer,\nor even the observational or mensurational act; A few physicists would\ngo even further, and define any phenomenon as perforce including\nthe whole universe or all of spacetime; Certain modern composers generalize\nthe notion of musical scale to include any systematic or recurrent\narrangement of notes on which a composition is based; The concept of intelligence has been generalized to include animals that were formerly regarded as\nmindless; Skeletal and muscular systems have been generalized to\ninclude the cytoskeleton and other purely intracellular systems and structures;\nAnalogous generalization of the nervous system to include equivalents\nin unicellular organisms--and perhaps plants--may be imminent; Concepts\nof star and galaxy should perhaps be generalized to include one\nanother--since stars (as superstars) may equal or exceed (dwarf) galaxies\nin size; The progressive generalization of the concept of number in the\nhistory of mathematics to ever more abstract, strange ' numerous, and 'less\nnumber-like' things (imaginary numbers being one of the more famous products\nof this process); Over history the concept of evolution has become\never more generalized--to embrace not only biology (life; the phylogeny\nof species, ontogeny of bionts, and life-long biosynthesis of molecules,\norganelles, etc) but geology (Earth and other planets; the evolution of\ncontinents, mountains, geospheres, etc), astronomy (stars, galaxies perhaps,\nand the universe as a whole), physics (matter, energy, space, time, physical\nlaws and constants perhaps, etc), society, industry, economies, the mind,\nethics, the arts, etc; Mental illness has been generalized to include\nnormal mental states and individuals (on the belief that the difference\nis only one of degree, perspective, or concern)--and mental normality has been generalized to include mental illness (e.g. based on the belief\nthat the latter may be rational, coherent, or productive when viewed internally,\nfrom a different or larger perspective, or with an awareness that society\nis universally illogical and insane); Learning might be generalized\nto include selective forgetting, unlearning, and progressive inhibition;\nThe concepts of publishing, book, and magazine can be generalized\nto include novel forms and products of electronic publishing; The concept\nof color might be generalized to include the static and dynamic\nmeanings of pseudocolors in different or all possible situations--or simply\nto perceptual and cognitive patterns apparent in temporal successions\nand combinations of regular colors; Over the course of history the\nconcept or subject of science has broadened unremittingly, to the extent\nthat it now includes the study of: art qua aesthetics, musicology,\nphilology, etc.; money, wealth, and economic systems qua economics;\ngovernments and governance qua political science; reasoning and\nintelligence qua logic and cognitive science; battle and peace qua military science; techniques and engineering qua technology; society qua sociology; history qua historiology; the psyche qua psychology; ideas qua ideonomy; administration qua management science; language and languages qua linguistics; forms qua morphology; chance qua stochastics; science itself qua metascience; farming qua agriculture; etc; Etc . Examples of things that may have been inadequately generalized or\nthat may be generalized in the future: Humor : If precursors, rudiments', theriomorphic variants, or\nanalogs of laughter or a risibles are eventually found in animals other\nthan man, generalization of the concept or phenomenon of humor (its origin,\nfunctions, mechanisms, types, properties, referents, states, logics, degrees,\nscope, etc) may turn out to be desirable or necessary; Machine : The concept of a machine may have to be generalized\nso as to include biological phenomena (e.g. genomes, protein molecules,\nmicelles, organelles, cells, organs, biochemical networks and processes,\nbodily macro- systems such as the nervous and immune systems, organisms,\necosystems, and the hypothetically Gaian bios), various phenomena and entities\nin pure and applied mathematics--or even logic, chemical reactions, crystals,\ndiversely intelligent computers; models, simulations, and even scientific\ntheories; human languages and computer programs; geological and meteorological\nphenomena such as volcanoes and storms, the 'universe', man's mind or society,\npure or real-world ideas, physical laws, statistical and quantum phenomena\nin physics, economic systems, political ideologies, ethical systems, and\nsymphonies; Food : This should include 'nutritive' atmospheric gases; conceivably\norganisms get some genes or genic influences directly from food (via \"lateral\ngene flow\"); the body is forever 'consuming itself' (in strange and little-\nknown senses); even inanimate phenomena 'eat' or require 'nutrition' from\ntheir environment; conceivably the seemingly stable and self-existent macroscopic\nworld, with its delomorphic baryons and leptons, is in reality being dynamically\nmaintained and replenished from below, or by chains, fountains, singularities,\nplexiform or vergent hierarchies, or the like ascending from the ultramicroscopic\nlevel of zero-point, Bore], Dirac- vacuum, Wheeler-prespace, or Bohm-implicate\norder fluctuations; and the mind 'eats' ideas; House : This concept should be generalized to include the diverse\nhomes (-nests, burrows, cavities, interstices, webs, mounds, hollow trees,\nlogs, host exteriors and interiors, atmospheric dust and cloud particles,\netc) of all organisms; shells, exoskeletons, skin, bodies, the skull and\nblood-brain barrier, etc; cells, plasmalemmas, misc. membranes, etc; ecological\nniches, ecosystems, and the bios; as well as the 'houses' of inanimate\nphenomena: atmospheres, planets, the heliosphere, the galactic atmosphere,\nthe universe, factories, etc; Universe : Generalizing this terribly presumptuous concept might\nbe appropriate if there are other universes or quasi-external parts of\nour universe, Everett's Many-Worlds Cosmology is real, most of the mass\nof the universe is invisible and exotic stuff, there is an infinite microcosm,\nBohm's Implicate Order exists, etc; or to take account of Wheeler's Superspace,\nthe omniverse (all of spacetime), physicomental \"reality\", and the Ideocosm. Important genera of generalizable things, or of things whose treatment\nit will often be important to generalize, include : Effects; Causes;\nLaws; Analogies; Differences; Criteria; Definitions; Criticisms; Decisions;\nBeliefs; Answers; Questions; Assumptions; Acts; Abilities; Bads; Goods;\nAppearances; Concepts; Corollaries; States; Governments; Arguments; Discoveries;\nDoctrines; Domains; Errors; Events; Fields; Functions; Fundamentals; Generalizations\n(sic); Goals; Hierarchies; Dimensions and properties; Histories; Hypotheses;\nIgnorances; Illusions; Individuals; Instances; Instruments; Interactions;\nInterests; Inventions; Knowledge; Languages; Levels; Limitations; Mathematics;\nMechanisms; Metaphors; Methods; Models; Forms; Motions; Needs; Negations;\nNetworks; Niches; Nonexistences; Responsibilities; Opportunities; Order\ntypes; Origins; Paradoxes; Paths; Patterns; Plans; Possibilities; Predictions;\nPrinciples; Probabilities; Problems; Processes; Proofs; Purposes; Quantities;\nRelations; Representations; Resources; Roles; Rules; Scenarios; Senses;\nSeries; Shortcuts; Simplifications; Solutions; Spaces; Speculations; Stories;\nStrategies; Systems; Taxons; Theories; Things; Transcendences; Trees; Unifications;\nUncertainties; Uses; Values; Virtuals; Wants; Wisdoms; Behaviors; Combinations;\nCommonalities; Complexities; Conflicts; Cooperations; Correlations; Cybernetics;\nGeneses; Disjunctions; Alternatives; Circumstances; Perspectives; Analyses;\nClusters; Chains of consequences; Changes; Chances; Chaoses; Economics;\nElements; Equivalences; Essentials; Excuses; Experiments; Extensions; Futuribles;\n\"Groups\"; Equalities and inequalities; Equilibria; Manifolds; Connections;\nPractices; Norms; Statistics; Mappings; Centers; Tendencies, trends, and\ndirections; Standards; Cycles; Symmetries and asymmetries; Invariants and\nconservations; Convergences and divergences; Measures; Etc. Senses, methods, and types of generalization are : Things, concepts, methods, resources, etc that are ordinarily used in\nonly a limited way can be tentatively or permanently applied elsewhere ,\nto other things, domains, elements, tasks, subjects, etc, or universally; Words, concepts, things, loci, structures, operations, functions, etc\ncan be added to, combined with, included within , subsumed or treated\nunder, identified with, etc something : one or a set of : things,\nconcepts, words, functions, subjects, concerns, investigations, etc; Other forms of a thing, concept, or whatever can be created,\ndiscovered, postulated, treated, used, etc: one, many, or all; Something can be transformed into something else, of a similar\nor dissimilar nature, or something else can be derived from it; Finite boundaries of what a thing is, can be, applies to, etc\ncan be precisely discovered , investigated, described, referred to,\ndefined, assumed, or imposed - and arbitrary or false boundaries or limits\ncan be invalidated, removed, or transcended; Larger meanings or implications of a thing or concept can be\nadded, sought, hypothesized, found, researched, described, referred to,\nmade use of it, etc; Other examples or instances of a thing, concept, etc can be found,\ndescribed, validated, indicated, etc: one, many, or all; Something : supposedly or actually : particular , individual,\nconcrete, derivative, virtual, unique, anomalous, accidental, conditional,\ndependent, transitory, minor, indeterminate, meaningless, peripheral, etc\n: can be : transformed into , imagined as, or treated as : what is\ninstead instead : general , plural, abstract, nomothetic, primary,\nfundamental, real, variable, universal, normal, categoreal, necessary,\nabsolute, independent, enduring or eternal, major, determinate, meaningful,\nessential, central, cognitive or ideonomic, etc; Taxon or category : can be : given , treated as having,\nvirtually given, Tound to have, or postulated to have higher : taxological,\nexistential, or cognitive : status or nature e.g. a species may\nbe turned into a genus; Thing may be assigned to a higher taxon or category; More and more relationships of a : thing concept, etc : to more\nand more : things, concepts, parts of the world or reality, etc : may be\n: discovered, postulated, described, treated as existing, implied, sought,\ndifferentiated, created, etc; Analogs , equivalents, homologs, associates, etc : of a thing,\nconcept, or whatever can be : discovered, conceived of, postulated, surveyed,\ngrouped quantitatively and qualitatively relative to the 'thing', connected\nthereto, investigated, unified or synthesized with or treated as being\nidentical to the 'thing', treated conjointly with the 'thing', etc; In a larger and larger way just one or a few : dimensions , properties, aspects, elements, relationships, types,\nexamples, etc : of a thing, concept, or whatever may be : investigated,\ndiscovered, described, created, perfected, extended, postulated, or otherwise treated; Etc. Questions about generalization that ideonomy can help to ask and\nanswer include : What are the meta-structures of, connected with,\nand relevant to generalization overall or specific generalizations: e.g.\nhierarchies, networks, trees, series, vergences, rings, lattices, matrices,\ncircuitries, plexures, differential-topologic structures, fractals, chaos,\nPeano curves, tessellations or 'jigsaw puzzles', spheroids, convergences,\ndivergences, etc? And all canonical sub-types thereof? What are all : reciprocities, interrelationships, Interdependences,\nintertransformations, symmetries, asymmetries, co-probabilities, sets,\nequilibria, antisyzygies, redundancies and irredundancies, mereologies,\ncycles, interoperations, combinations and combinatorics, algebras, laws,\ninterrepresentations, morphisms, myrioramic. patterns, coevolutions, 'cellular-automaton\nlogics', logics, etc of all or particular sets of generalizations ? For all or particular : specific or generic : generalizations of\nall or particular : specific or generic : things, what are all generic\nand specific : Limits; Infinities; Goods and bads; Rules and errors;\nQuestions; Principles; Concepts; Mechanisms; Analogies and differences;\nPossibilities; Data; Tests, experiments, and proofs; Alternatives; Spectrums,\nranges, quantities, measures, and scalings; Mathematics; Probabilities;\nDimensions and properties; States, spaces, conditions, and environments;\nEvents, processes, procedures, methods, operations, and strategies; Contents;\nAssumptions; Gedankenexperiments; Decisions; Problems and solutions; Names,\ndefinitions, classifications, and descriptions; Neural correlates and bases;\nParadoxes; Emergents; Elements; Essentials; Evaluations; Extremes; Fields;\nPaths, courses, flows, motions, behaviors, changes, and transformations;\nFunctions, roles, purposes, uses, goals, and values; Corollaries, interests,\nand implications; Geneses; Games; Futuribles; \"Groups\"; Histories; Knowledges\nand ignorances; Illusions; Appearances; Complexities and simplicities;\nHarmonies and disharmonies; Languages; Negations; Opposites; Networks of\nconsequences; Levels and niveaus; Nonexistences; Order taxons; Origins;\nParadigms; Achievements and failures; Pathoses; Requirements; Possibilities;\nSub-types; Realms; Recursions; Chances; Representations and ideograms;\nResources (instruments and materials); Sets; Shortcuts; Stories; Surprises\nand discontinuities; Linearities and nonlinearities; Nonmonotonic manipulations;\nSystems; Theories; Transcendences; Wholes and gestalts; Wisdoms; Research\nprograms; Interdisciplinary relationships; Etc? What are all possible, all nonequivalent, all specialized, and all hierarchical\ngeneralizations of or regarding a single , random or particular, thing ? How can or should all things , or all sets of types of\nthings, be progressively generalized into, with respect\nto , or on the basis of, one another? What are all human motivations for generalizing and not generalizing\nany and all things in any and all ways in any and all circumstances; and\nwhat are all of the psychodynamics thereof? What are the total ideonomic\ninterests of these things? What are the current frontiers of generalization of things by\nmankind? Suggest Goals Many enterprises are launched, conducted, and even consummated with\nalmost no attention paid to their possible, actual, or appropriate goals. Yet this can cause many problems and have many costs, e.g. : Inefficiency;\nFailure to make adequate or correct provision or preparation; Inability\nto notice and rectify a faulty course; Taking of excessive or unnecessary\nrisks, perhaps unconsciously; Blindness to opportunities; Indecision and\ninaction in crises; Indirection and aimless wandering; Lack of plans and\npriorities; Inability to optimize the use--and mindless wastage--of finite\nresources; Anarchy; Distractibility; Inaction; Anomie and tedium; Lack\nof motivation; Inconsistencies, contradictions, and disharmonies; Impossibility\nof cooperative endeavor; Inability to structure existence; Fragility of\nan enterprise and a tendency for it to degenerate and fragment; Inability\nto discriminate good from bad--or to recognize what is best and worst,\nvital and unimportant, central and peripheral, significant and irrelevant,\netc; Anonymity to the world at large or external confusion and misreaction;\nEtc. Ideonomy can be used to suggest goals that are : new, alternative,\ncontrasting, successional or progressive, maximal or optimal, safe, certain,\ntranscendent or revolutionary, unconsidered or overlooked, realistic, easy,\nexpedient, productive, ultimate or supreme, simpler or more complex, indirect,\ncontingent, secondary or tertiary, suited to oneself, complementary to\nsituations or circumstances, compatible, synergistic, logical, less costly,\nmultidimensional or multipurpose, subtle, definable, proportionate to one's\nresources, unorthodox, contra-intuitive, irredundant, finite or infinite,\nequivalent or analogous, specific or general, universal, etc. Goals are often pursued that are the wrong ones, but they are not abandoned\nbecause they have never been made explicit. When some goal is made explicit\nit becomes possible to study its real meaning and importance and the relationships\nit has to other things that are being done or that might be done. The things\nthat are required for the goal to be achieved can be investigated, decided\nupon, and implemented. Ideonomy by its nature encourages the comparative study of every sort\nof goal in every sort of field, and profitable knowledge can be derived\nfrom this of the larger and more efficient ways and means of pursuing arbitrary\nor all goals. Mistakes that are apt to be made in selecting and achieving\ngoals can be identified, along with ways of avoiding those mistakes or\nof dealing with them when they occur. Other characteristic problems that are associated with the pursuit\nof goals include an overdramatization of the importance of a single\ngoal, token attention to the goal, a tendency for a goal to be misformulated\nor misinterpreted, failure to appreciate that a goal is apt to be more\nthan a simple name or definition and may embrace the simple insights that\nare apt to accrue in planning for and advancing toward the goal, the error\nof relying upon a single method or path for achieving the goal, etc. Illustrative examples of goals are : Putting the first men on\nthe Moon; Target in an enemy country of an intercontinental ballistic missile;\nDowning and eating of a gazelle as the goal of a lion that is stalking\nit; Student's goal of passing an exam; Finding a needle in a haystack;\nLanding someone as one's spouse; Solving some great unsolved problem in\nmathematics, as by finding a proof of Fermat's last theorem; Breaking an\nOlympic record in poll vaulting; 'Pineapple's goal' of reaching the standard\nsize specified by the genome of the pineapple plant; Zinc atoms' 'goal'\nto deposit themselves on the cathode in the electrolysis of zinc chloride\nsolution; Break-even point in research to achieve controlled thermonuclear\nfusion for industry; 'Goal' of a column of magma ascending through Earth's\ncrust to reach the atmosphere and erupt lava on the Earth's surface; Goal\nof a company to recover its investment in developing a new product; Puppy's\ngoal of reaching its mother's teat while fighting its littermates for the\nsame objective; Goal of a detective to discover the identity of a murderer;\n'Goal' of the disturbed surface of a pond to settle back into hydrostatic\n(gravitational) equilibrium; Etc. Although the concept of a goal in the realm of inanimate nature is momentarily\ndiscountenanced, several fundamental questions are in fact begged by this\nexclusion, and--certainly with revision--the concept may one day be be\nresurrected. At the very least it may be decided that the word should\nbe redefined so that it can function in this more embracive way, since\ndead matter can be observed to behave in ways that by analogy suggest\nthe pursuit and satisfaction of goals by organisms or minds. The 'goal'\nmay simply be the thermodynamic end-state of a physical process that is\nrelaxing toward equilibrium-regardless of whether that end-state is known,\nspecifiable, or even meaningful in advance, or of whether it is uniquely\nimplicit in some set of mathematical equations. It is also true that it\nis premature to absolutely exclude the possibility of teleological phenomena\nor of \"final causes\" from physical nature. Excluded possibilities in science\nhave a funny way of reentering the picture years later in radically different\ndress, although this is a lesson that scientists have been slow to learn. Show Paths To Goals It is possible to know, or even to prove, that a goal is attainable\nwhile at the same time remaining ignorant of how to actually achieve it.\nEven if all of the necessary resources and methods are at one's disposal,\na critical sequence of steps or concatenation of things may elude one.\nAn objective may hover an instant, layer, cell, operation, or decision\naway and yet be impossible to reach simply because the path to it is not\nknown, well-defined, or available. Ideonomy can teach general and specific ways to discover or create paths\nto specific and generic goals, and train the relevant skills. It can also suggest : Whether a desired or imagined path exists\nor not or would or would not be feasible; Costs and requirements of finding,\nconstructing, altering, or using paths; Things paths should avoid or their\ngeneral hazards; Different types of paths that are possible or appropriate;\nLikely and proper quantitative dimensions of paths; Consequences or side\neffects of using different paths; Etc. Clarify Good To clarify good it may be convenient, desirable, or necessary to first\nor eventually consult, define, investigate, portray, or even create bad.\nBads and goods are both primary concerns of ideonomy. Basic classes of goods are : Helps and assistance; 'Net goods';\nVirtues; Excellences; Benefits; Advantages; Ideals; Wishes and aims (desired\nthings and conditions); Needed and useful resources; Good luck; Pleasures\nand pleasurable things; and 'Non-bads' (absences of bad; everything that\nis not actually bad). The goods that interest ideonomy need not have anything to do with human\nbeings or human values. Inanimate phenomena and entities--and 'pure ideas',\nwhatever they are--have their own agathokakological orders. All goods of all things should be inquired into, systematized, and reduced\nto ever more universal laws. How can good be served, maximized, and evolved if we are ignorant of\nits kinds, possibilities, and laws? If we do not understand its complexities,\nproblems, contradictions, and illusions? If its elements, fundamentals,\nneeds, mechanisms, processes, and manifold relationships to the other things\nof the universe are unknown? One way to begin the scientific study of good would be to examine the\nnature, circumstances, and existence of a single-random or particular-thing\nin an effort to discover all goods of or connected with the thing, or every\nway and degree in which any or every thing is or is not 'good' for the\nthing or 'from the thing's perspective'. Were the thing to be given such comprehensive agathological scrutiny\nan ant, for example, one might ask and try to answer these questions: Is\nthe presence of a minimum amount of water in the soil important to the\nant's hive? Which traces of chemical elements are good for the ant's diet, even though they are not essential nutrients ? Are there diseases\nof other soil organisms that benefit the ant when they occur? What polymorphisms\nare good or best for the species of ant? What wind velocity at the mouth\nof an ant's nest is optimal for the colony, in good weather? Are there\ncertain early life experiences that are good for an ant to have, say because\nthey trigger the emergence of latent instincts, orient the ant for life\nto the peculiarities of its environment, or institute certain skills in\nthe then- plastic nervous system of the ant? Lessons here could be carried over experimentally to the possible goods\nfor other animal species. Discrepancies, adaptations, and supplementations\nnoted through such series, networks, and hierarchies of comparisons could\nlead to an even more powerful generalization of agathological knowledge,\nmethods, and skills, and eventually make possible the treatment of arbitrary\ngoods of arbitrary things. Another valuable ideonomic exercise would be to construct a diagram\nwith the names of a random set of related or maximally diverse things scattered\nabout but enclosed in ellipses. Arrows would be drawn between certain ellipses\nto indicate which things are or might be, in some sense or degree, good\nfor which other things. Arrows could be : one-way or two-way, simple\nor branched, connected only to ellipses or also referent to or from other\narrows ( à la vergences, networks, circuitries, hierarchies,\nor other meta- structures), weighted by being thickened, colored to signify\nsenses of good or goodness, etc. Complementary sets or suites of the diagram could be created to exhibit\nor investigate the difference that various arguments, circumstances,\nor perspectives make for the possible or actual relationships, incremental\nbut rational and natural changes in various directions (e.g. that of scaled\ntime or probability), how different people would render the same diagram,\netc. Such an agathological diagram - or agathogram - could be programmed\non a computer in a matric or dynamic form. Multivariate analysis, multidimensional\nscaling, cluster analysis, artificial intelligence techniques and programs,\netc could be used to discover and explore an agathological universe - or\nagathocosm - of : meaningful, contrasting, interdependent, orthogonal,\nnonexistent, evolutionary, anamorphic, circular, cyclic, autopoietic, mathematically\ndiverse, arborescent, stochastic, chaotic, aesthetically appealing, \"implicate\"\n(in David Bohm's sense), etc : idea spaces, permutations, combinations,\nclusters, chains, series, \"rotations\", inversions, representations, games,\nsystems of motions and transformations, morphogeneses, other types of ideograms,\netc. All of the : senses, categories, types, subtypes, taxons, and\nnatural taxological systems : of special or universal goods need to\nbe identified, described, named, evaluated, reduced to operations and\nlogic and transformations, etc. They should be used to : discover,\nimagine, investigate, characterize, compare, interrelate, synthesize, criticize,\nperfect, exploit, transcend, teach, etc all goods of all things. What are all known or possible dimensions for scaling goods or\nthe goodness of things, and all actual scalings and co-scalings of all\nabstract and concrete goods, e.g. per : closeness, redundancy, co-representability\nor comparability, orthogonality, oppositeness, cost, frequency of exemplification,\ntypological diversity, confinement to man (anthropomorphism) or contrary\nexemplification throughout nature, human importance, human agreement about,\ndegree of clustering, logical containment or hierarchy, universal symmetry,\nconceptual simplicity, etc? How does the same type of good vary when it is exemplified in different\nphenomena or sciences? What are all of the goods and bads that converge in and/or diverge from\nsingle events? What transvaluations of goods, or of the goodness of things, are possible,\ndesirable, or inevitable? Some illustrative genera of good are : order, harmony, efficiency,\nsimplicity, reliability, strength, success, improvement, wealth, balance\nor proportion, security, freedom, opportunity, utility, diversity, transcendence,\nwisdom, power, control, productivity, flourishing, peace, 'health', problemlessness,\nsalubrity, wholeness, meaning, challenge, consummation, certainty, purpose,\ndirection, preservation, beauty, challenge, responsibility, 'fairness',\ngood fortune, cleanliness, clarity, sophistication, assistance, synergism,\ntruth, self-mastery, etc. All causes of good need to be discovered, defined, distinguished, quantified,\nexplained, synthesized, systematized, mastered (technologically and methodologically),\netc. Yet the causes of both specific and generic goods are often esoteric. Some possible or known causes of good are : one or more other\ngoods; universal laws and relationships; nature's pervasive or absolute\nself- similarity; the subjectivity of 'goods' and the spatiotemporal invariances\nof human minds; striving for good; plans; methods; cooperative and coevolutionary\ntendencies of natural phenomena; evolution--incl. self- evolution and cosmic\nevolution-of things and goods; the pervasive tendency of the universe to\norder and organize itself; moral and legal laws; the sense of beauty; fractal,\nharmonic, hierarchic, vergent, cyclic, and other meta- patterns and meta-structures;\nman's habits of collecting, preserving, nursing, and combining goods or\ngood things; early agathology; etc. Some illustrative species or narrow examples of good are : humility,\nhonesty, sanity, kindness, reverence, trust, stability, civilization, good\nhabits, tolerance, gentleness, magnanimity, eloquence or mastery of language,\nlongevity, altruism, grace, happiness., comfort, leisure, community, scientific\nand technological progress, economic growth, wit, family strength, quiet,\nnonpollution of the environment, learning, teaching, husbandry of human\nresources, thrift, military peace, good government, manners, integrity,\nrefinement of taste, and the doing of good. Ideonomy might be used to investigate what is good for, in, about,\nor otherwise in connection with such diverse particular things as :\nsoil, the family, enzymes, the human voice, an enemy, a friend, spiders,\na spider's web, grape flavor, starlight, yard sales, religion, atheism,\nthe Golgi apparatus (dictyosomes), war (sic), bads (sic), virtue, the crossword\npuzzle, seed dispersal, the honeybee waggle dance, filter feeding, Earth's\nwinds, cosmic gravity waves, binary star systems, beaches, time, Reynold's\nnumber (Re = rn L/ h ),\nthe alga, earth tides, psychoanalytic transference, intelligence tests,\noneself, the unconscious mind, heat diffusion, proton precession, striations\nin electrical discharge, radioactivity, adjoint groups, paracompact space,\nexterior algebras of linear spaces, Fourier transforms, saddle points,\noverteaching, ring whizzers and other fluxional molecules, monomolecular\nfilms, certain choices of starting materials in chemistry, marine upwelling,\nthe sea's internal waves, ocean spray, a falling birth rate, acculturation\n(intercultural borrowing), twinned crystals, the semicolon, taxation, the\nSwiss system of government, German character, boldness in war, military\nnight operations, astronomy, historiographic periodization, goodwill in\ncommerce, expressionist painting, the design of a safety pin, one person's\nhandwriting, leveraged buyouts, corporate disclosure, FM (frequency modulation)\nradio transmission, the gear, formal education, the metaphor, crying, touristry\nto the Third World, divinities, the universe, the mathematical point, play,\nbirds' nests, the chair, the theater, the Dirac quantum mechanical vacuum,\ncompetition, philosophy, the pinna, examples, music, continental drift,\nultramicrophysical strings, etc. The ideonomic treatment of good and bad can be pandisciplinary in two senses: not only can ideonomy help to treat the content or phenomena of\nall subjects, but it can at the same time be used to evaluate, criticize,\nand improve the work, organization, and structure of entire disciplines. Thus it could be used to answer the question : what in the methods,\nresearch programs, tools, goals, foundations, concepts and theories, language,\nresearch foci, institutions, pedagogy, publications, etc of present- day biology is good and bad? Help Treat the Hardest Things At any moment in a given field certain problems, tasks, questions, methods,\nphenomena, domains, unmet needs, goals, concepts, subfields, etc explicitly\nor implicitly exist that are the most difficult ones of all in that field;\nand a subset of these things will be the hardest things in human knowledge\nand endeavor as a whole. Breakthroughs in these cases are apt to cause the greatest excitement,\nhave the largest consequences for those fields or for civilization, shift\nparadigms or upend cherished beliefs, reorient or revolutionize theoretical\nor experimental inquiry, initiate new fields of investigation, conclude\nor commence the longest-lived and most emotional squabbles, etc. In an abstract and generic sense the hardest things are apt to be or\nrelate to: Demonstrations that a postulated or implied entity or relationship\nexists or does not exist, or is possible or impossible; Firm proofs or\ndisproofs of a proposition or hypothesis; Unifications of an entire field\nor theory; Proofs of the equivalence or nonequivalence of two fundamental\nthings; Universality of some concept, law, relation, or phenomenon; Demonstration\nthat a certain thing is truly fundamental or more fundamental than anything\nelse known or possible; Falsification or modification of what are assumed\nto be universal or absolute laws, constants, theories, etc; Gaining of\nabsolute or overriding control over some system, process, or phenomenon;\nObtaining complete knowledge or understanding of a thing; Advances\ninvolving extremely complex or chaotic phenomena; Matters that require\nbreakthroughs in pure or applied logic; Etc. For a variety of reasons ideonomy may in the future play an important\nrole in the treatment of the hardest things : It may be a fallacy that\nthe hardness of solving certain classes of problems is fundamental, intrinsic,\nand irreducible--and ideonomy may help challenge this highly influential\nfallacy; it may be a fallacy that there is only one way to solve certain\nproblems or answer certain questions--and ideonomy may have a peculiar\npower to bring to light the actual richness of possibilities; One of the\nspurs for the creation of ideonomy in the first place was the attempt to\nfurnish the human mind with some universally more powerful instrument in\nthe treatment of extreme difficulty and complexity, and in the handling\nof the special problems being created by the explosive growth of human\nknowledge, technology, and endeavor; Unexpected analogies may exist between\nthe hardest things in different sciences, the concepts and methods pertinent\nthereto, the importances thereof, and even the basic solutions to the problems\nrepresented by such things--analogies that ideonomy can help to reveal\nand treat; Ideonomy can be used to ascertain and dramatize the absolute\nand relative need, importance, and consequences of achieving the hardest\nthings; Ideonomy can systematize, coordinate, accelerate, and maximize\nthe imagination and discovery of the totality of hardest things; Usually\nfew people know of the existence, nature, and implications of the hardest\nthings, and ideonomy can make such knowledge more broadly available, both\nwithin the relevant field and outside it; Etc. Some illustrative examples of the hardest things are : Whether,\nin mathematics, there are fractional alefs, or whether alef one is or is\nnot equivalent to the power of the continuum; Nature of measurement in\nquantum theory; Fundamental relationship between quantum and relativity\nphysics; How our brain thinks or computers can be made to think as well\nor better; Fundamental relationship between the physical and mental aspects\nof nature; Basic nature of mathematical truth; Question as to the ultimate\nsafety of scientific and technological progress, or of how to insure its\nsafety; Many- body problems in mathematical physics; What the essential\nnature of life is; Whether actual infinities exist in nature or nature\nis wholly finite and discrete; Why nature itself exists in the first place;\nExtent to which our picture of nature is reducible to one or a few things\n(e.g. laws, forces, entities, sciences, theories, representations, phenomena,\nrelationships, processes, principles, substances, problems, concepts, etc);\nUnification of gravitation with the other known fundamental physical forces;\nIsolation of the fundamental, quantitative, and predictive laws of society\nor of social behavior and development; Automation of artistic creation;\nCreation of a fully consistent, or comprehensive, theory of probability;\nLogical foundations of physics; Nature of randomness or its contribution\nto the physical world; Scientific basis of ethics; Why physical space is--or\nseems--tridimensional; Structure and dynamics of Dirac's quantum-mechanical\nvacuum; Ergodic theory; Information theory; Prediction of patterns given\ncellular automata will produce, or of the cellular automata that can generate\ndesired or noted patterns; Initial conditions of 'the universe'; Long-term\nfuture of civilization; Measurement of gravitation's fundamental velocity\nor coupling constant to other basic forces, or detection of gravity waves\nor gravitons; Basic nature of time, or whether reversible travel backwards\nand forwards in time is feasible; How life began, and a priori probability\nof its origin or repeated origin (around the universe ); Basic structure\nof the universe; How to civilize human nature or the earth--or extinguish\nwar and crime; How much of the human mind is inherited from the human genome;\nWhat the quantity of nonsense in the world is; Etc. What are all of the hardest problems and possibilities that are connected\nwith a single, random or particular, thing? Where would all of the examples of hardest things that were mentioned\nabove fall on a universal scale of degrees of hardness? Which of the things\nwould be most ambiguous or hard to place on such a scale? What hierarchies of hardest things are there? Also what series, networks,\ntrees, rings (sic), clusters, etc? Which of the things listed above should be tackled first and last --and\nwhy? Are there things that are by definition, or that can be proven in advance\nto be, infinitely hard to accomplish or know? Where would the examples of hardest things above all fall on a scale\ngiving the imagined quantity of future time that will or must elapse before\nthat which they speak of becomes known or is achieved? What are the basic reasons for the hardness of each of those things? Which of those apparent or supposed hardnesses may in fact be illusory? On the other hand, which of all those things that would seem to us easy\nto accomplish or know in the future, may actually turn out to be hard or\namong the hardest of possibilities? What were the hardest problems historically and how were they solved?\nMoreover, what resulted from their solution or explanation-and what lessons\nmay there be for us now as we confront those things that for ourselves\nare the hardest to come to terms with? Describe Hierarchies From the point of view of ideonomy, an infinite number and variety of\nhierarchies may well exist in and as nature, and all things, in some sense,\nmay be hierarchical or possess hierarchical aspects, elements, and relationships. The foreseen task is to find and define the totality of such hierarchies\nand hierarchical relationships, to identify the laws thereof, and to progressively\nexploit the opportunities implicit in such things. Of course hierarchy represents just one of the basic genera of\nso-called meta-structures that presumably pervade the universe or 'reality',\nbut the exemplifications, meanings, and possibilities of each such genus\nmust be thoroughly investigated and elaborated. The case of hierarchy can\nserve as a general example of what must be done and of what is apt to follow\nupon the doing of it. What is meant by the word or concept of hierarchy? One way to answer\nthis question is by seeing what hierarchy could mean--or what hierarchies\nmay in fact, or could in theory, exist--in connection with a variety of\nthings. For example: Could there be a hierarchy of snowflakes ? Actually there could\nbe many such hierarchies: Presumably there is a probability spectrum for\ndifferent flake shapes; Formative mechanisms may be plural or subject to\ncomplication or external influences, in which case either the causes or\ntheir effects may canonically progress in chains and branch in--chronological\nor nomological-- trees; Probability or existence of certain flake forms\nmay be a function of the set-theoretic statistics or combinatorial clustering\nof other flake forms; Etc. A hierarchy of winters ? Perhaps winters can be multidimensionally\ndescribed and there are certain types of winters that are only likely to\nto occur after, or somewhere in the middle of, certain sequences of other\ntypes of winters; Perhaps there is a hierarchy of descriptions or of descriptive\nelements, such that certain descriptions or elements are more fundamental\nor at least simpler than others, and it is appropriate or necessary to\n'move along' the hierarchy in attempting to characterize winters; Etc. A hierarchy of stars ? Certain stars generate chemical elements\nand isotopes that are then recycled in other stars and without which those\nother types and generations of stars are impossible; Similar stellar hierarchy\nmay exist thanks to the production, recycling, multistage transformation,\nor control of different molecular species by generations--or perhaps by\nsynchronic hierarchies--of stars; Hierarchical sets of stars may create\ndifferent physical conditions at a variety of levels (e.g. of stellar density)\nthat induce special types of stars, or of stellar behavior, at those levels;\nEtc. Possible or actual properties, dimensions, or features of hierarchies\nor of their contents include : Elements; Sets, subsets, and supersets;\nLevels; Degrees; Layers; Ranges; Intervals; Gaps; Folia; Partitions; Stages;\nChains or sequences; Series; Harmonics or powers; Units and multiples;\nDomination and subordination; Supreme commander; Tops, apexes, vertexes,\netc; Bottoms, bases, roots, foundations, etc; Starts, origins, first things,\na single beginner, etc; Stops, finishes, last things, etc; Greatest or\nmaximal thing; Least or minimal things or thing; Thresholds; Transformations;\nRhythms, cycles, iterations, reappearances, etc; Poles, orientations, etc;\nInversions; Transitivity; Asymmetry; Antisymmetry; Control, government,\nor regulation; Ranks; Superiority; One-many relationships; Trees or arborescence;\nDirection; Unidirectional action; Dependences, independences, and interdependences;\nMonotonic progression; Emergence; Equivalent and nonequivalent elements;\nSimplicity; Internal structure and external form; Completeness and all-\ninclusiveness; Horizontal and vertical relationships; Rules; Defined or\nexact relationships; Continuity; Universality; Pyramidality; Discrete and\ncontinuous aspects; Opposites, antipolarity, and antisyzygies; Uniqueness\nor singularity; Unity-in-diversity; Spectrums; Convergence, divergence,\nand vergence; Orthogonality; Etc. Possible effects, values, or uses of hierarchies include: Arbitrarily\nlarge sets of things or elements can be connected, reduced, related, or\ntraced back to, or derived from, just a single thing, element:, point,\nevent, law, etc.--via a path that is at once maximally short, powerful,\ncomprehensive, logical, necessary, central, self-similar, ubiquitous, etc;\nCausation, perturbation, government, etc can be shown to be, or treated\nas being, completely unidirectional and an incremental and comprehensive\nflow over an arbitrarily large set of identical or diverse things, processes,\nphenomena, domains, effects, changes, events, etc; Time-asymmetric evolution\nof an entire system or universe; Flows in two opposite and paired directions\ncan be enabled or defined--flows of an opposite, complementary, reciprocal,\nor independent nature or content; Things or processes of every possible\nsize, number, or complexity can all be 'reduced' to the dimidiations, doublings,\nbifurcations, partitionings, iterations, recursions, fractal structure,\nor the like of a single thing, process, pattern, or the like--so that the\nsmallest and largest scales or sets, first and last things, whole and parts,\ne/vc of the hierarchy are mutually derived, antisyzygially, in an exact\nor approximate way; Generalization, specialization, and their interdetermination;\nAlternative descriptions, classifications, or treatments of things can\nbe rigorously excluded; Possibilities can be constrained; Different and\ndisjunct trees of possibilities can be differentiated and selected; Things\ncan be described or controlled via the simplest language, code, logic,\nor information-theoretic structure; Operations or actions can be reduced\nto uniquely consecutive and finite decisions; Variables can be treated\nas constants, and constants as variables, at successive 'levels'; Those\ndegrees of freedom that enable the self- organization of a phenomenon or\nrealm can be increased or maximized; Potential or actual self-interaction,\nself-government, self-connection, autocorrelation, self-description, complexity,\nheterogeneity, proteanness, e/vc of a thing or phenomenon can be maximized;\nUse of resources can be optimized, or need for resources minimized; Redundancy\ncan be minimized, irredundancy maximized (and vice versa, paradoxically);\nEtc. In a simpler way, hierarchies or hierarchization can serve, i. a.: classification, description, definition, development, morphogenesis, evolution,\ntransformation, revolution, generalization, specialization, integration,\nisolation, amplification, analogization, distinguishing, specification,\nindividuation, universalization, organization, self- organization, control,\ngovernment, meetings of opposites, simplification, complexification, randomization,\nlocalization, innovation, distribution, centralization, decentralization,\nself-reference, operationalization or processualization, conservation,\nconceptualization, mechanization, simulation or modeling, proceduralization,\nstratification, cooperation, diversification, nomogenesis ( sensu either the discovery of laws, or their emergence and evolution), systemization,\ncorrection or adjustment, adaptation, stabilization, selection, search,\nchecking, supervision, coordination, communication, compilation, colligation,\nassimilation, convergence, divergence, 'parsing', counting, etc. More specifically, hierarchy or hierarchization serve or are exemplified\nin or by: e.g. memory (or memorization and recall), recognition, thought,\nbodily action, feeling, psychogenesis, social evolution, biosynthesis,\nthe evolution of life, cosmogony, parallel computation, industrialization,\nhuman government, military organization and strategy, nervous systems and\nartificial neural nets, computer hardware and software, evolution and classification\nof mathematical ideas, the process or result of painting, accounting, language\ntranslation, literary analysis (as of a novel), family relationships, the\nimmunal system or immunogenesis, ecological structure and processes, genomic\nstructure and function, ontogenesis, social stratification, structure and\ntraffic dynamics of a nation's road system, etc. Universal genera of hierarchies include hierarchies of : abilities,\nacts, alternatives, AMBIGUITIES, analogies, ANSWERS, ANTISYZYGIES, appearances,\nassumptions, bads, beauties, behaviors, beliefs, causes, CHAINS, CHANCES,\nCHANGES, CHAOSES, circumstances, clusters, coevolutions, COMBINATIONS,\nCOMPLEXITIES, CONCEPTS, conflicts, connections, CONSERVATIONS, contents,\ncontrols, CONVERGENCES, cooperations, COPROBABILITIES, corollaries, COURSES,\ncriterions, CRITICISMS, CYCLES, decisions, defects, definitions, descriptions,\ndifferences, discoveries, disequilibriums, disjunctions, DISTRIBUTIONS,\nDIVERGENCES, doctrines, domains, ecological things, ECONOMIC THINGS, EFFECTS,\nelements, emergents, ENVIRONMENTS, EQUALITIES, equilibriums, EQUIVALENCES,\nerrors, essentials, EVALUATIONS, events, examples, EXCELLENCES, excuses,\nexpectations, EXPERIENCES, EXPERIMENTS, EXTREMES, fields, FIRST PRINCIPLES,\nFLOWS, forms, functions, FUNDAMENTALS, FUTURES, FUTURIBLES, games, GENERALIZATIONS,\ngeneses, goals, goods, \"GROUPS\", hardest things, heuristics, HIGHER REALITIES,\nhistories, HYPOTHESES, IDENTITIES, IGNORANCES, ILLUSIONS, IMAGES, implications,\nIMPOSSIBILITIES, INDIVIDUALS (sic), INEQUALITIES, INFINITIES (and INFINITESIMALS),\nINFORMATION- THEORETIC THINGS AND ENTROPIES, instances, INSTRUMENTS, interdependences\nand reciprocities, interests, inventions, INVERSIONS, KNOWLEDGES, languages\nand linguistic things, LAWS, limitations, LOGICAL THINGS, MANIFOLDS, mathematical\nthings, MATRICES, MEASUREMENTS, MEASURES AND DIMENSIONS, mechanisms, METAPHORS,\nmethods, MINDS AND INTELLIGENCE, MODELS, MOTIONS, needs, NEGATIONS, NETWORKS\nNETWORKS OF CONSEQUENCES, NICHES, NONEXISTENCES, operations, OPPORTUNITIES,\nORDER TAXONS, ORIGINS, PARADIGMS, paradoxes, pathoses, PATHS, patterns,\nPERSPECTIVES, phenomenons, plans, possibilities, practices, PREDICTIONS,\npreparations, THE PRESENT, principles, PROBABILITIES, PROBLEMS, PROCESSES,\nproofs, PROPERTIES, psychological things, PURPOSES, quantities, QUESTIONS,\nREACTIONS, realms, RECURSIONS, relations, RELAXATIONS, representations,\nresources, responsibilities, RINGS, roles, rules, SELF- EFFECTS, SERIES,\nsets, SHORTCUTS, SIMPLICITIES AND SIMPLIFICATIONS, SIMULATIONS, SOLUTIONS,\nSPACES, speculations, STATES AND CONDITIONS, STORIES, strategies, SURPRISES,\nsystems, tactics, taxons, TECHNOLOGICAL THINGS, THALWEGS, THEORIES, things,\nTHOUGHTS, TOPOLOGICAL THINGS, transcendences, TRANSFORMATIONS, TREES, types,\nULTIMATES AND ENDS, ULTRAFUNDAMENTALS, uncertainties and doubts, unifications,\nthe 'universe', uses, VALUES, VERGENCES, virtuals, wants, wholes and GESTALTS,\nwisdoms, and WORK. Particularly or peculiarly interesting genera of hierarchies in this\nlist are in upper case. Many suggest fascinating problems, questions, and\npossibilities--which ideonomy will eventually address. Actually many things need to be learned about all of those genera. Thus\nwhat are all of their : exemplifications, specializations, causes, effects,\nroles, interrelations and interactions, laws, activities, structures, transformations,\nhistories, futures, evolutions and retrogressions, fine structure, etc? Hierarchy can be defined in many different ways. The dictionary distinguishes :\n(1) The arrangement of objects, elements, or values in a graduated series;\n(2) A series of objects, elements, or values so arranged; (3) In logic, a series the members of which are grouped in accordance with a principle\n(as of importance, perfection, or priority); (4) The stratification so\nachieved; specifically , a table of statistical correlations having\na constant proportional relationship and graded from high to low; (5) A\nbody of persons or things ranked in grades, orders, or classes, one above\nanother; a system or series of terms of successive rank, used in classification\n(as in biology). Additionally, of the adjective \"hierarchical\" it says: (6) Having the\npower to control; influential. A more ideonomic characterization of hierarchy: (7) At the top or upward\nis the thing or set of things that controls, dominates, influences, limits,\nexpresses, indicates, facilitates, e/vc the meaning, importance, behavior,\ndegrees of freedom, changes, possibilities, relationships, aspects, costs,\nneeds, outputs, e/vc of that below or dot-inward."
    }
  ]
}