{
  "url": "http://animal-rights.net/ar-views/crucial-points.php",
  "content_hash": "e909542a8b592867b879ddac94c943ab25f92fc590aee11ec05016baa0b1a4f8",
  "total_blocks": 53,
  "retained_blocks": 8,
  "ignored_blocks": 45,
  "blocks": [
    {
      "tag": "div",
      "text": "animal-rights.net work AR-Views AR-FAQ Contact"
    },
    {
      "tag": "h1",
      "text": "AR-Views"
    },
    {
      "tag": "div",
      "text": "td>\n\n<a href=\"http://animal-rights.net/\" target=\"_parent\">\n<img SRC=\"< ?php echo $image_path; ? >arnetbanner-klein.gif\" alt=\"animal-rights.net work\" BORDER=0 align=right>\n\n</td"
    },
    {
      "tag": "h1",
      "text": "AR-Views Crucial Points"
    },
    {
      "tag": "p",
      "text": "This essay is designed to be a resource for people willing to subscribe AR-Views , but who are not sure, if they\nfit the list pattern of an animal rights advocate. For basic questions about Animal Rights see the AR-FAQ (Animal Rights frequently asked questions) (to be completed)"
    },
    {
      "tag": "h3",
      "text": "the incremental movement toward abolition"
    },
    {
      "tag": "p",
      "text": "Here is some commentary on the question. It's an excerpt from 48 Rutgers Law\nReview 397, 448-468, ANIMAL RIGHTS AND ANIMAL WELFARE  Copyright 1995 by\nGary L. Francione. Portions of this article are taken from the book Rain\nWithout Thunder. Footnotes are omitted. CRITERION #1: An Incremental Change Must Constitute a Prohibition ...Thus the first criterion for any incremental change, beyond the\nincremental education of the public about the need to abolish\ninstitutionalized animal exploitation, is that it must prohibit some\nreasonably identifiable behavior. This prohibition must also correlate with\nthe ability of the animal to claim (through a representative) the protection\nof the right. The requirement that there be a prohibition, and not merely a regulation\nthat requires \"humane\" treatment, is sometimes phrased as requiring the\n\"abolition\" of a particular practice. Although this is a correct description\nof the matter, it can cause confusion by equating the abolition of\ninstitutionalized animal exploitation with incremental measures that, it is\nhoped, will lead to that abolition. On the first level of moral theory,\nanimal rights theory is clearly \"abolitionist\" in that its long-term goal is\nthe complete eradication of institutionalized animal exploitation. What we\nare examining now is whether there are adequate criteria that can be used to\nidentify incremental means to the long-term goal. To say that the incremental means must themselves be \"abolitionist\" is\ncorrect if the definition includes prohibitions against reasonably\nidentifiable conduct which, if engaged in, would constitute a failure to\nrespect a particular animal interest. But these incremental means are by\ndefinition not \"abolitionist\" in the sense that no one incremental\nprohibition will effect the long-term goal of ending animal slavery. In\norder to avoid confusion, it is better to reserve the use of \"abolition\" for\nthe long-term goal of rights theory, and \"prohibition\" as one criterion of\nincremental measures that seek to realize that long-term goal.... CRITERION #2: There Must Be a Prohibition of an Identifiable Activity That\nis Constitutive of the Exploitative Institution Consider the following proposals: Proposal 1: Reduce the number of hens confined in a battery cage (usually\nfloor space is a twelve inch square) from four hens to three hens. Proposal 2: Criminalize the use of animals in drug addiction experiments. These proposals cannot be distinguished using the first criterion alone,\nbecause, for the reasons stated above, both of these can be considered to\ninvolve prohibitions. Although Proposal 2 accords more with the notion of a\nprohibition, Proposal 1 can be conceptualized as a prohibition on keeping\nfour chickens in a cage. This is not to say, however, that there are no distinctions between Proposal\n1 and Proposal 2. With respect to the criminalization of the use of animals\nin a certain type of experiment, a particular activity that is constitutive\nof the general practice of vivisection has been stopped. ...[E]ven if the elimination of the battery cage and the substitution of the\nsmall hen house constitute a prohibition of an activity (i.e., the use of\nthe battery cage), that proposal implicates the problem that the change\nnevertheless continues to sanction the exploitation of the hens, albeit in a\ndifferent form. CRITERION #3: The Prohibition of a Constitutive Activity Must Recognize and\nRespect a Non-Institutional Animal Interest Although there is some controversy over whether animals can be said to have\n\"interests,\" as has been discussed elsewhere, for good reasons, most people,\nincluding those who exploit animals, regard nonhumans as having a wide range\nof interests. The law supposedly protects animal interests. The problem is\nthat for the most part, these interests are those that facilitate the\nexploitation of animals for a particular property use. For example, the law\nprotects the interests of animals used in experiments to the extent\nnecessary to ensure that the animal produces data of the quality considered\nacceptable by research scientists. Indeed, those who support the use of\nanimals in experiments assure the public that \"only those animals that are\ncared for properly will be good research subjects,\"  and that the federal\nAnimal Welfare Act and other sources of regulation provide for the requisite\ncare. In this sense, each form of institutionalized exploitation will have\nrules about the \"humane\" care of animals that are tailored to that\nparticular use of animal property and that reflect the particular concerns\nof that exploitative activity. To the extent that we seek the incremental eradication of the property\nstatus of animals, it is necessary that there is a corresponding recognition\nof the interests of animals in not being regarded as property, or, as Regan\nwould say, in not being treated exclusively as a means to human ends. ...To\neradicate the property status of animals, there must be a recognition of an\ninterest that is noninstitutional, or that is not simply an interest that\nensures the animal is used \"wisely\" in a context of exploitation. It is only\nthrough recognition of extra or noninstitutional interests that incremental\neradication of property status can be achieved; recognition of institutional\ninterests, such as the interest of a turkey destined for slaughter in being\nfed, merely reinforces and supports the property status of animals. ... CRITERION #4: Animal Interests Cannot Be \"Tradable\" ...If there is to be an incremental eradication of the property status of\nanimals, then there must be a recognition that animals have interests that\ngo beyond those interests that must be respected if we are to exploit\nanimals efficiently. And, following the second salient assumption of animal\nrights theory, these non-institutional interests cannot be tradable just\nbecause the aggregation of consequences indicates that the trade is\njustified to secure the human \"benefit.\" Indeed, animals are property\nprecisely because animals have no interests (beyond those that must be\nobserved if the animals are to serve their \"purpose\" as our property) that\nare safe from being balanced away as soon as some human \"benefit\" is\nidentified. In one sense, this criterion seeks to ensure that the incremental\neradication of property status is indeed an incremental \"assembly\" of\npersonhood status for nonhumans through the recognition of the inherent\nvalue of animals. At present, we do not recognize animals as having any\nvalue except for their value to us. For example, philosopher Joseph Raz\nclaims that although animals may have some value apart from their\ninstrumental use to people, animals cannot have inherent value because any\nvalue of the animal ultimately derives from the animal's contribution to the\nhappiness and well-being of some human or humans, who do have inherent\nvalue.  Raz's views are representative of many people's views. The fourth\ncriterion ensures that each incremental move provides for and protects some\nnotion of the inherent value of animals. In one sense, this criterion could be said to address the enforceability of\nprotection for recognized interests. One could say that under slavery as\npracticed in the United States, there were some laws that seemed to\nrecognize that slaves had interests other than ones directly related to\nkeeping a slave alive and fit for whatever purpose the slave was intended.\nFor the most part, however, these interests were ignored whenever they\nconflicted with the interests of the master whose property rights were held\nto outweigh the slave's interests. If animal interests are to be taken\nseriously, then, to the extent that the law regulates the use of animal\nproperty beyond what is necessary to exploit the animal property, that\nregulation must be held as eliminating the property right to the extent\nnecessary to protect the interest. Otherwise, the victory for animals will\nbe illusory; as soon as the rights of human property owners are triggered,\nthe animal interest will be ignored. Accordingly, the interest of the animal must be seen explicitly as an\ninterest that is to be protected as would a true \"right\" within the legal\nsystem. The interest would not be a \"right\" in the full sense in that since\nanimals would not yet possess the basic right not to be regarded as property\n(they would still be used for food and in experiments), they would have\nnonbasic rights that could be said to be building blocks of the basic right\nnot to be property. These nonbasic rights must, however, be treated as\nthough they were rights in the sense that they will be regarded as\nprotecting interests that are not subject to interest balancing. To protect animal interests in this manner would require a very deliberate\nand intentional recognition of a type of legal norm that our legal system\ndoes not yet recognize: a norm that functions like a true right in that it\nrecognizes an interest that cannot be balanced away, but that is held by a\nbeing who has not yet achieved the status of being a holder of the basic\nright not to be regarded exclusively as a means to an end. Indeed, every\ntime we recognize such a right, we move away from treating the being\nexclusively as a means to human ends; the problem is that the being's most\nfundamental interests in not being eaten or used in experiments or kept in a\nzoo have not yet been recognized. These incremental measures may be seen,\nhowever, as recognizing pieces of the basic right not to be regarded as\nproperty. So, although these interests represent nonbasic rights in one\nsense (the animal does not yet by definition have the basic right of not\nbeing property), the interests are more properly regarded as \"parts\" of the\nbasic right of animals not to be treated exclusively as means to human ends. ..In order to recognize that animals have such interests, it is necessary\nthat these interests be understood as trumping the interests of property\nowners. And in order to be effective, it would be necessary for the legal\nsystem to recognize that it is animals who hold this interest, and not their\nowners or government agencies, such as the USDA, which protects only\nthose animal interests that make animals property in the first place. It\nwould be necessary to recognize that animals (or, more properly\nspeaking, the guardians of animals) have standing to articulate these\ninterests against property owners, which would functionally require that\nsome sort of guardian be recognized. Because animals are regarded as property, and property is, by definition and\nseveral hundred years of accepted understanding, that which cannot have\nlegal relations with persons or other property, courts have developed\ndoctrines that preclude animals or their surrogates from articulating their\ninterests in courts of law and before regulatory agencies. This exclusion is\nbased on the supposed inability (in terms of the power of the court) to\nadjudicate claims made by property or those who purport to represent that\nproperty. So, if the ... non-institutional interests of animals are to be\nnon-tradable, then those interests, which must be seen as recognizing\n\"minitrumps\" of the property rights of animal owners, must be protected by\nthe legal system. This will require that animal interests have legal\nstanding and that some human actor (and this could be the police) have\nstanding to articulate those claims before the appropriate body. This is, of\ncourse, not a new idea. In Should Trees Have Standing? -- Toward Legal\nRights for Natural Objects, Christopher Stone argued that the inherent value\nof nonhumans could be recognized and protected by guardians just as are the\nrights (basic rights and nonbasic rights) of children or the mentally\ndisabled. CRITERION #5: The Prohibition Should Not Substitute an Alternative, and\nSupposedly More \"Humane\" Form of Exploitation This fifth criterion follows from both aspects of rights theory identified\nat the outset of this section: that rights theory requires eradication of\nthe property status of animals and that the right of animals not to be\nregarded as property cannot be compromised for consequential reasons. In\nmany respects, this fifth criterion is the most significant of the group\nbecause it often will be the most helpful in determining whether a proposed\nincremental measure is consistent with rights theory, although, like the\nother criteria, this one is not exact and will not provide an easy answer in\nall cases. But then, the idea is to try to make a morally informed decision,\nand not necessarily one that is always right. The fifth criterion holds that it is inconsistent with rights theory to\ntreat some animals exclusively as means to the ends of others, or as\nproperty, in order to secure some benefit that it is hoped will eventually\nsecure a higher moral status for other animals. This is a serious problem\nfor the new welfarist who purports to endorse the long-term goal of animal\nrights by using short-term welfarist reforms as a means to the end of\nabolition of institutionalized exploitation. The new welfarist disregards the inherent value of some animals in order to\nsecure a benefit for other animals. For example, the federal Animal Welfare\nAct provides that animals  may be used in biomedical experiments as long as\ntheir use is \"humane\" and they are not forced to suffer \"unnecessarily.\" The\nnew welfarists, who supported the 1985 amendments to the Act, believe that\nthe Act will itself reduce animal suffering, but more importantly, that laws\nlike the Act are \"stepping stones\" to the future recognition and respect of\nanimals other than the ones whose interests are now being ignored. This\nArticle argued earlier that there is simply no way to determine whether laws\nlike the Act actually reduce animal suffering, and that, given the\nstructural defects of welfare theory generally, such laws will generally be\nheld only to require that conduct that facilitates the use of the animal as\nproperty. Apart from the rather puzzling logic of how we get to a\nnon-property status of animals by persistent reinforcement of the property\nparadigm, there is something objectionable on a theoretical level when a\nrights advocate explicitly endorses the property status of animals as a way\nof eradicating that status on an incremental basis. ...So, for example, a complete prohibition on the use of chimpanzees in\ncertain procedures can reasonably be said to constitute the prohibition of a\nconstitutive activity, but to the extent that the advocate urges or accepts\nthat other animals, such as dogs, should be used instead...such a rule would\nviolate the fundamental proscription against speciesism. In order to understand more fully the point of this fifth criterion,\nconsider the following example: animal advocates propose to lobby for a law\nthe preamble of which explicitly recognizes that animals have moral\ninterests and the current configuration of battery hens per cage disrespects\nthose moral interests. The body of the law provides that in recognition of\nthe interests that hens have, no more than two shall be placed in battery\ncages, and these cages shall be enlarged to provide 196 inches of floorspace\nrather than 144 inches. The egg industry objects to this arrangement\nvehemently as it is \"unnecessary\" to maximize the value of animal property\nand will, in fact, impose a very significant cost on the ownership of animal\nproperty in this context. The law provides that this interest must be\nprotected irrespective of the economic consequences and contains penalties\nto ensure that the interests are not recognized subject to complete\ndefeasance through a claim of human \"benefit.\" The traditional welfarist would undoubtedly support this measure because it\nwill, in the welfarist's view, reduce animal suffering. The new welfarist,\nwho seeks as a long-term goal the abolition of animal exploitation, will\nalso undoubtedly support this, not only because it will supposedly reduce\nsuffering, but because it is a \"stepping stone\" or \"springboard\" into\nabolition at some future time. The new welfarist and the traditional\nwelfarist have the same view -- that the measure will reduce suffering --\nbut the new welfarist, unlike the traditional welfarist, believes that\nbecause the measure will reduce suffering, it will act as an incremental\nmeasure on the road to the long-term goal. The animal rights advocate first dismisses the view that avoiding pain and\nsuffering are the only interests that animals (human or nonhuman) have. If\npain and suffering were the only relevant moral interests, then what would\nprevent us from using small numbers of \"undesirable\" humans to eradicate\nlarge amounts of human pain and suffering? Obviously, although we all have\nstrong interests in avoiding pain and suffering, we do limit the ways in\nwhich pain and suffering can be alleviated so as to respect other\ninterests -- such as the rights of humans (and nonhumans) -- as well.\nSecond, the rights advocate dismisses the new welfarist view, also\narticulated by Singer, that a measure that reduces pain and suffering will\nlead to incremental achievement of the long-term goal of equal consideration\nfor equal interests (Singer) or the abolition of all institutionalized\nexploitation (Regan) simply because it supposedly reduces pain and\nsuffering. The rights advocate knows that some measures that supposedly\nreduce pain and suffering will do nothing more than assure that animals\nreceive protection that is consistent with their status as property, and\nthat facilitates their use as particular types of property. The rights advocate begins by asking whether the proposal contains a\nprohibition or a regulation, and concludes that the proposal prohibits\nkeeping more than two hens in the cage. She is unclear as to whether, even\nif the proposal is a prohibition, it constitutes a prohibition of an\nactivity that is constitutive of the overall form of exploitation. She errs\nin favor of regarding the measure as prohibiting a constitutive activity.\nShe is clear, however, that the proposal provides for the recognition of an\ninterest that is extra-institutional in that it provides for the recognition\nof an interest that is not tied to the property status of the hens. The\nproposal recognizes that the hens have inherent value beyond their status as\nproperty, which would justify only that level of regulation that facilitated\nanimal use. Moreover, the proposal provides that these interests cannot be\ntraded away and constitute proto-rights. The problem with the proposal is that it is, on its face, not only\nconsistent with the status of animals as property that, as a general matter,\nlacks inherent value, but does so in a way that explicitly trades away the\nbasic right of the hens not to be property in favor of a recognition of\nmoral status that falls short of recognition of the basic right, or the\ncomplete protection of some interest that the animal has in, for example,\nbodily movement. By agreeing to the two-hen arrangement, animal advocates\nare trying to achieve proto-rights while at the same time endorsing an\nalternative form of exploitation -- two hens in a cage -- that is supposedly\nmore \"humane.\" In the present case, it seems reasonable to say that the interest involved\nis the interest that the hens have -- all of them -- in not being in the\nbattery cage in the first place and in having freedom of movement that is\nappropriate to the species. To the extent that the proposal recognizes and\nrespects that interest, then the prohibition arguably does not substitute\nanother form of exploitation and is acceptable. That is, assume that a\nprohibition abolishes the battery cage entirely and replaces it with a\nrearing system that accommodates all of the hen's interests in freedom of\nmovement and thereby fully recognizes the interest of the hen's bodily\nintegrity. Such a state of affairs may be another way of saying that the\nprohibition ends a particular form of exploitation that has violated a\nparticular non-institutional, non-tradable interest that we have now decided\nto respect. But this sort of substitution differs considerably from merely\nremoving two of the hens from the cage in that although we have not yet\nabolished the institutionalized exploitation, the substitution eliminates\nthe exploitation involved in the confinement system through a full\nrecognition of the interest of the hens in their freedom of movement. In any event, any substitution of exploitation raises serious questions for\nthe rights advocate. If the incremental eradication of the property status\nof animals is going to be consistent with rights theory, it is important\nthat proposed measures not substitute one form of exploitation for another,\nsupposedly more \"humane\" form of exploitation. Oftentimes, the alternative\nform of exploitation will provide in general terms for \"humane\" treatment,\nwhich then feeds the whole matter right back through the mechanisms of legal\nwelfarism which, as argued before, are structurally defective and\nsystematically devalue animal interests. But even if the substitute form of\nexploitation is more definite (i.e., there shall be no more than two birds\nper cage), and even if the proposal recognizes that the animals have some\ninherent value that justifies the recognition of a non-institutional,\nnon-tradable interest, that recognition comes at the expense of endorsing\nanother form of exploitation that rests on the legitimacy of the status of\nanimals as property. This sacrifices the moral right of the animal not to be\nproperty for a proto-right that is designed to effect the incremental\neradication of property status. The substitution of exploitation raises\nissues of moral conflict with rights theory, and incoherence in light of the\nfundamental assumptions of that theory. This discussion does serve, however, to demonstrate that as a practical\nmatter, certain campaigns will be difficult for animal rights advocates to\npursue if they agree with this fifth criterion. It seems that the rights\nadvocate really has no choice but to condemn any form of substitute\nexploitation, unless that alternative arrangement completely eradicates an\nactivity constitutive of animal exploitation through the full recognition of\nrelevant animal interests. The animal advocate must not herself suggest an\nalternative, and must not agree to any alternative offered by the exploiter.\nTo do either would involve the rights advocate sacrificing the basic right\nof animals not to be property in order to secure a less-than-basic\nproto-right that, while it does recognize and respect that animals have\nperson-like interests that transcend their status as property, is achieved\nat the cost of reinforcing the notion that a \"better\" system of animal\nslavery is acceptable. These considerations would militate in favor of\nconducting the sort of campaign that may not succeed (at least initially),\nbut that will have a potentially powerful effect on educating members of the\npublic about animal exploitation. And in many respects, such education,\nwhether sought directly in the classroom or as part of a militant campaign\nsuch as one that supports a law to demand the end of the egg battery and\nthat urges no substitute form of exploitation (rather than a reactionary and\nconservative welfarist campaign to make the matters more \"humane\" for the\nhens) is probably the best thing that the animal rights advocate can do at\nthis stage of history in any event. <h3>Animal Rights - not Animal Welfare</h3> <h4>\nAn introduction to the trojan horse phenomenon in the AR movememnt.\n</h4> <H3>\nAnimal rights vs. Animal Welfare - An introduction\nto the Controversy</H3>\n\n<H4>\n<I>by Dietrich von Haugwitz</I></H4>\nMany people who have only recently joined the Animal Rights/Animal Protection\nMovement are puzzled why one issue seems to stir up a never-ending debate&nbsp;\nwithin the movement.&nbsp; The following is designed to acquaint the reader\nwith the reasons why \"animal rights\" and \"animal welfare\" are two very\ndifferent concepts, even though they both concern the well being of animals.\n<BR>&nbsp;\n<BR>In most counties throughout the U.S. we find organizations with names\nlike Society for the Prevention of Cruelty to Animals (SPCA), Animal Protection\nSociety (APS) and Humane Society (HS).\n<BR>&nbsp;\n<BR>These should be viewed as \"animal welfare\" organizations.&nbsp; As\ntheir names indicate, they are concerned with cruelty, with protection,\nwith humane treatment.&nbsp; And typically, their concern is for domestic\nanimals:\n<BR>chiefly dogs and cats, but also horses, goats, rabbits, etc.\n\n<P>The welfarist accepts certain traditional attitudes toward animals:\nThese are our animals; we own them, and we should be responsible owners.&nbsp;\nLike a good shepherd, we should look after those in our charge; protect\nthem; treat them humanely.\n<BR>&nbsp;\n<BR>But for the welfarist there is a fundamental difference between animals\nand people.&nbsp; People have rights, but with each such right come some\nobligations.&nbsp; (I have a right to be protected from theft; but in turn\nI have an obligation not to steal.)&nbsp; Animals can't reason; they can't\nunderstand obligations, and so it would be absurd to give them rights.\n<BR>&nbsp;\n<BR>(Note that animal protection laws do NOT create legal rights for animals.&nbsp;\nIn the eyes of the law, animals are not \"legal persons\", they are property.&nbsp;\nIf I kill your dog, in the eyes of the law I have harmed YOU, not your\ndog.)\n<BR>&nbsp;\n<BR>Animal welfare people accept this property status of animals.&nbsp;\nStill, they differ widely on how much welfare animals are entitled to.&nbsp;\nEven the cattle rancher, circus owner, or vivisector claims to be greatly\nconcerned with the welfare of his or her animals: \"We avoid all unnecessary\npain and suffering; we observe the Humane Slaughter Act and the Animal\nWelfare Act; and we truly care for our animals - or else they wouldn't\nyield good meat, perform well in the circus, or yield good results in research.\"&nbsp;\nWhereas animal-loving people in humane societies go much farther: they\nsee lots of unnecessary suffering in all those industries: Those laying\nhens should be free running; those circus elephants are hurt during training;\nand using those lab rabbits is unnecessary because safe cosmetics (unlike\nmedical discoveries) can be obtained without animals.\n<BR>&nbsp;\n<BR>For welfarists the bottom line is: We are opposed to cruelty;&nbsp;\nwe owe the animals kindness and compassion.\n<BR>&nbsp;\n<BR>How does that differ from the animal rights view?&nbsp; The difference\nis fundamental.&nbsp; AR says: Kindness and compassion?&nbsp; That's all\nvery nice, but it misses the point.&nbsp; What we owe the animals is something\nquite different:&nbsp; We owe them RESPECT and JUSTICE !&nbsp; (Put yourself\nback into, say, the year 1830.&nbsp; There were the welfarist: We must\ntreat our slaves with great kindness and compassion.&nbsp; Nonsense!, said\nthe Abolitionists;\n<BR>we must liberate them!&nbsp; Even if their lives might sometimes become\neven harder, we must recognize that the entire institution is utterly immoral\nand must be abolished.)\n<BR>&nbsp;\n<BR>In this short overview, we cannot get into the philosophical difference\nbetween the utilitarian AR view (Singer) and the strict rights view (Regan,\nRollin, ...).&nbsp; But both theories arrive essentially at the same bottom\nline:&nbsp; The traditional line drawn between one species (human) and\nall other species is irrational when it comes to morals.&nbsp; Species\nmembership is not morally relevant.&nbsp; We must give equal consideration\nto the interests of all sentient animals, regardless of species.&nbsp;\nNot to do so rests on nothing more than tradition.&nbsp; Animal rights\ntheorists\n<BR>have advanced arguments that are very hard to refute; they show why\nall differences between humans and non-humans - great as they may be! -\nare morally irrelevant.\n<BR>&nbsp;\n<BR>Therefore, animals must not be viewed as ours.&nbsp; They do not exist\nfor us. They are not our commodities, harvests, stock, game, objects of\namusement or education, specimens, or throw-away lab tools like rubber\n<BR>gloves or test tubes.&nbsp; To regard them as our property, and to\nencode this property status in our laws, is a case of \"might makes right\"\n-- no more.&nbsp; It cannot be morally justified.\n<BR>&nbsp;\n<BR>As Regan points out, if humans have \"independent value\" (and most of\nus accept that), then so do chimpanzees.&nbsp; To deny this would be irrational.\nIf something has \"instrumental value\", it may be used as a tool, for our\nbenefit.&nbsp; But individuals who have independent value must not be used\nas if they&nbsp; were instruments.&nbsp; (Hence the abolition of human\nslavery.)&nbsp; We must respect their rights not to be enslaved for our\nbenefit.\n<BR>&nbsp;\n<BR>So when we say that animals have some very basic rights (such as life,\nliberty, and the pursuit of their happiness), we are talking of MORAL rights.&nbsp;\nBefore each of our existing legal rights were established, a\n<BR>majority of people had felt strongly that a moral right existed. Campaigners\nworked for the rights of racial minorities, of women, of children.&nbsp;\nAnimal rights campaigners now work for translating the moral\n<BR>rights of animals into legal rights.\n\n<P>So in the AR view, all institutions which enslave animals must be abolished!&nbsp;&nbsp;\nThat's an incredibly radical idea. It differs fundamentally from any version\nof the animal welfare or protection view.&nbsp; While animal welfare people\nwork for improvements of the conditions in which animals are kept, animal\nrights people challenge the right of owners to keep such animals.&nbsp;\nOne AR motto: We do not demand larger and cleaner cages; we demand empty\ncages!\n<BR>&nbsp;\n<BR>How to achieve this abolition?&nbsp; That's where there are very serious\ndifferences with in the AR community, and they are appropriate topics for\ninternal debates.&nbsp; Should the emphasis be on legislative actions?\nOn education? On confrontations and \"direct action\"? Should we support\nthe Animal Liberation Front (ALF) ?\n<BR>&nbsp;\n<BR>But another quarrel between two factions in the AR movement concerns\nthis:&nbsp; Should we work with welfare people on reforms?&nbsp; Some say:\nby all means!&nbsp; Let's strengthen the Animal Welfare Act;&nbsp; let's\nmake the animal\n<BR>care committees' minutes public; let's support the downers bill (collapsed\nanimals should not be dragged to slaughter); let's get rid of face branding\ncattle; etc.&nbsp; NO!, says the other side.&nbsp; Reforms only legitimate\nthe exploiting industries; abolition will be much harder if the worst excesses\nare legally removed.\n<BR>&nbsp;\n<BR>To sum up:&nbsp; Each of us should search his or her soul as to what\nthe ultimate goal of our activities should be.&nbsp; Undoubtedly many animal\nrightists will often work together with animal welfare people and with\nenvironmental groups on certain efforts.&nbsp; But we should give a certain\nstructure to our own beliefs and convictions.&nbsp; Do we just want to\nhelp animals here and there (perhaps because we are \"animal lovers\")? Obviously\nthere is nothing wrong with that.&nbsp; But if we want to commit ourselves\nto this hard work, we will have to make up our minds about our ultimate\nintent:&nbsp; reform or abolition? END OF PAGE CONTENT"
    },
    {
      "tag": "div",
      "text": "Tierrechte Netzwerk (german) Animal_Net The international animal news exchange World Animal Net Directory World Animal Net Directory animal-rights.de (german) GRASP TM Great Ape Standing and Personhood THE UNDERWRITERS"
    }
  ]
}