{
  "url": "http://jmenad.typepad.com/lapdwife/",
  "file_number": "90",
  "content_hash": "7c23f390e918767cba2215f684fb7b4428da44cb66e901fabd2c03142f1ae657",
  "total_blocks": 224,
  "retained_blocks": 61,
  "ignored_blocks": 163,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\"\n\t\"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" banner"
    },
    {
      "tag": "h1",
      "text": "LAPD Wife"
    },
    {
      "tag": "h2",
      "text": "All About My Life Married to the Badge"
    },
    {
      "tag": "div",
      "text": "sidebar1"
    },
    {
      "tag": "h2",
      "text": "Recent Posts"
    },
    {
      "tag": "div",
      "text": "LAPD Wife - The Newsletter Not a Goodbye"
    },
    {
      "tag": "h2",
      "text": "LAPD Wife's Life"
    },
    {
      "tag": "div",
      "text": "Photos taken by Renee - a sampling of LAPD Wife's Life"
    },
    {
      "tag": "h2",
      "text": "Recent Comments"
    },
    {
      "tag": "div",
      "text": "SES on Merry Christmas! Cliff on Not a Goodbye MaryC on Not a Goodbye Andrew Baber on The Hungry Detective SES on Not a Goodbye DEA on Not a Goodbye GIVE ME A BREAK on Not a Goodbye just my thoughts on Not a Goodbye just my thoughts on Not a Goodbye Line Reserve Guy on Not a Goodbye"
    },
    {
      "tag": "h2",
      "text": "Police Wives Unite! Categories"
    },
    {
      "tag": "div",
      "text": "Beyond the LAPD Book Reviews Capers Cool Stuff to Buy Dating Everyday Life Family / Kids Guest Posts Guns Humor L.A. Insight Let's Chat Marriage Media On the Job \"Police-Chic\" Politics Stress Thin Blue Line Columns Worthy Causes"
    },
    {
      "tag": "h2",
      "text": "Archives"
    },
    {
      "tag": "div",
      "text": "November 2006 October 2006 September 2006 August 2006 July 2006 June 2006 May 2006 April 2006 March 2006 February 2006"
    },
    {
      "tag": "h2",
      "text": "Random Stuff"
    },
    {
      "tag": "div",
      "text": "Blogarama WEBBOT bot=\"Script\" startspan PREVIEW=\"Site Meter\" Copyright (c)2005 Site Meter WEBBOT bot=\"Script\" Endspan Who links to me?"
    },
    {
      "tag": "h2",
      "text": "December 2006"
    },
    {
      "tag": "div",
      "text": "Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 powered by Powered by TypePad Member since 06/2004 Subscribe to this blog's feed entries"
    },
    {
      "tag": "h3",
      "text": "Merry Christmas!"
    },
    {
      "tag": "p",
      "text": "The first year that Officer Jake was on the LAPD he was the new guy in town - literally. He'd moved here from out of state and only had a distant cousin who lived way up in Ventura. When Christmas rolled around, he was still a fresh boot - only a few months out of the Academy and working weekends, holidays, etc. And so he spent his first Christmas in L.A. on the job - out all day patrolling in a black and white. He had a few cookies at the station, I'm sure. But after work he went home to his bachelor apartment and had a tradition holiday meal of .... Pollo Loco. When he first told me this story I thought I was going to cry. I just wanted to hug him like he was a child and tell him he'd never be alone or eating bad chicken on Christmas again. But this is pretty common for a lot of law enforcement officers everywhere. Crime doesn't take holidays or weekends off. And neither do police officers. So here's to the rookies from out of town working on the holidays - I hope you are greeted by well-wishers, lots of treats and invited to someone's home for a proper family meal. I instructed Jake to ask around the station and see if there are any young men or women who are in a similar situation as the young Officer Jake found himself that Christmas so long ago. He has standing orders from this watch commander (me!) to invite them over. And I'm not forgetting the seasoned officers still working the holidays. Thanks for hanging in there and doing the good job that you do. You are appreciated! And here's to the wives and families, missing their officers but waiting faithfully for them to get back home after their shift and share in the festivities. In the past we've celebrated on alternate days or waited to open presents til Daddy got home. It's important to find a rhythm in your family to dealing with the missed holidays and weekend time off. And here's to my readers. You've made my Christmas wonderful by being so supportive of me here. Thanks! Merry Christmas and Happy Holidays everyone! (This is a reprint from last year)"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "December 24, 2005 in Everyday Life , Family / Kids , Marriage | Permalink | Comments (7) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "LAPD Wife - The Newsletter"
    },
    {
      "tag": "p",
      "text": "Due to high demand, I've decided to create \"LAPD Wife - The Newsletter\" to hold you all over while I take a couple months to reorganize (see the post \"Not a Goodbye, below). This will probably be a once-a-month deal, but hey, you know I'll make it worth your while. So email me with your email address and I'll add you to my \"subscription\" list. The price is right... free! And I promise to keep your email address confidential and never, ever use it for my own evil purposes. I'm going to turn off comments here, because I don't want you to mistakenly put your email on this post for all the world to see. Again, send me your email address via my email and I'll make sure you're on the list. How very \"L.A!\" (To clarify, this is an e-newsletter only. Don't send me your postal address. Email addresses only. thanks!)"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "November 28, 2006 in \"Police-Chic\" , Dating , Everyday Life , Family / Kids , Humor , Marriage , Media , On the Job , Stress , Worthy Causes | Permalink | Comments (0) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "Not a Goodbye"
    },
    {
      "tag": "p",
      "text": "Over two years ago, in June of 2004, \"LAPD Wife\" was born. I've nurtured this site with news and articles of police family life and shared personal stories of the ups, downs and crazy turns in my life married to Officer Jake, an LAPD narcotics officer. I've made so many new friends and met many interesting, fascinating people online. I feel like my original goal of using this site to reach out to other wives and family members of law enforcement has been reached and in fact, has grown beyond my wildest expectations. I've had nearly 300,000 hits in this short life and maintained a daily average of nearly 600. And so it saddens me to do this, but I'm now at a point where I need to take a break, step away from the keyboard and rejuvenate. My life, always busy, has reached new pinnacles of craziness both professionally and personally. Don't worry, all is well with me, I'm just exploring new ideas and trying out new avenues for my creative self. I've tried to put up this post often during the last couple of weeks, but it seems like every day as my finger hovered over the Save button, I'd get another e-mail from an leo wife who had \"just found my site\" and \"was so excited to find someone writing about our lives who really understands\" ...and I just couldn't do it. It still kills me to step back like this, but I'm burning out and not doing you all much good in this stage. I'm keeping the rights to this url, www.lapdwife.com , and I'd encourage you to check back every month or so to see what I'm up to. I also will still have my e-mail address , so feel free to drop me a line once in awhile at renee@lapdwife.com . I have a lot of ideas circling in my very crowded head that I'm sure many of you will love and still will cater to the leo family life theme I've always followed. Just will take a little time, a lot of effort and great amounts of love to bring them to life. To all of you who have been my loyal readers, my ardent commentors, my site watchdogs and most of all, my friends - thank you. This site has been a labor of love for me and I feel well rewarded from the contacts I've made and the community I've felt among us all. And the biggest thanks of all goes to Office Jake, without which there would be no \"LAPD Wife.\" Thanks - and look for me in the New Year - I'll see you soon."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "November 27, 2006 in Everyday Life | Permalink | Comments (36) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "Happy 231st Birthday Marines!"
    },
    {
      "tag": "p",
      "text": "Every year GoDaddy, a service I use for maintaining this site and others I administer, puts up a a special salute to the men and women of the United States Marine Corps. This year Gunnery Sgt. R. Lee Ermey of Full Metal Jacket fame collaborates with them. I know that a lot of Marine wives and family members also read my site, so I'm putting up the link for them here. Even if you're not a part of the Marine Corps, this is a worthy watch. 2006 Tribute If you really liked that one, you can see the past two years' tribute also: 2005 Tribute 2004 Tribute"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "November 10, 2006 in Beyond the LAPD | Permalink | Comments (4) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "Back at the Farm"
    },
    {
      "tag": "p",
      "text": "Meanwhile, back at the farm, I've been replaced. My parents have 2 new horses and they are the apples of their eyes. I have a feeling that my old room is probably filled with saddle and tack now. And there will be Christmas stockings hung on the fireplace with their names - Richard and Rockabye. (Just kidding, Mom!) I apologize for how pixelated these photos are and will try to get better ones uploaded soon. And no, they weren't taken with my fancy new camera . Click on my photo album, on the left, to see my photography work."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "November 06, 2006 in Everyday Life | Permalink | Comments (4) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "Facing the Fire"
    },
    {
      "tag": "p",
      "text": "I’ve been caught up in the drama and tragedy of the Esperanza fire these last couple of days. Four firemen dead, another critical with burns on near 90 percent of his body. The story, full of heroism and horror, has caught the attention of everyone. Stories are continually updating, but I was especially drawn in by the photo gallery at the LA Daily News . The pictures there of fireman on the front line are so intense I could almost imagine the feel of the heat and wind there. I was with a colleague at work when the news of the deaths of the firemen broke. She knows I am married to a police officer and asked if I took this news a bit more personally. I did, I do, I always will. I think that wives of police officers and wives of firemen, while having their small differences, will always have much in common. Our husbands face great dangers at work - I just think that the danger is spread about differently. While police officers get a general even dose of it throughout their jobs, firemen face danger in extreme doses in between calm spaces. It all evens out in the end, I'm sure. And so my heart goes out to the wives and family members of these firemen who perished - and all firemen who are still working the lines out there. It's no fun to sit back here, watch the news coverage, and try to see if we can recognize our husbands somewhere in the background of the various news footage. And yet we remain proud of them and the work they do. And breathe easier every night they return home safely."
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "October 30, 2006 in Marriage , Media , On the Job , Stress | Permalink | Comments (1) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "LAPD Officer Landon Dorris"
    },
    {
      "tag": "p",
      "text": "Stereotypes make believe that families of police officers worry most about high-drama trouble like mafia hits, vengeful drug lords and Fatal Attraction groupies. But in reality, the worries we carry for our loved ones are more common and yet often more deadly. My husband has often said that domestic violence situations hold more deadly potential for law enforcement that other seemingly dramatic situations. Traffic accidents are another situation that routinely bring harm and, sadly, death to officers. As in the case of Officer Landon Dorris, who was killed during a routine traffic collision investigation yesterday in the NorthEast division. Flags are flying at half-mast today at stations around L.A. May we all take a moment today to think of him and his family left behind and appreciate his brothers and sisters in blue who carry on. LAPD Online link LAPD Blog Article"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "October 23, 2006 in L.A. Insight , Media , On the Job | Permalink | Comments (3) | TrackBack (0)"
    },
    {
      "tag": "h3",
      "text": "The Hungry Detective"
    },
    {
      "tag": "p",
      "text": "I was watching the Food Network this weekend and saw a new series was debuting called “ The Hungry Detective .” Hmm, sounded interesting, so I hit the menu guide to see a description. It read something like this: “Los Angeles detective travels the nation and brings us tips for the best food etc...” Ok, this made me pop up and go to the computer, yelling for Jake as I booted it up: “Oh, honey, you’ve just gotta see this!” On the Food Network site, I found a much better description and Jake was looking over my shoulder to see if it was someone he knows (and could totally give ‘em hell about at work). No such luck. Turns out, if I’m reading their intro right, Detective Chris Cognac works for a South Bay police department. Most of the info about his police department is vague, but I’m guessing it’s Hawthorne from one of the photo links on a separate page I found when I googled him. Funny that the Food Network is pushing the whole “Los Angeles detective” bit. It makes it seem like they want people to think LAPD. I did, anyway, at first. Guess it sounds sexier, as well as more recognizable, than South Bay. Here’s some of the web site content – they use the police angle a little cheesily, but hey, it’s a theme and if anyone can understand a theme – it’s me! : “His name is Chris Cognac, and he works two beats: he's a true-blue police detective in Los Angeles AND he's the food critic for his local paper, guiding readers to hidden gem restaurants in his hometown. Now, Chris is leaving his jurisdiction for cities across America, on a mission to uncover the best off-the-beaten-path restaurants in each place that only the locals know. Using all of his detective skills and trusty informants along the way, Chris will teach viewers how to uncover clues to hidden gem eateries in any town.” I haven’t watched the show yet, though I did watch a few of the online clips previewing segments and interviewing Detective Cognac. Looks like it could be fun. Let me know if anyone else out there has caught it. And as they say… who knows local food better than the local police? I totally agree!"
    },
    {
      "tag": "div",
      "text": "technorati tags"
    },
    {
      "tag": "p",
      "text": "October 21, 2006 in Media | Permalink | Comments (5) | TrackBack (0)"
    },
    {
      "tag": "div",
      "text": "sidebar2"
    },
    {
      "tag": "h2",
      "text": "Me & My Blog"
    },
    {
      "tag": "div",
      "text": "Who is \"LAPD Wife\" and what is this site about? Want to be a guest writer here?"
    },
    {
      "tag": "h2",
      "text": "Products I'd Recommend"
    },
    {
      "tag": "div",
      "text": "Click here to purchase these products at Amazon.com. \r\nSelect \"Book Reviews\" or \"Cool Stuff to Buy\" in the categories section on the left to read all about them. Canon Digital Rebel XT 8MP Digital SLR Camera with EF-S 18-55mm f3.5-5.6 Lens (Black) Garlic and Sapphires : The Secret Life of a Critic in Disguise How to Be the Funniest Kid in the Whole Wide World (or Just in Your Class) Everyday Italian: 125 Simple and Delicious Recipes I Love a Cop: What Police Families Need to Know"
    },
    {
      "tag": "h2",
      "text": "Law Enforcement"
    },
    {
      "tag": "div",
      "text": "Cop the Truth Jack Dunphy L.A. Police Revolver and Athletic Club LAPD Officer in South Central LAPD Official Blog LAPD Wives Association Law and Disorder Life of a Cop in a Cop's World Los Angeles Police Department Los Angeles Police Protective League Matt's Space Negative, Ghostrider Officer Down Memorial Flag Officer Down Memorial Site Officer.com"
    },
    {
      "tag": "h2",
      "text": "Sites I Enjoy"
    },
    {
      "tag": "div",
      "text": "Black Rat Dad Talk Killired LA Blogs LA Observed LA Voice Perpetually Pregnant No More The Back Page West L.A. Online Add me to your TypePad People list"
    },
    {
      "tag": "h2",
      "text": "Legal Notice"
    },
    {
      "tag": "div",
      "text": "Copyright 2006 by LAPD Wife Copyright 2006 by Renee - LAPD Wife. All content on this site owned by me. To republish any material, please e-mail me and ask. This is my blood, sweat and tears - and my very own original stuff. Please don't use it without asking me. Thanks."
    }
  ]
}