{
  "url": "http://kidshealth.org/kid/feeling/emotion/anger.html",
  "content_hash": "2468473a26534e17700485539c9e5778b371c4d20e7bc3225a88585ec3bad367",
  "total_blocks": 84,
  "retained_blocks": 17,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" <body onLoad=\"audioOn=true; MM_preloadImages('/image/kidnav/dealing_with_feelings2.gif','/image/kidnav/staying_healthy2.gif','/image/kidnav/recipes2.gif','/image/kidnav/everyday_illnesses2.gif','/image/kidnav/my_body2.gif','/image/kidnav/growing_up2.gif','/image/kidnav/kids_talk2.gif','/image/kidnav/people_places2.gif','/image/kidnav/watch_out2.gif','/image/kidnav/game_closet2.gif','/image/kidnav/health_problems2.gif','/image/kidnav/word2.gif','/image/kidnav/grownups_2.gif','/image/kidnav/espanol_2.gif')\"> THE MAIN MENU FOR THE CATAGORIES GOES HERE <a href=\"/misc/popup/K_squarebanner.html\" target=_blank><img src=\"/images/kidnav/K_squarebanner.gif\" width=\"153\" height=\"126\" border=\"0\" ></a> <object classid=\"clsid:D27CDB6E-AE6D-11cf-96B8-444553540000\" codebase=\"http://download.macromedia.com/pub/shockwave/cabs/flash/swflash.cab#version=5,0,0,0\" width=\"153\" height=\"126\">\n\t\t  <param name=movie value=\"/updates/K_squarebanner.swf\">\n\t\t  <param name=quality value=high>\n\t\t  <embed src=\"/updates/K_squarebanner.swf\" quality=high pluginspage=\"http://www.macromedia.com/shockwave/download/index.cgi?P1_Prod_Version=ShockwaveFlash\" type=\"application/x-shockwave-flash\" width=\"153\" height=\"126\"></embed>\n\t</object> KidsHealth > Kids > Dealing With Feelings > My Emotions & Behaviors >\n\t\tDealing With Anger"
    },
    {
      "tag": "p",
      "text": "Have you ever lost your temper? Did you yell and scream or want to hit someone? Maybe your little brother got into your room and played with your toys without permission. Or maybe your teacher gave you too much homework . Or maybe a friend borrowed your favorite video game and then broke it. That made you angry! Everyone gets angry. Maybe you \"lose your cool\" or \"hit the roof.\" Anger can even be a good thing. When kids are treated unfairly, anger can help them stand up for themselves. The hard part is learning what to do with these strong feelings."
    },
    {
      "tag": "h3",
      "text": "What Is Anger?"
    },
    {
      "tag": "p",
      "text": "You have lots of emotions. At different times, you may be happy, sad , or jealous. Anger is just another way we feel. It's perfectly OK to be angry at times — in fact, it's important to get angry sometimes. But anger must be released in the right way. Otherwise you'll be like a pot of boiling water with the lid left on. If the steam doesn't escape, the water will finally boil over and blow its top! When that happens to you, it's no fun for anyone."
    },
    {
      "tag": "h3",
      "text": "What Makes You Angry?"
    },
    {
      "tag": "p",
      "text": "Many things may make kids angry. You may get angry when something doesn't go your way. Maybe you get mad at yourself when you don't understand your homework or when your team loses an important game. When you have a hard time reaching a goal you might become frustrated. That frustration can lead to anger. Kids who tease you or call you names can make you angry. Or you might get angry with your parents if you think one of their rules is unfair. Worst of all is when you are blamed for something you didn't do. But it's also possible to get angry and not even know why."
    },
    {
      "tag": "h3",
      "text": "How Can I Tell When I'm Angry?"
    },
    {
      "tag": "p",
      "text": "There are different ways people feel anger. Usually your body will tell you when you are angry. Are you breathing faster? Is your face bright red? Are your muscles tense and your fists clenched tight? Do you want to break something or hit someone? Anger can make you yell or scream at those around you, even people you like or love. Some people keep their anger buried deep inside. If you do this, you might get a headache or your stomach might start to hurt. You may just feel crummy about yourself or start to cry. It's not good to hide your anger, so you should find a way to let it out without hurting yourself or others."
    },
    {
      "tag": "h3",
      "text": "How Can I Tell When Someone Else Is Angry?"
    },
    {
      "tag": "p",
      "text": "When someone you know is angry, he or she may stomp away or stop talking to you. He or she may become quiet and withdrawn. Some people scream and try to hit or harm anyone close by. If a person is this angry, you should get away as soon as possible. Once you are away from the angry person, stop and think. Try to figure out what made that person so angry. Can you make the situation better? How does the other person feel? When the other person has cooled down, try to talk about the problem. Listen to what he or she has to say."
    },
    {
      "tag": "h3",
      "text": "What Should I Do If I Get Angry?"
    },
    {
      "tag": "p",
      "text": "Don't lose control if you get angry. Taking it out on others never solves anything. Instead, admit to yourself that you are angry and try to figure out why. What can you do to keep the situation from happening again? If your little sister gets a toy and you don't, it's not OK to break that toy. Maybe you can ask her to share it with you. Or if your science homework is too hard, don't rip up your notebook. Ask your teacher or a parent for help instead. It helps to talk about your anger with an adult, such as a parent, teacher, or relative. Once you talk about anger, those bad feelings usually start to go away."
    },
    {
      "tag": "h3",
      "text": "Anger Busters"
    },
    {
      "tag": "p",
      "text": "Here are some other things you can do when you start to feel angry:"
    },
    {
      "tag": "div",
      "text": "talk to a friend you can trust count to 10 get or give a hug do jumping jacks or another exercise draw a picture of your anger play a video game run around the outside of the house five times as fast as you can sing along with the stereo pull weeds in the garden think good thoughts (maybe about a fun vacation or your favorite sport) take a bike ride or go in-line skating"
    },
    {
      "tag": "p",
      "text": "Never getting angry is impossible. Instead, remember that how you act when you're angry can make the situation better or worse. Don't let anger control you. Take charge of it! Reviewed by: W. Douglas Tynan, PhD Date reviewed: July 2004 Originally reviewed by: Steven Dowshen, MD, and Edward Woomer, LCSW"
    },
    {
      "tag": "div",
      "text": "Printer -friendly version Email this article to a friend Send email to us About Us / Contact Us / Partners / Editorial Policy / Privacy \n        Policy & Terms of Use Note: All information on KidsHealth is for educational purposes only. For specific medical advice, diagnoses, and treatment, consult your doctor. ©1995-2006 The Nemours Foundation.  All rights reserved."
    }
  ]
}