{
  "url": "http://lists.debian.org/debian-consultants/2001/12/msg00000.html",
  "file_number": "99",
  "content_hash": "b57beddefa40c5b875b3a5ff7f66a21665514cb892ce5ad87f9e20fff3425c20",
  "total_blocks": 56,
  "retained_blocks": 15,
  "ignored_blocks": 41,
  "blocks": [
    {
      "tag": "div",
      "text": "X-Body-Begin X-User-Header X-User-Header-End X-TopPNI [Date Prev][ Date Next ]\n[Thread Prev][ Thread Next ]\n[ Date Index ]\n[ Thread Index ] X-TopPNI-End X-MsgBody X-Subject-Header-Begin"
    },
    {
      "tag": "h1",
      "text": "Fwd: [reiserfs-list] Viability of Open Source Business Models"
    },
    {
      "tag": "div",
      "text": "X-Subject-Header-End X-Head-of-Message To : Debian Consultants < debian-consultants@lists.debian.org > Subject : Fwd: [reiserfs-list] Viability of Open Source Business Models From : Russell Coker < russell@coker.com.au > Date : Thu, 6 Dec 2001 02:32:27 +0100 Message-id : < 20011206013228.3C46C331FFD@lyta.coker.com.au > Reply-to : Russell Coker < russell@coker.com.au > X-Head-of-Message-End X-Head-Body-Sep-Begin X-Head-Body-Sep-End X-Body-of-Message"
    },
    {
      "tag": "pre",
      "text": "Is there any chance of us getting something like this going to support our Debian \ndevelopment efforts?\n\nWhat do you think of Hans' ideas?\n\n----------  Forwarded Message  ----------\n\nSubject: [reiserfs-list] Viability of Open Source Business Models Tried Once Again:-)\nDate: Tue, 04 Dec 2001 19:05:11 +0300\nFrom: Hans Reiser <reiser@namesys.com>\nTo: reiserfs-list@namesys.com\n\nIfeel better about it not being my error that the document was\nunattached from my email.:-)\n\n\nThis is being translated into Russian for publishing, and if you would\nlike to be the first english language publisher let me know.\n\nBest,\n\nHans\n\n-------------------------------------------------------\n\n\n\n-- http://www.coker.com.au/bonnie++/ Bonnie++ hard drive benchmark http://www.coker.com.au/postal/ Postal SMTP/POP benchmark http://www.coker.com.au/projects.html Projects Iam working on http://www.coker.com.au/~russell/ My home page"
    },
    {
      "tag": "div",
      "text": "Title: The Viability of Free Software Business Models"
    },
    {
      "tag": "h1",
      "text": "The Viability of Free Software Business Models"
    },
    {
      "tag": "p",
      "text": "by Hans Reiser reiser@namesys.com"
    },
    {
      "tag": "h1",
      "text": "Service Contracts"
    },
    {
      "tag": "p",
      "text": "Making your software free might DECREASE your service contracts\nrevenue. The free software movement is quick to cite service contracts as the\nbest way to make money from selling free software.  There is a problem\nwith that. Companies are quicker to spend money on service contracts for\nproprietary software. The typical Linux software using company will have service contracts\non its Sun workstations including the software, and a hardware only\nservice contract on its Linux workstatons.  It will have service\ncontracts on Network Appliance fileservers, and, well, there is\nexactly one company (Lycos-Europe) with a large service contract on\nits ReiserFS fileservers. If a Linux using company does have service contracts on its Linux\nworkstations/appliances, most of the time that money goes to some\nintermediary company which doesn't give any of the money to the\nauthors of the software being serviced. This is not rational economic behavior.  The authors of the software\nwill indeed give much more expert advice than anyone else.  They will\nprobably give it cheaper also.  It makes no economic sense whatsoever\nto be slower to buy a service contract on free software than on\nproprietary software if you use the free software. It is very real behavior though, and it is killing off many free\nsoftware companies.  Sourceforge went proprietary because their sales\npeople couldn't sell service contracts for free software, and making\nthe premiere version of the software proprietary made the service\ncontract an easier sale.  GFS, Bitkeeper, how many pieces of software\nmight have been free if the service revenues had been there? This is deeply endangering the free software industry's fiscal\nviability. Why are they reluctant to pay for service on something that is free? Iget several emails a day from users who want me to tell them\nsomething in our FAQ, or to diagnose that they didn't really recompile\nthe kernel module like they thought they did, etc.  Iam happy to do\nthis, but Ithink Ishould get paid for it quite honestly. We have a support page which has to have the lowest fee in the\nindustry, $25 a question, and we'll answer any Linux related question\n(though most of the ones we get are ReiserFS related quite naturally.)\nThis support webpage gets used once every several days. Irefer the emailers with user error problems to the support page.\n(Bug reports not in the FAQ we handle for free, though the proprietary\nguys laugh and tell me that they charge for bug reports also.)  Maybe\n40% of those emailers with user errors send me a flame back, angry\nthat Iwant money to answer a simple question that Iknow the answer\nto.  They wouldn't send an email like this to their medical doctor\nexpecting a free diagnosis. So we have a real problem in our industry.  Economically irrational\nbehavior by users is killing our industry's revenues, and it\ndemolished the business plans that all of those Linux VCs funded once\nand swore to never fund another one looking like it again. Where do we go from here? The advantage that Gnu/Linux has is passion.  We need some focused\npassion.  If it is not logical, then we need to get going with the\npsychological!  If you believe in the value of the free software\nmovement, then you need go to the next IT purchases meeting at your\ncompany or government lab, and ask if there is a service contract from\nthe developers on all of the significantly used free software.  It is\nthat simple. We need to create a cultural norm in which it is considered proper\nbehavior to buy service from free software authors with the same\nfrequency one buys it from proprietary software authors.  The way to\ndo it is to acknowledge we have a problem, and start telling people\nbeing irrational doesn't just leave you losing the cost of your time,\nit leaves you hurting a movement you care about. There are other ways also, but Idon't find them as attractive. My guess is that most of the reason the proprietary vendors sell more\nservice contracts is that users are more inclined to buy service when\nit is one more line on a contract than when it is a new contract. An economist might be tempted to call this a transaction cost, and\nthink rational behavior is occurring, but beware that temptation!\nThis marketing phenomenom holds true even for customers where the cost\nof service would be hundreds of thousands of dollars.  Rational\neconomic behavior for the customer company as a whole it is not. We could for instance modify the license to require users to\npurchase zero or more dollars worth of service from the software\nauthors (including issuing a purchase order or supply a credit card\neven if the order is for zero dollars).  Ithink that some of those\nvendors whose free software business plan seriously depends on service\nrevenue should consider experimenting with this.  Alternatively, we\nshould just not depend on service revenue for the support of free\nsoftware businesses. Perhaps one can better make substantial amounts of money from\nservice if one's product is complicated enough.  MySQL seems to be\nmaking that approach work.  Namesys plans to add database and\nhypertext functionality to ReiserFS.  It is possible that someday our\nfilesystem will offer sufficient functionality that having a Namesys\nconsultant will be worthwhile for the average fortune 500 company.  In\nthat case the whole revenue model could snowball, with each consultant\ncreating more features, each new feature creating more customers, and\nthe end result could eventually be a company the size of Anderson\nconsulting advising companies on their information bases.  While there\nis nothing unique to open source about this, it is possible that open\nsource could allow a faster initial user adoption rate. It is interesting that free software service revenue at this time\nseems to encourage economic concentration.  This is not very\nencouraging if it holds true for the long term, and we end up with\nproprietary software locking out competitors from the source code, and\nfree software vendors either not giving any of the revenue to\ndevelopers (most small vendors) or being highly concentrated large\nvendors who favor funding software internally developed and\ncontrolled.  The only thing worse than a state controlled economy is a\nmonopoly controlled economy. Keep in mind that this is being written from a perspective in the\ndepths of the 2001 tech bust in which Namesys is managing \"only\" a\n100% annual growth rate due to the severity of the economy.  While\nReiserFS usage is increasing by one or two orders of magnitude, all\nnon-governmental sources that were on the verge of increasing revenue\nby an order of magnitude disappeared as those customers entered into\nlayoffs."
    },
    {
      "tag": "h1",
      "text": "Free software is very effective as a market sampling methodology."
    },
    {
      "tag": "p",
      "text": "That does imply though that one must segment one's market.  One way to\nsegment the market is according to whether the software is integrated\nwith proprietary software.  Our licensing policy says that if you\nmake money from charging for usage licenses, then we must make money\ntoo.  This allows Namesys to sell to fileserver vendors and\nproprietary software vendors who want to add proprietary improvements\nto ReiserFS.  All sales that Namesys has made in this area have\nresulted from market sampling being very effective.  It generates far\nmore revenue at this time than service does. Sales to proprietary OS vendors have not happened yet, but once the\neconomy recovers this could change, and interest has been expressed.\nIt takes just one sale of that size to make 8 years of work on a high\nrisk technological gamble pay off financially."
    },
    {
      "tag": "h1",
      "text": "Open Sales"
    },
    {
      "tag": "p",
      "text": "We could make proprietary optional plugins, with the core filesystem\nremaining GPL'd.  An issue though is how to prevent the poor from\nbeing locked out of access to software.  Software fees are usually set\nto what an average middle-aged man spending his boss's money at a US\ncorporation would be willing to pay.  Currently the only reasonable\noption for the poor for most software is to pirate their software.\n(Pirating can also serve as a form of anti-trust vigilante action when\nthe judicial system is as corrupted as it is in the US.)  Making\nlicense fees proportional to storage hardware cost is the best way to\nhandle this. This still leaves us with the economic inefficiency that occurs when a\nuser needs a spreadsheet three times a year, and he would like to use\nthe best one made, but the best one is priced appropriately for those\nwho use it several times a week.  Icall this the focused taxation\ninefficiency. Most products are sold for more than their marginal cost because most\nreal markets are only semi-competitive.  Doing this distorts the\neconomy.  Software takes this distortion to its greatest extreme, and\nbest illuminates a longstanding inefficiency in real world semi-free\nmarket economics. Ihave an unproven hypothesis to put before you: The amount of\neconomic distortion is a function of not just the total dollar amount\ntraded and exceeding the marginal cost, but is a function also of the\nratio of price to marginal cost, and high ratios are \"typically\" more\ndistorting than low ratios, even if the total number of dollars is\nmade equal.  Persons interested in discussing proving this hypothesis\nare encouraged to email me at reiser@namesys.com.  If the hypothesis\nis true, then can we choose to defocus the disincentive? Can we avoid the serious disadvantages of a state controlled, or\nmonopoly controlled, economy, and avoid the focused taxation\ninefficiency at the same time?  How can we lockout neither poor\ncustomers nor poor startup OS component suppliers? I'd like you to consider the concept of open sales.  In an open sale,\nusers pay a fixed percentage of hardware costs as a fee for using a\nsoftware pool.  Users may use all software in the pool.  The users are\npresented with a random sample of those developers who contributed to\nthe pool, and asked to allocate their fee among the sample in\nproportion to their perceived utility. Benefits: Adefocused disincentive to use software.  You may use the best of\nanything in the pool. Poor people can afford the fee. More finegrained rewarding of developers in proportion to their\nproductivity than traditional copyright law due to reduced transaction\ncosts. More accurate rewarding due to assessment of value being made\nafter usage."
    },
    {
      "tag": "h1",
      "text": "Conclusion"
    },
    {
      "tag": "p",
      "text": "Open source is a niche we at Namesys enjoy inhabiting.  Its production\nis not motivated mostly by money.  It is a gentleman's hobby for most,\nand a profession for some who aren't in it for the money.  It is\nlikely to remain a niche.  As long as that is understood, a good time\ncan be had by all us mutant hairless monkeys.  It is amusing to give\naway for free a filesystem faster than what a company worth billions\nis able to write despite all their money.  Life should be enjoyed. X-Body-of-Message-End X-MsgBody-End X-Follow-Ups Reply to: debian-consultants@lists.debian.org Russell Coker (on-list) Russell Coker (off-list) Follow-Ups : Re: Fwd: [reiserfs-list] Viability of Open Source Business Models From: Bernhard Reiter <bernhard@intevation.de> X-Follow-Ups-End X-References X-References-End X-BotPNI Next by Date: Re: Fwd: [reiserfs-list] Viability of Open Source Business Models Next by thread: Re: Fwd: [reiserfs-list] Viability of Open Source Business Models Index(es): Date Thread X-BotPNI-End X-User-Footer X-User-Footer-End"
    }
  ]
}