{
  "url": "http://lists.w3.org/Archives/Public/w3c-wai-gl/1999AprJun/0006.html",
  "file_number": "101",
  "content_hash": "ffb618f9d9465addd05e02493c09a126cdb697142c46292443b9592a1ba729e0",
  "total_blocks": 11,
  "retained_blocks": 6,
  "ignored_blocks": 5,
  "blocks": [
    {
      "tag": "p",
      "text": "W3C home > Mailing\n    lists > Public > w3c-wai-gl@w3.org > April to June 1999"
    },
    {
      "tag": "h1",
      "text": "\"Bugs\" in the 24 March 1999 Version"
    },
    {
      "tag": "div",
      "text": "This message :\n[ Message body ]\n [ Respond ]\n [ More options ] Related messages : [ Next message ]\n[ Previous message ] From : eric hansen < ehansen@ets.org > Date : Tue, 06 Apr 1999 23:08:45 -0400 (EDT) To : w3c-wai-gl@w3.org Message-id : <vines.yRv7+7lg0rA@cips06.ets.org>"
    },
    {
      "tag": "pre",
      "text": "\"Bugs\" in the 24 March 1999 Version of the Web Content Accessibility \nGuidelines\n\nThis memo highlights key \"bugs\" in the 24 March 1999 version of the \"Web \nContent Accessibility Guidelines.\" Additional bugs and suggestions are \ndescribed in my revision of the 24 March 1999 guidelines document. The \nrevision is available (temporarily) at: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm =====\nBug-1. The concept of \"equivalent\" is incomplete.\nImportance: Extreme\nDescription: The overall concept of \"equivalent\" is probably the most \nimportant concept of the document. Yet Ibelieve that without the change, \nthe concept of \"equivalent\" will remain vague.  \nAction Performed: Refined definition of \"equivalent\". See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#equivalent-def Further Action Suggested: Replace old language with new.\nEase of Correction: Very easy\n===\nBug-2. The definition of \"equivalent\" is incomplete without a concept of \n\"communication element\".\nImportance: Extreme \nDescription: Ithink that the concept of \"communication element\" is very \nimportant. It has to encompass all the things listed in checkpoint 1.1. The \nterm communication element is an essential foundation for the definition of \nequivalent. The term makes clear that we are not talking about \"HTML \nelements.\" \nAction Performed: Added a new term called the \"communication element\". See \nthe definition of \"communication element\": http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#communication-element-d ef\nIalso replaced the phrase \"non-text elements\" with \"non-text communication \nelements\". Ithink that this change is extremely important. Idid this \nbecause (1) The former was and is undefined and the latter is now defined.; \n(2) Several of the things that were called non-text elements looked like \n\"text\" (scripts, ASCII art, etc.) so the simple reference to \"non-text \nelements\" was confusing.\nFurther Action Suggested: Add the provided definition to the glossary. Make \na few related changes noted in main revision.\nEase of Correction: Very easy\n==\nBug-3. The term \"text equivalent\" is vaguely defined.\nImportance: Extreme\nDescription: This is probably the most important refinement of the \nrevision. The characteristic of being able to be rendered in several \ndifferent ways - auditorially (synthesized speech), tactually (braille), \nand visually (visually-displayed text) -- was mentioned in the previous \n3/24/99 version (in the body of the document but not the definition of text \nequivalent). But this revision makes the feature the one that distinguishes \nit from non-text equivalents. (Aparallel contrast is found in the new \ndistinction between \"text communication elements\" and \"non-text \ncommunication elements.\") If this cannot be addressed editorially, then Iask that it be discussed on the list or wherever else necessary.\nAction Performed: Refined the definition of \"text equivalent\". See the \ndefinition of text equivalent: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#text-equivalent-def Further Action Suggested: Replace old language with new in the glossary and \nmake a few other changes as indicated in the revision.\nEase of Correction: Very easy\n==\nBug-4. The term \"non-text equivalent\" is improperly defined.\nImportance: Extreme\nDescription: This is another very important refinement. Essentially, a \nnon-text equivalent is an \"equivalent\" that it is not a \"text equivalent.\" \nThe previous definition of non-text equivalent did not provide such a clear \ndistinction. If this cannot be addressed editorially, then Iask that it be \ndiscussed on the list or wherever else necessary.\nAction Performed: Revised the definition of \"non-text equivalent\". See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#non-text-equivalent-def Further Action Suggested: Replace old language with new in the glossary and \nmake a few other changes as indicated in the revision.\nEase of Correction: Very easy\n==\nBug-5. The term \"alternative equivalent\" is redundant.\nImportance: High\nDescription: Ieliminated the term \"alternative\" from the term \"alternative \nequivalent\" since the latter phrase is redundant. \"Equivalent\" is adequate \nby itself. Also, the term is \"alternative\" is not defined, except by \ncontext. (The word \"alternative\" seems fine in other usage.)\nAction Performed: Removed the \"alternative\" from the term \"alternative \nequivalent\"\nFurther Action Suggested: Make edits as provided.\nEase of Correction: Very easy\n==\nBug-6. Document uses of the word \"description\" without making clear its \nspecial meaning.\nImportance: High\nDescription: The revision reduced reliance on undefined terms such a \"video \ndescription\", \"auditory description\"; these terms will tend to confuse \npeople, especially if they are not defined in the glossary. They are not, \nto my knowledge, necessary. Itried the use defined terms and to get the \nsame message across. For example, Ifound that the defined terms \n\"equivalent\" was often helpful. \nAction Performed: Reduced reliance on undefined uses of the word \n\"description\"\nFurther Action Suggested: Make edits as provided. \nEase of Correction: Very easy\n==\nBug-7. The introduction to guideline 1 is inconsistent with the refined \ndefinitions.\nImportance: High \nDescription: NA\nAction Performed: Provided a revised introductory section for guideline 1 \nto make it consistent with the revised definitions above. See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#revised-guideline-1-int ro\nFurther Action Suggested: Use the provided language.\nEase of Correction: Very easy\n==\nBug-8. Checkpoint 1.1 needs refinement. \nImportance: Extreme\nDescription: Note that is recently underwent a revision and therefore might \nbe expected to require some editing. As noted, the reference to \n\"synthesized speech\" as requiring a \"text equivalent\" would not be \ncomprehensible without further explanation. \nAction Performed: Revised the wording of checkpoint 1.1\nHere is my current suggestion: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#suggested-revision-chec kpoint-1.1\nHere are some earlier versions. They have some comments not in the most \nrecent version. http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#revision-2-checkpoint-1 .1 http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#revision-1-checkpoint-1 .1\nHere is an even older version with heavy comments: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#commented-checkpoint-1 .\n1\nHere is the original (3/24/99) version: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#old-3-24-99-checkpoint -\n1.1\nFurther Action Suggested: Make the provided changes. Note that any \nreference to \"synthesized speech\" as a non-text communication element would \nneed to be explained if the group feels that it is important to include.\nEase of Correction: Moderately easy. Should be reviewed by several members \nof the working group. There are a few questions raised that should be \naddressed.\n==\nBug-9. Checkpoint 14.2 mistakenly makes reference to equivalents \"to text\".\nImportance: Extreme\nDescription: This is a clear factual error.\nAction Performed: Provided revised wording. (Ialso made other edits that \nshould be considered.) See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#equiv-to-text-bug Further Action Suggested: Make the provided changes.\nEase of Correction: Very easy.\n==\nBug-10. The possibility of synchronizing text equivalents for video was not \nacknowledged in checkpoint 1.3\nImportance: Very High\nDescription: The old version of 1.3 reads: \"For each movie, provide an \nauditory description of the video track and synchronize it with the audio \ntrack. [Priority 1]\"\nAction Performed: Revised checkpoint 1.3 and gave it a split priority. http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#checkpoint-1.3 Further Action Suggested: Easy. This one should be reviewed and discussed. \nThe idea proposed was discussed briefly but received inadequate \nconsideration.\nEase of Correction: Easy.\n==\nBug-11. The word \"visual\" is used to describe non-text elements, even \nthough text is usually rendered in a visual manner.\nImportance: Moderate\nDescription: NA\nAction Performed: Reduced reliance on the word \"visual\". \nGenerally, Ihave tried to reduce reliance on the word \"visual\" when \nreferring to things like graphics and video. The problem is that it is \nsometimes intended as a contrast to text, yet text can also be \"visual.\" If \nthe editors think that it is important to use the visual, Irecommend that \nthey define it early in the body of the document.\nFurther Action Suggested: Make provided changes.\nEase of Correction: Easy\n==\nBug-12. The need for text equivalents for ASCII art was cited in two \ncheckpoints (1.1 and 1.5).\nImportance: High\nDescription: This is a small redundancy in the checkpoints.\nAction Performed: Deleted Checkpoint 1.5 http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#checkpoint-1.5 Further Action Suggested: Make suggested deletion.\nEase of Correction: Very Easy\n==\nBug-13. The description of the relationship between the terms \"assistive \ntechnology\", \"screen reader\", and \"user agent\" is not consistent throughout \nthe document.\nImportance: High\nDescription: This is a fairly clear factual mismatch. See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#assistive-technology Action Performed: Ihave not tried to resolve this. \nFurther Action Suggested: The editors should pick one explanation and use \nit throughout the document.\nEase of Correction: Easy.\n==\nBug-14. The guidelines document does not claim a conformance level.\nImportance: High\nDescription: The guidelines document does not claim a conformance level for \nitself.\nAction Performed: Added a conformance claim. See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#conf-claim-for-wcag-doc Further Action Suggested: Review and approve language.\nEase of Correction: Fairly easy. This should be reviewed by Working Group \nmembers.\n==\nBug-15. The document fails to follow checkpoint 4.2 on acronyms and \nabbreviations. \nImportance: High (essential for obtaining triple-Arating).\nDescription: NA\nAction Performed: Problem noted. One or more acronyms were expanded in the \nbody of the text. Also another example was suggested. See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#abbreviations-and-acron yms\nFurther Action Suggested: Fix them. Ithink that it would be an important \nlost opportunity to fail to claim a triple-Arating and do whatever it \ntakes to make sure that it sticks.\nEase of Correction: Fairly easy to somewhat difficult\n==\nBug-16. The document does not say how to handle conformance ratings for \ninaccessible primary pages that have accessible alternative pages.\nImportance: Moderate to High\nDescription: NA\nAction Performed: Provided an explanation. See: http://etsr.digitalchainsaw.com/wcagpub/r990324a.htm#alt-page-conformance Further Action Suggested: Verify that this is the desired location for this \ninformation. Approve.\nEase of Correction: Easy\n=============================\nEric G. Hansen, Ph.D.\nDevelopment Scientist\nEducational Testing Service\nETS 12-R\nRosedale Road\nPrinceton, NJ 08541\n(W) 609-734-5615\n(Fax) 609-734-1090\nE-mail: ehansen@ets.org"
    },
    {
      "tag": "div",
      "text": "Received on Tuesday,  6 April 1999 23:41:12 GMT This message : [ Message body ] Next message : Special Offer: \"Book - \"Louis Farrakhan: Made In America\"\" Previous message : Chuck Letourneau: \"Announcement: Working Group Conference Calls\" Mail actions : [ respond to this message ] [ mail a new topic ] Contemporary messages sorted : [ by date ] [ by thread ] [ by subject ] [ by author ] Help : [ How to use the archives ] [ Search in the archives ]"
    },
    {
      "tag": "p",
      "text": "This archive was generated by hypermail 2.2.0+W3C0.50 : Friday, 10 February 2006 22:13:54 GMT"
    }
  ]
}