{
  "url": "http://members.iinet.net.au/~jgowland/plp/The%20Republic.htm",
  "file_number": "108",
  "content_hash": "cb93eb4b998de430cfcd5e5d86acb31efc393a64f3488604e1d5adcf5c812a54",
  "total_blocks": 71,
  "retained_blocks": 40,
  "ignored_blocks": 31,
  "blocks": [
    {
      "tag": "p",
      "text": "THE REPUBLIC Policies for Political,\nElectoral & Constitutional Reform Issued 5th April,\n2000, Adopted by the National Council, January 2000 [ *Note: The first section of Part B, Clause 2b,Cis still in Official\nDraft mode, and is subject to further discussion at the June 2000 Conference ]"
    },
    {
      "tag": "h4",
      "text": "Preamble:"
    },
    {
      "tag": "p",
      "text": "a/ The PLP proceeds from the\npremise that major political, electoral and constitutional reforms are long\noverdue in Australia and that they are not and will not be tackled by the major\nparties. In developing a blueprint for change we prioritise an order in the\nchange process on the basis of urgency and achievability. Therefore, what\nfollows is an ambit package, eg. proportional representation for all Parliaments\nis high on the list, followed by the abolition of state upper houses, followed\nby the creation of a two-tier structure of elected government. Depending on the\nchanging preferences of the Australian people some stages may be speeded up,\ncollapsed or skipped altogether. What we present here is an overall concept for\nchange. b/ Our principal policies for a new\nRepublic are:"
    },
    {
      "tag": "div",
      "text": "President: elected DIRECTLY by the people, with symbolic powers only: Note: the Irish Presidential model provides a useful guide: strictly\n    symbolic powers unlike the present powers of either the Monarch or\n    Australian Governor-General. In addition, persons who have been members of\n    any Parliament during the past 10 years cannot be candidates. Steps would be\n    enforced to prevent expenditure by parties or business interests of large\n    sums of money to distort the result of the poll. A President is needed to perform a variety of ceremonial and legislative\n    functions. Two-tier system of elected government: National government and a\n    much strengthened local government system, coupled with administrative local\n    government regions Proportional Representation: aimed to create greater diversity in\n    Parliament Improvement in the Quality of Political Executive Government, with\n    consideration of a number of options for democratisation and broadening of\n    cabinet government in Australia. Fixed four-year parliamentary terms Acomprehensive Bill of Rights Safeguards for: (a) the\n    environment; (b) Indigenous\n    Peoples' rights; (c) other\n    minority groups c/ PLP policy is\naimed at creating the Maximalist Republic, a Republic for the people, by the\npeople and of the people - as it should be! Amere change of ceremonial Head of\nState would still leave Australia with a rigid and archaic constitution, an\noutmoded political system and a grossly unequal society. This would be piecemeal\ntinkering of the worst kind. The time has come to consider clear alternatives to\nthe federal form of government, the two-party system, the electoral system and\nthe scope of government. A Bill of Rights, constitutional protection of the\nenvironment and a conciliatory settlement of indigenous rights need to be\nincorporated in a Republican constitution."
    },
    {
      "tag": "p",
      "text": "d/ The PLP has adopted the\nposition that a sovereign people naturally have the unfettered right to rewrite\nand replace their constitution if they believe this to be a requirement for\ntheir survival, prosperity and improvement of their democracy. The PLP holds\nthat what has happened in Australia in recent years is like putting the cart\nbefore the horse. Neither major party has a program for significant constitutional and\npolitical change. e/ The notion that\na government can be enterprising - and enabling - itself is the antithesis of\nthe view that only private enterprise can deliver economic recovery, jobs and\nfuture prosperity for Australia. Many other countries, even those with a\nsignificant private sector, have entirely government-owned or jointly-owned\npublic corporations to run key industries, e.g. France and Norway. As the PLP is\nof the view that Australia should aim at government enterprise rather than\nprivatisation it becomes imperative to build real quality and independence into\nthe Government and Parliaments and to ensure that Government and Parliaments\ncease to be the servants of powerful multinational corporations and financiers\nin the private sector. The reformist strategy is dealt with in\nthree sections: SECTION 1: THE INADEQUACIES OF THE EXISTING POLITICAL SYSTEM; SECTION 2: A MAXIMALIST MODEL FOR POLITICAL AND CONSTITUTIONAL REFORM IN\nAUSTRALIA; SECTION 3: DRAFTING THE NEW CONSTITUTION, - CONSTITUTIONAL CONTINUITY, -\nLAUNCHING THE NEW CONSTITUTION BY MEANS OF SECTION 128."
    },
    {
      "tag": "h3",
      "text": "SECTION 1 The\nInadequacies of the Existing Political System"
    },
    {
      "tag": "p",
      "text": "a/ The kind of question which\nAustralians are now increasingly increasingly asking themselves in relation to\nthe Republic is: What kind of a Republic do we really want? If Australians can\nreconstruct their political system to meet the demands of a society vastly\ndifferent from Federation in 1900, having greatly advanced technology at its\ndisposal and possessing superior transport and communication systems as well as\nphysical resources, how will they do it? Would there still be any need for a\nfederal system at all? Or would it be a huge hindrance to effective government?\nWould there still be need a for some 830 politicians? Should they introduce a\ntwo-tiered system of elected Government and enable the majority party or\ncoalition to select the Ministry from outside Parliament rather than appoint\ncareer politicians? Surely the issue is no longer whether Australia should be a\nRepublic OR continue to be an outpost of a rather shaky constitutional monarchy\nwhich has little interest in her distant Dominion. Improving the processes of\nGovernment in Australia, steeped in 200 years British colonial and Westminster\ntraditions, is a task habitually avoided by both major parties. Unless it's done\nAustralia may no longer in business on account of its antiquated constitution\nand political system. More likely it will be governed by the Boards of Directors\nof foreign Multi National Enterprises through a comprador class of well-paid\ncompliant Australian managers and politicians. That trend is unmistakable\nalready. The PLP intends to create a real democracy in Australia. b/ The domination by two major\nparties has led to an erosion of democracy and to a weakening of Government,\noften described as \"the passing of Parliament\". The electoral system\nhas kept that now sterile, male dominated, two-party system in place for far too\nlong. Agreater variety of interests, persons and cultures should be represented\nin the National Parliament. The role of the citizens in constitutional change\nhas been minimal and tokenistic. The initiative and timing of referendums is the\nprerogative of the Government of the day. Almost every constitutional referendum\nturns into a political slanging match regardless of the merits of the proposal(s).\nOnly eight of many such referendums have been successful over the 100 years of\nfederation. The rejection of the four proposals of the 1988 referendum\ndemonstrated the present Constitution's dangerous inflexibility once again.\nUpdating the Constitution has proven to be far too difficult. The result has\nbeen to devise expensive ways to circumvent it, often unsuccessfully, a recipe\nfor stagnation and deterioration. c/ The PLP's\nanswer to these problems is that the piecemeal tinkering must end. Australians\nneed to rewrite the entire constitution. The idea that the constitution cannot\nbe replaced by another one, supposedly because it can only be amended (and then\nonly in terms of the highly unsatisfactory amending clause, section 128), is no\nmore than a legal fiction. It suggests that the legal system ultimately rules\nAustralia rather than the people. This line of argument, frequently voiced by\nso-called constitutional experts, suggests that today's Australians are shackled\nby past agreements among some of the citizens who voted on the 1900 Constitution\nDraft in a VOLUNTARY referendum 100 YEARS AGO."
    },
    {
      "tag": "h3",
      "text": "SECTION 2: A Maximalist\nModel for Political and Constitutional Reform in Australia"
    },
    {
      "tag": "p",
      "text": "2a/ The phoney Minimalist\nRepublic 'debate' resulted in the Constitutional Convention of February, 1998.\nThe Convention was dominated by conservative politicians, Minimalist candidates\nof the ARM and the pro-monarchist candidates. However, a vocal minority of\nMaximalist candidates presented the kind of arguments which are embodied in PLP\npolicy as well. In addition, the Australian voters favour a directly elected\nPresident a fact that the conservative majority at the Convention found hard to\ndeal with. We have incorporated that wish also in our policy. 2b/ That policy\nnow follows:"
    },
    {
      "tag": "h4",
      "text": "A."
    },
    {
      "tag": "div",
      "text": "Head\nof State to be directly elected by the Australian people."
    },
    {
      "tag": "p",
      "text": "Head of State to have essentially symbolic powers, plus some reserve powers\naimed essentially at breaking legislative deadlocks. In the event of legislative\ndeadlock the President convenes a joint sitting of Parliament where a majority\ncan resolve the matter, or otherwise a referendum is called. The PLP does not favour the US-style Presidential system or a dual executive\nstructure (as for instance in France)."
    },
    {
      "tag": "h4",
      "text": "B. The Prime Minister\nwill remain the effective Head of Government."
    },
    {
      "tag": "p",
      "text": "This official is the leader of the party or coalition of parties which\ncommand majority support on the floor of the House of Representatives"
    },
    {
      "tag": "h4",
      "text": "C. * The PLP is most\nconcerned with the lack of quality in political executive government."
    },
    {
      "tag": "p",
      "text": "We propose a democratisation and broadening of cabinet government in\nAustralia, including consideration of : Inclusion of ministers with appropriate expertise and experience from\n    outside of Parliament (as is the practice in most overseas countries); Nomination of ministers not only by the Prime Minister but also by unions\n    and community organisations in their sphere of responsibility; Election of cabinet by the whole of parliament, instead of appointment by\n    prime minister or factional leaders; Direct election by voters of all executive/cabinet positions; All ministers to be responsible to parliament, and subject to recall at\n    any time."
    },
    {
      "tag": "div",
      "text": "Ministerial Codes of Conduct"
    },
    {
      "tag": "p",
      "text": "We endorse the creation of codes of conduct for each Ministerial Department\nin order to enshrine a character of ethics and accountability to the decision\nmaking processes and to ensure that the Universal Human Rights of the UN Charter\nand a concern for the welfare of all people becomes the fundamental basis for\nall policy making."
    },
    {
      "tag": "h4",
      "text": "D. Measures to end to\nthe domination of the National Parliament by two parties."
    },
    {
      "tag": "p",
      "text": "The PLP calls for a referendum to introduce Proportional Representation by means of the Hare-Clark system based on multi-member electoral districts\n(these districts could be same as the administrative regions for local\ngovernments.) This would provide scope for the representation of more parties and\nIndependents - provided they would have minum support of, say, 4% or 5% in a\nnine-member district. This would also end the single-member (district) system,\npork barrelling, by-elections, neglected seats (safe seats), electoral boundary\nchanges and the adversarial mode of debate. The proportion of votes required for representation in a district would not\nbe able to be raised without a referendum or some other means of democratic\nconsultation. This is to ensure that major parties in a district cannot simply\nvote together and raise the percentage without community consultation, in order\nto reduce the representation of smaller rival parties and independents. Asystem of 30 electoral districts, each returning nine members, would yield\na 270 member legislature (House of Representatives). Add to this three Senators\nper district (possibly not belonging to any party) and a total of 360 MPs would\nrepresent the nation in Canberra. That would be less than half the present total\nnumber if the states are abolished. The Hare Clark system is well known in\nAustralia as it is used in Tasmania, the ACT, and for the present Senate\nelections. It is preferred over other PR systems, such as list PR systems and\nthe NZ MMD system of PR (based on the German system). The Senate would retain its present powers\nand functions. The Senate , already elected by PR - Hare Clarke now (although distorted\nby \"malapportionment\" on account of the federal system and state\nrepresentation) would retain its present powers and functions. However, in the\nPLP proposal Senators would not represent the abolished states. The principal\nfunctions of the Senate would be legislative review and holding Parliamentary\ninquiries as at present. The PLP would remove the power of blocking Supply . The PLP favours the Robson Rotation system for PR (used in the ACT, and\nTasmania) with the right to discontinue the allocation of preferences beyond the\nnumber of vacant positions. the PLP supports Voter-determined Above-the-line or\nUnder-the-line Optional Preference Voting. Compulsory voting will be retained."
    },
    {
      "tag": "h4",
      "text": "E. The introduction of a\nFIXED four-year terms for the National Parliament and Government -"
    },
    {
      "tag": "p",
      "text": "with provision for optional early elections only if a Government has lost\nmajority support in the House of Representatives, and after exhausting all\noptions of forming a new government under the existing parliament. Fixed-term parliaments are supported by many people but the major parties\nwon't take steps to introduce this reform once in power. The advantages are\nwidely accepted though. It provides time to implement policy and predictability.\nIt reduces uncertainty and the frequency of elections. Change the electoral law or write it into\nthe new constitution."
    },
    {
      "tag": "h4",
      "text": "F. The creation of a\ntwo-tier system of elected government with STRONG local government units."
    },
    {
      "tag": "p",
      "text": "The present states could be replaced by smaller, administrative regions\nindirectly elected by groups of local councils and/or on some BioRegional\nprinciple. Special separate City Administrations could be established modelled\nperhaps on the Greater Brisbane Council . This would reduce direct popular\nelections to two levels: the national and local levels. The regions could be grafted onto the local government tier. Already an\nextensive system of voluntary regional councils exists which could be a base to\nstart from. The savings of such measures have been estimated to be in the order\nof many billions of dollars (possibly $30 billion p.a., Drummond in Hall, 1998)\ndepending on what model of regional administration is adopted. E.g. Drummond has\ndeveloped detailed scenarios of such options by means of cost/benefit analyses\nbased on applications of linear regression techniques to State, Territory and\nLocal Government outlay as well as population data. The need for special regions to ensure representation for sparsely populated\noutlying areas is acknowledged and will be accommodated. Existing powers and responsibilities of\nthe states would be redistributed between national and regional governing\nbodies. The PLP greatly favours the strengthening of local government, both in\nterms of funding and functions. In order to effectively extend functions\ncritical mass needs to be achieved and some smaller local government units would\nneed to be amalgamated. Certain functions which are now the domain of state\ngovernments will be transferred to local government of sufficient size and\ncapacity to handle them. In addition, the PLP will introduce the precinct (or\nward) system to ensure maximum community involvement in local government - and\ngenerally promote grassroots democracy in every way possible. In 1900 an excellent case could be made for a federal structure. Alot has\nchanged since then. Communications and transport systems have improved\ndramatically. In 2000 a country of only 19 million people does not need a\nfederal structure, seven different administrations plus that of the Northern\nTerritory and ACT. All the reasons for federation have long disappeared! As a first step the PLP advocates the abolition of the state upper houses by\nmeans of state referendums - assuming that our priority No. 1, the introduction\nof PR for state lower houses, has first been achieved. This would then be\nfollowed by a campaign to abolish the states altogether."
    },
    {
      "tag": "h4",
      "text": "G. The introduction of a\nBill of Rights, including a preamble concerning the rights of Indigenous people\nand providing a conciliatory settlement with similar status and protection as a\nBill of Rights."
    },
    {
      "tag": "p",
      "text": "The protection of human rights and special minorities will also be included\nin a Bill of Rights."
    },
    {
      "tag": "h4",
      "text": "H. The introduction of\nnational environmental aims and safeguards"
    },
    {
      "tag": "p",
      "text": "together with ways of redress and compensation where a communitys or\nindustry's livelihood is adversely affected."
    },
    {
      "tag": "h4",
      "text": "I. The amendment\nprocedure for the new Constitution will be simple."
    },
    {
      "tag": "p",
      "text": "The new Constitution can be amended in two ways: ONE: by a 3/4 majority of all National Parliamentarians of both Houses of\nParliament voting jointly OR by a binding, mandatory national referendum which can be introduced in two\nways:"
    },
    {
      "tag": "div",
      "text": "Initiated by the Government of the day Initiated by the people on the basis of a petition signed by 1% of the\n    electors on the national electoral roll J. Review of Constitution procedure"
    },
    {
      "tag": "p",
      "text": "The new Constitution needs to be extensively reviewed after every five years.\nThe review need to be given wide publicity and adjustment facilitated."
    },
    {
      "tag": "h3",
      "text": "SECTION 3: Drafting the\nNew Constitution, - Constitutional Continuity, - Launching the New Constitution\nby means of Section 128"
    },
    {
      "tag": "h4",
      "text": "K. Who would draft the\nNew Constitution?"
    },
    {
      "tag": "p",
      "text": "The PLP recommends a panel of 50 persons representing various key\nconstituencies of all age groups and all classes in society. These should be in\na position to consult extensively with their constituencies . Politicians should\nnumber no more than five and constitutional experts would be equally limited to\nfive. There could be five foreign constitutional experts to provide input."
    },
    {
      "tag": "h4",
      "text": "L. Continuity"
    },
    {
      "tag": "p",
      "text": "It is desirable that the Constitution has a link with the old one and\nprovides continuity in spite of introducing radical changes. Many new\nConstitutions of national states have been the outcome of great political and/or\nsocial upheavals, major crises such as wars, a struggle for independence, civil\nunrest and secession. However, this does not mean that states which are not\nsubject to such major crises (a) therefore have no need for major changes to the\nground rules of their governmental system; (b) that such changes as are needed\ncannot be achieved in a civil, democratic and peaceful manner. After all major\ncrises are almost always the result of inadequate, evolutionary adjustment. Moreover, the notion that Australia is free from crisis at present would be\nchallenged by many and denied only by the ultra conservative and foolhardy. It\nhas become a very unequal country in recent decades with many pressing social\nissues. In economic terms Australia is struggling to maintain its independence\nand achieve greater competitiveness. International capital is increasingly\ndictating her destiny. Australia's present Constitution and political system has\nsevere constraints which, the PLP maintains, cannot be remedied by ineffectual\npiecemeal tinkering at the margins."
    },
    {
      "tag": "h4",
      "text": "M. Launching the New\nConstitution through Section 128 - an evolutionary method"
    },
    {
      "tag": "p",
      "text": "The principal problem in having a constitutional referendum accepted has been\nthe requirement laid down in Section 128 that , apart from a national majority,\nthere has to be \"majority in a majority of states\". Clearly this\nrepresents a bias in favour of the federal system itself. In order to alleviate\nthis problem, an undemocratic feature of the present Constitution the cause of\nmuch rigidity and expense, the following strategy is recommended: In a \"New Constitution Referendum\" there could be two questions in\norder to overcome the \"majority of states\" problem, as follows:"
    },
    {
      "tag": "div",
      "text": "For the purpose of voting on this New Constitution Package are you in\n    favour of disregarding a requirement of Section 128 that a constitutional\n    referendum needs to be carried by a majority of states? YES/NO Do you support the proposition that the New Constitutional Package should\n    replace the present Constitution in its entirety? YES/NO"
    }
  ]
}