{
  "url": "http://mobyrebuttal.blogspot.com/",
  "file_number": "112",
  "content_hash": "0719d987790bd1f5e76f20c9bd56ab4935c3899fe84c2ced5d03208254849d14",
  "total_blocks": 59,
  "retained_blocks": 5,
  "ignored_blocks": 54,
  "blocks": [
    {
      "tag": "div",
      "text": "Notify Blogger about objectionable content. What does this mean? Send As SMS BlogThis! \"Honesty is my only excuse...\""
    },
    {
      "tag": "p",
      "text": "View my complete profile"
    },
    {
      "tag": "div",
      "text": "Links Open in New Window July 2004 August 2004 September 2004 October 2004 November 2004 December 2004 January 2005 February 2005 March 2005 April 2005 May 2005 June 2005 July 2005 August 2005 September 2005 October 2005 November 2005 December 2005 January 2006 February 2006 March 2006 April 2006 May 2006 June 2006 July 2006 August 2006 September 2006 October 2006 November 2006 December 2006 The Drudge Report Free Republic World Net Daily News Busters September 11, 2001 Sean Hannity Ann Coulter Laura Ingraham Protest Warrior Iraq the Model GOP Grassroots PA Young Nationalist Right Wing News National Summary Pajamas Media Conservative Pages Powerline News Zombie: A Real Look at the Anti-War Left PAT DOLLARD: Young Americans Jules Crittenden Keystone Soldiers Castle Argghhh! BLACKFIVE Mudville Gazette CBFTW's WAR MILblogging.com Army Girl Desultory Butterfly My Army Life Doc in the Box American Soldier From My Position...On the Way! Miserable Donuts A Female Soldier This is Your War II Anti-Idiotarian Rottweiler The Jawa Report The Middle Ground Basil's Blog Ace of Spades HQ Small Dead Animals AFSis' Side of the Puddle The G-Man The Cassandra Page She Who Will Be Obeyed Junk Yard Blog Villainous Company TrekMedic251 News & Views from Philly Righty in a Lefty State Third World County Homocon Guardian Watchblog ArmyWifeToddlerMom Andi's World Six Meat Buffet Papa Doc Wizbang Three Sources Lost in Lima Heartless Libertarian Stalking Cat The Attic Downstairs A Sage Moment Right in Philly Ron Goodwyne Slag Blog Common Folk-Common Sense Cancer World Another Man's Meat UrbanGrounds Rab Honest Partisan Lone Liberal in The Dirty South Pax Romano J. Marquis Courtney's Gifted School D-NC Bourgeois Deviant PROTEIN WISDOM Straight White Guy IMAO The Flying Space Monkey Blame Bush! Blank Forever Anonymous Rowhouse Tammi's World Jethro's Chirotechnics Homeschooling Mamma Sleeping Ugly Freakchylde's Playground A Unique Southern Belle My Favorite Pastor BlueWolfess Violent Day Dreams Kalipornia Sux My Opinions Are Free Bloggedy Blog Philly Future Blinq Attytood Philadelphia Will Do \"Now there's a sassy blonde! Why don't Ihave her linked?\""
    },
    {
      "tag": "h4",
      "text": "~Glenn Reynolds"
    },
    {
      "tag": "div",
      "text": "Ollie North's Freedom Alliance Adopt A Platoon Women For Women International Toys For Iraq Operation Shoe Fly All SANDBOX photos sent to ALa via email or taken from I'm of the Select Few in Technorati Cosmos How about you? Big & Mean TX PunkRock Mommy VA Desultory Butterfly MD Mr. Nimbus VT Pax Romano NJ She Who Will Be Obeyed KS CW4BillT NJ Army Girl AZ Russ from Winterset IA Dan Rubin PA Courtney MA Dale Cruse MA CBFTW CA kali MD RBP TN"
    }
  ]
}