{
  "url": "http://nsr.mij.mrs.org/1/20/complete.sym.html",
  "file_number": "128",
  "content_hash": "323b180b1f21427bc0181f572702c9900507fae1c88336b2368a6b3d743331b5",
  "total_blocks": 191,
  "retained_blocks": 26,
  "ignored_blocks": 165,
  "blocks": [
    {
      "tag": "div",
      "text": "M R S Internet Journal of Nitride Semiconductor Research"
    },
    {
      "tag": "p",
      "text": "Volume 1, Article 20"
    },
    {
      "tag": "h2",
      "text": "Recent Results in the Crystal Growth of GaN at High N 2 Pressure"
    },
    {
      "tag": "p",
      "text": "I. Grzegory , M. Bockowski , B. Lucznik , S. Krukowski , M. Wroblewski , S. Porowski High Pressure Research Center This article was received on Friday, May 31, 1996 and \raccepted on Wednesday, October 23, 1996."
    },
    {
      "tag": "h3",
      "text": "Abstract"
    },
    {
      "tag": "p",
      "text": "We present recent results on bulk GaN crystallization. The best quality GaN\rcrystals grown from the solution at high N 2 pressure without an\rintentional seeding are single crystalline platelets of stable morphology\rreaching dimensions up to 10 mm. The fastest growth direction for such crystals\ris [1 0 0], perpendicular to the GaN c-axis. The maximum stable\rgrowth rate perpendicular to crystal c-axis is determined from the experiment\rand used for an estimate of the effective supersaturation for the\r{10 0} face assuming two dimensional layer growth. The heat of GaN\rdisssolution, determined from experimental solubility data, is used for the\restimation of the edge energy of 2-Dnuclei on the growing {10 0}\rface.\r\tBulk crystal growth seeded by a single hexagonal needle with well developed\r{10 0} faces is also reported. The crystallization mechanisms and\rmorphological stability in seeded growth of GaN are discussed on the basis of\rexperimental results.\r\tThe physical properties of the GaN crystals and homoepitaxial layers grown on\rthem are briefly reviewed."
    },
    {
      "tag": "div",
      "text": "top"
    },
    {
      "tag": "h2",
      "text": "1. Introduction"
    },
    {
      "tag": "p",
      "text": "GaN is a strongly bonded compound well suited for applications such as high\rpower, high temperature electronics. The bonding energy of GaN is 8.9 eV/atom\rwhereas for GaAs it is only 6.5 eV/atom [1] . Consequently, the free energy G(T)\rof the crystal is very low in relation to the reference state of free Nand Ga\ratoms.\r\tOn the other hand, the N 2 molecule is also strongly bonded\r(4.9eV/atom). Therefore, the free energy of the constituent Ga and\rN 2 becomes quite close and surpasses that of GaN as the temperature\ris raised. Figure 1 shows the free energy of GaN (1 mole) versus its\rconstituents (Ga + 1/2N 2 ) as a function of temperature. The G(T) of the constituents decreases faster than that of the GaN crystal and\rat higher temperatures GaN become thermodynamically unstable.\r\tThe crossing of G(T) curves determines the equilibrium temperature where GaN\rcoexists with its constituents at a given N 2 pressure.\r\tThe application of pressure allows  us to increase the free energy of the\rconstituents much more than that of the crystal shifting the equilibrium point\rto higher temperature and extending the stability range of GaN.\r\tThe equilibrium p N2 - Tconditions for GaN determined\rexperimentally by Karpinski et al. [2] [3] are shown in Figure 2 . Most of crystallization processes discussed in this paper have been\rcarried-out in large volume gas pressure reactors at an N 2 overpressure of up to 15 kbar, which corresponds to a GaN stability limit at\r1850K.\r\tThe maximum temperature of 1850 Kis quite far from the melting temperature of\rGaN. According to the theoretical estimation of Van Vechten [4] the melting\rpoint of GaN is ~3000K. The N 2 equilibrium pressure at the melting\rpoint is therefore much higher than we can obtain in our experimental system.\r\tThe extension of the GaN stability range to 1850 Kallows the growth of GaN\rcrystals from a liquid Ga solution. In Figure 3 we show the Nsolubility data\rresulting from the annealing of Ga at the three phase equilibrium conditions of Figure 2 . Since the Nconcentrations are not high, the growth experiments have to be long\rto obtain high quality bulk GaN crystals with dimensions appropriate for\rmeasurements and applications. Therefore, stability over a long time (>100h)\ris an additional requirement for the growth system.\r\tThe solid line in Figure 3 is the liquidus line for Ga-GaN system calculated\rusing an ideal solution approximation and Van Vechten's melting\rtemperature of 2790K. For an ideal solution, the solubility can be expressed\ras: (1) where Hsol is the heat of dissolution. For GaN, Hsol =\r44.7 kcal/mole = 0.49 eV/bond and expresses the bonding energy in the crystal\rin relation to its mother phase: the solution."
    },
    {
      "tag": "h2",
      "text": "2. Crystal Growth"
    },
    {
      "tag": "h3",
      "text": "2.1. Experimental"
    },
    {
      "tag": "p",
      "text": "The growth system is designed for the crystallization of GaN from solution\runder high N 2 overpressure at high temperature in relatively large\rvolumes. Since the material to be grown is a semiconductor for optoelectronic\rapplications, the system has to fullfil all the requirements concerning purity\rand control of the growth conditions. Moreover, crystallization from a dilute\rsolution requires lengthy processes of ~100 hours. Therefore, the high pressure\r- high temperature crystallization reactor (chamber and multizone furnace) has\rto be supplied with additional systems necessary for: in situ annealing in vacuum electronic stabilization and programming of pressure electronic stabilization and programming of temperature pressure, temperature, voltage and current sensitive alarms cooling of the pressure chamber In Figure 4 we have shown schematically such an experimental apparatus. Many\rfunctions mentioned above are realized by the use of standard commercially\ravailable devices ( e.g. vacuum pumps, temperature programmers, mass flow\rdetectors...). The pressure in the chamber is stabilized with a precision\rbetter than 20 bar. The temperature is measured by a set of thermocouples\rarranged along the furnace and coupled with the standard input power control\relectronic system. This allows the stabilization of temperature better than 0.5\rdeg., and the ability to program changes in the furnace temperature\rdistribution during the experiment. Supersaturation in the growth solution has been created by the application of\rtemperature gradients along the axis of the crucible. Both horizontal and\rvertical arrangements of the crucibles have been used. The typical duration of\rthe experiments was 100 - 150 hours for crystals of 6-10 mm in size."
    },
    {
      "tag": "h3",
      "text": "2.2. Crystallization without intentional seeding"
    },
    {
      "tag": "p",
      "text": "Gallium, when heated under high N 2 pressure, does not wet the\rcrucible walls (usually graphite or BN). Rather, it is covered with a thin GaN\rlayer consisting of GaN single crystals. This is the first step of GaN\rcrystallization at high N 2 pressure. The size of the crystals\rcovering the Ga depends on the sequence and rates of compression and heating of\rthe system. Atypical structure of the surface layer is shown in Figure 5 . The formation of the surface layer inhibits further synthesis of the nitride\rwhich allows longtime crystallization processes and the growth of relatively\rlarge GaN crystals. Since the solution is in a temperature gradient, the GaN\rlayer at the hot end of the crucible dissolves in gallium and is transported,\rby convection and diffusion, to the cooler zone of the crucible where the\rsolution become supersaturated and crystallization of GaN takes place. The\rcrystals of the surface layer are the natural source of growth centers for\rfurther crystallization. Some of them start to grow faster hindering the growth\rof the neighboring ones. This selection leads to the formation of relatively\rlarge, well shaped GaN crystals on the internal surface of the surface layer. The GaN crystals grown by this method are wurzite, mainly in the form of\rhexagonal platelets or hexagonal needles, depending on the growth conditions. Ageneral tendency is that high supersaturation favors growth in the c-direction\rwhich produces the needle-like crystals. Supersaturation of the growth solution\ris determined mainly by the growth temperature, supercooling, mass transport\rmechanisms in Ga, and also the local surroundings for a particular crystal. Crystals in the form of hexagonal platelets grow slowly, with a rate <0.1\rmm/h into the {10 0} directions (perpendicular to the c-axis). They are\rusually single crystals having perfect morphology suggesting stable layer-by\rlayer growth. They are transparent, colorless, with flat faces. In some cases,\rthree dimensional, hexagonal growth which occurs during the post-growth system\rcooling is observed on the crystal surfaces. Some GaN platelets grown without\rintentional seeding are shown in Figure 6 . For crystallization of large GaN crystals by this method, it is crucial to\rcontrol the supersaturation to avoid acceleration of the growth near the edges\rand corners of the growing crystal. This can occur if some of them reach\rdimensions significantly larger than the others. Then the edge nucleation on\rthe hexagonal faces of the GaN platelets is often observed. This is the first\rstep to unstable growth on these faces. The result of such a growth is shown in Figure 7a . In extreme cases of very high supersaturation or when the\rsupersaturation is abruptly increased (i.e. by increasing the temperature\rgradient), the growth into c-direction, nucleated at the edges of the platelet,\rbecome very fast and leads to the formation of well developed {10 0}\rfaces. This results in a hollow needle-like crystal such as is shown in Figure\r7b. Therefore, for growing of large GaN platelets of stable morphology, the\rsupersaturation must be decreased during the crystallization process inorder to\rprevent the runaway phenomena just described. Therefore for the stable growth of large GaN crystals it is necessary to have\rsufficiently low and uniform supersaturation across the growing crystal faces.\rOne of the most important factors influencing the uniformity of N-concentration\rin the growth zone is the volume of the solution in relation to the size of the\rgrowing crystal. In Figure 8 we show a crystal grown in a crucible with an\rinternal diameter of 17 mm (as opposed to 14 mm previously). The increase in\rthe crucible volume resulted in a significant increase of the size of crystals\rwhich could be grown with stable morphology. We summarize the general tendencies of GaN crystal growth without an\rintentional seeding following from the experimental results: The growth of GaN crystals from a diluted solution in liquid gallium is\rstrongly anisotropic. At lower supersaturations, the fastest growth directions are the [1 0 0 ] ones, perpendicular to the c-axis of the crystal. The growth rate\rin the [ 0 0 0 1 ] directions, parallel to the c-axis is then extremely slow.\rThis results in thin hexagonal platelets. With increasing supersaturation, the rate of the growth parallel to the\rc-axis abruptly increases, resulting in needle like crystals with well\rdeveloped {10 0} faces. We have estimated the supersaturation at which high quality GaN platelet grow\rat a rate of 0.1 mm/h. in the [1 0 0] direction (see Figure 9 ). For\rthe estimation, we assumed two dimensional layer-by-layer growth on the\r{10 0} face of the platelet with a thickness of 0.1 mm and length of\rthe leading edge of 1 mm. We also assumed that the creation of a 2-Dcritical\rnucleus on the crystal face results in the growth of a new layer. That is, the\rlateral growth rate is fast enough to complete the plane before appearance of\rthe next nucleus of the critical size. Aheat of GaN dissolution in liquid Ga\rof 0.49eV/bond (see Introduction) was used as a measure of bond energy in the\rcrystal in relation to the liquid phase. For a crystal growing at 1800K, we have obtained a supersaturation of the order\rof 50%. For the growth of GaN on a seed crystal with well developed\r{10 0} faces, the supersaturation necessary for stable two dimensional\rgrowth can be significantly lower due to large surface area of the fast growing\rplanes. The details of this estimation will be published elsewhere [5] ."
    },
    {
      "tag": "h3",
      "text": "2.3. Seeding"
    },
    {
      "tag": "p",
      "text": "Knowing that GaN in our experimental conditions prefers to grow in a stable\rway in directions perpendicular to the c-axis, we decided to use a needle like\rcrystal to seed the growth on the {10 0} faces. In Figure 10 , we show\rthe seed crystal which was introduced into the cooler zone of the vertical\rcrucible. It had well developed {10 0} prismatic faces and also\r{10 1} pyramidal ones. Ahexagonal surface did not appear due to the\rfast growth of the needle in c-direction. Prior to the growth, it was necessary to heat the system up to\r1200 o Cat low N 2 pressure to achieve wetting of the seed\rwith liquid Ga. If the sysyem were be heated at high pressure, the\rpolycrystalline surface layer would cover the Ga surface adjacent to the seed,\rand eliminate its usefulness for further crystallization. The growth on the seed was performed under conditions where high quality\rplatelets were obtained in previously described processes without intentional\rseeding. The resulting crystal, after 50 hours of growth, is shown in Figure\r11 . The fast growth directions were the [1 0 0], as\rexpected, and also the [1 0 1] one perpendicular to\rthe pyramidal face. Since the growth rate in the c-direction was very small, a\rhexagonal face developed in the resulting crystal. As we know from previous considerations, at low supersaturations, the growth\rrate in c-direction is almost zero whereas at higher supersaturations we fall\rinto the \"difficult\" region of the abrupt increase of the nucleation rate.\rTherefore, the growth on the hexagonal face is difficult to control and\rprobably is very sensitive to fluctuations of temperature, convectional flows\rand uniformity of the nitrogen concentration field in the crystal surrounding.\rThis can easily lead to three dimensional nucleation or to edge instabilities\rof the growth."
    },
    {
      "tag": "h2",
      "text": "3. Physical Properties of GaN crystals"
    },
    {
      "tag": "p",
      "text": "The quality of the GaN crystals was estimated by X-ray rocking\rcurves [6] . The full width at half maximum (FWHM) of the X-ray\rrocking curves ((0004) CuK reflection) depends on the size of the crystal. The\rvalue is 20-30 arcsec for 1mm crystals and 30-40 arcsec for 1-3 mm ones. For\rlarger platelets the rocking curves split into a few 30-40 arcsec peaks showing\rthe presence of low angle (1-3 arcmin) boundaries separating grains of 0.5-2 mm\rin size. Misorientation between grains increases monotonically from end to end\rof the crystal [7] . This indicates a \"bending\" of the crystal during growth,\rfollowed by strain relaxation leading to the formation of the low angle\rboundaries. Indeed, the lattice constantsmeasured for the two basal planes of\rthe crystals differ by 0.001 » , suggesting different growth mechanisms and\rdefect structures for the two polar directions of the GaN platelet. It was\rshown by Liliental-Weber et al. [8] by TEM examination and confirmed by AFM\rstudies [9] , that one of the polar surfaces of the GaN crystals (especially for\rthe smaller ones) is often atomically flat (2-3 monolayer steps present) and\rthe crystal below is practically free of extended defects. However a high\rconcentration of point defects, mainly N-vacancies and Ga-antisites, were\rdeduced from Convergent Beam Electron Diffraction patterns [8] . On the opposite\rside, regular pyramids of 100 - 200 » in size terminate the surface [8] [9] .\rBelow are many extended defects such as stacking faults, dislocation loops and\rGa micro-precipitates. Such pecularities result from the different growth modes\rof the two polar directions of the crystal in the Ga-rich conditions of the\rprocess. For larger (>3 mm) GaN plateletes, the presence of three dimensional\rhexagonal features on the surfaces is typical. This results from the system\rcooling after the growth in the temperature gradient. The GaN crystals are highly conductive, showing metallic behavior in the whole\rtemperature range of 4.2-300K. Free electron concentration of 10 19 -\r10 20 cm -3 with mobilities of 30-90 cm 2 /Vs [10] are present regardless of temperature. No clear dependence of the electrical\rproperties on the growth conditions has been observed. Both ab initio calculations of electronic structure of GaN native defects [11] [12] and\rexperiments [13] confirm that the source of free electrons in this GaN is\rN-vacancies. The optical absorption spectra of pressure-grown GaN crystals and epitaxial\rGaN layers with a free electron concentration of 6x10 17 cm -3 have been measured by Teisseyre et al. [14] . Ashift to high\renergy of the optical absorption edge for the bulk sample is observed and\rassigned to the Burstein-Moss effect [14] . Due to this shift, the bulk GaN\rsubstrate crystals are transparent to near edge luminescence of GaN. The dominant luminescence features of GaN bulk crystals are near band edge\remission at ~3.5 eV and a broad yellow luminescence band centered around 2.3\reV."
    },
    {
      "tag": "h2",
      "text": "4. GaN homoepitaxy"
    },
    {
      "tag": "p",
      "text": "The first results of homoepitaxial growth of GaN MOCVD layers have been\rrecently reported [15] . Pressure grown GaN crystals were used as substrates.\rThe layers were grown in a horizontal atmospheric pressure Epigress system\radapted to the growth of nitrides. TMG and NH 3 were used as sources\rof Ga and N, and H 2 was the carrier gas. The substrates did not\rrequire any mechanical or chemical surface treatment before the growth. Also\rthe deposition of a low temperature buffer layer was omitted. The growth\rtemperature was 900 - 1050°C. P-doping was realized using the\rMCp 2 Mg metalorganic and subsequent annealing of the layer at\r700°Cin the presence of N 2 gas. Si was introduced to\rachieve n-doping of the layers. Atomic Force Microscopy studies performed on homoepitaxially grown GaN layers\rindicate the presence of monatomic steps on the layer surfaces, often in the\rform of large diameter (100 m) spirals indicating two dimensional growth on\rscrew dislocations. The X-ray diffraction peaks from the homoepitaxial layer and from GaN\rsubstrate from [7] are shown in Figure 12 . The lattice constant parallel to the\rinterface is the same for both the substrate and homolayer, whereas the c\rconstant of the epilayer is smaller by about 0.02%. The increase of the c\rlattice constant of the bulk GaN crystals is related to the presence of the\rsame point defects responsible for the high concentration of free electrons. The high quality of the homoepitaxial layers is confirmed by the\rphotoluminescence measurements [15] . The spectrum is dominated by two strong\rand narrow lines XD (3.4719 eV) and XA (3.4666 eV) related to the excitons\rbound to neutral impurity centers [15] . The FWHM of these lines is about1.8 meV\rand 1.0 meV respectively. The higher energy XD line shows a double peak\rstructure which fitted with Lorenzian curves can be described by energies:\rE 1 = 3.4711 eV, E 2 = 3.4720 eV. The photoluminescence and\rreflectivity of GaN homoepitaxial layers are analyzed in detail in [15] . Also\rthe lifetime of the bound excitons has been measured [16] to be 650 and 700 ps\rfor excitons bound to the neutral donor and acceptor, respectively. This is\rmuch higher than the corresponding values for GaN/sapphire (70 and 140 ps,\rrespectively). The PL spectra for p-type Mg doped GaN homoepitaxial layers have been reported [17] . In addition to the XD and XA exciton lines (XA line much stronger than\rfor undoped layers), a series of very narrow lines attributed to donor-acceptor\rpair related transitions have been observed between 3.4 - 3.5 eV. The FWHM of\rthese lines were < 0.5 meV. The PL lines observed for MOCVD grown\rhomoepitaxial layers are the narrowest so far reported for GaN. Recently very high quality homoepitaxial layer have been obtained by MBE [18] .\rThe nearedge photoluminescence spectrum of this layer is dominated by XD and XA\rpeaks and 3 lines corresponding to free excitons. The PL lines for this layer\rare even sharper than for best MOCVD samples. The halfwidth of the XA line is\rsmaller than 0.5 meV"
    },
    {
      "tag": "h2",
      "text": "5. Conclusions"
    },
    {
      "tag": "p",
      "text": "High quality GaN crystals can be grown at nitrogen pressure up to 15\rkbar. The main obstacle to growing larger substrate sized GaN crystals is\rinstability of the growth. The instability is related to the non-uniform\rdistribution of nitrogen in the solution due to the small volume of the\rcrucible in relation to the size of growing GaN crystals. It is shown that high quality homoepitaxial layers can be obtained on the \"as\rgrown\", single crystalline, pressure grown GaN substrates. Further optimization\rof both substrate and homoepitaxial growth techniques should lead to the\rfabrication of efficient optoelectronic devices. Special effort has to be paid\rto increasing of the size of high quality GaN substrates."
    },
    {
      "tag": "h2",
      "text": "Acknowledgments"
    },
    {
      "tag": "p",
      "text": "The research reported in this work has been supported by the Polish Committee for ScientificResearch grant # 7 7834 95 C/2399. tail"
    },
    {
      "tag": "h2",
      "text": "References"
    },
    {
      "tag": "p",
      "text": "[1] W. A. Harrison, Electronic Structure and Properties of Solids, Freeman, San Francisco, (1980) (No journal name recognized.) [2] J. Karpinski, J. Jun, S. Porowski, J. Cryst. Growth 66 , 1 (1984). [3] J. Karpinski, S. Porowski, J. Cryst. Growth 66 , 11 (1984). [4] J. A. Van Vechten, Phys. Rev. B 7 , 1479 (1973). [5] I. Grzegory and S. Porowski, unpublished. (The title must be entered, and surrounded by quote marks.) [6] M Leszczynski, I Grzegory, M Bockowski, J. Cryst. Growth 126 , 601-604 (1993). [7] M. Leszczynski, I. Grzegory, H. Teisseyre, T. Suski, M. Bockowski, J. Jun, S. Porowski, J. Crystal Growth, unpublished (1996). [8] Z. Liliental-Weber, C. Kisielowski, S. Ruvimov, Y. Chen, J. Washburn, I. Grzegory, M. Bockowski, J. Jun, S. Porowski, J. Electron. Mater. 25 , 1545 (1996). [9] G. Nowak, S. Krukowski, I. Grzegory, S. Porowski, J.M. Baranowski, K. Pakula, J. Zak, MRS Internet J. Nitride Semicond. Res. 1 , 5 (1996). [10] P. Perlin , J. Camassel, W. Knap, T. Taliercio , J. C. Chervin , T. Suski, I. Grzegory, S. Porowski , Appl. Phys. Lett. 67 , 2524-2526 (1995). [11] P. Boguslawski , E. L. Briggs, J. Bernholc , Phys. Rev. B 51 , 17255-17258 (1995). [12] Jorg Neugebauer, Chris G. Van de Walle , Phys. Rev. B 50 , 8067-8070 (1994). [13] P. Perlin, T. Suski, H. Teisseyre, M. Leszczynski, I. Grzegory, J. Jun, S. Porowski, P.Boguslawski, J. Bernholc, J. C. Chervin, A. Polian, T. D. Moustakas , Phys. Rev. Lett. 75 , 296-299 (1995). [14] H. Teisseyre, P. Perlin, T. Suski, I. Grzegory, S. Porowski, J. Jun , A. Pietraszko , T. D. Moustakas , J. Appl. Phys. 76 , 2429-2434 (1994). [15] K Pakula, A Wysmolek, KP Korona, JM Baranowski, R Stepniewski, I Grzegory, M Bockowski, J Jun, S Krukowski, M Wroblewski, S Porowski, Sol. St. Comm. 97 , 919-922 (1996). [16] M. Godlewski, A. Wysmolek, K. Pakula, J. M. Baranowski, I. Grzegory, J. Jun, S. Porowski, J. P. Bergman, B. Monemarin Proc. of Intl. Symp. on Blue Lasers and Light Emitting Diodes , , (Chiba, Japan,  March 5-7, , 1996) 356. [17] A. Wysmolek, J. M. Baranowski, K. Pakula, K. P. Korona, I. Grzegory, M.Wroblewski, S. Porowskiin Proc. of Intl. Symp. on Blue Lasers and Light Emitting Diodes , , (Chiba, Japan,  March 5-7, , 1996) 492. [18] H. Teisseyre, G. Nowak, M. Leszczynski, I. Grzegory, M. Bockowski, S. Krukowski, S. Porowski, M. Mayer, A. Pelzmann, Markus Kamp , K. J. Ebeling, G. Karczewski, MRS Internet J. Nitride Semicond. Res. 1 , 13 (1996). Figure 1 . \r Gibbs free energy of GaN and its constituents Figure 2 . \r Equilibrium curve for GaN [2] [3] Figure 3 . \r Liquidus line for the Ga-GaN system Figure 4 . \r Experimental system for the crystal growth of GaN at N 2 pressure up to 15 kbar. Figure 5 . \r Crystallized GaN surface layer at high N 2 pressure Figure 6a . \r GaN single crystals grown without an intentional seeding. The underlying grid is 1mm x 1mm. Figure 6b . Figure 6c . Figure 6d . Figure 7a . \r Edge-nucleated growth on the {0001} faces at high supersaturation. Figure 7b . \r  Initially plate-like growth changes into the needle-like type due to the increase of supersaturation during the growth. Figure 7c . \r  Schematic of unstable growth of a GaN platelet at high, non-uniform supersaturation in the solution. (a) edge-nucleated growth on the {0001} faces at high supersaturation, (b) initially plate-like growth changes into the needle-like type due to the increase of supersaturation during the growth. Figure 8 . \r GaN crystal grown in a 150h process in the crucible having an ID of 17 mm. Figure 9 . \r GaN crystal growing quickly perpendicular to the c-axis Figure 10 . \r GaN crystal used for the intentional seeding Figure 11 . \r GaN crystal grown on a GaN single crystalline seed. Figure 12 . \r Diffraction peaks of (0004) CuK reflection from an MOCVD grown GaN heteroepitaxial layer and GaN substrate. footer © 1996-1999 The Materials Research Society M R S Internet Journal of Nitride Semiconductor Research"
    }
  ]
}