{
  "url": "http://observantlittle.blogspot.com/2005/06/dr-death-enquiry.html",
  "file_number": "129",
  "content_hash": "d8afa9d8efd2f4ce2d5ce222db242749ae95581ce6acfb964ce3570abdee9923",
  "total_blocks": 75,
  "retained_blocks": 29,
  "ignored_blocks": 46,
  "blocks": [
    {
      "tag": "div",
      "text": "Notify Blogger about objectionable content. What does this mean? BlogThis! Outer Dark Brown Container / Centers Content Top Paper Graphic Blog Header"
    },
    {
      "tag": "h1",
      "text": "Observant little ..."
    },
    {
      "tag": "p",
      "text": "Idon't understand the answer, but Imay have some ideas on the question..."
    },
    {
      "tag": "div",
      "text": "End Blog Header Begin #profile-container"
    },
    {
      "tag": "h2",
      "text": "About Me"
    },
    {
      "tag": "dd",
      "text": "Name: OLS Location: Brisbane, Queensland, Australia"
    },
    {
      "tag": "p",
      "text": "My family refer to me as the \"observant little s**t\" after a couple of things Imentioned about them or others that hit a little too close to home.  One was my cousin's lip curl whenever she said the word \"teacher\".  Another was that my mother thought she never pushed us kids... in fact, her ethos was more like \"Thou shall succeed... if you really want to!\" You can email me at the email address in my profile, but that address isn't checked often, so commenting on my blog is actually a faster way to get my attention. View my complete profile"
    },
    {
      "tag": "div",
      "text": "End #profile Main Content Area (This shows background image) Begin #sidebar :: left column :: blog archives, links Creative Commons License This work is licensed under a Creative Commons License . /Creative Commons License <rdf:RDF xmlns=\"http://web.resource.org/cc/\"\n    xmlns:dc=\"http://purl.org/dc/elements/1.1/\"\n    xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\">\n<Work rdf:about=\"\">\n   <dc:type rdf:resource=\"http://purl.org/dc/dcmitype/Text\" />\n   <license rdf:resource=\"http://creativecommons.org/licenses/by-nd/2.0/\" />\n</Work>\n\n<License rdf:about=\"http://creativecommons.org/licenses/by-nd/2.0/\">\n   <permits rdf:resource=\"http://web.resource.org/cc/Reproduction\" />\n   <permits rdf:resource=\"http://web.resource.org/cc/Distribution\" />\n   <requires rdf:resource=\"http://web.resource.org/cc/Notice\" />\n   <requires rdf:resource=\"http://web.resource.org/cc/Attribution\" />\n</License>\n\n</rdf:RDF> The Cast of Characters Today I'm feeling: a bit of culture, a bit of music Boyfriends vs boy friends \"we don’t think clients are God\" child support my heart's desire advocacy skills Intolerable tollerance lessons birthday parties, girly nights and refugee benefits Women in Docs getting where you're going"
    },
    {
      "tag": "h2",
      "text": "Brisbane bands/ musicians Ilike: Acre AfroDizziAct The Boat People Charles Foster Kane Dave McCormack Doch george Guy Webster The Informants Lancaster Shifter Speedstar Taxi Tylea Women in Docs Zephyr Timbre [if no website, try brispop.com (link below) for info] Other bands/ musicians Ilike: Augie March Ben Folds / Ben Folds Five Damien Rice The Frames Jeff Buckley Matthew Sweet Mercury Rev Sarah McLachlan Suede + many more Links to music sites Ilike: BrisPop - lists local artists, venues and gigs Rockinghorse - music store in Brisbane Skinnys - music store in Brisbane Rics - one of my favourite venues The Zoo - one of my favourite venues Blogs Iread Non blo.gs blogs:"
    },
    {
      "tag": "div",
      "text": "Any Resemblance Diary of an Average Australian Kangaroo Court Stay of Execution START Women of Oz Code ‹‹ # Women \n    of Oz ? ›› END Women of Oz Code Who Links Here <p>This is a paragraph of text that could go in the sidebar.</p> Begin #main :: right column :: blog entry content Begin .post"
    },
    {
      "tag": "h3",
      "text": "Dr Death enquiry"
    },
    {
      "tag": "p",
      "text": "Acompletely law-related post today.  For the non-lawyers, if you want to read on, the whole point of the following is that no government department is an entity capable of suing or being sued.  If you want to sue a Queensland government department, then you sue \"The State of Queensland\" or you sue the chief executive of that department - usually, it's the first. Lushlife referred me to the Dr Death inquiry transcripts which included this amusing little exchange on Day 1 between Tony Morris (the Commissioner - there's a photo of him down the bottom of the page here ) and David Boddice (for \"Queensland Health\" - you'll why I've put that in inverted commas if you read on), both of whom are Senior Counsel, though Tony at #34 is more highly ranked than David at #72.  I've highlighted in bold the parts that particularly amused me: COMMISSIONER: Thank you, Mr Boddice, for those very helpful submissions. Ipersonally have no difficulty with the proposition which you advance as to why Queensland Health has an interest in this matter or the criteria which should be taken into account in granting or refusing leave. My difficulty at the moment is in understanding precisely who or what it is that you will be representing. Itake it from what you have said so far that you are not proposing to represent all of the staff of Queensland Health? MR BODDICE: Yes, except to the extent of it causes a conflict or they seek separate representation. COMMISSIONER: Then how do we know which of the staff you are representing and which you are not? MR BODDICE: Because, as Iunderstand the system that applies, staff who seek representation make application to the Attorney's Department, a division of it, and a decision is made as to whether to grant indemnity or not. If they are granted indemnity, Irepresent those people. If it is of concern to the Commission Ican indicate at each time whether Irepresented that person or not. COMMISSIONER: Ithink the difficulty arises at an earlier stage, though, whether - counsel, consisting of investigative staff, going out and interviewing people, how do we know in advance whether it is a client of yours or not? For example, our first witness today is going to be Ms Hoffman. At the stage when we were interviewing Ms Hoffman, how were we to know whether you were going to be appearing for her or not? Iassume you are not, by the way? MR BODDICE: Not that Iam aware, no. Idon't understand she has sought leave - Idon't understand she has sought representation. COMMISSIONER: You will see the difficulty, don't you? Who do your instructions come from? Is it the Director-General? MR BODDICE: They come from the Director-General, and Isuppose ultimately----- COMMISSIONER: Or the Minister? MR BODDICE: And the Minister as well. COMMISSIONER: Well, isn't there a potential conflict there? Isn't it a situation where ultimately this inquiry will have to determine if there are problems within the department, whether it is a situation where the Minister was informed of the problem and did nothing about them, or whether it is a situation where the department withheld relevant information from the Minister? MR BODDICE: No, because in my submission Iam there representing the department, and as has been stated in public and Istate publicly now, Queensland Health intends to cooperate fully, and all documents that have been asked forhave been provided and will be continued to be provided. COMMISSIONER: We will come back to that in a moment. Do you have instructions to represent the Minister? MR BODDICE: Iexpect that Iwill do. COMMISSIONER: Ican't give leave on the basis of your expectation. Will you get those instructions and inform the inquiry whether you are representing the Minister? Do you represent the Director-General. MR BODDICE: At the moment Iseek leave to represent Queensland Health. COMMISSIONER: Iam not going to give leave on that basis. Do you have instructions to represent the Director-General? MR BODDICE: Iexpect when the Director-General is called to give evidence, Iwill have instructions to represent him while he is giving evidence. COMMISSIONER: Only while he is giving evidence, not in cross-examining other witnesses? MR BODDICE: Iexpect, as is consistent with my instructions, Iam here to represent Queensland Health, which is the entity. COMMISSIONER: It is not an entity, that's the problem. Queensland Health is a branch of the Government of Queensland. To say you are representing Queensland Health is like saying you are representing the Stones Corner Branch of the Commonwealth Bank. It is not a separate and distinct entity, it is part of the Crown right of the State of Queensland. MR BODDICE: Iunderstand that, but it is the organisation responsible for the running of the hospitals and it is that organisation Iam seeking leave to represent. COMMISSIONER: And that's where Ihave difficulty in understanding where you draw the line. If you speak about it as an organisation, that presumably means all of its staff, and you will be protecting the interests of all of its staff. If it is something less than that, Iwould like to know what it is, whether it is only the Director-General, whether it is the Director-General and its deputies. You refer to the Fitzgerald Inquiry. My recollection was Mr Callanan was given leave to appear for the Commissioner and Deputy Commissioners of the Queensland Police Service, or natural persons, rather than the Police Service as an entity. That may be mistaken. MR BODDICE: That's not correct, with respect. In fact, they were separately represented by other counsel, as were, of course, the union----- COMMISSIONER: Yes. MR BODDICE: -----separately represented by other counsel. COMMISSIONER: In this case we have got - as Iunderstand, the Queensland Nurses' Union will be seeking leave to appear. They obviously will represent a great number of people who are members of the staff of the department that you are purporting to speak for, the AMA Queensland will be seeking leave to appear. They obviously represent quite a number of the people that you are purporting to speak for. Ijust can't see practically how you can say, \"Iappear for the department\", without identifying in what sense you appear for the department. MR BODDICE: That must be the difficulty that confronted the Fitzgerald Inquiry. COMMISSIONER: Well, perhaps the decision was wrong or perhaps the circumstances were so different that it didn't matter, but in this case, given the structure of Queensland Health, the zones and regions, and so on, before giving leave Iwould like to know quite specifically whose interests you are representing. If it were, for example, the council or the committee operating Bundaberg Hospital, they might have quite different views about the matters arising here from the Director-General or other staff in Charlotte Street. MR BODDICE: Yes. COMMISSIONER: Again, Ican't see how you can possibly get around the conflict of interest that arises from representing on the one hand the interests of the bureaucrats in Charlotte Street, and on the other hand representing the interests of people who are operating the hospital on the ground in Bundaberg. MR BODDICE: That, with respect, assumes there is a conflict in those interests. COMMISSIONER: Ithought you just agreed that there was. Those parties would have quite different views as to the likely outcome of the appropriate recommendations and findings of this inquiry. MR BODDICE: Idon't think that necessarily follows at all, with respect. COMMISSIONER: Well, do you have instructions? Have you spoken to the people from Bundaberg? Do you know what they are hoping to get out of this inquiry? MR BODDICE: Ihave instructions to act for Queensland Health. COMMISSIONER: Who gave you those instructions? MR BODDICE: Pardon? COMMISSIONER: Who gave you those instructions? MR BODDICE: Those instructions came, Iam instructed, through the Crown Solicitor. COMMISSIONER: Yes, and who gave the Crown Solicitor his instructions? MR BODDICE: Iexpect it would have been the Director-General. COMMISSIONER: Well, Iam inclined at the moment to give you leave to represent the Director-General, if you wish to have such leave. MR BODDICE: Well, they aren't my instructions at the moment. COMMISSIONER: Iwill adjourn your application until you have got instructions identifying quite specifically who it is that's going to be represented here. Not just some nebulous, amorphous body that's referred to as Queensland Health, but some quite specific description of who it is who is going to be actually represented, who is going to be the source of your instructions, and whose viewpoint is going to be expressed to this inquiry through you and your learned juniors speaking on behalf of those who give you those instructions. MR BODDICE: Iwill get those instructions. COMMISSIONER: Thank you, Mr Boddice. Also for the lawyers, this calculator which shows you just how much time you have to put into the office to meet your billable hours requirement in private practice.  Note:  Idon't think that any lawyer can get away without at least 1 hour private time, 1 hour professional time and 1 hour administration time. (via the dark goddess of replevin )"
    },
    {
      "tag": "h3",
      "text": "Listening to:  Garbage - Beautiful Garbage"
    },
    {
      "tag": "p",
      "text": "posted by OLS | \n                        Wednesday, June 15, 2005 | 9:37 AM"
    },
    {
      "tag": "div",
      "text": "End .post Begin #comments"
    },
    {
      "tag": "h4",
      "text": "3 Comments:"
    },
    {
      "tag": "dt",
      "text": "Lushlife said..."
    },
    {
      "tag": "p",
      "text": "What Icouldn't believe is that after Morris put him through all this  rigamarole of who exactly it is that Boddice is or is not representing, Ithink  by the end of the day Boddice got up to withdraw entirely from proceedings which he did not have leave to appear and then at this point Morris turned around and permitted him to appear as Boddice originally requested.What a waste of time! Have you heard of the Justinian - its a rag which is put out by some unidentified barristers - and it pokes a bit of fun at lawyerly behaviour. In the lateset article,  Morris is referred to as \" Lord Eldon\" - apparently because when he took Silk - he was found in the Supreme Court library researching the fact that he was the youngest person to take silk since \"Lord Eldon\"."
    },
    {
      "tag": "dd",
      "text": "12:42 PM"
    },
    {
      "tag": "dt",
      "text": "Lushlife said..."
    },
    {
      "tag": "p",
      "text": "http://www.justinian.com.au/ This is the link to the article however there is a catch worth the price of $235 per annum - something Iam not willing to part with at the moment. Ithought you might be interested or find someone else who is already a member to obtain the article it's a ripper."
    },
    {
      "tag": "dd",
      "text": "12:55 PM"
    },
    {
      "tag": "dt",
      "text": "OLS said..."
    },
    {
      "tag": "p",
      "text": "Hey Lushlife - thanks for those.  Iwasn't going to reply to your comments until I'd read some more of the transcript and could add something to the thread, but Ihaven't got there yet, so Ithought I'd reply/comment now. Ican see that about Tony Morris - he's obviously very proud of having taken silk at such a young age.  Still, Ihave no idea who Lord Eldon was, so the analogy has always been lost on me! ;o) I'm still looking for someone who has access to the Justinian... it sounds like something I'd really enjoy reading. - OLS"
    },
    {
      "tag": "dd",
      "text": "6:27 PM"
    },
    {
      "tag": "p",
      "text": "Post a Comment << Home"
    },
    {
      "tag": "div",
      "text": "End #comments Begin #footer :: bottom area"
    },
    {
      "tag": "p",
      "text": "Copyright &copy; 2004 [Your name] (plus any additional footer info)"
    },
    {
      "tag": "div",
      "text": "End #main-content Bottom Paper Graphic WEBBOT bot=\"HTMLMarkup\" startspan ALT=\"Site Meter\" WEBBOT bot=\"HTMLMarkup\" Endspan Start of StatCounter Code End of StatCounter Code"
    }
  ]
}