{
  "url": "http://parents.berkeley.edu/advice/babies/laundry.html",
  "file_number": "139",
  "content_hash": "01d2d66463ededad2f080e046bb746ced1f3dab739451eb2c37d882d2be0deff",
  "total_blocks": 41,
  "retained_blocks": 6,
  "ignored_blocks": 35,
  "blocks": [
    {
      "tag": "div",
      "text": "Berkeley Parents Network"
    },
    {
      "tag": "div",
      "text": "Home Members Post a Msg Reviews Advice Subscribe Help/FAQ What's New Search"
    },
    {
      "tag": "h2",
      "text": "Laundering Baby Clothes"
    },
    {
      "tag": "p",
      "text": "Berkeley Parents Network > Advice > Babies > \nLaundering Baby Clothes Should Iuse special detergent for baby's laundry? Removing food stains from baby's clothes More advice about Laundry Detergents"
    },
    {
      "tag": "h4",
      "text": "Should Iuse special detergent for baby's laundry?"
    },
    {
      "tag": "p",
      "text": "Jan 1999 Iam expecting our first child in a month.  Iwould like to learn how\npeople do their laundry with baby clothes.  There are expensive,\nspecially-for-baby brands of detergents (Dreft, Ivory snow) that people\nrecommended, and that probabily means doing baby laundry separately and\nspending even more $$..  Iwonder if the dye-free, perfume-free detergent\n(maybe plus one more rinse cycle) would also work for baby's delicate\nskin. \n\n  How about fabric softeners and dryer sheets?\nCherri My son, now three years old had severe eczema.  We were very careful to\nonly use detergents without fragrance or dyes.  Tide and Cheer both have\nproducts that worked well for us.  For the dryer we did the same - we\nuse Bounce without fragrance.  Ihave washed our clothes together and\neverything held up well. We washed our clothes separately from the baby clothes for about a week. We\nhave always used detergent with no perfumes or dyes, so that was never an\nissue. Iunderstand that using fabric softener on cloth diapers and diaper\nwraps makes them less absorbent.\nLaurel What worked well for us was washing once with a dye-free,\nperfume-free detergent, then running the clothes through\nthe full wash cycle again with no detergent. We had no problems with baby's skin.  Ithink the extra\nrinse is important, as I've often noticed suds on the\nclothes if Iopen the washer right after the regular\ncycle is done.  The soap isn't thoroughly rinsed out of\nthe clothes in the regular cycle (at least with my\nwasher).\nCecilia Idid what you've already suggested - dye-free, perfume-free detergent \nwith an extra rinse - when my daughter was a baby and it seemed to work \nfine.  Although Ihad purchased Ivory, Ifound out later that you can't \nuse it on sleepwear for baby/children since it is a soap and will remove \nthe flame retardants. As for softeners/dryer sheets - Inever used them because the fragrance \njust seemed to chemically to me.  Ididn't want that next to the baby.\nCathy We don't use fabric softeners for a variety of reasons. But we found that\nour daughter's skin responded best to the dye- and perfume-free mainstream\ndetergent (All or Arm & Hammer, etc.). Everything else, including all the\nexpensive guilt-marketed baby stuff, gave her a rash. \nLaura Laundry soap for babies: For my own and my daughter's clothes, Iuse plain\nold unscented Trader Joe's laundry detergent. It's cheap and concentrated\nso a box or bottle (comes in powder or liquid) lasts a long time. I'm\nallergic to almost all scents in brand-name products, and the smell of\ntalcum powder literally makes me gag and gives me a headache, so Iavoid\nmost \"baby\" products. The clothes come out smelling and looking fine to me,\nand when time and weather permit, Idry them on the line outside rather\nthan in the dryer, and then they smell super, though they might not be as soft.\nNicole Inever did my baby's laundry separately, but I've always used Dye-Free,\nperfume-free detergent for my own sensitive skin.  It seems to work just\nfine, and Ihaven't ever done a second rinse.\nDawn We have used Tide Free with for our child's clothes since she was born.\n(She is now almost 20 months old). We wash all of the family's clothes\ntogether, and have not had a problem with this method. Good luck, Gail\nGail Ido a separate load of baby clothes, sheets, towels, etc. every week,\nall colors and fabrics together, with Dreft and warm water, and it has\nworked out fine.  My son does not have problems with his skin, so Iprobably could use scent- and dye-free Tide or the like, but have not as\nyet.  Such products are very harsh, however, so Iwould want to do at\nleast one *warm* rinse.  The other detergent we have used, both for\nourselves and the kid, is an environmentally friendly liquid laundry\nproduct, Ecover, that we get at Whole Foods or the Berkeley Bowl.  It\ncomes in several sizes, including a biggish plastic bottle, and is fine\nfor baby clothes.  It is not a particularly \"budget\" product, however.\nIprefer to do the kid's wash separately, so that Ican better control\nwhat he's exposed to, and it's not a problem to collect one load over\nthe course of 4-7 days.  As to dryer sheets and fabric softeners - Ithink those are a big waste of money and that you'd be better served\nbuying the milder soap or detergent.  Have fun. \nWendy Many babies are sensetive to the perfume and dyes in detergents.\nBelieve it or not, Dreft has fragrance and even though some babies are\nok with that, our pediatric dermetologist recommended All Free and\nClear as a better option.  Absoutely NO FABRIC SOFTNER OR DRYER SHEET.\nEven adults should really not use them if they have any sensetivities.\nIwas allergic to them though Idid not find that out till this year.\nSuddenly all my allergies disappered when Istopped using them.\nDowney makes a \"downey free\" but why bother??  If you want to talk\nsome more, email me.\nGlosson About washing baby clothes:  I've been washing all of my daughter's (9 1/2\nmos) clothes with regular detergent (Tide, usually) since she was born.  Idid one load after she got home with Tide and tried the clothes on her,\nkeeping an eye out for reactions, and had no problem.  This has worked for\npretty much all of the other moms that Iknow.  I'd say give it a shot\nbefore going out and investing in all the special detergents.  At least\nthat way, if you do have to use them, you'll know it's because that's what\nyour baby needs.  Good luck!\njocelyn Regarding detergent and baby clothes.\nNot all babies have sensitive skin.  Ihave always washed both my kids\nclothes with our clothes and with our regular detergent, Arm and Hammer\nscent free, and it has never been a problem.  We don't use any fabric\nsofteners though.  But some of my friends babies skin are more sensitive,\nand they use special detergent.  Hopefully you won't have to.\nLiz Ihave had no problems washing my baby's clothes with perfume-free, dye-free\ndetergents; All, Tide, and Arm and Hammer all work, without even an extra\nrinse cycle. (Idon't use much soap, since it's not as tough the clothes\nhave ground-in dirt or anything.) She's five months old now, and we've been\ndoing this since she was bornwith no sign of any allergic reaction. Your\nbaby's skin may be more prone to irritation, but otherwise Isee no reason\nto spend the extra money on Dreft etc.\nCouldn't tell you about fabric softeners and dryer sheets, though, 'cause Idon't use either.\nJennifer One more point about fabric softeners that wasn't made by responders so\nfar--the allergy doctor at Kaiser who treats my toddler for excema pointed\nthat IF Ichoose to use a fabric softener, it should be the kind Iput in\nthe washing machine, not the sheets one adds to the clothes in the dryer,\nwhich work by coating the clothes (with a wax, Ithink) and is definitely\ngoing to contact the skin, even if it is scent-free.  The fabric softener in\nthe washer is less likely to be right on the surface of the cloth in contact\nwith skin--it either penetrates into the fibers or is rinsed out or\nboth--can't remember that part of the explanation.\nsally We were both grad students when our son (almost 3) was born, and we\ndidn't have time to do separate laundry, so Idecided to use the\nall free (perfume-free, dye-free (unfortunately not also expense\nfree!)) soap and it worked great. Be sure to wash all new clothes before the baby wears them too.\nIwas happy that this worked since several people in my family\nhave severe skin allergies, so Iwas on the look-out for any\nadverse reaction.\nHeather Home | Reviews | Advice | Members | Post a Message Join BPN | Help | What's New | Search Please send questions and comments to Berkeley Parents Network . Last updated: May 15, 2006 © 1996-2006 Berkeley Parents Network The opinions and statements expressed on this website \nare those of parents who subscribe to the Berkeley Parents Network . Please see our Disclaimer for details."
    }
  ]
}