{
  "url": "http://pmo-sun.uoregon.edu/~pmo/class_outreach_gen_overview_nov03.html",
  "file_number": "143",
  "content_hash": "71f5d0564562c478d9744b4a8645f9fedcd6edd6cfd01f0c6b228af029002e52",
  "total_blocks": 13,
  "retained_blocks": 2,
  "ignored_blocks": 11,
  "blocks": [
    {
      "tag": "div",
      "text": "doctype PUBLIC \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "div",
      "text": "CLASSROOM\nOUTREACH GENERAL OVERVIEW  2006-2007: This is our 15th year doing outreach around the State of Oregon and\noccasionally\ninto Washington and California.  We visit approximately 300\nclassrooms\neach school year, fairly evenly distributed in grade levels. LOGISTICS OF OUTREACH SESSIONS: (contents in next section) General Info:  I'm (Rick Kang) probably the person that will come\nto\nyour classroom.  The program is a collaborative extension of\nUniversity\nof Oregon's Professor Greg Bothun's \"Electronic Universe\" project (see http://zebu.uoregon.edu ). We may have other outreach instructors available during the year,\nparticularly\nin the Portland and Central Oregon areas.  We create specific\nsessions\nfor each class, grade appropriate, and addressing specific topics you\nwant\ncovered. The program fits into many areas of science curriculum FOR ALL GRADE\nLEVELS\nINCLUDING EARLY ELEMENTARY.  Content tie-ins can be forces,\nmotion,\ncycles, electricity, matter and energy, radiation/waves, general\nphysical\nscience, and some areas of geology, meteorology, and ecology. \nWithin\na specific Earth Science/Astronomy program, the Electronic Universe can\nserve\nwell as an introduction to how we probe deep space as well as answering\nstudents'\nquestions later on and providing a capstone conclusional activity such\nas\none of our digital labs (see below for details). The overall program is called the Electronic Universe because we use\nand\npresent a lot of electronics and digital technology.  We feature\nthree\nmajor digital items: Professor Bothun's new JAVA (interactive\nweb-based)\nvirtual physics labs/demos, projects using a CCD (digital camera), and\nOregon\nResearch Institute's new Sun-Earth-Moon virtual reality software. Ilike at least 60-90 minutes, but we can do a 30-45 minute session or\nmultiple\nsessions.  Idon't mind doing several repeat sessions during a\nday. \nMinimally, Ibring a laptop and LCD projector, so the room needs to\nhave\na screen, be darkenable, and have a table for the projector and\ncomputer. \nIf we are doing any of the technology pieces, then Ibring in a\nportable\nCCD Camera and/or a small Telescope.  If we are doing basic Solar\nSystem/Sun-Earth-Moon,\nwe may do some activities outdoors (scale models, and solar viewing). For the technology/measuring the sky program, there is extensive\nhardware\nsetup, about 30 minutes, and also similar take-down time, and several\nboxes\nof gear to transport, so placing me in one location and rotating\nclasses\nin works best.  Since we do a lot of \"hands-on\" activities,\nclasses\nshould be under 30 students.  We have found that \"assemblies\"\ndon't\nwork for our main inquiry-based type of program.   If you'd\nlike\na show-and-tell or pictureshow type of general program for an assembly,\nthat\ncan be arranged, but our program is primarily an inquiry-based\nintroduction\nto the science of astrophysics, with a lot of participatory activities. My schedule can get booked full particularly in the Spring, so please\ncontact\nme several weeks in advance if possible. Costwise, this year (2005)we are requesting between $10 and $100 per\nschool, regardless of number\nof classes done, on a sliding scale, generally proportionate to the\nnumber of classes done but with consideration of available school\nbudget. (Example: 1 small class would be $10, a small “assembly” or\nmorning’s worth of individual classes might be $30, a multi-day\npresentation to six classes would approach $100.)  This amount\ngoes to Friends of Pine Mountain Observatory, not to the instructor,\nand  is used to offset our overhead costs, primarily the\nproduction/distribution of the prep video, curriculum materials, and\nhardware usage.  NASA's Oregon Space Grant currently covers\ninstructor cost and travel costs for trips throughout western\nOregon.  For extended distant trips, we may request some\nadditional funding to help cover the travel expenses.  Visiting\nmultiple destinations during one trip will help share costs. CONTENTS OF OUTREACH CLASS SESSIONS: Variety of programs for ALL grade levels: The basic presentation covers how students at any grade level can do\nreal\nscience with the Sky by making observations and measurements.  For\ngrade\n4 and higher we provide an introduction to how data can be collected\ndigitally,\nand how digital data can be measured and put to use.  We generally\ndon't\npresent historical narratives, collections of statistics, nor cover\nconstellation\ninformation or lore (we can point you to resources for these topics). Prep session, prior to outreach, is very important, particularly to\nclarify\nvocabulary of objects and vastness of space.  See below for\nsuggested\ntopics, and about the new free prep video. Basic Theme: Surveying the Sky:  If we examine the sky with our\neyes,\nwith a telescope, or with a camera, what do we see? Can we characterize and classify objects by making observations? Sorting out objects by apparent size and brightness. Observing change in appearance and position over time. Arranging our data to use the data to draw rational conclusions. Making models to explain our observations. What are \"physical characteristics\" of objects/phenomena? Can we measure such characteristics of very distant objects? We are concerned with the inquiry-based process of scientific research,\nnot\nwith \"factoids\".  Our program stays away from \"factoids\" and does\nnot\ndeal with topics such as constellation lore/history (although these\ntopics\nare excellent cross-curriculum content!)  Often we deal with\nquestions\nthat do not have a \"right answer\" nor even any answer at this time. We encourage students to collect and evaluate data. Integrated with the above investigative strategies, here are some of\nthe\nspecific content areas that we can work with your students to explore: a. Introduction to the Solar System: \nSun-Earth-Moon\nand beyond:  We can address motions/views of Sun-Earth-Moon and\nSolar\nSystem, using kinesthetic models, a new dynamic virtual reality\ngraphical\nmodel, scale models, and lots of images from various professional\nsources. \nWhy are planets and stars spherical?  Why do they rotate? \nWhy\ndo the planets orbit the Sun in a plane?  Why do we see the Moon\nand\ncertain planets only at certain times?  This program is suitable\nfor\nearly elementary, and can be adapted for higher grades where students\nneed\ninformation for the Common Curriculum Goals Earth-in-Space Benchmarks. b. Introduction to Technologies to Explore Deep Space: How we know what we know about very distant objects/phenomena: We bring a small Telescope plus a portable CCD Camera that students can\nuse\nto explore how distant light is collected and detected, and how digital\nimages\ncan be enhanced and measured.  What are the two basic\nmeasurements? \nWhat can these measurements tell us about characteristics of distant\nobjects? \nThis material is very suitable for grades 4-12 and portions can be\nadapted\nfor early elementary. We also use a variety of high tech JAVA based interactive graphical\n\"applets\"\ndeveloped by Professor Greg Bothun at Uof Oto illustrate various\nprinciples\nof physics and astrophysics such as production of photons, production\nof\nthermal spectrum, and nature of detectors. Greg and ORI are both developing new virtual lab activities and we'll\nshowcase\nthese as they become available. c. Computer Labs: Two years ago we commenced this\nactivity,\nsix schools, from grades 3-12 were successful.  We preload free\nFITSVIEW\nimage analysis software plus a series of images to analyze.  \nThere\nare four pairs of images taken one night apart, that have one of the\nfour\nouter planets (Saturn-Pluto) in each pair of images.  The job of\nthe\nstudents is to find the planet in each pair of images and then to\nidentify\nwhich planet by measuring relative shift from night to night and also\ncomparing\nbrightness. We do this as a follow-up to the in-class session described\nin\npart b, above.  If your school has a Windows or Mac lab, you can\nparticipate. d. Overview of the Cassini-Hugens Mission to Saturn\nand\nTitan:  Apowerpoint presentation covering overview of mission,\nspacecraft,\nflight, scientific goals, and showing current images sent back from\nSaturn\nand its Moons.  This program will work for larger\ngroups/assemblies. \nWe do some scale model activities but primarily focus on the\ninformation\nand pictures supplied by NASA and JPL.  We furnish teachers with a\nsummary\nhandout sheet including URLs. WORKSHEETS and EVALUATION SHEETS: Most teachers have requested use of worksheets for classes at 5th grade\nlevel\nand higher.  We normally bring a fill-in-the-blank style worksheet\nfor\nduplication and distribution at start of class. We can send the master to you ahead of time if you wish to print it\nbeforehand. Sometimes we encourage students to use a blank piece of paper and then\nwe\nmake notes together on a projected window from the laptop. We supply a key for the teacher for use in review after the class. We also bring a page for students with a few questions to fill out for\nfeedback\nfor us on how the classes can be improved, and we supply teachers with\na\nmore detailed questionaire.  These surveys can be mailed back to\nme\nand are usually done for homework or the next day, as our sessions\nusually\nrun the whole class period. PREP VIDEO Tom Cleveland, of Think Video/Lane Community Cable Television, and I,\nhave\nput together a 28-minute introductory video for use prior to the\noutreach\nsessions, or as a stand-alone INTRODUCTION to EXPLORING DEEP\nSPACE. \nThe material is suitable for ALL grade levels, but particularly\nsuitable\nfor Elementary and Middle School.  We start with a brief\nintroduction\nto the emptiness of space by taking an imaginary flight upward from\nEarth,\nnoting the results and requirements of leaving the atmosphere and\nrunning\nout of air. Next we cover, using models, the vocabulary of Moon, Planet, Star/Sun,\nSolar\nSystem, Nebula, Galaxy, and Universe.  Then we create a scale\nmodel\nof the Solar System and beyond on a real football field, an activity\nyou\ncan duplicate. Finally we explore the basic concepts of light, introducing viewers to\nthe\nterm \"photons\", and noting that to \"see\" anything we need a source of\nphotons\nand a detector of photons (stars and our eyes).  We tie the whole\nprogram\ntogether with a final demonstration with a flashlight to show how\nphotons\nfrom a distant source spread out, thus why objects in deep space are so\ndim,\nso hard to explore. The actual classroom outreach program then gives the students the\nopportunities\nto explore the collection/detection/measuring technologies (telescopes\nand\nCCD cameras) and includes computer labs where actual research can be\ndone. When you contact me to schedule your outreach session, I'll mail you a\nprep\nvideo along with several worksheets and answer keys to complement the\nvideo. \nI'll pick up the video when Icome to your classroom.  There is no\ncost\nfor the video, but we do need it returned. Responses have been very positive from Elementary and Middle\nSchoolers. \nMost High School students have felt that the video was too simplistic\nfor\nthem, although some have commented that the concepts/overview have been\nvery\nhelpful. Our major concern is that students have the overview of vast distances,\nhierarchy/vocabulary\nof types of objects, and initial exposure to concept of photons for the\ntechnology\nprogram, as we don't have time within the class to cover these\ntopics. \nFor example, the students should understand the difference between a\nSolar\nSystem and a Galaxy, functionally, in appearance, and in scale. If you don't wish to go this route or don't have enough time to get the\nvideo\nmailed to you, Ican attach a basic vocabulary/distance scales info\nsheet\nto an e-mail message to you, or you can find this document at the\nFriends\nof PMO web site. We will also be creating a video that demonstrates the use of FITSVIEW\nand\nAIP4WIN image analysis software.  This will be distributed as\nfollow-up\nmaterials for students interested in pursuing a research project using\ndigital\nimages of the sky. SOLAR VIEWING: We now have a standard solar filter for the 6\" telescope that Ibring\nto\nclassrooms, so if the sky is clear, there is potentially the\nopportunity\nto view sunspots.  We can set up the telescope outside before or\nafter\nclass or during lunch or recess.  This is not an H-alpha filter\nlike\nwe have at Pine Mountain that shows the solar prominences, but the\nstandard\nfilter still offers very interesting views of the solar \"surface\"\nfeatures. \nQueing up to view through the telescope takes time, so this usually\ndoesn't\nwork well during a class period as too many students are left idle, but\nis\ncertainly suitable as a supplemental before/after class/school activity. REQUESTS FOR SKY VIEWING IN EVENING: Occasionally schools request an evening sky observing program in\nconjunction\nwith the classroom outreach.  This may be feasible, working with\nyour\nlocal Astronomy Club/Astronomical Society, or with any other local\npeople\nwho can bring large telescopes.  We can set up the portable CCD\nCamera\non a table outside, and students have a great time taking actual images\nof\nsome of the larger objects in the sky, such as galaxies, star clusters,\nand\nnebulas.  We can discuss the arrangements for each request\nspecifically,\nas resources vary considerably around the State. VIRTUAL REALITY (VR) Sun-Earth-Moon (SEM) project: Oregon Research Institute (ORI), in Eugene, has created a VR program\nwhere\nthe user can \"fly\" his/her craft around, above, and below the Sun,\nEarth,\nand Moon (other planets may be added later).  The goal is for the\nuser\nto conceptualize the motions, orientations, and views of these objects\nby\nbeing able to gain a wide variety of physical perspectives not normally\navailable. \nExplorations include phases of the Moon and the orbits and periods of\nthe\nEarth and Moon and their relationships to the position of the\nSun. \nThis program, called SEM, is funded by the Federal Department of\nEducation. \nORI Prime Investigator, Dr. Dean Inman, wrote the grant as a program\ndesigned\nto help Orthopedically Impaired (OI) students do science labs that they\nordinarily\nwould not be able to access. When Isaw the software in early Summer, 2002, Iwas immediately struck\nthat\nnon-OI students should also be able to put these explorations to good\nuse,\nand also noted that the software serves to illustrate many of the ODE's\nEarth-in-Space\nbenchmarks. Iam now working with ORI to develop teacher and student materials for\nuse\nof the SEM program, and will be introducing SEM in many of my outreach\nclasses. \nDr. Inman and Iwill be looking for teachers who are interested in\ncollaborating\nto investigate the efficacy of SEM, comparing how students learn with\nconventional\nstrategies versus SEM, for both OI and regular students. The software is free and is available either as a download off the web\nfrom http://www.ori.org/%7Evr/projects/vrscience/sem/index.html or from a CD-ROM\nthat ORI can send you.   Fed Ed has also funded availability\nof\nhigh video performance computers from ORI for classrooms wishing to\nparticipate. \nPlease contact me if you are interested in participating, whether or\nnot\nyou have OI students. RESEARCH PROJECTS: Inquiry-based RESEARCH\nPROJECTS for ALL GRADE LEVELS: Digital data can be used by students of all ages.  Here are some\nsuggested\nprojects that we can assist you to implement in your classroom. \nDepending\non student academic levels, you could use/adapt several projects at a\nwide\nvariety of grade levels. The projects can begin as inquiries after viewing some initial digital\nimages\nof the sky (or viewing the real sky for that matter!)  If you come\nup\nwith your own project, we can assist you with data and data analysis\nsoftware. \nWe can demonstrate a basic project listed below during outreach and can\nthen\nwalk your students through the project in your computer lab. a. How many stars (how many galaxies)? Starting from a rudimentary counting exercise, students can explore\nimages\nfrom various areas of the sky and images taken with a variety of\nexposure\ntimes.  Questions can be generated concerning distribution of\nobjects,\ntypes of objects, and how much of what's out there we are really able\nto\nsee, why and why not.  This is a very open-ended project that can\nbe\na real eye-opener to the vastness of space and the nature of how\nscience\nis done and is very suitable for lower elementary grade levels. b. Do any objects shift position in the sky? This involves astrometric (positional) measurements, over a period of\ntime. \nStarting by \"blinking\" (comparing) images of the same area of sky over\none\nor more nights, students can search for objects that shift relative\nposition\nand then attempt to explain the shift observed.  Students can\nderive\nthe basic relationship between distance and parallactic shift and thus\nsort\nout Solar System objects versus Galactic objects, discover asteroids,\nand\ncan begin to sort out the various planets at various distances and\napproximate\nthe orbital radii. See the astrometric project, initiated by Silverton High School\nTeacher,\nRay Kaser, described as the computer lab option in the Contents of\nOutreach\nSessions section above. Another astrometric project involves the search for asteroids. \nThis\nis an authentic research project with potentially very useful results\n(saving\nEarth!).  Students can request data or can scan archived\ndata. \nBest done with Richard Berry's AIP4WIN image analysis software, which\nwhen\ncombined with a digital database, will allow the user to accurately\ndetermine\ncoordinates of any candidates.  Data can then be compared with\nlist\nof known objects compiled by Lowell Observatory, and if object is truly\na\nnew discovery, the discoverer may participate in the naming of the\nobject. c. Why are some objects brighter than others? This involves photometric (brightness) measurements and leads to\nmeasurement\nof distances, temperatures, sizes, and brings up issues of instrument\ncalibration. \nAt the basic level, students can intuitively conceptualize the\nrelationships\nand can begin to characterize and classify objects in the sky. We have archived sets of data of stars of several constellations, which\ncan\nbe measured for relative brightnesses. At more advanced levels, we can furnish images filtered in various\ncolors\n(BVR) which would lead to measurement of temperature from the Planck\nBlackbody\nCurve and ultimately to construction of an H-Rdiagram and determining\nstellar\nage. REQUEST or DOWNLOAD DATA (IMAGES of the SKY): Archived data can be \"FTPd\" (we like WS_FTP software to do this) or\n\"Timbuktud\"\n(Timbuktu software from www.netopia.com) from IP 128.223.164.30 . Contact Rick ( rkang@efn.org ) for\nuser name/password. Also contact Rick if you want to acquire new data either from our\nCOWCAM\n(1/2 degree FOV, BVR filters available, 1Kx1K pixel CCD, 5 Meg FITS format images) or from our PIGGY (1 degree FOV,\nno\nfilters, 242x375 pixel CCD, 300 KB FITS format images), we may be able\nso\nset up remote imaging sessions for you. We encourage you to select suitable targets and to furnish us with the\nidentity,\nRA/DEC, and desired integration time and filters for your\ntargets. \nWe can provide an initial digital sky tour if you wish. There is a $20 charge to set up a remote imaging session, and you will\nneed\nto have Timbuktu software (from http://www.netopia.com )\nrunning on your computer. \nThere may be local firewall issues to resolve. See the FOPMO web site for links to DATA ANALYSIS SOFTWARE -------------------------------------------------------------------------------------------- HOW TO BRING YOUR CLASS TO PINE MOUNTAIN OBSERVATORY: DETAILS FOR OBSERVATORY TOURS: Please make advance reservation with Mark Dunaway,\nmarkpmo@oregon.uoregon.edu\nor 541-382-8331 if you are planning to bring your class (or any group\nlarger\nthan 10 people) during regular tour season (Fri-Sat evenings Memorial Day weekend through September, or during the off season). We are now closed due to winter weather, but come March or April if the snows don’t make the road impassable, you may be able to bring your\ngroup to PMO if Mark can fit you in…dark moon weekends fill quickly). Program starts at dusk, check with Mark for exact times as may change\nas\ndarkness falls later or ealier.  Also check with Mark on rates,\nwe’ve\nhad to increase our group rates as we’ve had to find funding for staff\nto\ndrive up.  We’re trying to hold regular Fri-Sat summertime drop in\nrates\nto $3.00/visitor.   Dress warmly (can easily get below\nfreezing\nat the 6500 foot elevation!) and bring a small flashlight covered with\nred\ncellophane or a brown paper bag (to protect everyone's night\nvision). \nWe furnish star charts.  You can stay up with us all night,\nweather\npermitting.  Check the web site for Quick Cam views of the weather\nduring\ndaylight before you come up.  There is a Forest Service campground\njust\nacross the parking lot from the Observatory, first come, first served,\nno\nreservations, no fees.  Primitive campground, you need to bring\nwater. Some schools have made arrangements with teachers at local Bend schools to use their gym to camp out in. Try to pick a non-Full Moon night (moon is very bright and washes out\nfainter\nobjects). For further details, see the How to Visit PMO link and/or call\n541-382-8331. OBSERVATORY TELESCOPE STATUS: 15\" Telescope now has digital setting circles, making finding objects\nmuch\neasier. 24\" Telescope has minor tracking problems in some positions, we\ncontinue\nto work on this, but telescope and PIGGY CCD are basically in service. 32\" Telescope continues to be available for limited collection of\nresearch\ndata with the COWCAM, including images filtered with B, V, or Rfilters. \nContact Rick with your initial proposal, I'll put you in touch with\nProfessor\nBothun to work out the details. Solar Viewing: We now have an H-alpha solar filter for use on our\nportable\n8\" telescope, that allows visitors during daytime to view the huge\nprominences\nblasted out by the Sun.  Normally we have this telescope set up\noutside\nthe 24\" dome on Saturday afternoons, 2-5 PM during the regular\nVisitors'\nSeason."
    }
  ]
}