{
  "url": "http://poisonivy.aesir.com/view/control.html",
  "file_number": "144",
  "content_hash": "3e22d6fda06b7561fb5b720642362acf61e8af222122199c8fa2e5d98058b420",
  "total_blocks": 108,
  "retained_blocks": 36,
  "ignored_blocks": 72,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.01 Transitional//EN\""
    },
    {
      "tag": "div",
      "text": "Home Fast Facts Pictures Products Treatments Q&Aboard FAQ General Info Control Search Books Site Map Help Support Site"
    },
    {
      "tag": "h1",
      "text": "Control"
    },
    {
      "tag": "div",
      "text": "Brush-B-Gone / Roundup"
    },
    {
      "tag": "p",
      "text": "General Discussion Household mixtures to kill poison ivy plants Large Area Control Goats Mulch, Tarps, Pulling Never Burn Poison Ivy Remove from other Items Ammonium Sulfamate"
    },
    {
      "tag": "div",
      "text": "Some suggestions on controlling poison ivy, oak and sumac plants. If you're lucky you may be able to fully remove the plants - I've only been able to get them under control. Missouri Department of Conservation - How to identify and control the plant U.S. Food and Drug Administration - Outsmarting Poison Ivy and Its Cousins ... control University of Oklahoma Police Department - Great Section on control and specific list of products that \r\ncontrol Poison Ivy, Oak, and Sumac Michigan State Univeristy Extension - Great paper on identify and control the plant Brush B Gone Roundup Gardenweb Forum - Discussion using organic and non organic methods of removing poison ivy."
    },
    {
      "tag": "h1",
      "text": "Brush-B-Gone / Roundup"
    },
    {
      "tag": "div",
      "text": "Mixed it according to label recommendations, then you probably\nwill get a good kill of the parts you sprayed.  The first sign is curling and\ntwisting (epinasty in plant physiology terms), and it may take a week or\ntwo to look real dead.  Some resprouting may occur from areas of the root\nsystem that the chemical did not reach. Respray after these sprouts reach\n8 or 10 inches (too soon and there may not be enough leaf area to absorb\nenough chemical).  Triclopyr (the active chemical) is sooo much more\neffective on woody plants than Roundup.  But it really does little to kill\ngrass family plants, or rosette type weeds that are already bolting. --(matson@NOSPAMawwwsome.com) submitted Jun/6/1999"
    },
    {
      "tag": "p",
      "text": "We just bought a piece of property and it has poison oak. It is\n   covering a huge granite rock about 8 foot tall and 30 foot around.\n   It is also growing between the rocks to the height of 10 to 12\n   feet and also growing like a vine over the rocks. Igot two spots\n   the first time. It is maddening to itch like that. Iwent out\n   and bought a gallon of round up . The kind you dilute with\n   water to the correct consistency. Isprayed that huge plant. It has\n   been reduced to dead leaves and dead branches. Iused about one\n   forth of the gallon to do the job. The gallon cost $85.00 but\n   even though Iam on a limited budget it was worth every penny.\n   And Istill have enough round up just in case it comes back \n   up. Then Iwas clearing a spot on another part of our property\n   and got it again.  \nThe first two places to break out were the ones where it was\n      before and then it spread. Tonight Iactually took a bath in\n      diluted bleach. Tomorrow Iam going to go spray that new\n      plant. Thanks for your web site about the evils of poison oak\n      and ivy. Naoma Hayes --\"ppainter13\" (ppainter13@NOSPAMmsn.com) submitted 25/Jun/2002 Ihave found Brush-B-Gone foam to be the best product for complete,\n   easy removal of Poison Ivy. It is sometimes hard to find, perhaps\n   they're discontinuing the foam? One can removed all the Poison Ivy\n   in our large backyard with one application per plant (including a\n   vine running some 20+ feet up a tree, about 4\" around at base), and\n   because it's a foam it is much easier to not hit plants you don't\n   want to kill. --\"J. Simon\" (mnrsage@NOSPAMvisi.net) submitted 30/May/2003 My comment is about Round-up , and its use on Poison Ivy etc.\n   Guys, Round-Up doesn't work!! It's just that simple. It kills\n   the upper leaves, but the roots remain. This product is a\n   complete rip, and we are wasting our $$. And not just poison ivy,\n   round up won't kill grass long term. What does work? Pick axes,\n   hoes, gloves you wear for roses, and washing in cold water within\n   one hour of known exposure. --\"molly\" (mollysimonds@NOSPAMhotmail.com) submitted 8/Jun/2003 Editor: It is true that you might have to re-apply round-up but it will eventually kill poison ivy completely as Inow have acres of no poison ivy to prove it. Ihave had to repeat my applications up to 3 times on some very resilient plants over a summer. You will not kill the big vines though and will need to cut a segment and use a herbicide containing triclopyr for those tough guys. Pick axes, hoes, and gloves are a sure thing.  The other nice thing about your comments is that its better for the environment and doesn't cost any money!  Thank you. Ihave used Roundup, etc for poison ivy, oak, but the only thing\n   that Ihave found to really \"kill\" poison oak or ivy is Brush-B-Gone !! --\"Lin\" (linb5@NOSPAMhotmail.com) submitted 19/Jun/2003 [Top]"
    },
    {
      "tag": "h1",
      "text": "General Discussion"
    },
    {
      "tag": "div",
      "text": "Contact with poison ivy can leave you with a rash and persistent itch. \nThis native perennial grows throughout Virginia, in woods, fields, and\nsometimes in the garden.  It grows in sun or shade,\nand in wet or dry places.  Its growth habit depends on where it\nis growing, resulting in a trailing ground cover, free-standing\nshrub, or a vine supported by trees, shrubbery and fences."
    },
    {
      "tag": "p",
      "text": "All parts of the poison ivy plant contain an oil, urushiol, which causes\nthe allergic reaction.  Most poisoning occur during the\ngrowing season when the presence of lush foliage increases the\nchance of contact, but the dormant stems and roots of the vine\ncan cause winter poisoning as well.  Individuals vary in their\nsensitivity to poison ivy, but repeated exposure can lead to\nincreased sensitivity.  It would be a good idea for everyone to\navoid this plant. Poison ivy appears in many forms.  The leaflets vary in size,\nglossiness, and marginal notching, but always occur in groups of three. \nIf you avoid all unknown plants with leaves composed of\nthree leaflets, you will be playing it safe. Poison ivy is difficult but not impossible to eradicate.  The\nchief difficulty lies in the chances of becoming poisoned when\ntrying to remove it.  Wear protective clothing, including gloves, whenever\nyou are working near it.  Pulling and grubbing are\neffective means of removal, though they necessitate close contact and will\nprobably need to be repeated once or twice for complete control.  If time\nis not an object, the vines can be smothered by completely covering them\nwith black plastic for several months.\nDo not mow the plants as this will spew bits and pieces of\npoisonous material over the area.  When removing poison ivy, take\nfrequent breaks to change clothes and scrub thoroughly with a\nstrong soap.  Wash contaminated clothing separately.  DO NOT BURN any\nplants that you physically remove.  The resulting smoke can\ncause severe lung damage if inhaled. Herbicides are effective and allow you to control the plant\nwithout getting too close to it.  Several commercial products are available. \nCheck labels to find one that will control poison\nivy, and apply it as directed.  Many of the herbicides for poison ivy\ncontrol contain glyphosate.  This chemical is systemic.  It\nis absorbed by leaves and transferred to stems and roots, and\nslowly causes the death of the entire plant.  It must be applied to an\nactively growing plant for this process to take place; do\nnot apply it during a drought when even poison ivy will not be\ngrowing.  Glyphosate, like most herbicides labelled for poison\nivy removal, is nonselective and will kill any other plants it\ncontacts. Where poison ivy has grown up tree trunks or into hedges, cut the vine\nat ground level.  Remove as much of the stump and roots as\nyou can with a hoe or by pulling.  As regrowth occurs, apply an\nherbicide to the leaves, or keep pulling up the growth.  With\nperseverance, and probably of few itches, poison ivy can be\ncontrolled. --(f_rushingr@NOSPAMccsvax.sfasu.edu) submitted May/21/1994 [Top]"
    },
    {
      "tag": "h1",
      "text": "Household mixtures to kill poison ivy plants"
    },
    {
      "tag": "div",
      "text": "Here is one Ifound.  Mix 3 pounds salt with\n1 Gallon soapy water; spray the solution on the plant's leaves and stems.\nIhave also used a combination of roundup and letting nature choke the plant\n(ie. wild rose) myself. --Editor (July/27/1999)"
    },
    {
      "tag": "p",
      "text": "I'm an environmentally sensitive landscaper and landscape designer with a\ngood deal of experience in eliminating poison ivy from the landscape. And,\nlittle as Ilike the prospect of using an herbicide, out of considerations\nboth for my personal health and for the environment, the only way I've found\nto get rid of substantial colonies of poison ivy is by the careful and\nresponsible use of herbicide. You can remove a single young plant or two by grasping it through a plastic\ngarbage bag and pulling it up root and all. Turn the bag inside-out over the\nplant, and it's done. (You may have some growth return from broken roots,\nbut can get rid of them in the same way.) Glyphosate --the active ingredient in Roundup and Rodeo--is sometimes\nrecommended for killing poison ivy. Because its active ingredient breaks\ndown quickly, Iinitially tried to use Round-up, but found that plants could\nrecover from as many as six applications over two years. Others with whom\nI've compared notes also describe similar experiences. I've only used the\nproduct as sold, with glyphosate. The only thing that seems to work, in my experience, is a herbicide\ncontaining triclopyr . I've used Ortho Brush-b-Gon with a great deal of\nsuccess. If I'm careful, Ifind Ican spot-treat individual plants without\ndoing much damage to what's growing around them. For greater accuracy,\ninstead of spraying you can paint the herbicide directly on the leaves. Ihate to sound like a spokesperson for Monsanto. This company has many sins\nto answer for. And, as I've said above, I'm reluctant to use herbicides. But\nthis product really does the job. Use it with respect. Read the label and follow the directions religiously.\nWait for a day when the winds are still. Don't use it in or within ten feet\nof a wetland. Use rubber gloves, and be careful not to breathe the spray.\nWash up thoroughly afterwards, and put your clothes in the wash right away. Istrongly recommend against using salt to kill plants . Yes, we use salt in\nour food. But in the environment, in the quantities required, it's toxic and\npersistent--much more so than Roundup or Brush-b-Gon. It does not break\ndown, and will continue to kill anything planted on the spot until it's\nthoroughly leached away--a matter of years even in regions of high rainfall.\nAnd even then, it continues to be a hazard, as it leaches into the\ngroundwater. Using it is much more environmentally damaging than using\nherbicides whose sale for the purpose is allowed by the EPA. --Don Galbreath submitted 23/Dec/2000 Editor: Thanks Don for an excellent discussion!  Ihave been using Roundup exclusively\nhere on a little more than 2 acres and while it takes repeated spraying Ihave had reasonable results because it contains the ivy long enough that \nother more invasive plants can choke it out.  Iam in year 4 of what Icall my\nexperimental program and would call it a success this far given that Ihave elminated about 1/4 acre of just poison ivy plants.  Ihave to\ncompletely agree that the Ortho Brush-b-Gon product is \nincredible and Iapply it with a paint brush to all large old growth stems. \"Glyphosate\" will kill it.  It Iguess is the active ingredient in\nsystemic killers.  Iwonder if it can be bought \"over the counter\" instead\nof in \"round-up\", etc. -- Jeff (jzibrat@NOSPAMnb.net) submitted Jul/27/1999 Here is my way of getting back at that nasty plant and you don't have to spend alot of \nmoney...you need:"
    },
    {
      "tag": "pre",
      "text": "1 cup of salt,\n8 drops of liquid detergent,\n1 gallon of vinegar,"
    },
    {
      "tag": "p",
      "text": "combine\tthe salt and vinegar in\ta pan heat it up to dissolve the salt pour into\na spray bottle and kill away. Warning this will kill all plants that you spray so \ndon't spray\tanything important good luck. -- Eddie Shaughnessy (eddie337@NOSPAMhotmail.com) submitted Jul/13/2002 [Top]"
    },
    {
      "tag": "h1",
      "text": "Large Area Control"
    },
    {
      "tag": "div",
      "text": "Iuse the following on poison ivy, if it is in a place where Iwant \nto get rid of it: Growing in an open area (ie. field, etc.) - Mow it with the brush \nhog. After a while, if you mow it regularly, it will die. Growing up a tree - Cut the vine. If it is really big, use a\nchainsaw. If it is smaller, use what we call \"nippers\" (long handled \nshear like tool). Occasionally, if it is growing in a place where either 1 or 2 \nwon't work, Ispray it. For example, sometimes it will grow on the \nside of an outbuilding, but the vines are too small and numerous to \ncut easily. Iuse concentrated roundup diluted in water to the \nmanufacturer's\nspecifications and spray it. It always works for me.\nAs far as getting rid of the rash, only time works for me. --(Rob Gray@NOSPAMAlpha.injersey.com) submitted Jun/26/1999 Editor :  Iuse a similiar approach but choose to use a bow saw for the\nbig vines as Iam worried about the chainsaw throwing more oil around."
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "h1",
      "text": "Goats"
    },
    {
      "tag": "div",
      "text": "Goats.  Goats do an excellent job of cleaning out poison ivy and\nother unwanted brush, especially when its growing up in the fence\nline. --(Sojourner@NOSPAMnotime4@summer.spam) submitted Jun/21/1999"
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "h1",
      "text": "Mulch, Tarps, Pulling"
    },
    {
      "tag": "div",
      "text": "I've taken out long-established vines with trunks\nas big as your arm with but two or three strategic,\nthorough cuttings and a bit of digging and pulling. \nIcarefully note locations of major vine colonies\nin the middle of winter here, when they're easier\nto see and brittle to cut as well.\nOne had completely covered a large stone retaining wall,\nat the bank to the ramp to the main barn loft.  In winter\nIremoved major sections of matted vines from the stones,\nafter cutting all along the perimeter of the wall.  Ithrew\nmulch hay along the top of the wall and it killed the poison\nivy there without further ado.\nIknew  that there'd be a good burst of new growth from the base of \nthe big vine Ichopped away and dug out, but part of that\nwould be mowed as part of the yard and the other would be\nthe rest of the project.  More runners would pull up as\nthe ground thawed, too.\nThen Iwaited until the leaf growth was as good as it could\nbe before the seeds form.  Icut the vines twice each with a\nsharp action of the corn knife, two or more inches apart,\ndigging aside the cut section.  That takes only minutes.\nIusually let it rot in place or at least wilt down to\na dry brown before removing it to a composting area\nfor ornamental, non-food uses.  The seeds are a big\nsource of food for birds and end up under trees to a\nlarge extent, so thick mulches can be used in places\nwhere mowing isn't practical, as long as they don't\nextend right up to the trees.\nIsearch for separate smaller vines and pull them to find all\ntheir branches.  It's often easy that way to get most of the \nivy in a big area just by first locating a small number of\nwell-spread vines.  Ihave a spading fork, rake, and hay\nhook that Iuse to lift stubborn vines rather than cut\ninto the dirt with the knife.  Ialso use nippers to\nfinish off each and every smaller sprout in the area.\nAt most I'll check it to remove any resprouts, once,\nlater in the season.\nIf Iremove a plant Ireplace it with something else,\nand I'll mulch heavily and position the replacements\nonce Isee that the growth is all browned out.  This\nis a plant that gets as indignant as any hothouse\nornamental if you demonstrate your willingness to\ncut away at it with some persistence. It enjoys\nthick mulches even less .  Hell, I've killed some\nvines just by dropping scrap visqueen and tarps\non them, which do the job in a season or two\nand can be hidden under mulch until removed.  \nOne big cluster of vines used to live under a spot\nwhere Isubsequently stored a couple tons of cypress\nbark , but it didn't seem to thrive at all once it was\nunder a few feet of slow-rotting mill byproduct  ... --Muleskinner (green@NOSPAMtristate.pgh.net) submitted Jun/28/1999"
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "h1",
      "text": "Never Burn Poison Ivy"
    },
    {
      "tag": "div",
      "text": "Bag the plants, roots and debris in plastic, then\ntake to the dumpster or land fill.  NEVER, NEVER,\nNEVER try to burn poison ivy out or add to a burn\npile.  Smoke can and will carry the poison.  This\ndoes damage lung tissue and can lead to a long\nhospital visit or death.  If you ever do burn out an\narea of brush, stay out of the smoke.  There may be\npoison ivy that you don't see."
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "h1",
      "text": "Remove from other Items"
    },
    {
      "tag": "div",
      "text": "Hi,Just wanted to thank you profusely for your site. Tons of useful\n   information (more than Igot from WebMD.) Most useful were the\n   pictures (instead of the illustrations you tend to find elsewhere)\n   which helped me realize Ihad more than one kind/growing habit of\n   poison ivy growing in my yard. It took awhile, but eventually Ifound possible ways of washing the oil off my upholstry (you can't\n   exactly throw a possibly contaminated couch into the washing\n   machine.) Perhaps, if you've the time, a \"section\" on removing the\n   oil from more than your hands and clothing would be useful. And\n   lastly, simply reading about others who have gone through the same\n   suffering as much (and more) than Iam, has helped mentally. Thanks\n   again :-) and much praise for your site :-)--Heidi m., a sufferer\n   in central New Jersey --\"Heidi M.\" (workheidi@NOSPAMhotmail.com) submitted 2/Oct/2002 Editor: Iwould think it would come off rather easily with\nany cleaner that is good with oil. Even plain old water.  The problem with the skin is that once the oil bonds, it is very\ndifficult to remove.  Not a problem with furniture, tools, etc.\nAnyone else?"
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "h1",
      "text": "Ammonium Sulfamate"
    },
    {
      "tag": "div",
      "text": "I'm fascinated that in all your site and the other sites you\n   hotlink, there's absolutely no mention of ammonium sulfamate , sold\n   under the trade name of ammate among others. My 'job' when visiting\n   my grandparents in ipswich was to fill up the 2-gal pressure\n   sprayer every morning and roam around their 75 ac looking for p.i.,\n   and Idid that for many years. Like glyphosate, it needed several\n   applications at two-week intervals, but in my experience it was\n   very effective. Iknow enough chemstry to appreciate its relative\n   safety, and in my experience it's extremely selective, killing only\n   the p.i. Ican remember spraying it on a vine growing through a\n   highbush blueberry and seeing only the p.i. leaves wilt. I'm very\n   !$!#!$ that it seems to be completely unavailable now - perhaps\n   because it's too cheap and commodity-like to be profitable when\n   glyphosate and triclopyr can be sold instead? I'm tempted to try\n   making it. Idon't think it'd be too hard. My other grandmother\n   swore by phenolic soap ['fels naptha'] for removing urushiol before\n   the itch started, back in the '60s. --\"andrew hay\" (adh@NOSPAMan.bradford.ma.us) submitted 26/Jun/2003"
    },
    {
      "tag": "p",
      "text": "[Top]"
    },
    {
      "tag": "p",
      "text": "Special thanks to 1151 Clinch Road Home | Site Map | Feedback © 1999 - 2006 by Jim Dunphy"
    }
  ]
}