{
  "url": "http://radio.weblogs.com/0107233/categories/thanks/2005/01/03.html",
  "file_number": "150",
  "content_hash": "5b9161446f0e2e9bf620b774c43880ea4f88da85e9bd4334fce6aa1746ae80b2",
  "total_blocks": 485,
  "retained_blocks": 18,
  "ignored_blocks": 467,
  "blocks": [
    {
      "tag": "div",
      "text": "thanks"
    },
    {
      "tag": "h3",
      "text": "Web Services, people, software providers, writers and resources who have made this weblog more useful. Along overdue category... plus resources to never track of...\r\n\n\r\n\nFirst things first: this is not for \"public consumption\" this feed is raw, unedited bits of news gathered from the Web, direct quotes from savy bloggers. This is not meant as a weblog... noooo.... this is my personal treasure chest of knowledge... That said, I'm NOT WRITING it.  got it? It's not for review or anything else...\r\n\n\r\n\nI'm  hoarding it to a space on the web where Ican go back and find it. Why, you say? : stupid computer, stupid browser, stupid bookmarks can't track this stuff like a Radioland feed can ... and having it on the web is so useful."
    },
    {
      "tag": "div",
      "text": "Find ANY word Find ALL words Find EXACT phrase Help Previous /Next"
    },
    {
      "tag": "div",
      "text": "Updated: 1/4/2005; 3:04:30 PM. links open windows Explore Dog News: Home Dog Stories Canine Medical News index of all Dog News posts DC Dog News index of DC Dog News posts My Radio Answers Recommended books Help Pets on Wheels! Search Our Site: Picosearch Dog News Adopt a dog Subscribe email RSS/XML: RSS Validator Enter your email address below to subscribe to Dog News: weird, inspiring dog tales! powered by Bloglet Dog Magazine Price Search Other Dog News: Dog News dog.com Horse and Hound UK AKC Weekly wins Dog News Online Bird Dog News OzDog News Guide Dog News Dog World News Cow Dog News Dog News UK &  World DogZ AU & NZ Other Dog Newsletters ASPCA DVM News Maddie's newsletter Dog news in the media Dilbert's Dogbert Funny dog e-zine iVillage Pet Gazette Animal News: Animal News Animal Radio Network Animal Concerns Community Animal Attack Files Dog Blogs: Slat Rat The Books of Dog Ernie Rothman Chasing Daisy Dog Resources: Our Dog Stories Recommended Books Flickr dog photos my dog photos Dog News links feed Merck's veterinary manual Dog Links (spurl) dog events calendar Therapy dogs: Dog Play Pet Pages Veterinary Medicine Open Directory Petfinder's Forums dog faqs ASPCA Animal Poison Control Center Doglinks NZ temperment test dog listserv discussions dogs in cars Google dogs discuss dogs.about.com recently updated blo.gs : dogs Lii.org's animal sites Canine Legal Updates Canine Web Sites Dog Friendly Pet Abuse Chazhound Pet humor DogGroups Citizen dog cartoon dog jokes K-9 Patrol and Beyond Secure Your Server: Smoothwall Corporate Smoothwall Spyware Info Shell City Syndicate: News is Free DayPop Syndic8 Fyuze Bloglines NewsMonster Recommended: Jason Love Humor Librarian's Guide DayPop Top News DayPop 40 derShock Wave Popdex Libdex Library Resources New Media Musings Scripting News weblog diffusion index greeblie blog Beyond ... black stump Blah Stuff Law Guru Doc Searls Exploding Cigar Mind over matters Arts & Letters Obscure Room Scobleizer Simple Links Daily Rotation Info Feed Online News search New Scientist news fresh news org Paolo, English Crayon News Sites Liked TopSearch engines Radioland: fresh weblogs Radio Meta Docs User discussion Radio Dev Top RSS feeds Search Radioland Scott Radio Al's resources Radioland docs Jeff's Radio Weblog The FuzzyBlog Subscriptions blogroll Stagger nation Fagan Finder Blog Resources: Fagan Finder Feedster Kinja Bloglines Flickr Blog Compendium Ping-o-Matic Feedburner Globe of Blogs Blog Catalog Rss Weblogs Blog Matcher Linkwatcher Blogarama Blogwise Blog Search Engine Bloghop Kmax Blog Links search grid Linked local feeds BlogDex BlogStreet links Technorati top 100 BlogStreet blogshares Feedroom rootblog eatonweb gooFresh Google Watch Search google hacks Resource Shelf We're a Cool Site of the Day About.com's Pick of the Web DC area weather"
    },
    {
      "tag": "p",
      "text": "This is blogchalk: United States, DC, DC, English, playing with our dog, reading blog feeds."
    },
    {
      "tag": "div",
      "text": "\" # blogs & pets ? \" Monday, January 03, 2005 Ihave a couple of Gmail invites to give away.  If you want one, drop me a short note to tell"
    },
    {
      "tag": "p",
      "text": "how you help others. two sentences are enough..) First come, first served."
    },
    {
      "tag": "div",
      "text": "Permalink:"
    },
    {
      "tag": "div",
      "text": "January 2005 Sun Mon Tue Wed Thu Fri Sat 1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 Dec Feb"
    },
    {
      "tag": "div",
      "text": "Previous /Next Translate Deutsch Español Français Italiano Portuguese"
    },
    {
      "tag": "div",
      "text": "Yahoo Dog News 3:04PM EST Boca council to name new dog park (Boca Raton News) . The Boca Raton City Council this month will face a real tail-wagger of a challenge: naming the cityâs first ever dog park. The Boca Parks and Recreation Board voted last week to recommend three possible names to the council: Boca Raton Dog Park, Canine Park, and Canine Campus. Indian familyâs dog saves boy (Columbia Daily Tribune) . Pet dragged 7-year-old to safety during waves. CHINNAKALAPET, India (AP) - \"Run away!\" her husband screamed from a rooftop after he spotted the colossal waves. Nonprofit worker gives woman a canine friend (Traverse City Record-Eagle) . TRAVERSE CITY- Kathy Shields was inconsolable when her pet dog, Honey, had to be put to sleep earlier this year. That's when Marilyn Meteer started looking for a dog to give Shields for Christmas. Tell your pet to shape up (The Courier Journal) . You've heard of the dachshund wiener dog and the teacup Chihuahua. Well, Tater, a 9-year-old miniature pinscher, \"Looks like a little football,\" says his owner, Monnie Graves. \"You know â fat in the middle. Ikeep saying he's going to pop one of these days.\" News (Austin Daily Herald) . Call or email the Newsroom at (507) 434-2230. A Mower County Sheriff's Office canine is the best police dog in the nation for the third consecutive year. It's a dog-eat-everything world at Dr. Gillian Arsenault's house when they get a new miniature pinscher puppy (Medical Post Online) . In a moment of madness, our family acquired another miniature pinscher. You see, our first miniature pinscher, our beloved Finnegan, had shed his collar and tag and gone wandering. State's 1st pet blood bank will save lives of best friends (Arizona Daily Star) . Murphy, an Australian shepherd mix, was diagnosed with cancer in November and suffered from internal bleeding. His only chance at survival: a blood transfusion and surgery. But Murphy's veterinarian Keeping pets safe this winter is a matter of COMMON SENSE (South Coast Today) . Brrrrrr -- it's cold outside! Winter's fearsome weather creates many concerns for responsible pet owners. According to Dr. Kimberly Wadsworth, an associate at Anchor Animal Hospital in Dartmouth, providing appropriate care for household pets during winter is simply a matter of \"using common sense.\" Pet came to rescue when mom couldn't save son (Omaha World-Herald) . CHINNAKALAPET, India (AP) - \"Run away!\" Sangeeta's husband screamed from a rooftop after he spotted the colossal waves. It was a simple command that smothered Sangeeta in a nightmarish dilemma: She had three sons, but just two arms. Four-legged pet hailed a tsunami hero (Canoe) . CHINNAKALAPET, India -- \"Run away!\" her husband screamed from a rooftop after he spotted the colossal waves. It was a simple command that smothered Sangeeta in a nightmarish dilemma: She had three sons, but just two arms. Pit bulls have area neighborhood nervous (Gainesville Sun) . Dog trainer Michelle Dunlap, owner of Gainesville Canine Academy, scratches the belly of Phoenix, a pit bull she has been working with for 1 1/2 years. 9/11 rescue dog becomes guinea pig for human ills (Billings Gazette) . MIAMI - Three years ago, Mizu the rescue dog helped search for bodies in the smoldering remains of the World Trade Center. There at ground zero, Mizu, who works for Miami-Dade (Fla.) Fire Rescue, spent two weeks sniffing the rubble for signs of survivors - or their remains. Shop, eat, browse and be charmed in Clinton, Hunterdon County (Courier Post) . Molly's going incognito as she strides down Main Street in the town of Clinton. It's not exactly deliberate: If you stop to engage the 4-year-old Tibetan terrier, she'll gladly shake back the pepper-and-salt mane that shields her face from view and give you a heartbreaker of a canine smile. Buried treasure for dogs who dig (Pioneer Press) . This week, answers to your questions are from renowned dog trainers who attended the 11th annual conference of the Association of Pet Dog Trainers in Denver. Iwas honored to deliver the keynote address to the more than 1,000 attendees at the largest gathering of its kind in the world. HAVE DOG TREATS, WILL TRAVEL (San Jose Mercury News) . When she was laid off earlier this year, Cecilia Saleme turned to therapy -- dog therapy, that is. She launched her own business in which she counsels dogs in behavioral changes. Hey, dogs have issues, too. Blessing of the pets (Selma Times-Journal) . All things bright and beautiful, all creatures great and small, all things wise and wonderful, the Lord God made them all. Each little flower that opens, each little bird that sings, he made their glowing colors, he made their tiny wings. Main News (West Bloomfield Eccentric) . Time spent at an Oakland County Park can be a fun experience, even for one of the workers. Dogged duo praised for saving feline friend (Manchester Online) . CANINE duo Gizmo and Poppy have been named the region's bravest dogs, after rescuing their feline friend Cobweb from a fox. Rather than fighting like cat and dog, the brother and sister pair of Jack Russell/shih tzu crosses get on famously with Cobweb the cat at their Rossendale home. January (Northern News Services Yellowknife Canada) . Festivities to mark the first night of 2004 were branded a fizzle as Yellowknifers complained of a lack of fireworks. Four years had passed since City Hall had been part of New Year's festivities. Residents saw it was time for a change. 01/01/05 (Venice Gondolier) . It's clear from the moment you walk through Jerry Rustler's front door, you have entered the domain of a pet lover. Walls are filled with photos of his present and past dogs. Life-size ceramic Dalmations and tigers eye you as you walk from one room to the next."
    },
    {
      "tag": "div",
      "text": "Recent Dog News"
    },
    {
      "tag": "div",
      "text": "canine diaper  ... 1/4/05 tsunami sixth s... 1/2/05 dog saves child... 1/2/05 One at a Time S... 12/28/04 Deramaxx FDA do... 12/28/04 vicious dog att... 12/28/04 Tsunami disaste... 12/28/04 clone pet cat G... 12/25/04 incredible dog ... 12/25/04 dog adopt shelt... 12/25/04 iuplogbeta 12/25/04 dead pets Beiji... 12/16/04 pet dog rington... 12/16/04 pet dog Holiday... 12/15/04 African wild do... 12/14/04 coyotes eat dog... 12/14/04 man bites dog 12/14/04 dog bullet proo... 12/14/04 ebay dog magazi... 12/14/04 top searches 20... 12/14/04 posh pet furnit... 12/14/04 Pets Mobility p... 12/13/04 pet dog law jud... 12/9/04 pet gifts Chris... 12/8/04 book is your do... 12/7/04 dog food nutrit... 12/6/04"
    },
    {
      "tag": "div",
      "text": "Google Dog News 12/25/2004 27-Nov-04 Gnews2RSS closed down . Gnews2RSS has closed down due to bandwidth constraints. If you're using Gnews2rss you presumably find it useful. Please email Google asking them to produce RSS directly out of Google News Search. Feel free to host it yourself"
    },
    {
      "tag": "div",
      "text": "Dog Books Our Dog Stories geeky favorites Dog News blogroll Reading list Statistics: Today's top sites RSS Hotlist Alexa on radio.weblogs.com Popdex Today's visits Comments Syndic8 stats google links DayPop stats Technorati Google related Blogstreet Position Allt' web links Ecosystem MSN links Organica Googlert Search Sites"
    },
    {
      "tag": "div",
      "text": "the Web Dog News blogs we read"
    },
    {
      "tag": "div",
      "text": "GeoURL Feedster Previous /Next All original content on Dog News: weird, inspiring dog tales © Copyright 2002-2005 by Dog News, All Rights Reserved. © Copyright 2005 Design Dog News. © Copyright 2005 All Images by Dog News and respective companies; all rights reserved. Dogs don't lie: Reliance on the information this site contains is at your own risk. COPYRIGHTS ©2004 Dog News - Other contributors retain their own copyright. Material on this Dog News site may not be published or broadcast without express permission, except as authorized by the Creative Commons Attribution Sharealike License: in a nutshell, For Profit companies or websites do NOT have any authorization or permission to republish any of this site or its newsfeed. All rights reserved. Dog News is not affiliated with linked stories on other websites and is  not responsible for their content. All links for news stories expire eventually... and we're too busy picking up dog poop to bother fixing them... One reason a dog is such a lovable creature is his tail wags instead of his tongue. -- Unknown"
    },
    {
      "tag": "p",
      "text": "Previous /Next"
    }
  ]
}