{
  "url": "http://reviews.cnet.com/Anarchy_Online_PC/4512-9696_7-30977189.html",
  "file_number": "156",
  "content_hash": "760ab632875b52106d238c5bac07cb4e33c5861d9fa2f9f131958a81b067bca7",
  "total_blocks": 100,
  "retained_blocks": 5,
  "ignored_blocks": 95,
  "blocks": [
    {
      "tag": "div",
      "text": "Log in | Sign up Why join? Remember me | Forgot password? Welcome ( log out ) View profile Search: Reviews All CNET The Web Today on CNET Reviews News Downloads Tips & Tricks CNET TV Compare Prices Cell phones | Desktops | Digital cameras | Laptops | MP3 players | TVs | All Categories What's on CNET Find the perfect gift Who doesn't want an MP3 player, a big TV, or a shiny new laptop? CNET's editors have picked the best tech you can get this year--more than 200 gift ideas for every budget and desire. Read more More shopping help: Holiday Helpdesk Personal shopper podcasts Ultimate luxuries Holiday Countdown Holiday treat calendar"
    },
    {
      "tag": "div",
      "text": "Anarchy Online (PC) By: Andrew Park"
    },
    {
      "tag": "p",
      "text": "It's safe to say that Funcom's online role-playing game, Anarchy Online, has been one of the most widely and eagerly anticipated games this year..."
    },
    {
      "tag": "p",
      "text": "Email this to: Enter the email address of the recipient. Add your own personal message: Enter your email address: Note: Your email address is used only to let the recipient know who sent the email and in case of transmission error. Neither your address nor the recipient's address will be used for any other purpose. Dell Home PCs Dell • Home • Systems"
    },
    {
      "tag": "div",
      "text": "Help Center | Corrections | What's New | All Product Reviews | Search: Reviews All CNET The Web Popular topics: Adobe | Antivirus | AVG | Games | Drivers | Java | Photoshop | Spyware | Windows Media Player | WinRAR Today on CNET | Reviews | News | Compare prices | Tips & Tricks | Downloads | CNET TV Popular on CNET Networks: PS3 | Wii | Xbox 360 | Pussycat Dolls | Free Music Videos | TV Listings | Prison Break | Game Cheats About CNET Networks | Jobs | Advertise | Partnerships | Site map Copyright ©2006 CNET Networks, Inc. All rights reserved. Privacy policy | Terms of use"
    }
  ]
}