{
  "url": "http://som.binghamton.edu/programs/phd/marketing.htm",
  "file_number": "167",
  "content_hash": "3235697f9596b4a5f2877f394fb07ef7386502ed4092474bd65f43d8a6e2503c",
  "total_blocks": 126,
  "retained_blocks": 5,
  "ignored_blocks": 121,
  "blocks": [
    {
      "tag": "div",
      "text": "Concentrations \n            Offered - Marketing"
    },
    {
      "tag": "p",
      "text": "The marketing faculty \n        has identified the following areas of research interest: · Product and Services Bundling · Relationship Marketing · Information Processing and Individual Decision \n        Making · Competitive Marketing Strategies · Judgment and Decision Making Product and Services Bundling The study of bundling \n        can be approached from a variety of perspectives, such as information \n        processing, transaction cost analysis, and competitive advantage. Specific \n        research topics include how consumers select between competing bundles \n        (i.e., how information processing differs when compared to selecting between \n        individual products), the role of bundling in reducing churn in the marketplace, \n        and the optimal configuration of the bundle (the number of products in \n        the bundle as well as the relationship between the products in the bundle) Relationship \n        Marketing In recent years firms have realized that they can leverage their value \n        chains and achieve payoffs such as lower coordination costs, greater market \n        access, and the delivery of quality service by initiating, developing, \n        and enhancing long-term cooperation relationships with suppliers, distributors, \n        and customers. Asampling of research areas in this field include, relationship \n        initiation strategies through the use of market-place signals and social/structural \n        bonds, relationship termination strategies involving hostages, idiosyncratic \n        (specific) investments, and switching costs, etc. Information \n        Processing and Individual Decision Making The area of information processing borrows heavily from psychology as \n        well as economics. In recent years, research has focused on dynamic aspects \n        of consumer preference (i.e., how choices and preferences change over \n        time), information acquisition and use in Judgments (i.e., how people \n        search for information and use information in their decisions), advertising \n        exposure and attitude change (how attitudes are affected by advertising), \n        and customer satisfaction and loyalty. Competitive Marketing Strategies This is an area of immense importance to marketing managers and research in this field requires an understanding of areas outside of traditional marketing such as economics (e.g., game theory) and finance (Capital Asset Pricing Models). One area of study is the wireless telecommunications industry. In this area, one could potentially research how consumers adopt new tecnologies, how should the different telecommunication services be optimally priced given that there are strong cross elasticity across services, and what is the optimum service portfolio. Judgment \n      and Decision Making The study of judgment and decision making is rooted in Behavioral Decision \n        Theory, or BDT, which studies how consumers form judgments and make choices \n        in the marketplace. It is often described as a descriptive alternative \n        to the more normative economic theories of rational choice. In the marketing \n        context, BDT is applied in areas such as (1) the introduction of new products \n        and services, (2) judgment and decision making among multi-attribute options, \n        (3) the influence of market signals on price and quality perceptions, \n        and (4) the impact of description frames on communication and personal \n        selling. Typical Schedule for Marketing Ph.D. students:"
    },
    {
      "tag": "div",
      "text": "Year \n            1, Semester 1: Research \n            Methods I , Econometrics or Statistics, Current Marketing Topics, Pedagogy Year 1, Semester \n            2: Research Methods \n            II, Judgment and Decision Making, Econometrics or Statistics Year 2, Semester \n            1: Multivariate \n            Analysis, Consumer Behavior, Special Topics and Independent Study Year 2, Semester \n            2: Discrete Choice \n            Models, Special Topics and Independent Study Year 3: Comprehensive \n            Exams, Dissertation Proposal Year 4: Dissertation \n            Research"
    },
    {
      "tag": "p",
      "text": "All marketing students \n        will generally need a strong quantitative background even if their ultimate \n        dissertation is in a behavioral area. Multiple courses in methodology \n        including econometrics, multivariate analysis, discrete choice modeling, \n        and experimental design will be needed. Some of these courses will be \n        offered in the School, while others can be taken in the economics, political \n        science and psychology departments. The Marketing area \n        has graduated two Ph.D. students. David Reid, is a Professor at the University \n        of Toledo. He examined the dynamics of group decision making in Buying \n        Centers. Cynthia Cann is an Associate Professor at the University of Scranton. \n        She investigated the diffusion and buying practices in organizations purchasing \n        mainframe computers. Her dissertation was funded by IBM. Current marketing \n        faculty members have authored books, and articles in leading journals, \n        such as the Journal of Marketing, Journal of Marketing Research, Journal \n        of Consumer Research, Journal of the Academy of Marketing Science, Journal \n        of Retailing, International Journal of Research in Marketing, Journal \n        of Consumer Psychology, Journal of Advertising, Journal of Business Research, \n        Marketing Letters, , Journal of Product and Brand Management, Journal \n        of Public Policy and Marketing, Journal of Product and Brand Management. \n        They have also authored papers in leading journals outside of marketing \n        such as Production and Operations Management and Organizational Behavior \n        and Human Decision Processes. Core Marketing \n        Faculty Manoj K. Agarwal , \n        Ph.D., SUNY Buffalo; Associate Professor; research interests: Marketing Strategy, Marketing, Marketing Research, \n        Modeling. George \n        S. Bobinski, Jr ., Ph.D., Indiana University; Associate Dean; research \n        interests: Advertising and Consumer Behavior, Service Marketing. Subimal \n        Chatterjee , Ph.D., University of Pittsburgh; Associate Professor; \n        research interests: Consumer Behavior, Judgment and Decision Making Debi \n        Mishra , Ph.D., Case Western Reserve; Associate Professor; research \n        interests: Strategic Alliances, Relationship Marketing, Reputation and \n      Signaling, Transaction Costs, Structural Equation Modeling. Glenn \n        Pitman , Ph.D., Penn State University; Professor; research interests: \n        Marketing Strategy, Marketing Research. Qi Wang , Ph.D., University of Florida; Professor; research interests: Network Effects, Competitive Marketing Strategy, Firm and Product Survival, Empirical Industrial Organization, Theoretical Econometrics back \n      to top"
    },
    {
      "tag": "div",
      "text": "School \n  of Management at Binghamton University, State University of New York PO Box 6000, Binghamton, New York 13902-6000 E-mail SOM som home l about som l academic \n  programs l student resources l faculty & research executive programs l alumni & development l corporate relations l campus links"
    }
  ]
}