{
  "url": "http://southsudanfriends.org/wunlit/day2.html",
  "file_number": "169",
  "content_hash": "f7c0a5e29d46ec9a1129866d2cc0febe200de616161e530cf3c766d407dba407",
  "total_blocks": 112,
  "retained_blocks": 63,
  "ignored_blocks": 49,
  "blocks": [
    {
      "tag": "p",
      "text": "Second Day Dinka-Nuer West Bank Peace & Reconciliation Conference Introduction of Dignitaries\r\n& Guests, cont. (morning) and Dinka Narratives (afternoon) the 28th of February, 1999 Session begins with reciprocal singing, a Jieng woman leading off on the left\r\nside of the meeting hall. When she finished a Nuer woman took up another chant,\r\nall joining in. In time a male Nuer cantor (Peter Garkuoth) took over\r\nleadership, moving between the Nuer with a fly whisk. Telar Deng:"
    },
    {
      "tag": "div",
      "text": "asks for silence, calls Rv. MM to pray."
    },
    {
      "tag": "p",
      "text": "Matthew Mathiang:"
    },
    {
      "tag": "div",
      "text": "Let up pray. Prays in Arabic language. People in the\r\nNuer section are discussing issue of distribution of pens loudly; after prayer a\r\nspokesman requests silence)."
    },
    {
      "tag": "p",
      "text": "TD:"
    },
    {
      "tag": "div",
      "text": "Today we will start with the formal introduction of some participants\r\nand observers. It was not an oversight yesterday, but within the programme, to\r\nintroduce the Commissioners on both sides as well as special guests, foreign and\r\nlocal. After the introduction Iwill give two opportunities, one to the\r\nCommissioner of Leer, and one to the Commissioner Tonj County. What will happen\r\nin the order of their addresses. As Tonj is hosting the meeting, Tonj will come\r\nfirst, and that of Leer will follow, as a representative of guests. Istart by\r\nintroducing to you the Commissioners of Bahr el Ghazel to you. Ibegin with\r\nAndrew Kuac, that is followed by Paul Mayom Akec of Rumbek County. Followed by\r\nAcuil Tito of Gogrial County."
    },
    {
      "tag": "p",
      "text": "On this side Icall on Joseph Juac Kuol, Commissioner of Leer County. We also\r\nhave our observers who have come from Khartoum and Iwould like to introduce\r\nthem to you. First is Gabriel Yoal. We have Samuel Aru Bol Man, Member of\r\nParliament. We have Faruk Gatkuath. We have Stephen With Munuar. We have also\r\nbeen honoured to have among us commanders from UDSF forces. One is John Kulang\r\nPuot. We have commander Peter Riir . We have Gabriel Both Yol. Iapologise, they\r\nshould have come in order of seniority. Peter Parjang. We have alternate\r\nCommander Michael Thot Jang. Iwill reserve the other introductions of\r\nphotographers, etc., for Bill Lowrey to come read their names to us. Bill Lowrey:"
    },
    {
      "tag": "div",
      "text": "Would those who are journalists with us please come to the\r\nfront here. What Iam going to do, is to introduce three people who have been\r\nwith us during the chiefs' exchange, until now. Then I'll let others introduce\r\nthemselves. Over the period of about six weeks, including the chiefs' exchange\r\nvisit, and the lead-up to this conference we have had reporters from Life\r\nMagazine and the Washington Post . (Mario Maluk is invited forward).\r\nFrom Life Magazine is the writer, Janet Rightman. And the photographer\r\nwho is working with her is Malcolm Lenton, not presently in the building, but\r\nyou have seen him around. And from the Washington Post we have the photographer,\r\nMichel duCille. The other journalists we have with us have just arrived and will\r\nbe leaving on the third. They will not be with us the full time, but it is very\r\nimportant that we support them as they seek to take our story to the whole\r\nworld. I'm going to ask that each of the three of them, step forward and\r\nintroduce themselves and their organisation:"
    },
    {
      "tag": "p",
      "text": "My name is Stephen Kroshaw and I'm a writer with the Independent Newspaper\r\n  in London. My name is Thomas Sorenson. Iwork with the Danish Radio in Copenhagen. My name is Tom Pilston, a photographer with the Independent in London. We are grateful for these journalists who have come. They want to see what we\r\nare doing here and understand so that they can take your story to people around\r\nthe world, to grasp the importance of what you are doing. In addition to journalists we have partners from organisations which are\r\nproviding support for you to make this Conference possible. So I'd like each of\r\nthe partners to come forward, introduce themselves and give a word of greeting\r\nfrom their organisations. (Jieng women begin singing, \"give us power to\r\ntriumph over evil; give us power\") Thank you for that wonderful greeting from the women. My name is Jane\r\n  Conally, Sudan representative from the Christian Aid. What's important is that\r\n  we go forward with this. Ibelieve CA is concerned to continue to support this\r\n  series of meeting as well as the process of peace making. My name is Sarah Stuart. Iwork with Jane at CA, as the head of the Press\r\n  Office, concerned with telling the concerns of our partners to people\r\n  overseas. This is my first trip to Sudan so this is a very exciting time for\r\n  me. I'm also writing some articles for BBC radio. My name is Gunter Augustini. Icome from the Protestant Organisation for\r\n  Development. I'm happy to be here with you and witness this important\r\n  conference. Iwas asked to convey greetings from the Conference of German\r\n  churches. Coming from a country that has brought so much suffering to many\r\n  people, we are very aware that if you cannot solve your problems amidst peace\r\n  you cannot solve them amidst war. We support your negotiations toward peace. Iaffirm the saying in Swahili, which says, \"When the cattle join together the\r\n  lion goes to sleep hungry.\" As well there is a staying in Ethiopia that speaks\r\n  of climbing a tree to see afar. We would like to climb the tree with you to\r\n  look into the future in the search for genuine peace in Sudan. We will do all\r\n  we can to support this peace process. Ican only say peace be with you and\r\n  peace be with you all. My name is Johann Svenson and Icome from the Life and Peace Institute. Our\r\n  concern is to strengthen the initiatives of local people in their efforts to\r\n  bring peace. My name is Justin Makuac Maniel, Peace Co-ordinator from the Diocese of\r\n  Rumbek, working together with the NSCC. We were privileged to be at the\r\n  beginning of this peace process, meeting at Loki last June. I'm pleased to\r\n  announce that our Diocesan School in Kitale (Blessed Baghitta Formation Centre)\r\n  has offered to receive Nuer students to study with them. This is an important\r\n  advance. My name is Benaiah Odemba. I'm here to represent Catholic Relief Services.\r\n  We consider the NSCC as one of our strongest partners in Sudan. We are deeply\r\n  involved in this peace initiative and actually believe in building the local\r\n  capacity for bringing about peace. As was said yesterday, peace can only come\r\n  from the people themselves. We believe in peace by and for the people. We look\r\n  forward to working with you in this important service. My name is Louie Riemen from Church of the Brethren and we have been\r\n  partners with NCC since it first began. We are now pastors in the US, and our\r\n  church sends very warm greetings. They ask us to remind you that they pray for\r\n  you and they pray for peace. (Phil Riemen) It is a special joy to be back for nine weeks to help with\r\n  this ongoing peace process. My name is Marc Nikkel. Ibring greetings from the CMS as well as the\r\n  Episcopal Church in the USA, both of which are supporters of this gathering. Igreet you on behalf of thousands of Christians in America and Britain who are\r\n  praying for you each day we meet. I'm Jamera Rhone. Irepresent Human Rights Watch which is an independent\r\n  human rights organisation. We report on the abuses of all parties of all\r\n  conflicts in the world, with the hope that they will be shamed into changing\r\n  their policies and actions for the good of the people. Iam very glad to be\r\n  here with you during this very important gathering. My name is Malcolm Linton. I'm a photographer working for Life Magazine\r\n  working with Janet. We're doing a story about the Conference and we hope it\r\n  goes very well. BL:"
    },
    {
      "tag": "div",
      "text": "Ialso bring you greetings from many organisations in the US who have\r\ncontributed funds toward this meeting. As well, there are hundreds and thousands\r\nof people who are in prayer with us each day of our meetings."
    },
    {
      "tag": "p",
      "text": "TD:"
    },
    {
      "tag": "div",
      "text": "Okay, we will not proceed with our programme, but Iwould like to\r\nmake two remarks."
    },
    {
      "tag": "p",
      "text": "First, Rumbek Diocese, and Torit Diocese and others that we have are not\r\npartners of this Conference. They are actually members of the NSCC. Secondly, we would like to recognise other organisations, such as CEAS and\r\nWorld Vision who have provided considerable support in preparation for this\r\nconference. As well, there are a host of other organisations who stand with us\r\nand support us. Now Icall upon Commissioner of Tonj Country, Andrew Kuac Mayol, to speak to\r\nus. (Exchange of song begins, Jieng, Nuer, reciprocally) Andrew Kuac Mayol:"
    },
    {
      "tag": "div",
      "text": "Brothers and sisters in the Conference Igreet you in\r\nthe name of the Chairman of the Movement, Dr. John Garang de Mabior. Ialso\r\ngreet you in the name of the people of Tonj County. It was really a concern of\r\nour people yesterday that our people did not see me welcoming our guests to this\r\nmeeting house. People were saying that, as a commissioner of this place, Iwould\r\nsay a word of welcome to the delegates in general. Let me proceed, because it\r\nwould have been good for me to welcome yesterday so that the Commander and the\r\nGovernor were also to hear what the Commissioner of TC was saying. But since\r\nthat could not happen, let me proceed with a brief speech, even though that is\r\nnot equal to the speech Ihad prepared yesterday."
    },
    {
      "tag": "p",
      "text": "When we come to the purpose for which we have gathered, we were informed last\r\nSeptember that there would be a Nuer Dinka meeting in Tonj County. Preparations\r\nwere made then, but somewhere in the middle we began to doubt that the meeting\r\nmight not be a success. Why were we doubting? We were doubting because, in the\r\ncourse of preparations, there were things that were supposed to be done. But we\r\nfound that little or nothing had been done as far as some services had\r\nproceeded. Communication was not prompt from Nairobi to our end. We were\r\nreceiving communication at some points, but at others we were lost in the line.\r\nThere were times when we had difficulty knowing who was to do what, who was to\r\nprepare what. But in time we found that Mr. Mario Muor Muor and Tular Deng had\r\nbeen given certain responsibilities. Icame to this place to speak with the\r\nchiefs asking that they get on with the work of construction as quickly as\r\npossible. Building got underway, as did the digging of a well. However, it is\r\nunfortunate that we have only one well, which results in the congestion which we\r\nhave experienced. So later on when we saw Mr. Mario running back and forth, we\r\nwere struck by words like those of Shakespeare, which said: ?? We knew that we\r\nwould have to redouble our efforts. Buildings would have to be built quickly.\r\nLike these buildings were build quickly in a way that is inadequate to the\r\nmodern way of preparation. This is why we have many of us sitting on the ground.\r\nSo much for that, let us proceed. Here, let us come to the very matter for which we have gathered. It is good\r\nto say that we are here to record a very important event in Tonj county in\r\nparticular. This is a rare opportunity, hardly to be equalled in our history.\r\nThe Nuer and the Dinka are one people given their social and cultural\r\nbackgrounds. But in the course of time we have been divided by the enemies of\r\nthe people to fight ourselves. However, it is okay because all of us are aware\r\nthat sons quarrel with their father, and daughters with their mothers, but there\r\ncomes a time when a family sits together to resolve their differences.\r\nYesterday, who could not see the white bull outside here? The bull that was very\r\nfierce, that was almost on the neck of everyone who passed? That bull was not\r\nbrought by accident, but it was brought by design, and that was a design for\r\npeace. So, with the words of the spearmasters over this bull yesterday, Ithought that the entire effort was finished, and that we had come here simply\r\nfor formalities. If we did understand the words of the spearmasters talking\r\noutside over the bull, and even inside here, Idon't think we have much more to\r\nsay. It has been done. We have only to reflect on the wise resolutions which we\r\ncan make to bring the words spoken to their fulfilment. Something small that Iwould have said before, Iwill have to say now. Our\r\nmeeting for peace has brought people from far away. Dr. Peter Nyot is here from\r\nGermany, and Michael Wal has come from the US, both have come from afar to join\r\nwith us. This shows us that this is a serious matter since those from far away\r\nare joining with us here. As well, our foreign press people show that this is a\r\nworld-wide concern, since organisations from far away have sent their\r\nrepresentatives. We have even asked ourselves concerning some people, how they\r\nhave come, if they were invited by the churches or other people. I'm seeing\r\nbrother Samuel Aru with a very serious delegation from Khartoum, so Ihave asked\r\nmyself if Omer Bashir is interested in peace. Anyway, translation of this kind,\r\nmakes a very short speech, to be far too long. Therefore I'll conclude by speaking to the Dinka Chiefs and the Nuer Chiefs.\r\nMine is a word of caution to you. You spoke well yesterday as spearmasters, as\r\nelders, and as leaders. Iwould want that to be repeated today. because we have\r\ncome here to look for peace and reconciliation and unity. Iam not saying that\r\nyou should not air out your views, but that you should air out your views in a\r\nconstructive manner. Don't quarrel here. Don't quarrel here. Don't quarrel here.\r\nYou are to say your viewpoints here cool headed, rationally, and without raising\r\nyour emotions. All of us, the intellectual guest, are here to help you come to\r\nhelpful resolutions. You must say the right thing. It may happen that at some\r\npoint one of you will call for us to close the discussion because we are all\r\nsaying the same things. Avoid unhelpful arguments, matters that are not\r\nnecessary in our discussion of peace and reconciliation. Let us avoid matters\r\nthat look like we are in the courtroom. This is not a court we are creating\r\nhere. So, before Igo, Iwould like my counterpart, the Commissioner, to come here,\r\nso that we extend to each other, the greetings of peace. (The Nuer\r\nCommissioner comes forward, and the two grasp hands, holding their hands aloft\r\nbefore the community; the people on both sides respond with songs, chants,\r\naffirming the meeting. Nuer move into a full chant with extended responses). TD: Idon't have much to do, since the Commissioner has already invited the\r\nCommissioner from Leer. Commissioner of Ler, Joseph Juac Kon:"
    },
    {
      "tag": "div",
      "text": "I'm greeting you in the name of\r\nGod, in the name of our land, you, the Dinka and Nuer, our guests, and you who\r\nhave organised this conference. As well, I'm speaking of the peace that was\r\nsigned on the 21st April, 1997. So I'm greeting in the name of the Peace\r\nAgreement. Iam the person responsible in the government of Dr. Riak Machar for\r\nthe Co-ordinating Council. Ialso greet you in the name of this Council. When\r\nthe government was formed, the former commanders who were in the bush, these\r\nwere chosen to become the governors. . . . Maker Macek. When Iwas appointed and\r\ncame to Leer as its Commissioner, Iwas told that there was a grassroots peace\r\ninitiative. Some of my leaders were taken to Loki for the meetings, and soon a\r\nnumber of abductees taken from our people were returned to us. Iwas there to\r\nreceive them as they came home."
    },
    {
      "tag": "p",
      "text": "Icame here with fourteen chiefs from my area and others from other areas,\r\nsuch regions as Akoba and Nasir on the East Bank. And those far north of Bantiu.\r\nWe all came together with firm hope and enthusiasm for this peace. We came\r\nhoping that the Nuer and Dinka will be able to live in peace. We, the Nuer from\r\nthe Western Upper Nile, all came, except those from Menkin in the Bul area. You\r\nall know the conflict that continues there, and we ask you to hope with us that\r\nthe fighting in that region will be brought to an end. Icame here with the\r\nfirst Brigade Commander, and Acting Zonal Commander, Peter Pajiek, we came\r\ntogether so that he can talk to his forces, to preserve the resolutions of this\r\nimportant, historical occasion. We also came with Commander Gabriel Both Yol who\r\nis in charge of security in the Leer State. As well, because of the support of\r\nthis peace by Dr. Riak Macar, the General Secretary of the USDF has also come so\r\nthat he can report back the resolutions that are made here. Gabriel Yuol Dok, as\r\nSecretary of the Party is with us. The Khartoum Agreement was signed by Samuel\r\nAru. He did not come here because he is a son of this area but because he is\r\nwith Riak in the Government, and he has come to witness this important event.\r\nThe Southern Defence Forces/Movement are represented by Commander Peter Riir Puk, (PRP comes forward and says that all the senior officers of the SPLA know\r\nme). The speech of the Governor of Bahr el Ghazel, Nhial Deng Nhial, made me\r\nvery happy, when he said that the matter is not simply for the organisations to\r\ncome together, but that we share common objectives. Having heard this we all\r\nslept very soundly, with the hope of these words. Also, as we are witnessing\r\npeople as they speak, we are further convinced by the actions of Commander Selva.\r\nWe are glad to see his firm, practical commitment to facilitating this effort\r\ntoward peace between our peoples. Iwant to correct the statement made by our elder William, yesterday, when he\r\nsaid that he was a thief. He did not mean that he himself was a thief. We are\r\nall children of one father. Those who are raiding cattle are William's children,\r\nand thus he identifies with them. It seems this was misunderstood. Historically,\r\nwe Nuer, have so many Dinka with us, and so many of our chiefs were originally\r\nDinka. When Dinka came to settle in our land, we usually gave him the first\r\nplace, choosing him as leader. We have no difficulty with a man from afar being\r\na leader among our people. Iconclude my speech offering that history. Igreet you all in the name of\r\nJesus Christ our Lord. TD:"
    },
    {
      "tag": "div",
      "text": "(What commander Selva said as he opened his remarks yesterday was\r\nsimply a joke. There was no reference to the elder, William himself. It was\r\nsimply a humorous comment). Our next speakers will be women, one from Bahr el\r\nGhazel, and one from Upper Nile. The first is Awut from Bahr el Ghazel, to be\r\nfollowed by Deborah Nyandien from Upper Nile"
    },
    {
      "tag": "p",
      "text": "Awut Deng Acuil:"
    },
    {
      "tag": "div",
      "text": "Iam called Awut, a woman of Rek and Agar Dinka. Ihaven't nothing great to say today. In terms of age Iam younger than most of\r\nyou. Iam only a child. The joy of the In such occasions, whether you are young\r\nor old, it will not prohibit from the young from speaking. Igreet you all, and\r\nconsider you all as my children. Women gives birth to a man, who becomes a white\r\nhaired elder. What Iwant to say is that this gives us great joy that Nuer and\r\nDinka should come together for all of us have suffered, with many women and\r\nchildren killed during the fighting between our peoples. Iexpress my\r\nappreciation to NSCC and all affiliated churches that have brought us together.\r\nIexpress my thanks to both for SPLA as well as the USDF, for if they had not\r\nagreed, it would not have been possible for us to meet in this way. Ithank all\r\nthe chiefs and elders, Nuer and Dinka, who have come here knowing that fighting\r\nwill get us nowhere, and that we must discuss our differences in this important\r\ngathering. Ithank the foreigners who have come all the way to Wunlit to sit\r\ndown with us and observe our negotiations. Iwill not speak long."
    },
    {
      "tag": "p",
      "text": "This is not a court, but a process of reconciliation. The women of Bahr el\r\nGhazel, concerning their children, those they have given birth to, that they don't want their offspring to be killed any more. Yesterday someone said that\r\nthe women had stopped bearing children. Not only have they ceased to bear, but\r\nthey wish that those who are in the army, as combatants could return to their\r\nwombs again. It is both the women of Nuer and Dinka who have borne children, but\r\nit is not our desire that our young should die without good reason. What Ibeseech you, the chiefs and elders of Nuer and Dinka, that you will\r\nsettle these differences, that you come to final resolutions to stop the killing\r\nof our children. I'll do as the Commissioner of Tonj has just done, Icall on\r\nDebora to come forward that we as women can greet one another (Debora comes\r\nforward; Awut begins to sing, \"Dooray, dooray, we have come for peace\"). We hope\r\nyou have heard our voices. I've come to express my joy in this peace effort. Ihave nothing more to say, and give place to Deborah. Deborah Nyandien:"
    },
    {
      "tag": "div",
      "text": "Iwill speak, and Iwill use my Nuer language. The\r\nreason Ispeak in Nuer I'll tell you now. Iam called Deborah Yaar Jieng. Those\r\nfrom Yirol and Rumbek will know me. My father and mother were Nuer who left\r\ntheir home for Dinkaland long ago. When they travelled, they went to settle near\r\nYirol where my uncle, Nyibol, my uncles are here now. When Imarried, by\r\naccident, Mathiang Gok knew that their daughter was taken back to Nuerland. Iwill stop here concerning my own history, going to the centre of what Ihave to\r\nsay."
    },
    {
      "tag": "p",
      "text": "Igreet you in the name of all women who have been created by God to bear\r\nchildren. People of God, you the NSCC, and all related churches, Igreet you\r\nwith appreciation for your efforts to bring our peoples, Nuer and Dinka, will\r\nhave peace. Ialso greet all our guests who are here. Specifically, Igreet Bill\r\nLowrey, with thanks a hundred times over for his efforts throughout this long\r\nprocess until we meet at this stage. The two communities who first went to\r\nBilpham to train to fight this war against the Arabs. Igreet our elder Samuel\r\nAru Bol who has come to witness this meeting. Iam a women's leader among women.\r\nIhave come with 11 women from Bentiu to attend this meeting. Six women have\r\ncome from Khartoum, all Dinka women have come to observe. The Nuer women have sent a message to the Dinka women, which Inow declare.\r\nThis is similar to that given by Awut our sister. Since the 1960s, beginning of\r\nthe war of Anyanya I, we want to know from the men, why our children should be\r\ndying like this all these years! My word is like that of Awut. You the Nuer and\r\nDinka women, and even those from outside, Iwant to ask the men this question.\r\nWhat Iask is how it is that, since the creation of the earth, whether in all of\r\nhistory any man has died with a child in his womb? I'm not asking for an answer,\r\nbut Iwant you to think about it. Be quiet, and consider this question. I'll add\r\nthis as well: Has any man ever felt the great pains of labour in giving birth?\r\nWomen, we alone know the pain of giving birth, and our words and our thoughts\r\nmust be taken seriously. Don't discard the importance of our words! You Dinka\r\nand Nuer don't often consider the thoughts of women, but today hear us clearly,\r\nconcerning all the children have died among us. I'm saying this because , while\r\nyour are in discussion, , know that we will watch you carefully. If you don't\r\nultimately take our words seriously, then you must understand we will make a\r\nrevolution, and we will stop giving birth. Iknow you men are laughing because\r\nyou say you are married through payment of bride price over which women have no\r\ncontrol, and also that women have no power to make a revolution against you.\r\nHowever, we are speaking today, not as the women of the past. Iexhort you also,\r\nnot to discuss, without taking a break from your deliberations. Take an\r\noccasional break. Ithank you and conclude here. TD:"
    },
    {
      "tag": "div",
      "text": "Dr. Haruun Ruun invites the two Commissioners who have spoken as well\r\nas the two women who have just spoken to come forward."
    },
    {
      "tag": "p",
      "text": "HR:"
    },
    {
      "tag": "div",
      "text": "Iam emotionally moved and cannot express my feelings strongly\r\nenough. Iwould like to summarise it in this way. Iwant the two Commissioners\r\nand the two ladies, and myself to join our hands, and declare that we will\r\ncommit ourselves to do all we are able to bring this peace to fulfilment. We\r\nwill urge our friends here in Sudan, in Africa, and outside Africa to stand by\r\nus, and to pray for us. Let me repeat the joke that was said earlier. The ladies\r\nsaid, we will go on strike. It is powerful, that women should refuse their\r\nhusbands. We are no longer traditional ladies, we are women of the modern world\r\nand we know what we are able to do. Let us join hands. Now, you ladies, also,\r\nknow that some of our boys are dying because you are saying, if you ;have no\r\nmoney and you have no cattle how are you going to marry me? You cannot win a\r\nchild unless you have a cow with milk. We are all responsible for what happens\r\namong us. And we must all together accept the responsibility and work toward a\r\nsolution. (The 2 women and 3 men join hands together in the centre of the\r\nhouse of meeting and photographs are taken. They lift their hands up together.\r\nThe Dinka begin to sing, \"We have come for peace . . .\"). Thank you, all of\r\nyou. Thank you."
    },
    {
      "tag": "p",
      "text": "TD:"
    },
    {
      "tag": "div",
      "text": "Let me read for you the programme. following. It is now 12:50. We\r\nwill return at 2:50 p.m. The order of business will be as follows. What we will\r\ndo is this. Any aspect of clarification can be made later. The Dinka will begin\r\nto speak of their experiences during recent years. The leaders of the Dinka will\r\nspeak first. The Commissioners of Yirol, Tonj, Rumbek are full participants and\r\ncan share in the content of the conference. Ideclare that we are free to go for\r\nlunch."
    },
    {
      "tag": "p",
      "text": "Afternoon Session, 3:15 p.m. TD:"
    },
    {
      "tag": "div",
      "text": "We have guests who have come who need chairs. I'm asking you Dinka to\r\nassist with this. Let us start our evening session. Before we move to the Dinka\r\nside we would like to make a few introductions. When we were in Nairobi we\r\nformed a team of Rapportuers, individuals who we believe are devoted to the\r\npeace process. These people are here with us, though two were unable to join us\r\nfrom Europe. Before us are:"
    },
    {
      "tag": "p",
      "text": "Mulana"
    },
    {
      "tag": "blockquote",
      "text": "Dhol Acuil."
    },
    {
      "tag": "p",
      "text": "Mulana"
    },
    {
      "tag": "blockquote",
      "text": "John Luk."
    },
    {
      "tag": "p",
      "text": "Timothy Tut Chol, was responsible for contacts between NSCC and the SPLA On the side of USDF we have Bill Mar. We have Faruk Gatkuoth, also of USDF. The two who could not attend from Europe are Ruth Danier, and Majok Guando.\r\n  Inow invite Rev. Bill Lowrey to tell us something of the preparations. BL:"
    },
    {
      "tag": "div",
      "text": "Ever since the Loki Accord was signed on 10th June, 1998 we have had\r\na team working on this Conference to take place in BeG. When we met in Loki the\r\nchiefs and churchleaders from the West side of the Nile put together their plans\r\nfor this conference. One of the things they said was that this would be a\r\nconference of the people, in which local people would take the lead, and it\r\nwould not include poliltical leaders. They may be present as observers but not\r\nas participants. They said that all of the people must be mobilised to\r\nparticipate in this conference, that NSCC should prepare the Conference, and\r\nthat observers from around the world must be invited to attend. So for these\r\nmany months there have been numerous people involved. Gradually the group has\r\nchanged, with women and chiefs always part of the process, and always there has\r\nbeen the desire to have Dinka and Nuer from outside as full partners in the\r\nprocess. So Inow want to introduce you to some of those people who are here\r\nnow. Some are not present, but have worked hard over the months, but I'll\r\nintroduce you to those who are now with us. The Chairman of our Team is Dr.\r\nHaruun Ruun."
    },
    {
      "tag": "p",
      "text": "We have two people who have worked to mobilise the people in BeG and in\r\nWestern upper Nile. One is Rev. Matthew Mathiang Deng. The second is Judge Telar\r\nDeng. We have had two women who have been involved with us, Awut Deng whom you\r\nheard speak this morning. The second is Nyawaraga Joshua who is not able to be\r\nwith us today. We have asked intellectuals from the Diaspora to come and be part\r\nof this team. One of those is Dr. Peter Nyot Kok from Germany, and the other is\r\nDr. Michael Lual Duany from the USA. Always, as it was possible, we have asked\r\nthat Chiefs meet with us so that they could observe if we were keeping on the\r\npath that was set for us at Loki. And I, Dr. Bill Lowrey, have served as a\r\nfacilitator for this Team. The two chiefs who have been most involved with us\r\nthroughout this process are, first, Chief Dut Malual, who Iunderstand is sick\r\nin Nairobi, and we are missing him. The second of them is Chief Isaac Magok from\r\nLeer (stands, waving his fly whisk). Now Iwould like to tell you a short story from the Bible, that sets the\r\nstage for the Dinka to tell their story before the Nuer, and for the Nuer to\r\ntell their story before the Dinka. This is a story that Itold in Loki for the\r\nchiefs and leaders in Loki, and that was the beginning of three days in which\r\nthey told their stories, each group to the other. As you know, today is Sunday,\r\nwhich is the first day of the week. It was on a Sunday, after Jesus had died on\r\nthe cross and been raised from the dead, that this story took place. Most of the\r\ndisciples were together in a special room, but one was missing. His name was\r\nThomas. And suddenly Jesus appeared in the room, and his message was, \"Peace be\r\nwith you.\" The disciples were excited to see him, but when they told Thomas, he\r\nwould not believe it. He said, unless Isee him, and put my fingers in his side\r\nwhere the spear went in, Iwill not believe it. One week later, again on a\r\nSunday, Jesus appeared in the room and Thomas was present. Jesus said to Thomas,\r\n\"Reach out your fingers and feel the wound where the spear went in.\" This is a conference about reconciliation. Thomas could not be reconciled\r\nuntil he could see the wounds that he had helped to cause, and touch the places\r\nwhere Jesus had been wounded. For seven and a half years now, Nuer have caused\r\nwounds and injuries to the Dinka, and for seven and a half years now, Dinka have\r\ncaused wounds and injuries to the Nuer. If you want to be reconciled you must\r\ntell each other the wounds you have suffered, you must look at each other, and\r\nreach out and touch one another in the places where you have been wounded. It\r\nwill be important that you speak the truth, that you not hide anything from\r\nanother, so that the reconciliation goes deep, and it is a genuine healing of\r\nthe wounds you have inflicted. When you speak the truth, when you say the hard\r\nthings to each other, when you identify the issues that must be solved, then you\r\ncan reconcile relationships, and you can walk out of here, saying now we are\r\nbrothers and sisters once again. In just a few minutes, you as the Dinka, will\r\nbegin to tell the Nuer your stories. Do not hold back. Tell the true stories, no\r\nmatter how painful it may be. In just a few minutes, when the Dinka tell their\r\nstories, you Nuer, you must listen carefully. Do not debate with them, do not\r\nargue with them. Relationships begin with listening. And when they have finished\r\nyou will tell your stories to them. The time of beautiful speeches is over. It\r\nis now time for the hard work of peace. You must make a peace that will last.\r\nWhen Isit down, this will be your work. You, Nuer and Dinka, must make this\r\npeace and determine how deep the peace will go. May God give you the strength\r\nyou need. TD:"
    },
    {
      "tag": "div",
      "text": "Okay, Iintroduce to you Dr. Peter Nyot Kok, who will take the chair\r\nas the Dinka present their narratives. The first speaker will be Chief Dut Yol."
    },
    {
      "tag": "p",
      "text": "Dr. Peter Nyot Kok:"
    },
    {
      "tag": "div",
      "text": "Igreet you warmly, you Nuer and Dinka, you chiefs\r\nand elders, women and youth, you soldiers, may you all be blessed here. The talk\r\ntoday and onwards is for you the chiefs to talk, not me. However, after you have\r\nconcluded your statements, Iwill speak. Peace and reconciliation began\r\nyesterday when a white bull was sacrificed, and libations were poured. We had\r\nalready raised the house of peace, but what remains is the plastering of the\r\nwalls and floor and roofing of the building of peace. However, this is not easy\r\nwork that is before us. If we plaster the house wrongly it is likely that\r\ninsects will still bight us. If we don't put up good poles it is likely that the\r\nhouse will leak. Iwill start with what Bill Lowrey has said, that we must draw\r\nfrom the experience of our ancestors. We do each stage of the work so that it is\r\nsuccessful, and it is a solid house. During our meeting we will begin with the\r\nchiefs who attended the meeting in Loki, and we will move ahead so that a\r\nrepresentative from each county has opportunity to speak. Iam appealing to the\r\ntranslators who are speaking in Dinka, Nuer or English that you work to\r\ntranslate accurately, because this is a difficult aspect of our work. Now Iwill\r\ncall Chief Kulong Marial and, secondly, Chief Juol Macok. Together they will\r\nhave one hour to speak."
    },
    {
      "tag": "p",
      "text": "Chief Kulong Marial:"
    },
    {
      "tag": "div",
      "text": "Iwill not speak at length. Ihave been a chief for\r\na long time, in the area of Mapeer in Rumbek. By ethnic group Iam Agar from BeG\r\nRegion. Some months ago Iattended the meeting in Loki for the purpose of\r\nreconciliation between Dinka and Nuer. When Ireturned from Loki Idisseminated\r\nthe content of the Accord among Dinka and Nuer. Recently, Ialso participated in\r\nthe exchange visits of the Chiefs, stopping at Leer, and here. Yesterday we\r\nbegan our reconciliation by offering a white bull, and we said all that needed\r\nto be said, and the bull is now in its eternal existence above. It has always\r\nbeen our traditional practice that, when we have conflicts, as we often do, we\r\nmake sacrifice and we are able to reconcile and return to our normal life.\r\nUsually we conclude by confirming an accord between ourselves and Nuer with an\r\naccord that states we will no longer raid one another so there is no more loss\r\nof property or life. At the end of every conference we come out with\r\ndeclarations which are sent to Leer, Mapeer, Tonj, and elsewhere, confirming\r\nthat we should no longer fight each other. And the present reconciliation, being\r\nassisted by the churches, means that we address the issues that divide us and\r\nbring conflict and we put an end to them. Sometimes back we had a conference in\r\nGainlel, and we sacrificed bulls and that concluded our conflicts between Dinka\r\nand Nuer. As well, we had a conference at Wuniloor, and that meeting ended our\r\nproblems until the conflicts of Anyanya Ibrought out new conflicts between\r\nDinka and Nuer. The border conflicts intensified again with the tension between\r\nSPLA and Nuer, giving thieves concerned with their own well-being opportunity to\r\nexploit our differences. As well, our differences have been exploited by our\r\nenemies. D&Nare brothers, who share common borders. With our sacrifice\r\nyesterday our hostility was brought to an end. There are people who are against\r\nthis peace agreement, who have benefited from our hostility. There will be some\r\nwho will come trying to persuade our peoples on each side to believe that the\r\nother will not be faithful to our agreement, but we must not listen to these\r\ndeceptive words. We have always been fighting each other, D&N, but has never\r\nbefore happened that we deserted lands such as Mapeer. Today it is other people\r\nwho have come in to exacerbate these conflicts. An example is that our ancestral\r\nhome of Rumbek was in the hand in the enemy. Now that we have captured it from\r\nthe enemy we have made alterations and we are able to occupy our own lands\r\ncomfortably. As Isaid, in respect to Rumbek, Ican now return to my ancestral\r\nhome of Mapeer and we can settle there once again. Normally, in the relationship\r\nbetween us and Nuer, what keeps conflicts from being concluded, is when various\r\npretexts are brought up, saying we must locate the thief, and find the details\r\nof the case. All of these are delaying tactics, which should not deter us from\r\npeaceful coexistence. Yesterday we sealed our covenant. It is not in Dinka\r\ntradition that we should begin accusing one another, or quarrelling with one\r\nanother, after sacrifice is offered. We should not be doing this here. Our\r\ngathering here is heard all over the world, in Khartoum and Juba, and many other\r\nplaces. Thus, in my view, there is no use in talking about past grievances. What\r\nwe need to focus on is concrete actions to be taken to bring peaceful\r\nco-existence between our peoples. From this day forward we must stop the killing\r\nof women and children, and destruction of our properties. We reconcile ourselves\r\nfrom Yirol, Rumbek and Bentiu. Iwill not proceed further with my address. This\r\nis the message I'm telling the people of Gogrial and Tuic, that our\r\nreconciliation was concluded yesterday with the offering of our white bull. This\r\nis my word."
    },
    {
      "tag": "p",
      "text": "PNK:"
    },
    {
      "tag": "div",
      "text": "We have heard Chief Kulong Marial. Our second speaker is Chief Jol\r\nMacok."
    },
    {
      "tag": "p",
      "text": "Chief Jul Macok Lieny:"
    },
    {
      "tag": "div",
      "text": "Iam Agar from Rumbek. Iam grateful to all who\r\nhave organised this conference. I'm grateful to Bill Lowrey and greet him. Iwarmly greet my brothers from Bentiu, as well as those from BeG. Also, Igreet\r\nthose from Nairobi. We are here for peace and reconciliation, which we have\r\naccepted. This conference we declare that we have fully accepted this\r\nreconciliation. If we were in a court Iwould have asked questions from the\r\npeople of Bentiu. When people first began going to Bongo, the training camp, it\r\nwas because of the problem of the South that took them. When those who went to\r\nBongo split apart, it was unfortunate that we accepted that separation. Inever\r\nthought there was a government in Leer, until Isaw the Commissioner of Leer. Ihave no bad commissioner from Leer. When we said earlier that we should save\r\nlives, Ialso accept fully what you said, because Ihave a border with Chief\r\nMalual Wun. In my community Ihave a few people from Bentiu, like those staying\r\nhere at Wunlit. Our relationship with the people of Adoor, that is those of\r\nYirol and Rumbek, is that we are children of one family. We had no part in the\r\ndivision that had happened. When Isaid Iwanted to ask question of the people\r\nof Bentiu, Iactually wanted to ask questions of those of Adoor. As a good\r\ngesture, and to declare that we accept peace, Iwant to say that those who\r\nraided cattle on the 18th have now been apprehended, and the cattle are to be\r\nreturned. The civil administration in Rumbek ordered all chiefs to apprehend the\r\nraiders and return the cattle. This has now been done. (TD: Ibelieve Chief\r\nChul was speaking of two raids. One was on the 19th of February, and the other\r\non the 8th. Ibelieve that the those who were responsible for the first have\r\nbeen apprehended.) Before all who are in attendance here Iwant to affirm\r\nthat we have agreed to accept the peace between us. At present we have people\r\nwho have gone from Yirol to Adoor and they have been welcomed by the residents.\r\nIwill conclude here by saying that we have reconciled with the people of Malual\r\nWun as of today."
    },
    {
      "tag": "p",
      "text": "PNK:"
    },
    {
      "tag": "div",
      "text": "We have one half of an hour remaining from the time given to Rumbek,\r\nand we invite any other speakers from Rumbek, if they have anything to\r\ncontribute. From Rumbek we have previously four people. We have Marial Malwal\r\nArop and Col Madul Rilpiou. Inow give opportunity to Chief Marial Malual Arop,\r\nto speak toward a peace that cannot be broken, cannot be demeaned by crooks."
    },
    {
      "tag": "p",
      "text": "Chief Marial Malual Arop:"
    },
    {
      "tag": "div",
      "text": "What Ihave to say is brief. Our father, Malual\r\nWun, Igreet them with those who came with him. Ialso greet all the chiefs from\r\nBeG. Iwant to greet our father Malual Wun is because he was active working\r\ntogether with my father. When Chief Kulong returned from Loki Iasked if Chief\r\nMalual was still alive. Malual is now the only one remaining chief with sons of\r\nthe chiefs who once were his counterparts. We are all children, of this one\r\nfather who remains, Malual Wun. If there is a complicated problem, and your\r\nfather is still alive, he would be the one who restrains the children from self\r\ndestruction. The wisdom of CMW and our wisdom is not the same. He began working\r\nsince the time of the British with our fathers. Most of us began working during\r\nthe time of independence with the Arabs. We have always thought that CMW of the\r\nsaying in Dinka. Alion said to a father to give him his children so he could\r\neat them. Today all our fathers are gone except CMW. The lion ate all the\r\nelderly people, but one old person was hidden by his children. The lion that ate\r\nthe elderly people happened to swallow a snake with water. The snake would come\r\nfrom his stomach, peaking out from his mouth. On person suggested that he bring\r\nand old man to take the snake from the stomach of the lion, wouldn't the lion\r\neat the old man? The lion accepted the old man to be brought. He came and asked\r\nthe lion to lay down, and tied a rat to the leg of the lion. Then the snake\r\ncrawled out to eat the snake."
    },
    {
      "tag": "p",
      "text": "To you, our father Malual, you are the only father of all our peoples among\r\nD&N. Now we want to draw out the snake now. If you have accepted that the\r\nsnake in your stomach should be brought out by the rat we have accepted to bring\r\nout the snake, and that is why we have killed the white bull yesterday. Let your\r\nlion not come again to attack the children and the women. How could we refuse to\r\naccept peace? The toc which we have been sharing. Is your area Ganlil now\r\nempty of people? We have accepted reconciliation. When we bypass what our\r\nbrother said before, and we sit to discuss the past grievances, we are quenching\r\nthe fire with water and not quenching the fire with more fire. If there is any\r\ndisagreement between the sides then we will not reach our conclusion. Let us\r\nclose the old chapter since Anyanya Iand begin a new chapter. This is not a\r\ncourt. If it were a court we would enumerate our grievances. If we are committed\r\nto reconciliation, let us not account for the past. Let us simply enter the\r\nreconciliation and act as brothers. Let peace multiply as each person accepts\r\npeace and returns home to plant this seed among his own people. We people of\r\nRumbek, we have a commissioner. We are following the policy that has been put in\r\nour mind since the conflict began. We are continuing with it. To conclude my\r\ntalk, it is that we used quarrelled in the past, but today our conflict is\r\ndifferent. Ibelieve we are one, we can follow each other's footsteps. We have\r\nnow accepted reconciliation and peace. If people sit in such a house as this,\r\nthis is a house of God. And if somebody comes against this you, our brother.\r\nWhatever the quarrel in the past, let it conclude. My word stops here. PNK:"
    },
    {
      "tag": "div",
      "text": "Ithank you for your word, you people of Rumbek. Those of Rumbek are\r\nleft with 5 minutes. Chief Col Madol Arilpiou will speak in this time."
    },
    {
      "tag": "p",
      "text": "Chief Col Madol Arilpiou:"
    },
    {
      "tag": "div",
      "text": "The first person Iwill greet is God. As we are\r\nhere in this house of God, we have been taught by the Christians. God hates\r\nJealousy and hatred. God has tied the leg of hatred down now. This jealousy is\r\ncalled You, our brothers, Nuer, and Jieng, we have been made to collide. The two\r\npieces of wood that have been put together to cause the fire. God has divided\r\nthings long ago. He gave Nuer the young cow. He gave Dinka the old cow. This\r\nbrought conflict, that we must now bring to an end. We Dinka we are willing to\r\naccept reconciliation with all our hearts, but we have some doubt about our\r\nbrothers Nuer. You, Nuer, when we have something good, you change it into\r\nsomething bad the following day. The reason Isay this, is that we went to Bongo\r\nbecause we have a problem. The Arab claims this land. When we went to Bongo it\r\nwas because of that problem with the Arabs, but then we began to quarrel among\r\nourselves. We have killed ourselves in greater numbers than our original enemy\r\never killed us. The conflict between D&N, has led to the point that the\r\nwomen are now the ones who die in large numbers. In the old days the men died\r\nand were eaten by birds, but today the women die. This has come from you Nuer.\r\nYou are the cause of the death of women. You Malual, you stop that attitude, and\r\nstop killing women and children for no reason."
    },
    {
      "tag": "p",
      "text": "PNK:"
    },
    {
      "tag": "div",
      "text": "The addresses of Rumbek County are finished, and Ithank you three\r\nchiefs. We have heard your words in full. As well Ithank our brothers Nuer for\r\nlistening carefully to what has been said. This is not the end of those who will\r\nspeak. We will continue in the days ahead. Now we turn to the list of Chiefs of\r\nTonj County which Ihave just received. There are three people: Chief Dut Yol,\r\nChief Gum Mading Akucbeny, and our mother Sadia Manok. Just now Iinvite Dut Yol\r\nto come speak. You, people of Tonj County, you have but one hour to speak."
    },
    {
      "tag": "p",
      "text": "Chief Dut Yol:"
    },
    {
      "tag": "div",
      "text": "My name is Dut Yol Manyok, a man of Tonj County, and the\r\nsection of . Iwill not speak at length. What Iwill say first is that Iam\r\npleased that all our people have gathered here. First Iwill speak about those\r\nthings that have gone bad between us. Idon't know what has killed me. First of\r\nall, we have simply been staying with the Nuer. When we went to the bush they\r\ntook our children. What made them to quarrel in Bongo we still don't understand.\r\nThose who stayed with us as our brothers, they began to kill us. Some were\r\nstaying with us and our people tried to kill them, but we refused. Those who\r\nwanted to return to their homes, we accompanied them. Some are still staying\r\nwith us today. We have the chief called Mading Manyel who was killed together\r\nwith his entire family and 18 cattle camps. Also 150 people were killed, and 5\r\nof our young women were taken who are with them until the present day. When they\r\ncame they also attacked the section of Det Madheu. They took almost 20,000 head\r\nof cattle. 90 people were killed at once. Also, during the rainy season, they\r\ncame and attacked the place of Makuac. When they came back to attack for the\r\nsecond time they took everything, leaving not even a dog or a chicken. they\r\nraided the entire cattle camp. All the homesteads were burned, all of Makuac was\r\nburned to the ground. After 11 days Aboc was raided, Cattle camp of , Wunicuei,"
    },
    {
      "tag": "p",
      "text": "Mabior, Aboc, Makuac, Waiyaar CC, Wunicuei, Bikliir. They took all the\r\nchickens, the women children. Only a few of us remained who ran away. Now that\r\nyou have come Iam not angry, but happy. If even one person remains, and we have\r\npeace, that person can multiply. What I'm not happy about is our brother Nuer\r\nwere the ones to start to explain why they have been killing me. This would have\r\nbeen far better. We have been reconciled by a man called Telar Ring in a place\r\ncalled Maal. Why they kill us, we would have preferred if they had spoken first\r\nso that they can explain precisely why they have killed us as revenge. Since\r\nthey are with us now, and they all know me. some of them have their children\r\nstaying with us here. Those children who Ihave accompanied back home, they are\r\nhome now. Inow want our brothers to speak out the grievances they have against\r\nme so Ican understand. But the source of our quarrel is this, the Nuer and we\r\nare one. Idon't look at them as enemies. We share one toc and one border\r\nbetween us. We regard them as our elders to ourselves because their father is\r\nelder. When their father was born he could not her but was deaf. When my father\r\nwas born he was blind. He came in a secret way, my deaf uncle to raid my cattle\r\nbecause my father could not see. My father went to God and said that this\r\nbrother comes and steals my cattle. And God said, okay, it is something good.\r\nGod gave a girl to our Dinka father who was blind. Once he married, he never\r\nproduced another blind man among his children. And the deaf father of Nuer never\r\nproduced a deaf man. All their children have been healthy. Idon't know what has\r\nhappened. After we have produced good children we still carry on this old\r\ntradition because they have not liberated themselves from the way of their\r\nfather. Today God went to bring a foreigners and told them, if these two peoples\r\nquarrel, stand between them, and see why they are quarrelling. Today, especially\r\nit is the Church leaders who have come here. It is the right time for them to\r\nask us what our problem is so that it can be resolved between us. What Iknow in\r\nmy heart this year, after they have killed our children, and killed our\r\nchildren, and taken all our cattle, and all the goats, after all of this, what\r\nremains is only their brother who is blind is their brother. They can take their\r\nblind brother and kill him. This is not the first reconciliation talks. We began\r\nthem in Gainlel, and again we came to Mal. Today, in Wunlit, this is the third\r\npeace reconciliation. Those of you who have organised this conference, Iask you\r\nto invite our brother Nuer to speak out precisely what is in them, why they have\r\ndestroyed us. You who organised this conference, Iwill not bother to talk about\r\nthe loss of the cattle, or other property, or dead people. What we want from\r\nyou, our brothers, are those young girls. Sincerely speaking, Iask you to send\r\nour girls back, we will console ourselves with them. Please release them to us. The second point to finalise my talk: if we want to be reconciled. Yesterday\r\nthe white bull was killed. Iwill go back to my home and sit in my house, and\r\ntry to buy simple goat. My talk is ended, but this point Iwill stress. (Goes across the room to put his house on the head f the old chief. he did\r\nthis to show that his heart is open, he has nothing remaining, but his heart is\r\nopen to reconciliation.) PNK: Iam grateful for the word from Chief Dut Yol and for the gift he has\r\ngiven chief Kuol Muon. At the end of his talk, and as a sign of his\r\nreconciliation he has offered his had to the Nuer chief. Now we invite Chief Gum\r\nMading Akucbeny. While we relay our story telling about past events, we also\r\nwant to point to action we need to take to make peace in the future. We have\r\nbetween Gum Mading and Chief ... one half an hour. Chief Gum Mading Akucbeny:"
    },
    {
      "tag": "div",
      "text": "From the beginning Iwant to tell you this\r\n(begins to sing his own song, to which people respond; begins by saying, \"Iam\r\nGum Mading . . .\"). My name is Chief Gum Mading Akucbeny. Ithank God and the\r\nNSCC for choosing Wunlit as a location for this conference. To my mind a genuine\r\nreconciliation will not include only D&N, but it must include all Southern\r\nSudanese. This conference has also provided us with opportunity to meet with our\r\nchildren who have been cut off from us in Khartoum whom we've not met for a very\r\nlong time. This conference has also provided an opportunity for our kinfolk in\r\nEurope and America to come so that we can meet one another. It is very good that\r\nour children whom we've taken to school to learn English and Arabic have also\r\ncome to Wunlit, and that all people will now be able to hear that we have met at\r\nWunlit to bring peace to the land. Yesterday during the opening the military\r\nauthorities of the SPLA were here and we have seen them. We did not, however,\r\nknow that there were military and civil administration from Bentiu who were\r\nlikewise with us. We are glad to hear that there is a military commander coming\r\ndirectly from where Riak is staying to be in our deliberations, and that he will\r\nreturn to tell Riak of our progress."
    },
    {
      "tag": "p",
      "text": "The first thing Iwould like to say, concerns we chiefs, who have remained\r\nwith our people in S. Sudan and sent our children to schools or to Bilpham for\r\ntraining. The problems that occurred at Bilpham did not begin there, but they\r\noriginated right here prior to their departure. In 1984 a group of young men\r\nfrom Gogrial and Tonj began departing for Bilpham. As they went they naturally\r\nhad to pass through Nuerland. As they reached Abuong they were intercepted. Many\r\nwere killed and others were drowned while some returned. This had nothing to do\r\nwith the leadership. In the spirit of reconciliation we must begin with the\r\ngenesis of the problem. It is not with the leadership. We would like to know the\r\nchief who was responsible for the killing of our young men as they were en route\r\nto Bilpham. It is important to begin with the genesis of the problem. That is\r\nwhy Iasked for the senior military commander. That route through Abuong became\r\nunsafe for our the passage of our people and we were forced to move any parties\r\nthrough Bor area as our only alternative route. Ichallenge you, asking someone\r\nto come and tell me that this is not the real state of affairs, as Ihave\r\ndescribed it. The route through Bor was a far longer route for our people. When\r\nwe decide to reconcile and become one, Imust tell you that, currently, we now\r\nhave two of our people with you in Nuer. They have now devastated Gograil, . . .\r\nand Tuic areas. When you prepared to come, did you first really speak with them\r\nto ask what they intend to do. If we are sincere about reconciliation Iaddress\r\nmyself to those from Nuer area. You have with us Carbino Kwanyiny Bol and Matip.\r\nDoes it really make sense for us to reconcile if they are not with us, because\r\nthese two people are with you now. If we reconcile without their participation Ibelieve our efforts will be incomplete. s we are all Southerners, we have lost\r\nour women and children, cattle and properties. Iam glad to here that the\r\nCommissioner from Bentiu is here with us. As you saw yesterday, we have\r\nresponsible people with us here from our side. Iwould hope we can also speak\r\nwith Riak Machar to tell him that we as Southerners have lost everything we\r\npossess through our conflicts. First let us be practical, you the chiefs from Nand from D. As you have seen yesterday, we don't have an army. Yesterday\r\nGovernor Nhial Deng Nhial and Commander Selva Kiir were here to guard any\r\nagreement we come to in this place. What about you? Who will ensure that our\r\nagreement stands firm in your areas? When Chief Majok came here . . . Tell me,\r\nif we go to your area will we find that our Dinka are still alive there? As Isaid before, the Nuer are here with their property, they are here with their\r\ncattle and their children. If you want to take them with you are welcome to take\r\nthem. But Iwould only ask that you reciprocate, allowing our Dinka people to\r\nreturn to us also. Iconclude with greetings, and emphasise before the\r\norganisers, that this peace and reconciliation will be monitored, so that the\r\nDinka can go to Nuerland and claim their properties and likewise the Nuer can\r\ncome to Dinkaland to receive what belongs from them. PNK:"
    },
    {
      "tag": "div",
      "text": "Ithank the two chiefs who have spoken now for their penetrating\r\ninsights. Ithank the Nuer for listening patiently to the presentation of the\r\nDinka chiefs. Among the speakers from Tonj Country is Sadia . . . and in the\r\nspirit of this conference we would also like to hear the voice of our women. We\r\nwill begin tomorrow at 9:00 again hearing the narratives of the Dinka. We will\r\ngive three hours for the remainder of the presentations from the Dinka. Although\r\nthe time allotted to the representatives from Tong is finished, will give a\r\nbrief opportunity to Sadia to speak. Ithank you all for your participation\r\ntoday. << Previous day Overview page Next day >> Home About How\r\n        to help Issues News Links Lens Photos Contact\r\n        us"
    },
    {
      "tag": "p",
      "text": "SSFI's mission is to share the love of Jesus Christ with the people\r\n      of southern Sudan in a way that leads them towards peaceful\r\n      and self-reliant living from the grassroots level, so that available\r\n      resources will meet the needs of their communities. Copyright\r\n      (c) 1999 by SSFI. All rights reserved."
    }
  ]
}