{
  "url": "http://teachers.net/gazette/APR01/sigmon.html",
  "file_number": "176",
  "content_hash": "f8ea473df6e3895bd9978e26d7a69a90294bb1ab3e9ba03cacbadca0ecbfda9b",
  "total_blocks": 382,
  "retained_blocks": 22,
  "ignored_blocks": 360,
  "blocks": [
    {
      "tag": "div",
      "text": "TEACHERS | ADMINISTRATORS | GROUPS MY LINKS: chat center Chatboards Chat Center Teachers Administrators Librarians Grade Level EC/Pre-K Kindergarten Primary Elem Upper Elem Middle School High School College Instr Adult Educ Multiage Classrm Subject Area Math English Science SS/Geog/Hist Art Music Region US States Canadian Teachers.Net UK Teachers.Net NZ/AU Teachers.Net Interest Groups Administrators Librarians/Media Specialists Montessori Teachers Professional Readings Beginning Teachers Student Teachers Substitute Teachers Gifted/AP (GATE) Special Educ Teachers Private School Teachers Classroom Discipline Classroom Management Brain-Compatible Learning Counselors Retired Teachers NBPTS/EC-GEN NBPTS/ES-GEN Classifieds Help Wanted Books for Sale Items Wanted Teaching Supplies Teacher Created Manipulatives Educ Games Educ Software Fundraising Miscellaneous Educ Programs Distance Learning Distance Teaching Continuing Education Tutors Wanted Tutoring Services Lessons New Lessons Add a Lesson Browse Lessons Search Lessons Jobs Search Jobs Post Resume Post Job Listings Resume Search Distance Learning Mailrings Harry Wong Projects Project Switchboard Classroom Centers Professional Readings Grant Writing Fundraising Eco-Chatboard 100 Days Traveling Buddies Classroom Pets Pen Pals Post Cards Live Chat Advertising"
    },
    {
      "tag": "div",
      "text": "Teachers.Net Nav Chat Center Teachers Administrators Help Wanted Classified Ads"
    },
    {
      "tag": "div",
      "text": "TEACHERS.NET GAZETTE APRIL 2001 Volume 2 Number 4"
    },
    {
      "tag": "div",
      "text": "COVER STORY Harry & Rosemary Wong provide more sage advice for the new teacher.  Tune in to this month's Gazette cover story and hear what the Wongs have to say about mentoring and teacher induction...."
    },
    {
      "tag": "div",
      "text": "COLUMNS Effective Teaching by Harry & Rosemary Wong Promoting Learning by Marv Marshall Alfie Kohn Article 4 Blocks by Cheryl Sigmon School Psychologist by Beth Bruno Jan Fisher Column BCL Classroom by Kim Tracy The Arts by Fink & Heath ARTICLES ADD Kids & Success in Classroom Beginning Teacher Induction Science Teacher Workshops Around the Block With... Adapting for the Sight Impaired Between the Lines Software To Improve Reading Skills Role Of Language In Science Classrooms Internet Navigation Tips and Toys Tolerance Using The Web For Student-Writers The Relevance of The Gifts of All Children Non-Ability Grouping for Reading Instruction From The Peace Corps Back To Teaching On Spelling/Reading Relationships Coping with a School Fire Technology Integration's Motto: Ready, Fire, Aim M.Ed. Degree Without Leaving Home Preparing a Life Resume Gazette Authors in Print! Super Sarah Word Warrior Brain Research Oversold? Communication In Distance Learning Our Schools Today QChord Receives EC Awards REGULAR FEATURES Upcoming Ed Conferences Letters to the Editor New in the Lesson Bank Help Wanted - Teaching Jobs Gazette Back Issues Gazette Home Delivery:"
    },
    {
      "tag": "div",
      "text": "About Cheryl Sigmon... Cheryl Sigmon is the author of Implementing the 4-Blocks Literacy Model (Carson-Dellosa, 1997) and the co-author with Pat Cunningham and Dottie Hall of The Teachers Guide to the Four Blocks (Carson-Dellosa, 1999).  Cheryl was a classroom teacher for a number of years. For nine years she was a language arts consultant for the SC Department of Education, where she worked in K-12 classrooms to help schools strengthen language arts programs. Since January 1999, she has been a freelance consultant, helping thousands of teachers across the United States implement the Four Blocks Model."
    },
    {
      "tag": "p",
      "text": "More articles by Cheryl Sigmon ."
    },
    {
      "tag": "div",
      "text": "The 4 Blocks Center... Teachers.Net is proud to support Pat Cunningham ( patcunningham@teachers.net ), Cheryl Sigmon ( cherylsigmon@teachers.net ), and their colleagues in the research and development of the 4 Blocks method.  Join our community of teachers across the country working with 4 Blocks every day.  Visit and contribute to the 4 Blocks and Building Blocks chatboards, and subscribe to a Four Blocks Mailring.  It's like having the foremost authorities in 4 Blocks teaching right next door!"
    },
    {
      "tag": "p",
      "text": "Bookmark the 4 Blocks Center ."
    },
    {
      "tag": "div",
      "text": "Best Sellers"
    },
    {
      "tag": "p",
      "text": "True Stories From 4 Blocks Classrooms $21.99 from Amazon.com More information Teachers Guide To Building Blocks $18.75 from Amazon.com More information Implementing the 4-Blocks Literacy Model by Cheryl Sigmon $16.99 from Amazon.com More information Classrooms That Work : They Can All Read and Write by Patricia Cunningham $20.00 from Amazon.com More information Making More Words : Multilevel, Hands-On Phonics and Spelling Activities by Patricia M. Cunningham, Dorothy P. Hall $14.39 from Amazon.com More information"
    },
    {
      "tag": "div",
      "text": "Sifting and Sorting Through the 4-Blocks Literacy Model by Cheryl M. Sigmon The Media Center as the Hub of Four Blocks"
    },
    {
      "tag": "p",
      "text": "An inquiry came recently from Sylvia Hix, a Library Media Specialist at Lakeview Elementary in Nashville, Tennessee.  Sylvia and a teacher in her school were busy writing a grant to support some training in Four Blocks, and she wanted me to share with her how---and if---Ifelt that a media specialist could be helpful and involved in the school's implementation of the Four blocks framework.  Sylvia and Iboth thought that our discussion might be useful to others. Yes, media specialists can be critical to the success of 4-Blocks in a school.  Of course, teachers can be successful in spite of that lack of support from the librarian/media specialist, but those teachers really have to be super-motivated and super-informed.  When the partnership is strong between teachers and the media specialist, implementation can be so much easier and so much more successful. Below are some ways that media specialists can help: Media specialists can keep teachers updated on good read-aloud printed material for their SSR Block. Using a few minutes during each faculty meeting would be a great way to model read-aloud techniques and to give advice about titles that would be of interest to kids at different grade levels. On some days, librarians can actually do the read-aloud portion of the block for classes that are using the library for SSR Block on a rotating basis.  The kids then select books from throughout the library with the help of the teacher and the librarian.  Learning to pick appropriate books is an important skill for students and is usually acquired with help from one of these knowledgeable adults. Librarians can be instrumental in helping teachers make decisions about books that would be popular and appropriate to include in the students' book baskets during SSR Block.  In some schools that don't have generous classroom libraries, the librarians actually help teachers stock the individual book baskets.  Stocking the baskets is a difficult task as we look for a variety of ranges: readability levels, topics, genres, and authors. Librarians can help with selections that can be used for the grade-level and easier materials during Guided Reading.  Multiple copies of texts are almost always used for Guided Reading Block.  Librarians can make recommendations about appropriate texts and in some cases might even store multiple copies from which teachers can make their selections.  It's of little use for an individual teacher to have a huge collection of multiple texts when these can be stored in the library and made available to more teachers.  The below grade level texts are sometimes difficult for teachers to access. Librarians can furnish appropriate texts for Words Block where teachers are always on the lookout for rhyming texts or those books that allow them to explore the word level of reading. Librarians can encourage teachers to use certain books for their modeling during Writing Block where authors use techniques, styles or offer exemplars of good Standard English that would help students grow in their own writing. The librarian can set aside space for student publications from various classrooms that are publishing during their Writing Block.  Some librarians may want to actually put a bar code on the student publications and find prime display space for them.  This would really motivate students to improve their writing!  Students writing is exponentially better when they know that they have a real audience---and especially when that audience is their peers! The librarian may want to host a monthly (or whatever time period seems reasonable given all the tasks they do!) Authors' Tea for students who have published at certain grade levels or for representatives from each classroom.  This again would keep those kids writing!  Tables might even be set up for autographing. The librarian could be the person who helps the adults in the school establish a reading habit for themselves.  Often, as we encourage students to acquire good reading habits we don't see that we are their best models for lifetime reading.  We may use the time in school to help establish students' reading habits, but we hope and expect that there will be transfer outside of the school.  We may never be able to convince kids of this if we don't see ourselves as readers.  The librarian might be the person who includes adult books (not the X-rated ones---these are books for adults!) in the faculty newsletter.  Or, perhaps the librarian starts a book club for faculty members who want to gather once a week or once a month to discuss a book they all agree to read.  We could simulate Oprah's book clubs where we chat about the book and have snacks or dinner together.  What fun!  And, the students would know about it, too!  They would know that we ARE readers---we practice what we preach! The librarian can serve as the hub for 4-Blocks growth in the school not only by furnishing books as stated above, but also by keeping the momentum going---displaying posters of students' work, displaying teachers' work, posting ideas for teachers to try in their 4-Blocks delivery, inviting teachers and students to review books and write advertisements for them, displaying a Word Wall, etc. Yes!  The librarian can be instrumental in keeping 4-Blocks alive and well in a school.  There are many additional ways that you could use your time to support tremendous changes in teaching and learning in your school.  Ihope that these few ideas will spark your creativity as you support Four Blocks implementation! ANNOUNCEMENT : My newest book, Modifying Four-Blocks at the Upper Grades (2001, Carson-Dellosa)  is now out! I'm glad to have the writing of this one behind me, and Ihope it'll be helpful to teachers at grades 4-8 and, perhaps, those at 3rd grade who have more advanced students. Let me know what you think after you've had a chance to read it.  There are some great reproducibles in the back on the book! Notice For Grant Writers:  If you're writing grants and need assistance with implementation in your schools and districts, I'm willing to write letters of intent/commitment to support your training and implementation.  I've furnished quite a few of these lately.  Icertainly want you to get good training and I'll be sure that you do!  Just email or call if you need a letter.  Iknow that most of your grants are due soon. Training Opportunities : Below are seminars (some 1 day and some 2 day ones) that Ihave coming up in the future. Please know that Ihave a small group of really excellent folks who work along with me, too. We do site-based work in schools and districts at your request. For their services, you can simply call 843-549-2684 and speak with Cathy Bell or visit her website at www.ergsc.com . We offer various types of staff development: classroom demonstrations, on-site presentations, classroom observations and feedback, and exploring 4-Blocks in more depth, among other offerings. My scheduled presentations:"
    },
    {
      "tag": "p",
      "text": "Location Date Sponsor Chicago, IL April 24 SDR Detroit, MI April 25 SDR Anaheim, CA May 9 SDR Ontario, CA May 10 SDR Indianapolis,IN June 20-21 ERG (Grades 1-3 Intro.) Milwaukee, WI July 10 SDR Grand Rapids, MI July 11 SDR Philadelphia, PA July 16 SDR Boston, MA July 17 SDR Newark, NJ July 23 SDR Dayton, OH August 2 ERG (Grades 1-3 Intro.) Dayton, OH August 3 ERG (Grades 1-3 Beyond the Basics) Dayton, OH August 9 ERG (Grades 4-6 Intro.)** Dayton, OH August 10 ERG (Grades 4-6 Beyond the Basics) Charleston, SC September 22-23 ERG ( Conference/Block Party-Southern---Style!- Details TBA! )"
    },
    {
      "tag": "p",
      "text": "For ERG workshops on 4-Blocks and Building Blocks, call 843-549-2684 or go to www.ergsc.com . For SDR workshops, call 800-678-8908. Hope to see you at a workshop soon! **Seminar Note:  If you attend a seminar titled, Introduction to Four Blocks, Grades 4-6 , please know that \"Introduction\" at upper grades still means that basics will be covered---not just the adaptations.  For upper grade teachers who've had no Four Blocks training, they need---and appreciate---those basics. Personal Journal: Sad news to share with those of you who have written to me since Leadership Conference about my critically ill mother-in-law:  Freida died on March 17th.  She was a wonderful, wonderful woman whom we'll miss terribly.  Thanks for your kind thoughts and prayers that have sustained us throughout this difficult time. Sylvia, Eve, and Ihad another day with the good folks in New Jersey.  (We couldn't wait to get in that Sunday night to eat at Mastori's again!)  Thanks again to Suzanne Phillips for taking care of travel details and for hosting my day! Iloved my quick visit to Albuquerque and Phoenix.  What a beautiful part of the country!  Thanks to \"mailring buddy\" Susan Nixon for whisking me to the airport just in time for my flight all the way back across the country that evening!  Don't know what I'd do without a little help from my friends! Ihad a great group of folks in Houston this week who were patient with me while Idelivered my message with one of the worst colds I've ever had!  They were very kind.  Many thanks!  It's hard to be on the road when you're sick.  Itook my cold on to another group in San Antonio today.  Hope Ididn't leave any cold germs behind as mementos!  It was great to find that 4-Blocks is spreading in San Antonio.  I've done a good bit of work there over the past two to three years through Region 20.  The data coming out of that area sounds phenomenal!  They shared very kind words about the new upper grades book that excited me! Hope everyone's enjoying Spring Break or that you're now returning to your schools renewed and re-energized!"
    },
    {
      "tag": "blockquote",
      "text": "Cheryl"
    },
    {
      "tag": "p",
      "text": "Cheryl Sigmon is a regular contributor to Teachers.Net ."
    },
    {
      "tag": "div",
      "text": "Web Teachers.Net"
    },
    {
      "tag": "div",
      "text": "Site Map: Jump to... --------- Teacher Jobs Chatboards Lesson Plans Local Network Project Center Chatrooms Meetings Mailrings Classified Ads ** Forums ** Teacher Chatboard Administrators Media Spec/Lib Retired Teachers Pre-School(EC) Kindergarten Primary Elem Upper Elem Middle School High School College Profs Student Teachers Begin Teachers Subst Teachers Classroom Mgmt Classrm Disci Multiage Classrm Adult Educ Gifted/Talented Special Educ Private School Montessori Prof Reading Counseling Jobhunters Math Teachers Science Teachers Social Studies Music Teachers Fine Art Teachers Health Chatboard PE/Coaching Brain-Compatible School Humor MESSAGE CENTER Letters to Editor Ed Advocacy Current Events Politics Gatherings Social Chatboard Golden Apples Inspirations Feedback ENGLISH CENTER Reading/Writing HS English Books & Liter Remedial Reading AR Chatboard 4Blocks Lit Bldg Blocks(K) 6Traits Writing Read Across Amer NBPTS STANDARDS EC-GEN Elem/Secondary LANGUAGE CENTER EFL/ESL French Teachers Spanish Teachers Trav/Study Abroad PROJECT CENTER Project Switchbd Classroom Centers Grant Writing Fundraising Earth Day 100 Days Traveling Buddies Classroom Pets Pen Pals Postcards TECH CENTER Computer/Tech Web Authors Ed Software Apple/Mac STATE TEACHERS AL Teachers AK Teachers AZ Teachers AR Teachers CA Teachers CO Teachers CT Teachers DE Teachers FL Teachers GA Teachers HI Teachers ID Teachers IL Teachers IN Teachers IA Teachers KS Teachers KY Teachers LA Teachers ME Teachers MD Teachers MA Teachers MI Teachers MN Teachers MS Teachers MO Teachers MT Teachers NE Teachers NV Teachers NH Teachers NJ Teachers NM Teachers NY Teachers NC Teachers ND Teachers OH Teachers OK Teachers OR Teachers PA Teachers RI Teachers SC Teachers SD Teachers TN Teachers TX Teachers UT Teachers VT Teachers VA Teachers DC Teachers WA Teachers WV Teachers WI Teachers WY Teachers -- AU/NZ Teachers Canadian Teachers UK Teachers"
    },
    {
      "tag": "div",
      "text": "Home Search Jobs Classifieds Lessons Contacts PR Advertise"
    },
    {
      "tag": "div",
      "text": "© 1996 - 2006. All Rights Reserved. Please review our Terms of Use , Mission Statement , and Privacy Policy ."
    },
    {
      "tag": "div",
      "text": "#\n312219"
    }
  ]
}