{
  "url": "http://ucsu.colorado.edu/~obrian/02rev4.html",
  "file_number": "184",
  "content_hash": "e8bd2bf83db47ed137e9fccbec8e969621ac6bad3dc4f11016b535ab77b41c51",
  "total_blocks": 40,
  "retained_blocks": 21,
  "ignored_blocks": 19,
  "blocks": [
    {
      "tag": "h1",
      "text": "2002 Competition Game Reviews -- Page 4"
    },
    {
      "tag": "div",
      "text": "(in the order Iplayed them)"
    },
    {
      "tag": "h2",
      "text": "SCREEN by Edward Floren"
    },
    {
      "tag": "div",
      "text": "For a rookie outing, Screen really isn't too bad. That is, of course, if\r\nit's really a rookie outing. In the comp you can never really be sure\r\nthat anything is what it appears to be, and for all Iknow \"Edward\r\nFloren\" is a pseudonym for somebody who's released a half-dozen games.\r\nBut Idon't think so. There are a number of errors that experienced Inform coders are less likely to make, such as \"You have so far scored 0\r\nout of a possible 0, in 36 turns\" in response to SCORE. The more\r\nfamiliar you are with Inform, the more likely you have encountered Andrew Plotkin's web page of tips and tricks that gives the solution to\r\neliminating this untidy message, or for that matter figured out how to\r\neliminate it yourself. For another thing, there's the fact that although\r\nthere are plenty of scenery objects (and Iknow this because typing GET\r\nALL listed them out -- another rookie mistake), many of them aren't\r\nimplemented at all. It doesn't take very many \"You see nothing special\r\nabout the <whatever>\" messages for immersion to fall by the wayside. On\r\nthe other hand, some other aspects of the game are coded rather nicely,\r\nsuch as the custom cant_go messages and the room descriptions that\r\nchange depending on whether you're seeing the room for the first time or\r\nnot."
    },
    {
      "tag": "p",
      "text": "The prose quality is a similarly mixed bag. Much of the writing\r\nsuccessfully evokes a sweet nostalgia as it depicts Jordan the PC's\r\nreturn to the scene of his childhood games. Riffs on Baby Boomer pop\r\nculture are handled lovingly, with a light enough touch to let them feel\r\ntouching without being cloying. On the down side, this game would\r\ndefinitely have benefited from another round of proofreading. Consider\r\nthe flashback to Jordan's first kiss, where he stares at the girl he\r\nlikes and the narrator tells us, \"She looked so sweat.\" This is one of\r\nthe worst sorts of English errors to have in the public release of your\r\ngame -- not only does it miss its intended meaning, but in fact it\r\nsquarely hits another meaning entirely, and a rather comical one at\r\nthat. Certainly it's an understandable error -- it's only one letter off\r\nthe correct spelling, and could even be a typo, and for that matter\r\n\"neat\" and \"beat\" have the intended phoneme. Then again, the word\r\n\"sweating\" is used only three sentences later, which makes the error a\r\nlittle less understandable. In any case, it's a bad, bad mistake that\r\nentirely punctures the otherwise poignant scene. And lest it seem that\r\nI'm pouncing on the whole game for one little mistake, Ihasten to add\r\nthat little errors like this (though none worse than that) are present\r\nthroughout the game, and should have been eliminated before its release. The prose errors didn't stop me from enjoying the game overall, though.\r\nFor the most part, it's a short and sweet little romp through childhood\r\nmemories and favorite TV shows. The puzzles, too, are mostly\r\nstraightforward, though Iwas unfortunate enough to trip repeatedly on a\r\nrather tightly timed puzzle towards the game's end. The problem there\r\nwas that although Ihad figured out the elements of the puzzle, the\r\nsolution required an extra step that, as near as Ican tell, was\r\ncompletely unclued. Dear me, every time Istart to praise this game Iend up criticizing it. Overall, Screen is a nicely sketched vignette.\r\nEven if it feels rather aimless and disjointed at times (man, there Igo\r\nagain!), Ididn't want my 45 minutes back after Ifinished it. It's a\r\nnice start at the IF craft, and Ilook forward to the author's next\r\nwork. Rating: 8.0"
    },
    {
      "tag": "h2",
      "text": "A PARTY TO MURDER by David Good"
    },
    {
      "tag": "p",
      "text": "Iwill say this for it: A Party To Murder is the best ADRIFT game I've\r\never played. Unfortunately, that's not saying much. Even if it were\r\nwritten in a first-tier IF language, APTM would have some problems to\r\novercome, but as it is, it's hopelessly lumbered by the terrible,\r\nterrible ADRIFT parser. We're talking about a mystery game here,\r\nreminiscent of Suspect -- you play a guest at a party where a murder is\r\ndiscovered, and you must extricate yourself from suspicion. Amystery\r\ngame, okay? You might think that, in a mystery game, you'd be able to\r\nSEARCH things. Not this one -- it doesn't recognize SEARCH, LOOK IN, or\r\nLOOK THROUGH. Worse, with the latter two it parses them as LOOK rather\r\nthan just admitting that it doesn't recognize them. Same with LOOK UNDER\r\nand LOOK BEHIND. Hint: ignoring prepositions doesn't make them go away,\r\nit just makes your response more likely to be wrong. Perhaps, in a\r\nmystery game, you might want to SHOW things to NPCs. You can't here.\r\nEven if you hold a completely damning piece of evidence and want to show\r\nit to the person whom it damns, all you get from the ADRIFT parser is \"Idon't understand what you want me to do with the letter.\" Maybe, in a\r\nmystery game, you might even want to TELL someone about something. In\r\nthis game, you can't. All these very basic verbs, absolutely standard\r\nwith any first-tier system, are unavailable in ADRIFT, and their absence\r\nabsolutely slaughters this game. In fact, from a very early stage,\r\nwhenever Iencountered one of the game's many containers, Igot in the\r\nhabit of trying to GET ALL FROM it, because that was the only reliable\r\nway Icould get the game to tell me whether there was anything inside.\r\nNeedless to say, Iwasn't exactly feeling immersed in the story while\r\ndoing so. As Isaid above, even if all these problems were resolved, APTM still\r\nwouldn't be a great game. Part of the reason for this is the fact that\r\nthe game seems to operate on its own inscrutable logic rather than any\r\nsort of recognizable sense of cause-and-effect. For instance, there's a\r\nportion of the game where access to a useful item is being controlled by\r\none of the NPCs. The only way to persuade this NPC to let you have the\r\nobject is to perform a long series of apparently arbitrary tasks, and\r\nthe NPC doesn't really indicate that it wants these tasks performed. The\r\nonly way Ifound out was via the walkthrough, and I'd be surprised if\r\nanybody figured it out any other way. Of course, by that time Iwas\r\ngoing straight from the walkthrough anyway, because in my initial\r\nplaythrough of the game, Inever found that NPC at all -- it seems she\r\nonly appears after a particular item has been discovered, even though\r\nthat item is more or less unrelated to her absence. Oh, and that item is\r\nonly accessible by using an object whose primary logical use is\r\nunimplemented in the game. For the sake of spoilers, Iwon't name what\r\nthat object is, but just for example, if you found a knife, and the game\r\ndidn't understand the word CUT, you might think that knife was a red\r\nherring (and that the game was lazily implemented). Wouldn't you be\r\nsurprised to find out from the walkthrough that even though CUT isn't\r\nimplemented, you still need the knife to, oh Idon't know, scrape the\r\nmud off a stone tablet or something? Something analogous occurs in this\r\ngame. See what Imean about inscrutable logic? In addition to logic\r\nproblems, there are certain implementation errors as well. For example,\r\nmost of the game consists of a flashback, but typing X ME while still in\r\nthe frame story depicts the PC as if the flashback was already\r\nhappening. So after all this, what makes APTM the best ADRIFT game I've ever\r\nplayed? Well, for one thing, despite the occasional glitch, it does have\r\na decent depth of implementation. Most first-level nouns are described,\r\nand the setting is rather richly detailed. Ispent an inordinate number\r\nof hours with Suspect when Iwas younger, and at times this game brought\r\nback pleasant memories of that experience. The writing gets its job done\r\nwith a minimum of errors, and the NPCs are coded to handle a reasonable\r\nnumber of inquiries. In fact, a couple of times during the game Iasked\r\nan NPC about a somewhat extraneous topic, and was happily surprised to\r\ndiscover that the response had been implemented. Another point in favor\r\nof the NPCs is that they will sometimes react sensibly to strange\r\nactions on the player's part; for instance, walking into the teenage\r\ndaughter's bedroom while she's making out with the neighbor elicits\r\nangry responses from both of them, escalating in intensity the longer\r\nthe PC hangs around. Snooping around the objects in the house, though\r\nit's necessary, also provokes suspicion from some of the NPCs. Then\r\nagain, nobody gives you a second glance when you walk through the house\r\ncarrying an 8-foot ladder, so this realistic implementation is really\r\nrather patchy. Overall, APTM would be a seaworthy craft, but between the\r\nlogic holes in its hull and the tsunamis of ADRIFT inadequacy, it sinks\r\ndismally fast. Rating: 4.6"
    },
    {
      "tag": "h2",
      "text": "RAMON AND JONATHAN by Daniele A. Gewurz"
    },
    {
      "tag": "p",
      "text": "Since classical times, stories have opened \"in medias res.\" This phrase,\r\nLatin for \"in the middle of things\", refers to a narrative that begins\r\nduring some crucial piece of action, filling in the background and the\r\npreceding events sometime later. Ramon and Jonathan fulfills the former\r\npart of this bargain, but never the latter. The game drops us into some\r\nsort of science-fictional scenario where some (maybe) criminals are\r\nbeing exonerated, or extradited, or something, and suggests that we're\r\nnot happy with the situation. Then there's an unintuitive door-opening\r\npuzzle, a bit of quick noun-guessing with an NPC, and then it's over. We\r\nnever learn the backstory behind who did what to whom and why, who lives\r\non what planet and how they got there, or who any of these characters\r\neven are. Because the first (and really only) puzzle didn't make any\r\nsense to me, Iturned to the walkthrough in record time, but even after\r\nIhad walked through the game, Istill didn't really get it. As Ialways\r\nsay in these situations, that may be because I'm dense, but egomaniac\r\nthat Iam, I'm more inclined to believe that the game did an\r\ninsufficient job of explaining itself. Not helping matters was the fact that the prose is written in not-quite-fluent\r\nEnglish. It's not terrible, mind you -- many of the sentences\r\npass muster without a problem, but those that don't are really jarring.\r\nFor instance:"
    },
    {
      "tag": "pre",
      "text": ">x people\r\n   The audience has been waiting for years this moment, and is mostly\r\n   greatly disappointed for the two \"hangmen\" to have been virtually\r\n   cleared. Everybody rumble and yell."
    },
    {
      "tag": "p",
      "text": "The first sentence is almost up to snuff, if only \"years\" and \"for\"\r\nexchanged places -- it would still sound awkward and clunky after that,\r\nbut would at least be grammatically correct. The second sentence sounds\r\nstereotypically, almost laughably wrong, as if it were written for a\r\nBronson Pinchot character. You know, I've said this before: Idon't care\r\nwhether English is your first language or not, but Ido care about\r\nfluency and readability. If you can't write fluent English, either don't\r\nwrite a text adventure in English or make sure to have your text\r\nadventure thoroughly proofed and corrected before inflicting it on the\r\nworld. Idon't mean to sound harsh, but if you want to produce something\r\ngood, you simply must make sure the writing works. It's also a good idea to fully implement everything you put in your\r\ngame. Ramon And Jonathan, short though it is, is poorly equipped to\r\nhandle any deviation from its plotline. Anything outside the bounds of\r\nthe walkthrough is handled in one of two ways. The first method is\r\nsimply to end the game. This happened to me on my first half-dozen\r\nplaythroughs -- either because Iwalked in a disallowed direction or\r\nbecause Ifailed to solve the timed puzzle, the game abruptly kicked me\r\nto the curb and told me to restore or restart. Restarting wasn't\r\nterrible, because I'd invariably just played a few moves anyway, but the\r\nfrequency of the situation made it clear that there wasn't much room to\r\nwander. The other, much worse method that the game uses to handle\r\nplayers that leave the path is to simply do nothing. At one point, Iwandered into a room with no less than five NPCs, all of whom may as\r\nwell have been statues for all that they responded to me. Eventually Ifigured out Imust be doing something wrong because my current situation\r\nwas so amazingly dull. This does not make for a fun game -- utter\r\nboredom shouldn't be the tool that forces players to comply with the\r\nplot. So finally, Irestarted, hit the walkthrough, made the required\r\ntwenty moves, and the game ended. Or rather, if an ending implies that\r\neverything has been tied up and some sort of dramatic conclusion has\r\nbeen reached, it's probably more accurate to say the game stopped. Rating: 4.3"
    },
    {
      "tag": "h2",
      "text": "ERIC'S GIFT by Joao Mendes"
    },
    {
      "tag": "p",
      "text": "In the \"about\" text for Eric's Gift, the author mentions that much of\r\nthe inspiration for the story came from a dream. Somehow, this seems\r\nappropriate, because the experience of playing the game was quite\r\nreminiscent of a recurring dream of mine: the one where Ifind myself in\r\na play, but Idon't know my character or any of my lines. The other\r\nactors look at me expectantly, waiting for me to say the words that will\r\nadvance the plot, and all Ican do is madly improvise in a futile\r\nattempt to hit on the right topic. Eric's Gift is one of those games\r\nthat runs on triggers -- examining a particular thing, or asking about a\r\nparticular subject, or performing some other action triggers a\r\nnon-interactive cutscene, which changes the PC's location and moves the\r\nplot along. When games like this work, they give the feeling of a story\r\nadvancing smoothly, right in sync with the player's actions. When one\r\nbreaks down, though, it's hell -- players flounder about looking for the\r\nright action as the plot's momentum evaporates, along with the fun of\r\nthe game. Rather than guess-the-verb or guess-the-noun, the whole thing\r\nbecomes a game of guess-the-trigger, which is worse than either one,\r\nsince it encompasses both verbs and nouns, but you can never be sure\r\nwhich you're trying to guess at any given moment. That's just what\r\nhappened to me in Eric's Gift. Iwas in a conversation scene where,\r\nunbeknownst to me, Ineeded to examine a sub-object of an object (that\r\nis to say, a second-level noun) in order to trigger the next scene.\r\nThinking I'd examined everything, and having tried to leave, or do\r\nvarious other more or less appropriate actions, Ikept fishing for new\r\nthings to ask about, feeling like one of those characters in Sartre's No\r\nExit , doomed to spend all eternity trapped with the same annoying\r\nperson. In a situation like this, it really helps a lot if the game is\r\nthoroughly implemented, and in part, Eric's Gift accomplishes this. All\r\navailable scenery objects are described, and a few off-the-beaten-path\r\nconversation topics are implemented, too. However, as time wore on and Ikept not guessing the trigger, the NPC began to feel more and more\r\nthreadbare, always failing to respond to my increasingly desperate topic\r\nchoices. Perhaps part of my problem was that Iwas a bit distracted by\r\nthe game's insistent use of the same metaphor over and over and OVER\r\nagain. Saying that a woman has a \"light in her eyes\" is already a bit of\r\na clich, but quite tolerable if said once, maybe even twice. This game\r\nhits it so often that it becomes comical. My breaking point was when Iencountered this description: \"Her eyes shine with a light of their own,\r\nwith an intensity that almost blinds you.\" Mind you, there had already\r\nbeen many repetitions of the \"light in the eyes\" theme, but this one was\r\nway, way over the top. How could the light in someone's eyes, which Itake to mean an animated, vivacious expression, almost blind me? Icouldn't help but picture the NPC with high-beam headlights for eyes,\r\nthe PC shielding his face from the glare. The lesson here is that any\r\ngiven metaphor is best used sparingly -- the more often we see it, the\r\nless effective it becomes. My other issue with Eric's Gift is that it is pointlessly science-fictional.\r\nWhat Imean by that is that although the story is set in the\r\nfuture, it gains virtually nothing thereby. Afew details are changed\r\nhere and there -- people drink \"synthcaf\" instead of coffee, the TV is\r\ncalled a \"tri-di\", and so forth -- but otherwise the story might just as\r\nwell be set in 2002. Not one significant point of plot or character\r\nderives from the futuristic setting, and consequently that setting is\r\nlittle more than a distraction. Adding a science-fictional sheen to an\r\notherwise mundane story doesn't somehow make that story cooler. Quite\r\nthe contrary, in fact -- it drains the story of mainstream appeal while\r\ngaining nothing in sf credibility. Oh, and one more thing: there are\r\nserious logical holes in the plot, especially in the defining element of\r\nthe plot. Although its writing and coding was competent, the logical\r\nflaws, awkward emotion, and frustrating design make Eric's Gift one that\r\nIwon't be keeping. Rating: 5.4"
    },
    {
      "tag": "h2",
      "text": "JANE by Joseph Grzesiak"
    },
    {
      "tag": "p",
      "text": "Note: Because strong language and themes of domestic abuse appear in\r\nthis game, they will also appear in this review. Acouple of years ago, Ireleased a game with some pretty intense\r\nthemes , including rape, murder, and slavery. Aside from whatever other\r\nways my game succeeded or failed, people's reactions to encountering\r\nthis sort of thing in a work of IF varied a lot. Some people really\r\nappreciated it, others... not so much. One player rather memorably\r\ndescribed it this way: \"After playing, my head felt like someone had\r\nbeen hitting it very hard with a solid metal thing.\" After playing this\r\ngame, Iunderstand a little more where that guy was coming from. Jane\r\ntakes on the topic of wife-beating, portraying it from the perspective\r\nof the victim, the abuser, and a few others besides. The experience of\r\nplaying through a story in IF form, as opposed to reading it on the\r\npage, really intensifies my identification with the characters, and\r\nthere were moments during my time with Jane that Istarted feeling\r\nphysically ill, and dirty, involved in something Idid not wish to be a\r\npart of. Idon't mean to sound disapproving -- those moments were quite\r\npowerful and dramatic, and the game did give a clear warning about its\r\nsubject matter before it began. Indeed, the times when Iwas feeling the\r\nmost upset were when Iwas admiring Jane the most; its writing and its\r\nimplementation occasionally managed to affect me quite strongly. On the other hand, that effect was only occasional, for several reasons.\r\nFirst of all, though Iapplaud it for its ambition in getting inside the\r\nheads of abuser, victim, and onlookers, the characterization frequently\r\nfell a bit flat for me. The dialogue and actions of the characters\r\nsometimes rang quite true, but other times felt fairly stock, as if\r\npulled from one of those movies that always seem to be running on the Lifetime channel. Another, more severe issue is that presenting a story\r\nlike this interactively is a major challenge, and the game wasn't always\r\nprepared to meet that challenge. At its worst moments, the clash between\r\nthe intense action of the story and the standard Inform library\r\nresponses evoked by my actions was outright comical, completely\r\ndefeating the drama:"
    },
    {
      "tag": "pre",
      "text": "\"You'd have nothing!\" he shouts, continuing his rant. \"No one would\r\n   ever want you. You're of no use to anyone. You'd be nothing.\"\r\n\r\n   >get vase\r\n   That's hardly portable.\r\n\r\n   John's lost in his mind again. \"You ARE nothing!\" he shouts again. He\r\n   steps forward quickly and shoves you back, causing you to stumble to\r\n   keep your balance. \"You're useless! You're so fucking useless!\"\r\n\r\n   >push john\r\n   That would be less than courteous."
    },
    {
      "tag": "p",
      "text": "Those library messages, quite suitable in the majority of IF situations,\r\nare laughably inappropriate here, and either the author or the testers\r\nshould have caught them. The debugging verbs should also have been\r\nturned off -- the effect of these things together was that Jane had a\r\nfairly rushed feel. Even more damaging, by failing to account for fairly\r\nreasonable actions, the game makes itself too vulnerable to\r\nridiculousness, which is poison to the kind of tragic storytelling it\r\nattempts. Even when it does properly account for the player's input, though, Jane\r\nusually feels quite straitjacketed. In fact, although the game borrows\r\nheavily from Photopia by using multiple perspectives (albeit a\r\nchronologically intact story) and a virtually identical approach to\r\nconversation, it reminded me less of Photopia than of Rameses .\r\nUnfortunately, it wasn't the brilliant subversion of IF and storytelling\r\nthat Rameses was, both because that game arrived first and because in\r\nits very use of multiple viewpoints and linear chronology, Jane dilutes\r\nthe best rationale for its linearity. Ican see a viable argument that\r\nJane (the NPC, not the game), and perhaps even her abusive husband,\r\nshould present few real options to the player. They're locked into the\r\ncycle of abuse, and the player's frustration could mirror that of the\r\ncharacters as they try and fail to break out of their long-established\r\npatterns. However, that's far less true for other characters, who lack\r\nsuch a reason for being bound to any particular course of action. In\r\naddition, as the intensity of the rising action builds, the characters\r\nshould have more freedom available, as desperate measures become more\r\nand more plausible. Since Iexperienced the story in accurate\r\nchronological order, Iexpected that at some point I'd be able to find\r\nmy own way out of the ugly tangle of that relationship. Instead, what Ifound was that Ihad to follow the game's singular path through it, and\r\nthat meant enduring just as much abuse as the game decided it ought to\r\ncommit. In my own way, Ifelt a little battered by the time Ifinished.\r\nIdid finish, though. Ididn't quit. Iguess Iwas asking for it. Rating: 6.5"
    },
    {
      "tag": "h2",
      "text": "CONSTRAINTS by Martin Bays"
    },
    {
      "tag": "p",
      "text": "I'm far from the first person to make this claim, but Ithink every\r\npiece of art is, to some greater or lesser degree, about the art form\r\nitself. Every novel is at least a little bit about the novel, every\r\nfilm is at least a little bit about the cinema. And every text game is\r\nat least a little bit about IF itself. Then there are those that are\r\nvery much about the form. Constraints is one of these. It disarmed me\r\nby admitting upfront, in fact brandishing, the fact that it was going to\r\nconsist of constrained interactions. It then sets out to explore not\r\nonly the idea of constraint, and the ways that interaction in a text\r\ngame can be constrained, but how to make those constrained interactions\r\neffective, and even fun. Of course, it's not the first game to tread\r\nthis ground -- Photopia and Rameses have famously drawn from the same\r\nwell -- but it's the first one I've seen that devotes itself so purely\r\nto the concept, free of any particular narrative or character. However,\r\nbecause of the way it's structured, it's rather difficult to talk about\r\nwithout giving too much away. What Ican say, though, is that although\r\nat one point it enumerates the types of constraints it claims to employ,\r\nthere is one that it doesn't include in its list but which features\r\nprominently throughout the game. I'm referring to the fact that although you have the opportunity to play\r\nseveral characters in Constraints (all of whom are in some restricted\r\nsituation, natch), they all share a common trait: the desire not to be\r\nconstrained. In each scenario, Istruggled for a bit against the\r\ncircumstances, but then tried doing things that would indicate a certain\r\npeace with the situation. Each time, Iwas rebuffed, instructed that the\r\ncharacter's desire outweighed whatever notions Imight have about\r\ngraceful acceptance. I'm not complaining about this. It's quite\r\nlegitimate to instruct a player about how to behave in character when a\r\ncharacter is specified, and in a game this skillfully done, Iwouldn't\r\nbe at all surprised if the additional level of constraint was quite\r\nintentional. The idea intrigues me, though. How much of what we call\r\nconstraints in our lives are simply produced by our own desires, more or\r\nless independent of our circumstances? When we feel held down, held\r\nback, would the feeling disappear if we decided that we no longer wanted\r\nwhatever lay on the other side of the barrier? For that matter, can a\r\nconstraint even exist without a corresponding desire to define it as\r\nsuch? In this game, the question is moot -- there's no way of changing\r\nthe characters' desires -- but Ireally like it that the experience of\r\nplaying made me think about such a philosophical issue in my own life. It helps a lot that Constraints is quite exquisitely implemented. It's\r\nclear that this game has been tested thoroughly -- not only did Ifind\r\nno bugs, but several times throughout the game, Ihad the exciting\r\nexperience of trying a fairly unusual action, and seeing that the game\r\nanticipated it and handled it expertly. The game uses the z-machine's\r\ncolor capabilities quite nicely (thereby giving me another reason to be\r\nthankful to David Kinder for the new WinFrotz 2002 interpreter), and in\r\nanother section commits an impressive (though not quite unprecedented)\r\nz-machine abuse. For the most part, the writing hews to the same high\r\nstandard, though there are several instances of rather strange word\r\nchoices. I'm not sure whether these were simply typos, or whether they\r\nindicate that perhaps English isn't the author's first language. If the\r\nlatter is true, then Constraints is to be commended all the more for the\r\nlevel of mastery it does attain. Despite all this, Ican't quite bring\r\nmyself to rate the game a 10. Even though it was thought-provoking and\r\nnicely crafted, in the end Ididn't find it terribly enjoyable; Idon't\r\nreally like being constrained. Nevertheless, this is an excellent work\r\nof IF, and a fascinating metatreatise on \"puzzleless\" IF in general. Rating: 9.3"
    },
    {
      "tag": "h4",
      "text": "Go to the previous page of reviews Go to the next page of reviews Return to my IF page Return to my home page"
    },
    {
      "tag": "p",
      "text": "Paul O's 2002 Competition Game Reviews -- Page 4 / Paul O'Brian / obrian at colorado.edu / Revised November 2002"
    }
  ]
}