{
  "url": "http://www.infed.org/archives/nayc/ferris_girls_clubs_leader.htm",
  "file_number": "505",
  "content_hash": "d2f8accb31d1145394cc5a1da09c663de2251b738e44fbf60973186df02bb6e6",
  "total_blocks": 254,
  "retained_blocks": 41,
  "ignored_blocks": 213,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//IETF//DTD HTML//EN\""
    },
    {
      "tag": "h6",
      "text": "encyclopaedia archives extras"
    },
    {
      "tag": "h1",
      "text": "the club leader"
    },
    {
      "tag": "h2",
      "text": "Helen J. Ferris' authoritative manual, Girls' Clubs, was \r\n      published in the USA in 1918. In this chapter she examines the qualities \r\n      and requirements needed in club leaders."
    },
    {
      "tag": "h6",
      "text": "contents: preface | the need for a leader | who is to be leader? | special \r\n      qualifications to be sought | where are leaders found | general qualifications | a fundamental \r\n      requisite | other \r\n      desirable characteristics | getting acquainted \r\n      with the girls | know your community | contact with other \r\n      leaders of girls | training for the new club leader | contact with club \r\n      leaders through publications | cooperation with \r\n      other individuals | the new club \r\n      leader | how to cite this piece"
    },
    {
      "tag": "p",
      "text": "Helen Josephine Ferris (1890-1969) is probably best known \r\n              for the books she wrote and edited for children and younger \r\n              readers. She was editor-in-chief of the Junior Literary Guild from \r\n              1929 until her retirement in 1959. Helen J. Ferris' first \r\n              publication appeared in the Wisconsin Audubon Magazine when she \r\n              was eleven. From 1912 to 1919, she held a number of editorial \r\n              positions including The Guardian, American Girl, and Youth's \r\n              Companion. She also published her first four books - one of which \r\n              was the landmark manual for workers - Girls' Clubs. Helen \r\n              Ferris was born in Hastings, Nebraska but spent much of her early \r\n              life was spent in Wisconsin. Her father, Elmer, was a Baptist \r\n              minister. The family lived in La Crosse and later in Milwaukee. In 1924 she married Albert B. Tibbets . Girls' \r\n              Clubs became the standard work on girls work in the United States. \r\n              It provides a detailed account of the organization and management \r\n              of girls' clubs and includes material on programmes, activities \r\n              and classes, and discussions of the club's relation to the \r\n              community and country, the club in the everyday life of the girl \r\n              and club work in war time. We have reproduced chapter II: The club \r\n              leader. It underlines many of the ideas that were and remained \r\n              significant in thinking about youth workers in the twentieth \r\n              century. Ferris, H. J. (1918) Girls' Clubs. Their organization and \r\n              management. Amanual for workers , New York: E. P. Dutton and \r\n              Company."
    },
    {
      "tag": "h6",
      "text": "For biographical information see: Notable Wisconsin Authors (1983) . See, also, the history of \r\n              the Junior Learning Guild ."
    },
    {
      "tag": "h4",
      "text": "The need for a leader"
    },
    {
      "tag": "p",
      "text": "[ page 14 ] \r\n        The necessity for having a Leader among any group of organized girls is \r\n        evident to all who have had experience with Girls Clubs. The younger \r\n        the girls, the greater becomes this necessity \r\n        for the presence of an older person who can steady their impetuous \r\n        enthusiasm and tactfully guide their activities into useful channels. No \r\n        matter what the purpose of the Club is, the girls are coming together \r\n        because of some need in their lives. This need may be social or \r\n        educational in character. But, whatever it is, a Club Leader who is \r\n        far-seeing, wise in her judgments, and sympathetic, can introduce into \r\n        the Club activities the elements which will meet the needs of the Club \r\n        members. Often the girls but vaguely realize that there is a lack, in \r\n        their lives. It is part of the older Cub Leaders task to discover it \r\n        and to meet it. The presence of a Club Leader gives to the \r\n        proceedings of the Club a stability which is most necessary. The mothers \r\n        of the girls are more willing to have their daughters attend the Club \r\n        meetings when they know that the Club is under wise supervision. If the \r\n        Club Leader is present at every meeting, on hand early to welcome all \r\n        comers, if she knows What must be accomplished and [ page 15 ] by \r\n        her suggestions sees that the Club does not wander from its purpose  \r\n        she constitutes a help to any Club which it cannot afford to be without. When times of stress and disagreement enter into \r\n        the Club life, the Club members often look instinctively to a fair and \r\n        impartial Club Leader to make the necessary decision and to bring \r\n        harmony to the ranks once more. Awise and tactful leader can frequently \r\n        hold a Club together when, without her, the Club might have suddenly \r\n        ended its existence. The presence of a Leader is often necessary for the \r\n        constructive development of the Club. Many groups of girls have but few \r\n        ideas for the activities upon which their Clubs should enter. Given a \r\n        good suggestion from their leader, however, they are able to enlarge \r\n        upon it and add their own ideas. Other girls have suggestions which are \r\n        practicable for Club work only after they have been adapted to the \r\n        particular situation at hand. Afarseeing Club Leader receives such \r\n        suggestions and tactfully modifies them for her particular Club. Such \r\n        functions of a Club Leader could scarcely be performed by one of the \r\n        girls themselves, for it is the more mature judgment of the leader which \r\n        enables her to meet and to solve the problems of Club life. To the uninitiated, it might seem a wise policy to \r\n        allow one of the Club members to assume these duties of Leader. Such a \r\n        course of action suggests greater opportunity in the development of \r\n        self-reliance. As a matter of fact, in most Girls Clubs the presence of \r\n        a Leader is needed in order to insure just this training to all Club \r\n        members alike. A Club of young girls without a Leader  a Leader who \r\n        insists that all her girls, whether [ page 16 ] self-assertive or \r\n        retiring, share equally in the opportunities of the Club  will almost \r\n        inevitably see its affair, gradually drift into the control of a few \r\n        natural leaders, and its spirit of democracy lose force. A Club Leader \r\n        is needed among girls to see that the honors and opportunities of Club life are distributed share and share alike. \r\n        Her presence should mean greater opportunities for her girls and, \r\n        because she is there, her Club should be a more helpful and happy one."
    },
    {
      "tag": "h4",
      "text": "Who is to be leader?"
    },
    {
      "tag": "p",
      "text": "This is the question which confronts many a Club \r\n        organizer as she thinks of a group of girls whom she would like to see \r\n        formed in a Club. For the majority of Girls Clubs \r\n        are formed at the instigation of some larger organization or because of \r\n        the interest of some social worker or other broad-minded person. The Head of a Settlement House gets acquainted with a few girls who are \r\n        interested in sewing She thinks it will be helpful to have them meet \r\n        togetherand thus is born a Sewing Club. An extension Library worker \r\n        finds some girls who are interested in reading. She sends out \r\n        invitations for a Book Party, at the close of which she suggests that \r\n        they meet regularly to read and discuss what they have read. The idea is \r\n        enthusiastically received and a Girls Club is then under way. Or \r\n        perhaps a Y W C Asecretary finds a factory \r\n        where the lunch hour is sufficiently long for some activity. She obtains \r\n        permission to try out her plan and goes to the factory during the lunch \r\n        hour. The girls gather around her. She tells stories or amuses them \r\n        4.vith stunts. The girls show [ page 17 ] their interest and she \r\n        asks them whether they wouldnt enjoy coming together once a week. They \r\n        agree to do so  and another Girls Club has been organized. To be sure, \r\n        groups of girls do organize into Clubs without any outside suggestion. \r\n        Such groups sometimes apply for admission into a Settlement House \r\n        organization. They have been together in school and now they wish to \r\n        have a Club. In any case, the group of girls is there. They can be \r\n        organized. Now what about a Leader? The obvious answer to this question seems to be, a \r\n        woman. And this answer comes naturally because women have successfully \r\n        held the leadership of the majority of Girls Clubs. Men have, at times, \r\n        wisely directed such organizations, especially when the Club has met for \r\n        some class work and the man in charge has been qualified to teach in \r\n        that definite work. But a woman seems especially fitted for Club \r\n        leadership because of her understanding of the problems which the girl \r\n        constantly meets. The Camp Fire Girls Manual outlines the \r\n        qualifications of a Guardian (as the Camp Fire Leaders are called) in \r\n        the following way: Camp Fire Guardians are older women, who, because of \r\n        their larger experiences, are able to lead the girls into larger \r\n        interests. Mothers are urged to become Guardians, and the meetings are \r\n        usually held in the homes or out-of-doors. If, \r\n        then, a woman is to be chosen as Leader of a proposed Girls Club, what \r\n        kind of woman is best qualified for the task? Shall the organizer \r\n        search for a young woman, full of enthusiasm and energy, or for an older \r\n        woman, with the wisdom of judgment that comes with years? There can be \r\n        no fixed rule to follow. Girls Clubs have succeeded under the guidance \r\n        of [ page 18 ] enthusiastic young women, full of the stunts which \r\n        girls enjoy. And they have been successful under older women who have \r\n        had the spirit of youth in their hearts. The kind of Leader desired \r\n        depends upon the situation at hand. The social worker hunts for a \r\n        volunteer worker. The employer searches for someone to employ. In either \r\n        case, the task is essentially the same. The social worker must find \r\n        someone who is willing to take up the task and who will be faithful to \r\n        her responsibilities. The employer must find a Club worker who is \r\n        primarily interested in the development of the girls, rather than in the \r\n        salary he will pay her for the work. Each Club presents its special problems and often \r\n        the Leader should be definitely qualified to meet those problems. The \r\n        Leader of a Girls Canning Club in the country must understand the art \r\n        of canning and preserving. She will, whenever possible, introduce into \r\n        the Club life those social elements which mean so much to the lonely \r\n        country girl; but, first and foremost, the Club has been organized to \r\n        can. And the leader must therefore have this specific knowledge. The \r\n        leader of a Literary Club will of necessity have a \r\n        knowledge of books. Her girls have formed a Literary Club because \r\n        of their interest in literature. Her own acquaintance with books will \r\n        enable her to suggest those books for study which will be definitely \r\n        helpful and inspiring to her particular group of girls. The Leader of a \r\n        Girls Club in a business house will grasp the various phases of the \r\n        business life in which the Club is to grow, and will plan her work to \r\n        appeal to and help girls who are in just that situation. The leader of a \r\n        group of foreign girls will find it helpful if she is able to speak \r\n        their [ page 19 ] native language. This ability of hers is the door \r\n        through which she can lead them to an understanding of American life and \r\n        its ideals. Not every Club requires such specific talents. Most \r\n        Girls Clubs, especially those among the younger girls, come together to \r\n        have a Club. They wish to do many kinds of things in their hours \r\n        togethersinging playing, dancing and whatever else appeals to them. In \r\n        the majority of Clubs, in settlement houses, in Y.W.C.A.s and in churches, the demand is for a general Club \r\n        Leader, one who can rally the girls, interest them in the activities of \r\n        the Club and carry those activities to a successful conclusion. It is \r\n        always of great help, however, in planning the work of any Club, to know \r\n        at the outset what the prospective Leader is able to do in any special \r\n        line. The Settlement or Guild director can then often suggest certain \r\n        activities when she knows that the Leader is qualified to carry them on. \r\n        The Club Leader herself does not always realize that her talents can be \r\n        of practical use, until the questioning of the organizer brings the \r\n        matter to her attention and points out the possibilities. This search \r\n        for some talents often reveals others which are equally useful, and the \r\n        Club Leader comes to realize this important factthat Girls Club work \r\n        is wide in its possibilities and its requirements, and thatwhatever she \r\n        herself can do wellthis very training can be passed on to her girls."
    },
    {
      "tag": "h4",
      "text": "Special qualifications to be sought"
    },
    {
      "tag": "p",
      "text": "The following questions show the points concerning \r\n        prospective Club Leaders which an organizer of girls has considered \r\n        important in her own selection of them. [ page 20 ]"
    },
    {
      "tag": "h5",
      "text": "Choosing the Club Leader"
    },
    {
      "tag": "p",
      "text": "Her appearance and \r\n        personality . Is she neat and attractive appearance? Is her \r\n        personality, winning?"
    },
    {
      "tag": "h5",
      "text": "Her Training"
    },
    {
      "tag": "p",
      "text": "Education . What \r\n        has been her education? If at a college or other advanced school, in. \r\n        what did she specialize? What did she most enjoy? Was .she active in \r\n        any non-academic interests? If so, which were they? Did she hold any \r\n        offices or serve on any committees? Special Talents . Has she any special talents? Is she musical? Can she coach plays? Can \r\n        she direct athletics? Teach dancing? Can she teach cooking? Can she \r\n        teach sewing? Art embroidery? Crochet or knitting? Can she teach any \r\n        special arts, such as weaving? Does she enjoy books and reading? Previous Experience . Has she held any position, volunteer or paid, previously to this? If so, what? For how \r\n        long? Why did she leave? Has she ever done work of this kind \r\n        before? Where? What was the extent of it? \r\n        Who were the girls with whom she dealt? What were the activities of the \r\n        Club? Did she enjoy it? If she has never been active in Club work \r\n        before, bow did she become interested in it? \r\n        How much time can she give to it? What are her ideas about the \r\n        conducting of a Club?"
    },
    {
      "tag": "h4",
      "text": "Where are leaders found?"
    },
    {
      "tag": "p",
      "text": "The heads of our large social organizations \r\n        naturally look to our educated young women for service as Club Leaders. \r\n        They have enjoyed advantages for which many of these Club girls yearn, \r\n        or, perhaps, to which they are looking forward. To those who will never \r\n        be able to enjoy them, the college or school girl can bring something of \r\n        the happiness and of the lessons of school days. To those who will some \r\n        day be college girls themselves, the Club Leader can bringthrough \r\n        their Club team [ page 21 ] worksome elements of preparation \r\n        which are not to be found in the pages of the Latin grammar. In Hull \r\n        House, the evening social Clubs (self-governing groups of young people) \r\n        organize and meet under the direction of Leaders appointed by the Social \r\n        Clubs Committee. These Leaders are drawn from the Recreation Department \r\n        of the Chicago School of Civics and. Philanthropy and are students in. training. Such a plan is of \r\n        great advantage both to the Clubs and to the Leaders. The Clubs enjoy \r\n        the leadership of trained and vitally interested workers, and the \r\n        Leaders enjoy the opportunity of contact with a Club, while they are \r\n        studying to be recreational directors."
    },
    {
      "tag": "h4",
      "text": "General qualifications"
    },
    {
      "tag": "p",
      "text": "But such specially trained young people are not \r\n        always available. Many of our smaller and country communities have no \r\n        specially educated women upon whom they may call for Club leadership. \r\n        This should not mean that a Club cannot be started in these places. \r\n        There can always be found a club Leader for the girls, if careful search \r\n        is made. Many a mother has been found who has welcomed such an \r\n        opportunity to meet with her daughter and her daughters friends and to \r\n        be chums with them. Often school teachers have been persuaded to \r\n        undertake the work; they have been glad to meet the girls in an informal \r\n        way and to put aside the relationship of being the teacher. The Camp \r\n        Fire Manual suggests these points in the selection of a Leader. \r\n        Guardians should be appointed from among those (1) who personally know \r\n        the families of the girls; (2) with whom the parents will cooperate. If \r\n        a woman [ page 21 ] is vitally interested in the girls, open to \r\n        suggestions, and eager to develop her Club, that Club Leader will render \r\n        a service to the Community through the organization which she is \r\n        helping."
    },
    {
      "tag": "h4",
      "text": "Afundamental requisite"
    },
    {
      "tag": "p",
      "text": "Club Leaders of many years experience often \r\n        realize that, while the question of ones talents and specific abilities \r\n        is apt to be a first consideration, it is, in fact, secondary to \r\n        another. Without this other, the most brilliantly talented Club Leaders \r\n        have failed in their efforts. With it, those coming to their Clubs with \r\n        apparently empty hands have made of their Clubs vital organizations. \r\n        This primary consideration is the spirit of the Leader. To have the Club \r\n        do its most effective work, the leader must be wholeheartedly interested \r\n        in its members and their development. Real interest in the girls means \r\n        interest not merely in their meetings of one or two hours a week or a \r\n        month. The influence of the best Club Leader extends far beyond these \r\n        comparatively short periods of their being together in the Club, out \r\n        into the lives, of the girls, whether at home, at work, or in school. \r\n        She gets intimately acquainted with them and knows their family life, \r\n        their problems, and their interests. No matter who or where the girl is, \r\n        of what age or nationality, she will respond to real interest and will \r\n        instinctively go for advice to her who she, feels is her real friend. Do not go to your girls with any feeling of \r\n        superiority, a successful Club worker once said to a new Club Leader, \r\n        and dont feel rather satisfied to think you are doing a truly good \r\n        deed. They will feel your superiority [ page 23 ] and will resent \r\n        it. Instead, go to them as you would to a group of people whom you have \r\n        wished for a long time to meet, and as friend to friend get acquainted. \r\n        This key word As friend to friend is one which the new Club Leader may \r\n        well remember throughout her Club work. Asmall, unattractive woman once approached a \r\n        Superintendent in a city Sunday School and \r\n        asked whether she might take a class of young women. Thinking her \r\n        services would be of no special value, he gave her a class of three. In \r\n        the course of a year, the class had grown to seven. Two years passed and \r\n        fourteen were in the class. The quiet woman had formed a Girls Club \r\n        which met regularly at her house. She had called in the homes of the \r\n        girls and had come to know their families. She remembered their \r\n        birthdays with cards and went to see them when they were sick. She gave \r\n        parties for them to which they were sometimes invited to bring young \r\n        men. She could not direct plays or get up a Glee Club, and yet when her \r\n        girls wished to do those things, they had little difficulty in finding \r\n        someone who was willing to help them in that special line. Such \r\n        instances as this encourage tentative Club Leaders who perhaps feel that \r\n        they have not sufficient ability for Club work. Atrue, wholesome friend \r\n        is what every girl needs and it is possible for an earnest, interested \r\n        worker to give and to win friendship of this kind."
    },
    {
      "tag": "h4",
      "text": "Other desirable characteristics"
    },
    {
      "tag": "p",
      "text": "To name all the personal characteristics desirable \r\n        in a Club Leader would be to describe a combination of [ page 24 ] \r\n        them which is rarely, if ever, found in one worker. Afew, however, \r\n        stand out as especially helpful in Club work and surely not \r\n        unattainable. Faithfulness how often has the lack of it on \r\n        the part of her volunteer workers brought despair to the heart of a \r\n        Y.W.C.A. director! And, on the contrary, how often has she blessed the \r\n        Club Leader who is always present at meetings, always on time, and who \r\n        has always made the plans for which she said she would be responsible! \r\n        The best Club Leader places faithfulness to her word before her own \r\n        personal pleasure, and her influence upon the girls is strong or weak \r\n        according as she considers her Club important or unimportant. One Club \r\n        Leader once wrote a pledge which, in her opinion, was the most important \r\n        for a worker among girls to observe. The pledge was as follows: Iwill \r\n        always keep my promises to my girls, unless some real reason prevents. \r\n        By real reason, Ido not mean an attractive social engagement. Ability to be fair and to treat all Club members \r\n        impartially is also desirable in a Club Leader. It is difficult to \r\n        be constantly impartial when some of the girls seem so responsive and so \r\n        well worth the effort expended upon them, while others are far from \r\n        being attractive and are coldly indifferent. Unless a Club Leader is on \r\n        her guard, she will quite naturally fall into the habit of referring to \r\n        one or two Club girls as ideal Club members, and before she knows it, \r\n        the rest of the Club will charge her with having pets. Those who have \r\n        had little interest before will seize upon this as an excuse for their \r\n        indifference. One Club Leader found her work made suddenly difficult \r\n        because she had held up a certain few girls as [ page 25 ] a \r\n        constant example before the others. This aroused resentment in the Club \r\n        against the good workers and against her. She had, to be sure, honored those who most deserved it, but she \r\n        afterward said that had she realized the consequences of her action, she \r\n        would not have been so emphatic about the excellence of the few and \r\n        would have worked more intensively with the others to bring them up to \r\n        the high standard. The necessity for maintaining wholesome friendships \r\n        is closely allied to this ability to treat all with impartiality. Any \r\n        who have dealt with girls know what a crush, or passionate \r\n        hero-worship, is; and have come to dread its appearance as destructive \r\n        to team work and Club cooperation. Incipient hero-worship is but natural \r\n        in girls. They are at the hero-worshiping age. The wise Club Leader will \r\n        not shun nor treat with disdain the young girl who dogs her footsteps. \r\n        Rather, she will make of it the opportunity for developing a real and \r\n        vital friendship. And by showing an attitude of simple cordiality and \r\n        dispassionate interest, she will almost invariably be able to win a \r\n        steady loyalty quite different from flaming and fluctuating adoration, \r\n        and far more lasting. Adirector of many Girls Clubs once pointed with \r\n        pride to the fact that this spirit of passion was lacking in all of her \r\n        organization. Some people will tell you that it is impossible to carry \r\n        on Girls Club work without it, she remarked, but it is possible and \r\n        we know it because we have done it. To be sure, we have had a policy of \r\n        aiming at wholesome friendships and have kept it constantly before us. \r\n        More than this, we have endeavored to have \r\n        our own friendships for each [ page 26 ] other on the high plane of \r\n        balance and sanity. All of this has helped and we are proud of the \r\n        result. Power to see things in the same way as her girls is of greatest value to the Club Leader. When she knows their home life \r\n        and their training, or lack of it, there comes to her an understanding \r\n        of their actions. Before Igive any advice, Ialways try to put myself \r\n        in the girls place, one Club Leader has said. Its surprising bow \r\n        often this changes what Ihad meant to say ! Lack of this very ability to put herself in the \r\n        girls place has brought misunderstanding and even failure into the life \r\n        of many a Leader. A Club Leader in a business house once decided to \r\n        organize a Club among some young girls to meet during the lunch hour. \r\n        The girls were interested in dancing, so she taught them simple folk \r\n        dances. At the outset, she had had in mind the conducting of a class \r\n        like the Physical Training classes she had conducted in her gymnasium. \r\n        She soon found that she could not do it in that way. At first she was \r\n        inclined to reprimand the girls for getting out of line and for \r\n        giggling, but when she stopped to consider the fact that lunch time was \r\n        their only free hour during the day, she soon lost all desire to see \r\n        them standing in rows, learning steps the entire time. So there was no \r\n        reprimand for the girls who laughed heartily at their own efforts to do \r\n        the dances. She provided songs and games for part of the half-hour with \r\n        the result that when the time came for the dance work, the girls \r\n        invariably gave earnest attention to it. The result of this policy on \r\n        her part was the creation of an atmosphere of sociability and enjoyment \r\n        rather than of work to be done. [ page 27 ] Avisiting Club Leader complained of her inability \r\n        to hold her girls during lunch hour in a similar Club. The first leader \r\n        visited the others rooms and talked with the girls. She makes us work all the time on those dances, \r\n        objected one, and she says were silly when we laugh. How would you \r\n        like to work all day and never laugh even on your lunch hour ? The second Club Leader could not have made this mistake bad she been \r\n        able to sympathetically put herself in the place of her Club members. Self-Control . Perplexing situations are sure to arise in the life of a Club, such as \r\n        try the Leaders patience to the utmost. If, through them all, she is \r\n        able to preserve her self-control, she will have contributed vitally to \r\n        the development of her girls, who are often sadly in need of that very \r\n        self-control. The force of a good example is perhaps never exerted more \r\n        powerfully than in showing control of ones temper when the Club work \r\n        is difficult. She never gets mad when youre bad, said one girl of a \r\n        beloved Camp Director, but she makes you feel pretty mean when you \r\n        break rules, because shes always so sorry about it! And so it would be possible to make a long list of \r\n        personal characteristics which enable a Club Leader to exert a helpful \r\n        influence upon her girls. Perhaps the best general rule for the Leader \r\n        is to always try to be what she wishes her girls to be. If her ideal is \r\n        sufficiently high, she will never attain it. But in the striving, she \r\n        will help not only her girls but also herself, immeasurably. [ page 28 ]"
    },
    {
      "tag": "h4",
      "text": "Getting acquainted with the girls"
    },
    {
      "tag": "p",
      "text": "The earnest Club Leader will at once set about \r\n        getting acquainted with her girls in as vital a way as possible. She has \r\n        been given a group of girls to lead along the lines of useful \r\n        development. The activities of the Club and her personal relationship \r\n        with them must further this aim. In order to accomplish this, she must \r\n        know each girl. Her help can then be given wisely. But such acquaintance \r\n        cannot be gained, at once, nor without definitely searching for it. For \r\n        knowing each girl means far more than being able to recognize her upon \r\n        the street and calling her by name. It includes acquaintance with her \r\n        family and her home life, her education, her surroundings, her \r\n        interestsin short, an acquaintance with the forces which have made her \r\n        what she is. If, a Leader has definitely in mind what she wishes to, \r\n        know about her girls, any conversation will give her an opportunity to \r\n        learn the desired facts. It may be some time before the Leader knows all \r\n        that she wishes concerning her girls. Many Club Leaders have found it \r\n        far wiser to approach the girls gradually than to go to them in the \r\n        attitude of a cross-questioner and by constant questioning to arouse \r\n        their suspicions and antagonism. Afriend, however, confides in a \r\n        friend. Once a Club Leader has proved herself a friend to her girls, \r\n        girlish confidences follow and the Leader is in a position to advise and \r\n        direct wisely. Just what it is helpful to know about a group of \r\n        girls varies with the kind of girls who are members of the group. The \r\n        following list of questions, however, includes many of the necessary \r\n        facts and may be a guide [ page 29 ] to Club Leaders in making a \r\n        fundamental acquaintance with their girls. Miss Mary Richmonds book on \r\n        Social Diagnosis (Russell Sage Foundation, Publishers) also gives au \r\n        excellent set of questionnaires which fit situations of all kinds. The Girls Relationships. Her Family . How many are there in the family? Are the father and \r\n        mother native or foreign-born? Do they speak English? What does the father do? \r\n        Is his position steady? Does the mother work? How many of the family \r\n        work? What is the girls \r\n        attitude toward her family? Her Friends . Who are her friends? Are they in the neighborhood where she lives? Are they in her church? Are they in her place of \r\n        work? How did she come to know \r\n        them? Is she engaged? What does the young man \r\n        do? Does she expect to be \r\n        married soon? Living Conditions . Where does the girl live? If she is with her \r\n        family, has she a room of her own? Where does she board, if \r\n        a boarder? How much does she pay \r\n        for board? What kind of \r\n        boarding-house is it? Are there any rules \r\n        about the conduct of the girls who live in it? Physical Condition . Is her physical condition good? Does she need special \r\n        attention of any kind? Is she sufficiently \r\n        nourished? Does her physical \r\n        condition bar her from the more strenuous Club activities such as \r\n        basketball? Education . Is the girl still in school? What grade? If so, does she enjoy \r\n        it? What is her rank? [ page 30 ] What studies does she \r\n        most enjoy? Is her conduct good? If not now in school, \r\n        what was her grade when she left? Why did she leave? Can she return to \r\n        school? What studies did she \r\n        like best when in school? Does she read or study \r\n        now? Has she taken any course \r\n        since leaving school, such as a business-college course? Occupation . Is the girl filling a position of any kind? What is the work which \r\n        she is doing? By what concern is she \r\n        employed? Does she enjoy her work? If not, what would she \r\n        prefer doing? What are her ambitions? Is she suited to her \r\n        present occupation? Has she talents which \r\n        would enable her to pursue another better? Can she be directed into \r\n        that other line of work? Financial Situation . What is her salary? Does she give it all to \r\n        her mother and receive an allowance from her? What is the amount of \r\n        this allowance? What is the salary used \r\n        for? How much goes toward \r\n        clothes? Lunch? Recreation? Board? Does she save any and \r\n        how? Does she keep any \r\n        account of her expenditures? Religious Life . Does the girl attend any church regularly? If not, does she belong \r\n        to any church? Why did she get out of \r\n        touch with it? Is it a vital force in \r\n        her life? Recreation . What does the girl do for recreation beside her \r\n        Club meetings? [ page 31 ]"
    },
    {
      "tag": "h4",
      "text": "Know your community"
    },
    {
      "tag": "p",
      "text": "From the outset, the progressive Club Leader will \r\n        realize that her Club is not the only force which touches the lives of \r\n        her girls. The Club meets for one or two hours every week or two weeks. \r\n        Think of the many other hours during each week when other forces, for \r\n        good and for evil, are touching those same lives! What are they? How \r\n        can Iwork with them, and in this way establish more firmly the work of \r\n        my own Club ? These are the questions which \r\n        come before every Club Leader. Often they present themselves through the \r\n        desires or needs of the girls. One of the Club girls wishes to join a \r\n        church. What is the best one for her, in the section where she lives? A \r\n        Club member is eager to study stenography and typewriting. Where is the \r\n        most thorough course given, and at what price? The father of one of the \r\n        Club girls is living a life harmful to the best interests of the family. \r\n        What organization should she consult for help? The Club wishes to give \r\n        some financial help to some good cause in the community. What shall it \r\n        be? Such questions as these arise constantly in a growing Girls Club. \r\n        The alert Club Leader who knows the organizations and opportunities of \r\n        her own district or town is able to answer them with practical, definite \r\n        suggestions, which the girls can put into action. Margaret F. Byington in her booklet on What Social \r\n        Workers Should Know about Their Own Communities, has said of her \r\n        suggestions: This is not a plan for a Social Survey; it is rather an \r\n        outline of those facts about local conditions which are a necessary part \r\n        of the equipment for service of the volunteer or [ page 32 ] of the \r\n        regular in the social army. In fulfilling his task, whatever it may be, \r\n        every such worker must rely for help on the organized forces, on State \r\n        laws and local ordinances, on city, departments and volunteer agencies. \r\n        He will, moreover, find his problem so dovetailed with other problems \r\n        that all must be worked out jointly if anything is to be achieved. The knowledge of these forces and agencies is of \r\n        special importance to one who works among needy families, since he must \r\n        utilize them constantly in the rehabilitation of individual families. \r\n        Conversely, he should learn from the study of dependency in these \r\n        families what reforms are most needed, and help to focus the efforts of \r\n        all agencies with a social program on the removal of evils thus made \r\n        real to him. The general outline of Miss Byingtons suggestions concerning facts which the Club worker may \r\n        well know is as follows: Historical setting of the community. City \r\n        administration and finances. Housing. Health. Health activities. Recreation. Industry. The \r\n        immigrant. Children. Child labor . Education. Juvenile \r\n        delinquency. Child caring. Adult delinquents. Needy families. Private relief. The organization of charity. Public outdoor relief. Homeless men. The \r\n        aged. Community organization. Fraternal orders. Womens clubs. Business mens associations. Local civic \r\n        improvement associations. Churches. [ page \r\n        33 ] Many interested in the girl-problem have given this \r\n        matter of community organization special study and have compiled \r\n        outlines of definite help to workers with girls. In Columbus, Ohio, \r\n        through the officers of the Girls Friendly Society, a survey was \r\n        compiled of opportunities for girls in that city. The list included \r\n        opportunities for education, employment, amusement, protection, labor laws, legal aid, lodgings, lunch \r\n        rooms, savings, settlements and churches. The Young Womens Christian Association, in its \r\n        pamphlet on Some Resources for Work with Girls and Young Women in \r\n        Towns, places such a survey as an important part of girls work. This \r\n        pamphlet states: The purpose of a survey is not for prying, but for a \r\n        definite focus on facts, getting ones range, so that there shall be neither haziness of aim nor waste of energy. \r\n        Each place is a different puzzle, and the life and ambitions of girls \r\n        are always more or less colored by the \r\n        influence peculiar to each locality, so that one must never generalize. The outline suggested in this pamphlet is as \r\n        follows: Sources of Information for the Survey 1. Direct conversation with girls and young women. 2. Private inquiry of employers, teachers, pastors, \r\n        and parents. 3. Reports of public officials. 4. Study of methods and successes and failures of \r\n        other town organizations. Survey for a Town General . 1. Population of town. Number of girls between 15 \r\n        and 30 years of age. [ page 34 ] 2. Different nationalities represented. If any one \r\n        nationality predominates, which is it? Is there any section of the town \r\n        occupied principally by one nationality or race? 3. Number of occupations open to women. Number of women employed outside of their homes. State how \r\n        many girls are employed in each of the following: Teaching, including \r\n        music teachers; clerks in stores; telephone operators; stenographers and \r\n        bookkeepers; factories, hotels, restaurants; dressmaking; milliners; \r\n        domestic service. Discover for each group how many have homes in \r\n        town. 4. Organizations for women and girls. Give names of \r\n        clubs, indicating whether their purpose is literary, social, civic, philanthropic , telling the name of the \r\n        president and the number of members. Make separate lists of lodges and \r\n        also of church organizations. How many of these organizations have in \r\n        their membership girls between 55 and 25? What organizations, if any, \r\n        are there whose membership is made up exclusively of girls? Educational . 1. \r\n        Educational institutions in town with number of girls attending. Number of girls in High School. What percentage of girls finishing the eighth grade \r\n        within the last three years have entered the high school? Give \r\n        for each year separately if you can. - What are the girls doing who did \r\n        not go on to High School? How many girls from the High School have gone \r\n        to college in the last three years? What determined the others not to \r\n        go? What work have they taken up? (Consult the school superintendent or \r\n        High School principal in getting these figures.) Is there a library in \r\n        town? How many volumes? Open how much of the time? Does the town have a \r\n        lecture course during the season? A Chautauqua in \r\n        the summer? What occasions daring the year attract the largest \r\n        number of people to your town? Social and Recreational . How much social life and recreation is furnished by the churches of the \r\n        town? By the schools? Are there groups not \r\n        touched by either of these? Where do they find their social life? How many motion-picture houses in town? What would \r\n        you say of the character of the films shown? What is the average  [ page 35 ] attendance in \r\n        a week in one of these places? How many dance halls? Skating rinks? Gymnasiums in town? How \r\n        much are they used? Is any organization making a definite effort to \r\n        encourage outdoor activities for young people? Religious . Number of churches in town, giving denominations. Name of pastors and approximate membership. How many Sunday-School classes are there made up of girls between 15 and \r\n        25 years? What is the total membership? How many of the churches have \r\n        active young peoples organizations? Is there a city union of young \r\n        people or any other interdenominational plan for working together? Alarge, general survey of this kind, while \r\n        suggestive for the individual Club Leader, is much more broad in scope than she may wish to undertake. Miss Eliza R. \r\n        Butler, in connection with the problems of Secondary School girl work, \r\n        has formulated an outline for a survey in that field which shows how the \r\n        idea of a survey can be adapted to special problems. The following \r\n        points are included in Miss Butlers outline: 1. Study of the nature and interests of girlhood. 2. Social programsto determine the amount of time \r\n        available for Club activities. 3. School regulations in regard to student \r\n        activities and organizations. 4. State laws and ordinances concerning the use of \r\n        public school buildings, etc. 5. The problems of school life \r\n        in the given school or group of schools. (a) Percentage of graduates going to college. (b) Percentage of graduates going into remunerative \r\n        occupations. - (c) Percentage of graduates who live at home. (d) Existence of other clubs and organizations \r\n        which- ma~ be meeting student needs. [ page 36 ]"
    },
    {
      "tag": "h4",
      "text": "Contact with other leaders of girls"
    },
    {
      "tag": "p",
      "text": "Perhaps nothing is of more inspirational help to a \r\n        Club Leader than meeting others who are also interested in girls and who \r\n        are dealing with the same problems. Great benefit is to be gained from \r\n        such personal contact and from informal discussion of these problems. \r\n        Those who direct large organizations made up of many Clubs have long \r\n        since realized the importance of gathering Club Leaders together. And so \r\n        it is that we see the Club Leaders of a Settlement House meeting to \r\n        discuss their plans; the Secretaries and the volunteer workers in a Y. \r\n        W. C. A. coming together; we hear of Camp Fire Guardians or Girl Scout \r\n        Captains conferring in special sessions. In many parts of the United \r\n        States such gatherings are not limited to single organizations. Groups \r\n        of leaders have been formed that are city-wide, county-wide, and even \r\n        country-wide. In Philadelphia the leaders of girls in that city \r\n        are united in the Girls Conference. All organizations interested in \r\n        work for girls are invited to join. The conference is an open forum for \r\n        the discussion of city-girl problems. Four or more meetings are held in \r\n        the course of the year, and the problems are then presented and \r\n        discussed. The roll of the Girls Conference includes organizations of \r\n        all kindsreligious (Jewish, Catholic, and Protestant); remedial \r\n        organizations; educational organizations; and recreational \r\n        organizations. The executive board of this Conference includes a Girls \r\n        High School principal, representatives from the Catholic, Jewish, and Colored , organizations of the city, and \r\n        representatives from such organizations as the Salvation  [ page 37 ] Army, the Y. W. C. A., the Girls Aid \r\n        Society, and the Travelers Aid Society. Ameeting of a committee of this kind gives many points of view concerning \r\n        the girls of the community. The following subjects which the \r\n        Philadelphia Girls Conference has considered show the practical \r\n        problems which have come before them: Closer cooperation of all field \r\n        workers; Vocational training and guidance and follow-up work of girls \r\n        obtaining working papers, with special attention to recreation and \r\n        character building; Social Service for cases heard in Magistrates \r\n        Court; Work with girls and women in War Times; Constructive War Work \r\n        with girls, and Recreation of women affected by War-Time Activities. In smaller communities, it is possible to bring \r\n        together the school teachers and the Sunday- School teachers as well as \r\n        those directly concerned with Club work. The Boys and Girls \r\n        Agricultural Clubs, which have been largely promoted under the auspices \r\n        of the United States Government, have used the county as a unit, and \r\n        within a county have brought the Clubs and Club Leaders into personal \r\n        touch with one another. In this way there has been created a cordial \r\n        friendliness and cooperation."
    },
    {
      "tag": "h4",
      "text": "Training for the new club leader"
    },
    {
      "tag": "p",
      "text": "Contact with experienced Club Leaders is especially \r\n        valuable to the new and inexperienced Leader. Many young women just \r\n        starting out upon this work have received valuable suggestions by \r\n        talking with those who have for years been interested in this line. \r\n        Those who are in charge of many Clubs and of Club Leaders have prepared \r\n        for these Leaders short courses to be given  [ page \r\n        38 ] at summer conferences or winter meetings. The foTlowing course for Leaders was given under \r\n        the Girls Division of the National Service Commission, New York City, \r\n        in the form of six lectures by women of experience in girls work: A. The Club and its Organization. 1. How best to reach the girls. 2. The value of self-government and how to obtain \r\n        it. 3. The necessary steps in the first three meetings \r\n        of a Club. B. The Club and its Activities . 1. How to work out a program based on \r\n        physical-service recreational lines. This would include: a. The different kinds of physical work possible \r\n        for girls of different ages. The advisability of \r\n        drill work. b. Different kinds of service work. c. Recreation in general. 2. Dramatic Work for Clubs. Plays. Pageantry. Community Singing. a. Educational value of Dramatics. Aesthetic and Community sense to be developed \r\n        through pageantry. b. The director: The necessary point of view. Educational and Community Drama. c. The production; Formation of Committees, etc. d. Cooperation: Drama league. Community Choruses. 3. The Club and City Social Agencies. a. How to use Agencies for saving. b. How to use Clinics, Visiting Nurses, Hospitals, \r\n        and Convalescent Homes. c. How to use the Public Library and the Art \r\n        Museum. [ page 39 ] 4. Presentation and discussion of Club Plans which \r\n        have been found to be successful for girls, such as, a. Girl Scout Work. b . Camp Fire work. c . Woodcraft League \r\n        work. d. Protective League work. 5. Forum meeting for Questions and Discussions."
    },
    {
      "tag": "h4",
      "text": "Contact with club leaders through \r\n        publications"
    },
    {
      "tag": "p",
      "text": "Many books have been written which touch upon the \r\n        various phases of Girls Club work, and the periodicals which are \r\n        published by the various organizations give to every Club Leader a \r\n        splendid opportunity for gathering new ideas for her Club. The Camp Fire \r\n        Girls Handbook (fifty cents); the Handbook for Girl Scouts (thirty \r\n        cents); the Woodcraft Manual for Girls of the Woodcraft League (fifty \r\n        cents)all of these outline in greatest detail many activities for \r\n        girls. The monthly publications of the large organizations of girls and \r\n        young women give many suggestions for the actual carrying out of these \r\n        activities. There is no issue of the following Girls - Club magazines \r\n        which does not contain definite suggestions for Club work, either in the \r\n        special articles written by trained Club workers, or in the reports \r\n        which the girls themselves contribute. Any Girls Club Leader will find \r\n        help in the Association Monthly (Y. W. C. A. publication, one dollar a \r\n        year); Wohelo (Camp Fire Girls Magazine, \r\n        one dollar a year); The Rally (Girl Scouts Magazine, one dollar a \r\n        year); The Club Worker (published by the National League of Women \r\n        Workers, thirty cents a year). By subscribing to one or all of these \r\n        publications any Club Leader can, at a  [ page \r\n        40 ] small expense, receive a constant influx of new ideas. It \r\n        matters little whether or not she has a group of girls under any of \r\n        these particular organizations; there is suggestion and inspiration for \r\n        her in all work which is being carried on among girls."
    },
    {
      "tag": "h4",
      "text": "Cooperation with other individuals"
    },
    {
      "tag": "p",
      "text": "Many Club Leaders have found that there are others \r\n        living in the same community who are willing to help in the work of \r\n        their Clubs. These others are not willing to undertake the work of a \r\n        Club, but they are glad to give their help in coaching a play, in \r\n        training a Glee Club for a certain concert, or in arranging for a \r\n        special outing. The Club Leader who makes use of not only her own \r\n        talents but also those of her friends finds help waiting for her where \r\n        she may least expect it. One Club Leader in a large city successfully \r\n        introduced the Big Sister idea into her Club work. Her girls were of a \r\n        kind who needed a large amount of individual attention. She herself was \r\n        unable to give it. So she sought the help of a number of her friends, \r\n        asking each one to take one girl in the Club and be her big Sister, \r\n        taking her out to wholesome pleasures, watching her, and advising her. \r\n        The plan was well worth the effort, and the girls profited by these \r\n        helpful friendships."
    },
    {
      "tag": "h4",
      "text": "The new club leader"
    },
    {
      "tag": "p",
      "text": "The numerous possibilities in Girls Club work \r\n        should cause no young woman who is genuinely interested in it to \r\n        hesitate in undertaking it There is help for \r\n        her at every turn, through these many and various channels. She may feel \r\n        that her talents are meager and that she is \r\n        not well-equipped. But as her Club grows and develops, she, too, will \r\n        grow and develop. The girls themselves and those ready and anxious to \r\n        help her will teach her. As Dr. Luther H. Gulick , \r\n        President of the Camp Fire Girls, has said, The paradox of life is that \r\n        we keep that part of it which we give to others and that we lose that \r\n        which we save for ourselves. The breath of the \r\n        Spirit is like the breezegrasp it to hold and there is nothing. \r\n        It is like the heart which grows by giving love. Without love, save it, \r\n        and the heart is empty. How to cite this piece :  Ferris, H. J. \r\n      (1918) 'The club leader' being Chapter II of Girls' Clubs. Their \r\n      organization and management. Amanual for workers , New York: E. P. \r\n      Dutton and Company. Available in the \r\n      informal education archives: http://www.infed.org/archives/nayc/ferris_girls_clubs_leader.htm"
    },
    {
      "tag": "p",
      "text": "This piece has been reproduced here on the understanding that it is \r\n      not subject\r\n to any copyright restrictions, and that it is, and will \r\n      remain, in the public domain. First placed in the archives: February 2005"
    },
    {
      "tag": "h6",
      "text": "infed is an open, independent and not-for-profit site put together by a small \r\n        group of educators [ about \r\n        us ]. Give us your feedback ; write for us. Check our copyright notice when copying."
    }
  ]
}