{
  "url": "http://www.intrinxec.com/fcbpw.htm",
  "file_number": "512",
  "content_hash": "9fb132937e32984ca52dfe7f3364bde2d81b62979c0b2415f9a21cca05856064",
  "total_blocks": 84,
  "retained_blocks": 5,
  "ignored_blocks": 79,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation msnavigation msnavigation msnavigation"
    },
    {
      "tag": "p",
      "text": "Inspiring Women in the Workplace TM"
    },
    {
      "tag": "div",
      "text": "Mission Statement Vision Statement Statement of Faith Calendar of Events Bible Studies Newsletter Membership\r\n        Information Contact\r\n        Us"
    },
    {
      "tag": "p",
      "text": "FCBPW MISSION Providing opportunities for women in the workplace to come\r\n    together for bible-based worship, fellowship, discipleship, and\r\n    encouragement, advancing the spread of the gospel for the Glory of\r\n    God. FCBPW\r\nVISION Reaching and inspiring women in workplaces everywhere to know the\r\nlove of Christ and grow in grace and the knowledge of God. Bringing women together to build relationships; teaching,\r\nencouraging, and equipping them for works of service to the building up of the\r\nbody of Christ. All this for the glory of God! STATEMENT OF FAITH We believe the Bible is the inspired and inerrant Word of God. We believe in one God; Father, Son and Holy Spirit. We believe that we are saved by grace through faith and that is not of\r\n    ourselves, it is the gift of God. We believe Jesus Christ is the Son of God, that he died for our sins and\r\n    was raised from the dead, and that whoever believes in Him will have\r\n    everlasting life. CALENDAR OF EVENTS FCBPW holds bi-monthly luncheon meetings in which a business or professional\r\nleader gives their testimony and encourages women to share their faith in the\r\nworkplace. Meetings are held at the Town & Country Club from 11:30\r\na.m.  1:00 p.m. Be sure to check back for more information regarding upcoming \r\nprograms in 2007! Map\r\n    & Directions to Town\r\n    & Country Club SMALL GROUP\r\nBIBLE STUDIES FCBPW also holds monthly bible studies in Minneapolis and Saint Paul and\r\nplans to expand in other cities as the organization grows. If you are interested in joining a small group, please call: Minneapolis: Sherry Meyer ( 612)\r\n376-9361 St. Paul: Sherry Hastings (651) 291-3576 Women's Club: Carla\r\n    Pedersen (612) 752-1917 Woodbury: Nancy Branton (651) 459-0528 NEWSLETTER\r\n- FCBPW VOICE Winter 2006 (PDF) Summer 2005 (PDF) MEMBERSHIP\r\nINFORMATION The Fellowship of Christian Business & Professional Women (FCBPW) is excited\r\nto announce the launch of our new membership initiative. This 12-month\r\nmembership will begin on the date we receive payment and will continue for 12\r\nmonths.  The annual\r\nmembership fee of $75.00 will\r\nenable FCBPW to more effectively reach out to business and professional women in\r\nthe Twin Cities area.  Please review the benefits listed below that are\r\nincluded with your $75 membership fee, and prayerfully consider becoming a\r\nmember. Click\r\nhere to print and complete an application. Benefits of Membership Receive\r\n    all FCBPW mailings, including the quarterly electronic newsletter. Opportunity\r\n    to be featured in FCBPW's quarterly newsletter under Member Profiles. Be\r\n    included in, and receive, the annual FCBPW Membership Directory. Be\r\n    eligible to volunteer for FCBPW committee opportunities and Board positions. Criteria for Membership Agreement\r\n    and acceptance of FCBPW's mission, vision, values and statement of faith. Successful\r\n    completion of the Application for Membership. Membership\r\nExpectations and Fees Help\r\n    promote FCBPW to business and professional women. Encourage\r\n    and support one another. Annual\r\n    Membership Fee is $75.00.  Membership dues pay for 12-month membership\r\n    from date payment is received. Aportion of your membership dues may be tax\r\n    deductible. Consult your tax\r\n    advisor for more information. We hope you will prayerfully consider becoming a member of FCBPW and helping\r\nto support our mission. Click\r\nhere to print and complete an application. CONTACT\r\nUS Phone: (952) 252-3573 Fax: (952) 252-8096 Email: fcbpw@bcmn.com Address: FCBPW c/o IntrinXec Management Inc. P.O. Box 1705 Minnetonka, MN 55345"
    },
    {
      "tag": "div",
      "text": "msnavigation msnavigation msnavigation The \r\n\t\tAMC Choice | Our Services | Our Clients | News | Resources | Request for Proposal | Contact | Home IntrinXec Management, Inc.  Tel (952) 252-3573  Fax (952) 252-8096 Copyright 2006 IntrinXec. Reprint only with the express permission \r\n\t\tfrom copyright holder(s). All trademarks are property of their respective owners. Web design & maintenance by msnavigation"
    }
  ]
}