{
  "url": "http://www.ivc.ca/governments/usa/state/",
  "file_number": "517",
  "content_hash": "ef978cf333fb5282860e151d1f82d86c9fae34c019940bca63cd375a81a05bf6",
  "total_blocks": 414,
  "retained_blocks": 19,
  "ignored_blocks": 395,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\""
    },
    {
      "tag": "p",
      "text": "Home | Daily News | Join CTA (free) | Training | Jobs | Books | Media | Contact | Search | Links"
    },
    {
      "tag": "div",
      "text": "GOVERNMENTS, PUBLIC POLICY & TELEWORK Governments Home US GOVERNMENTS USA home Cities States Federal Federal employee telework program"
    },
    {
      "tag": "p",
      "text": "US \r\n            states and telework For many reasons, politicians all \r\n            over the world are becoming increasingly supportive of telework and \r\n            telecommuting. This listing of American elected officials (current \r\n            and past) support and endorse telework. Contact us if you know of others. See map showing \r\n\t\t\twhich US states use telework"
    },
    {
      "tag": "div",
      "text": "Arizona - Following oil pipeline rupture, Governor directs all state agencies, boards and commissions to limit daily agency \r\n          travel and to make utilization of the Rideshare and Telework programs \r\n          an immediate high priority. - State Governor \r\n          Napolitano advances the State Telework Program with Executive Order - Former State\r\n              Governor Symington mandated 15% of all Phoenix area State workers to telework as part of \r\n          his increased commitment to air quality California - Bill, SB 2021 Starting in\r\n            2001, qualified employers and employees in Los Angeles, Orange, and\r\n            Ventura will be eligible for a $500 tax credit if they use telework\r\n            and other alternative work arrangements to reduce traffic congestion\r\n            and improve air quality and worker productivity. Only newly created\r\n            positions would be eligible, and employees also must travel a\r\n            minimum of nine miles to their workplace and commute outside of\r\n            times other than normal \"rush hours\" - Governor Pete Wilson '94: In\r\n            an open letter to all California executives: \"Telecommuting\r\n            also must play a role (in reducing the number of cars. Atelecommuting program at your firm can help solve transportation\r\n            challenges and improve our air quality and regional mobility. It\r\n            also can cut your costs and improve your employees\r\n            productivity.\" - Gov't Code, S. 14200-14203:\r\n            \"The Legislature finds and declares the following: That\r\n            telecommuting can be an important means to reduce air pollution and\r\n            traffic congestion and to reduce the high costs of highway\r\n            commuting; that telecommuting stimulates employee productivity while\r\n            giving workers more flexibility and control over their lives. It is\r\n            the intent of the Legislature to encourage state agencies to adopt\r\n            policies that encourage telecommuting by state employees.\" - Assemblymember Liz Fugueroa: Introduced a bill into the California \r\n          State Assembly that authorized a $200 tax credit for each new \r\n          qualified residential teleworking position and a $100 tax credit for \r\n          each new qualified teleworking center position created during the \r\n          taxable year by the taxpayer and staffed by an hourly or salaried \r\n          employee residing in California during the taxable year. (Bill died in \r\n          committee) -"
    },
    {
      "tag": "div",
      "text": "Links:"
    },
    {
      "tag": "div",
      "text": "California\r\n            Department of Personnel Admin Telework Program California's\r\n            Smart Valley Telecommuting Guide California\r\n            Department of Personnel Admin Telework Program California's\r\n            Smart Valley Telecommuting Guide"
    },
    {
      "tag": "div",
      "text": "Colorado - 31 Colorado Mayors urge Colorado businesses to consider telework to\r\n    help solve critical business and transformation issues, including the ongoing challenge to\r\n    attract and retain highly skilled workers in a tight job market. -"
    },
    {
      "tag": "div",
      "text": "Links"
    },
    {
      "tag": "div",
      "text": "Colorado\r\n            Telework Program"
    },
    {
      "tag": "div",
      "text": "Connecticut - Sept 2005: The \r\n\t\t\tTelecommuter Tax Fairness Act proposed by Senators Chris Dodd \r\n\t\t\t(D-CT), and Joseph Lieberman (D-CT), and Representatives Christopher \r\n\t\t\tShays (R-CT), Tom Davis (R-VA), and Rosa DeLauro (D-CT) seeks to \r\n\t\t\tremove a state-based penalty tax on interstate telecommuting."
    },
    {
      "tag": "p",
      "text": "According to Representative Shays, \"Telework is a critical tool to help lower spiraling gas costs and \r\n\t\t\tour dependence on foreign oil. The Telecommuter Tax Fairness Act \r\n\t\t\twould facilitate telework by prohibiting a punitive tax on Americans \r\n\t\t\twho work from home for out-of-state employers. This is the time to \r\n\t\t\tmake telecommuting easier for Americans, not harder,\" he said. \"Iam \r\n\t\t\tglad to have the support of The Telework Coalition in the effort to \r\n\t\t\tempower more Americans to conserve fuel by telecommuting.\""
    },
    {
      "tag": "div",
      "text": "- CT Senator \r\n          Chris Dodd to introduce a measure in the senate that will protect \r\n          Connecticut telecommuters from having to pay a second income tax to \r\n          the state of New York. See story here - State set aside $55 \r\n          million to urge commuters to opt for commuting \r\n          options including telecommuting and other . Governor Rowland said: \"The choices are very simple:....When \r\n          to go to work; Where to work from; and How to get to work\" - TelecommuteCT is a $.5 million program to help state employers design and implement telecommuting programs Florida - Review \r\n          of Florida's Telecommuting Program - Florida \r\n          State Employee Telecommuting Program Georgia - 2006 Georgia. State gives \r\n\t\t\ttax breaks to firms who let workers telework. It will give employers a state income tax credit of up to \r\n\t\t\t$20,000 if they conduct telework feasibility study a tax credit of up to $1,200 per employee if they implement telework \r\n\t\t\tprograms. Details here - Georgia bill would jump-start telework. Telecommuting may finally \r\n          be poised to take off in Georgia after years of false starts. Apair \r\n          of bills now before the state House of Representatives would reward \r\n          employers with annual tax credits of up to $1,500 for each employee \r\n          who works a certain amount of time from home rather than the office. \r\n          Supporters say incentives will encourage companies that have been slow \r\n          to get their employees out of their cubicles and off the roads. Gov. \r\n          Sonny Perdue championed telecommuting during his 2002 campaign and has \r\n          backed the idea of state financial assistance - Georgia State teleworking initiative has had trouble revving up . \r\n          Officials blame budget and legal constraints for problems they have \r\n          had getting only 1,500 Georgia state employees are teleworking at \r\n          least one day a month, two years after Gov. Sonny Perdue said the \r\n          number would be 25,000 - or roughly 25 percent of the state \r\n          government's workforce - by 2005 - (2004) Georgia proposes telework tax credits Goal is to reduce congestion and air quality. Recipient teleworkers or \r\n          businesses could get from $500 to $5000, and would need to show how \r\n          their telecommuting program works and how many driving miles were \r\n          saved - Georgia State's telework \r\n          policy (pdf). Also see Georgia Governor's executive order (pdf) regarding telework - 2003\r\n            Clean Air Campaign Raises the Bar on Teleworking in Metro Atlanta: Telework Leadership Initiative awards employers with up to $20,000\r\n            in consulting and cash to establish telework programs The Clean\r\n            Air Campaign is accepting applications for the Telework Leadership\r\n            Initiative, a groundbreaking incentive program that provides\r\n            employers with up to $20,000 worth of resources to start or expand a\r\n            telework program. The Clean Air Campaign is a not-for-profit\r\n            organization working to reduce traffic congestion and improve air\r\n            quality in metro Atlanta - (2002) Georgia\r\n            Governor wants 25,000 state teleworkers as a viable\r\n            alternative for dealing with traffic, pollution and quality-of-life\r\n            issues - Governor Zell Miller '98: Mandated all 26,000 state employees to\r\n            reduce solo trips to and from work by 20% on Ozone Action\r\n            Days....telework is an ideal commute option. When an ozone alert is\r\n            issued, practiced teleworkers can easily collect enough work to be\r\n            highly productive at home, playing their part in reducing emissions\r\n            and single occupancy vehicles during peak congestion periods\". Kansas - Kansas Assistive Technology \r\n\t\t\tCooperative (KATCO) helps persons with disabilities find telework \r\n\t\t\temployment with loans for adaptive equipment and home office \r\n\t\t\tmodifications Kentucky - Kentucky State \r\n          Telecommuting White Paper: Policy and Technology Issues - State of Kentucky \r\n          telecommuting program ( MS \r\n          Word) Maine - Gov. John Baldacci signs executive order to reduce greenhouse gas emissions to 1990 \r\n          levels by 2010. He has asked state officials to review and report on \r\n          existing telecommuting programs by January 2005. He wants the State to \r\n          assume a leadership role in addressing the serious risk of climate \r\n          change by promoting more efficient use of energy in the transportation \r\n          sector Maryland - Apr 04 Bill supporting tax \r\n          incentives for private companies offering telecommuting programs in \r\n          Maryland made it through the House by a 139 to 0 vote, but \r\n          died in the Senate . Will try again next year. - Mar 04: Telework legislation (House Bill 1101) offers over half million \r\n          over three years to help employers and teleworkers. Employers would \r\n          get tax credit of up to 25% of telework costs (up to $5,000/yr). Aside bill mandates telework for state employees (sort of like the \r\n          federal telework law) - Maryland's DOT initiates The Telework\r\n              Partnership Offers\r\n              free professional telework consulting services to Maryland\r\n              Employers. Also, the state's Telecommuting Pilot Program requires a\r\n    statewide telecommuting pilot program for all government agencies - Working From Home Gains\r\n            Converts - Governments Warming To Telecommuting Option - Feb\r\n            2002: Sue\r\n            Hecht of the Maryland House of Delegates submits \"Telework Tax Incentive Act\". \r\n          Aim is to provide a\r\n            $500 tax credit for employees and/or employers to promote teleworking in the private sector - Governor Parris Glendening (2000) offers 'pay-me-not-to-drive'\r\n            incentives to employers and employees to address traffic and air\r\n            pollution problems. Gives a special pay boost for lower wage workers\r\n            while saving employers money - Establishes $600,000 fund to help employers establish telework programs to reduce traffic congestion and improve the\r\n            quality of life of state residents. Signs into law the state's\r\n            Telecommuting Pilot Program which requires the establishment of a\r\n            statewide telecommuting pilot program for all government agencies. Massachusetts - Massachusetts Division of Energy Resources (DOER) Massachusetts Telecommuting Initiative Minnesota - Senator Paul Wellstone, D-Minn. introduces Rural Telework Act of\r\n            2000 to provide funding to local organizations to help train,\r\n            connect and then employ rural workers to do \"telework\"\r\n            jobs in the information technology field in their own communities. - Statute s. 15.95 sub. 10 '94 Says no state agency may propose or\r\n            implement a capital investment plan for a state building unless it\r\n            receives approval from the state for increasing telecommuting by\r\n            employees who would normally work in the building, or can prove that\r\n            such a plan is not practicable. -"
    },
    {
      "tag": "div",
      "text": "Links:"
    },
    {
      "tag": "div",
      "text": "Minnesota Office of Technology Midwest Institute for \r\n                  Telecommuting Education University of Minnesota"
    },
    {
      "tag": "div",
      "text": "Montana - Montana passes a bill \r\n          formally authorizing state agencies to promote \"teleworking\" by \r\n          employees. The thinking is that telework makes employees more \r\n          productive, reduces office space needs and attracts more workers to \r\n          the labor force. The bill merely recognizes that in the law and gives \r\n          the Legislature some oversight. See story here . See actual bill here New York State - New York State telework program Check it out \r\n          here North Carolina - North Carolina \r\n          State Teleworking program - Telework\r\n            Feasibility Study published by State Auditor Ralph Campbell\r\n            concluded that if 5% of state employees teleworked, they would save\r\n            over $23 million in improved productivity, reduced  office\r\n            space and turnover costs. North Virginia - 2003: Gov. \r\n          Mark R. Warner: Virginia state can't\r\n            afford to build big new highways, so it's looking for smaller,\r\n            quick-fix solutions, including telecommuting, to gridlock. Governor\r\n            willing to invest $20 million for several related projects to ease\r\n            congestion Oregon - The Oregon \r\n          Department of Energy actively \r\n          promotes telework because it conserves fuel, relieves traffic \r\n          congestion, and improves air quality -- and because it makes good \r\n          business sense. The State has developed an aggressive  Telework \r\n          Program that: helps cities offer state tax credits, low-interest loans, and/or other\r\n          incentives to assist with purchasing and installing new or\r\n    used equipment that allows an employees to telework provides ongoing\r\n          resources to assist employers develop custom-fit telework programs Texas - Texas\r\n            State Comptroller recommends telework \r\n          and its savings potential - Texas State telework \r\n          Guidelines Utah - Governor Mike Leavitt '99: Proclaimed May 14 as Utah Telecommuting\r\n            Day. Employers were encouraged to allow eligible employees to spend\r\n            the day productively working from home instead of sitting in traffic\r\n            on a congested freeway. Vermont - Department Of Labor Grant \r\n          establishes Vermont Work at Home. The Vermont Telecom Advancement Center (VTAC), in collaboration with \r\n          Vermont State and private agencies working to relieve unemployment \r\n          throughout Vermont, plan to train unemployed and underemployed \r\n          workforce, enabling them to work at home. Vermont Work at Home is hosting a national seminar (June \r\n          2004) in Stowe, Vermont Virginia -"
    },
    {
      "tag": "p",
      "text": "Telework!VA This program \r\n\t\t\texists to reduce overcrowding on Virginia's highways, thereby \r\n\t\t\treducing real estate and parking costs; as well as improving\r\n        productivity.  Under the program's $3.2 million budget, companies \r\n\t\t\tcan receive: - $10,000 toward the cost of leasing equipment (fax machines, \r\n\t\t\tcomputers and high-speed Internet connections); - up to $35,000 (or $3,500 per employee), for the cost of \r\n\t\t\ttelecommuting-related equipment and services; - up to $25,000 for technical consulting;"
    },
    {
      "tag": "div",
      "text": "- Virginia Governor creates Office of Telework Promotion and Broadband Assistance - Governor James \r\n          Gilmore Seeks to offer $10 million in tax\r\n            incentives and grants for companies that let their employees\r\n            telework rather than contributing to rush hour traffic. This\r\n            addresses two of Virginia's most pressing problems: transportation\r\n            and work force shortages. Washington State - (June\r\n            2001): Governor Gary Locke directs state agencies to\r\n            dramatically increase use of telecommuting and flexible work hours\r\n            to show how employers can reduce traffic congestion. - Senate Bill 5171 (Jan '01)\r\n            Legislation sponsored by Sen. Ken Jacobsen, D-Seattle, would create:\r\n            a temporary joint task force on telework enhancement; a telework\r\n            enhancement board with funds to expand telework opportunities; and\r\n            tax incentives for employers Wyoming - Wyoming Department of Audit discovers several employees who worked \r\n\t\t\tfrom home 5 days per week in violation of the rules regarding the \r\n\t\t\tnumber of days allowed (1 to 3)"
    },
    {
      "tag": "p",
      "text": "Copyright 1997- \r\n\t\t200 6 . InnoVisions Canada All rights \r\n\t\treserved. ( Privacy \r\n\t\tstatement )"
    }
  ]
}