{
  "url": "http://www.jcim.net/Copyright/raj.htm",
  "file_number": "518",
  "content_hash": "b6c17f860db0980bb4a33744fa6c9e823ee89460bb1e0e19b6a645c526bc7e24",
  "total_blocks": 43,
  "retained_blocks": 5,
  "ignored_blocks": 38,
  "blocks": [
    {
      "tag": "blockquote",
      "text": "webbot bot=\"Include\" U-Include=\"../header.htm\" TAG=\"BODY\" startspan webbot bot=\"Include\" endspan i-checksum=\"64580\""
    },
    {
      "tag": "p",
      "text": "1994 TO\r\n  EVERYONE WHO LOVES A COURSE IN MIRACLES(tm) It is\r\n  imperative at this time for a clear statement to be made with regard to the\r\n  direction in which A Course In Miracles is being taken by its custodians, the\r\n  Foundation for Inner Peace, and the impact which it will have upon the Course,\r\n  itself, together with the unconsidered element - the students of the Course,\r\n  and the fact that it is they and not the Course who will be the transforming\r\n  Presence of love which will precipitate Awakening. There is a\r\n  plan being carried out by the Foundation which has as its goal the protection\r\n  of the purity of the Course, and this is slowly being accomplished by the\r\n  creation of certain structures which, when activated, will allow control of\r\n  the dissemination of the Course and Course-related materials. The Course\r\n  was naturally and appropriately copyrighted in 1975, thus giving the publisher\r\n  the necessary means to keep the Course present in the world in its original\r\n  form without being altered in any way. This act of copyrighting, whether of\r\n  the original or any subsequent translations, [is] its protection, and nothing\r\n  further is incumbent upon the publisher in order for its responsibility to be\r\n  fully discharged. However, the\r\n  publisher has taken it upon itself to do [more] than that, and as a result the\r\n  words, \"A Course In Miracles\" have been registered and trademarked\r\n  [and] the letters \"ACIM\" have been incorporated into a logo which\r\n  will appear on all new copies of the Course. The logo, of course, will become\r\n  a registered trademark, thus insuring the unavailability of \"ACIM\"\r\n  for use by students of the Course to identify [their] study groups, seminars,\r\n  conferences, community center, etc. Indeed, according to Judy Skutch, as each\r\n  new translation is published, not only will \"A Course In Miracles\"\r\n  be trademarked in that language, the translated equivalent of \"ACIM\"\r\n  will also be trademarked. While the\r\n  trademark policy was being developed and implemented, there was a simultaneous\r\n  alliance which was conceptualized between the Foundation for Inner Peace and\r\n  the Foundation for A Course In Miracles in Roscoe, New York, headed by Dr.\r\n  Kenneth Wapnick, and in a public statement they were dubbed \"sister\r\n  foundations,\" thus distinguishing the Foundation For A Course In Miracles\r\n  from all other foundations using \"A Course In Miracles\" in their\r\n  names and assuring it the right to [continue] using it after all others are\r\n  asked to cease and desist. In addition,\r\n  while all of this was happening, the Foundation For A Course In Miracles\r\n  incorporated a new concept and function, that of being an Academy. It was a\r\n  subtle shift, allowing those who had attended lectures on any number of topics\r\n  relative to the Course in past years to unconsciously re-identify those talks\r\n  as \"lectures\" at the \"Academy.\" It had a nice formal feel\r\n  of academia, and since the publicity of the move likened the\r\n  \"Academy\" to Plato's Academy, it conveyed a feeling of integrity. Since then\r\n  there have been unpublicized moves to ask those identifying themselves as\r\n  \"teachers\" of the Course, even some quite well known to those in the\r\n  growing Course community, to cease calling themselves teachers. What has not\r\n  been apparent to those who haven't recognized the \"signs of the\r\n  times,\" is that before long it will be announced that classes for\r\n  prospective teachers of \"A Course In Miracles\" will be given at the\r\n  Academy and, upon graduation, \"certification\" will be conferred,\r\n  [and] these individuals will be the only ones who will be able to freely use\r\n  \"A Course In Miracles\" and \"ACIM\" relative to their\r\n  teaching activities or teaching-related publications. You see, a\r\n  shift occurred and the custodians of the \"Course\"--- the particular\r\n  sequence of words, numbers, and punctuation marks which are uniquely\r\n  identifiable as \"A Course In Miracles\" - have metamorphosed into the\r\n  teachers and protectors of its [meaning]. This is [not] the charge that was\r\n  given them, and it is inconsistent with the Course, which, in all respects, is\r\n  a self-teaching course. Iunderstand\r\n  that \"A Course In Miracles\" [can] be read as a spiritual psychology\r\n  which, when brought to bear on human experience, will transform human\r\n  relationships, and that therefore, like any other psychology text, it can be\r\n  treated as an academic text - taught precept upon precept, line upon line. But\r\n  such a conceptual context constitutes a gross misapprehension of what it\r\n  really is. \"A\r\n  Course In Miracles\" can [only] be self-taught. It is, by its very\r\n  structure, an intimate interaction between the reader and the material read.\r\n  And because [its] curriculum was established by the Father's Intent for the\r\n  Sonship to be consciously Whole, [it] cannot fail in its Purpose. You must\r\n  understand therefore, that no \"human\" teacher can know the divine\r\n  Intent of the words perceived by the individual reader [for] the reader, and\r\n  that if, indeed, the teacher [did] know the divine Intent, he would find\r\n  himself putting It into words which, although as hopelessly original as those\r\n  in the \"Course\", would [not] be the words in the Course. It is in the\r\n  inviolable intimacy of the student and the Holy Spirit's curriculum that\r\n  Remembering occurs. It is in that uninvadable intimacy, where no other teacher\r\n  [can] enter, that the journey without distance occurs. It is in that intimate\r\n  experience of Love that the Wholeness of the Sonship is consciously realized. Iwill tell\r\n  you something: When a child is delivered, there is for a brief moment no more\r\n  wonderful person in the world than the doctor or midwife who facilitated the\r\n  event. But, the infatuation passes and the doctor, mother and child move on.\r\n  Likewise, those who facilitated the entry of \"A Course In Miracles\"\r\n  into the human experience --- and for whom all who have experienced its\r\n  phenomenal meaning have the greatest admiration, respect, and even love ---\r\n  must let the child go and do its work without hovering around it to ensure\r\n  that no one misunderstands it or mistreats it, protecting it from the world\r\n  [it] came to deliver into the Father's hands by means of the [Holy Spirit's]\r\n  curriculum. Do not\r\n  misunderstand. It is with great gratitude that Ilook upon their work in\r\n  \"delivering\" the Course and continuing to extend it through\r\n  translations into other languages. But Iask them to be alert and not stifle\r\n  the child by attending to anything more than its continuing presence,\r\n  unaltered from the form in which the unknowable Intent of the Holy Spirit\r\n  makes [itself] known. Iwill tell\r\n  you something else: A \"certifiable\" teacher of \"A Course In\r\n  Miracles\" is one who teaches from the state of communion [on the spot]\r\n  and not from \"learning.\" Let not the students, the teachers, or the\r\n  midwives forget this and they will not become confused as to their duties. Iam in\r\n  agreement with the words \"A Course In Miracles\" being trademarked\r\n  and used only as the title of the book published by the Foundation for Inner\r\n  Peace. Iagree that its use in the names of groups, associations, newsletters,\r\n  foundations and any [title] of any kind should cease, so that it may be found\r\n  [only on the one book so named]. But Igently declare that the letters \"ACIM\"\r\n  and their equivalent in other languages, [need] to remain available to\r\n  students of the Course throughout the world as a means of identifying the\r\n  focus of interest in the names of their groups, associations, newsletters,\r\n  foundations and publications, etc., relative to the Course. In addition,\r\n  Ifurther declare that the Foundation for ACIM (as it would be called) in\r\n  Roscoe, New York, should claim \"sisterhood\" with all other\r\n  foundations for ACIM and all other groups of students and teachers, having no\r\n  special relationship with the Foundation for Inner Peace. The moment\r\n  the Foundation for Inner Peace confirms publicly that it will cease promoting\r\n  a [generic] terms to identify materials related to \"A Course In\r\n  Miracles\" and [will] allow the unrestricted use of the letters ACIM to\r\n  identify them all, the Northwest Foundation for A Course In Miracles will, in\r\n  mutual agreement, immediately initiate steps to change its name to the\r\n  Northwest Foundation for ACIM in harmony and unity with the FFIP's desire for\r\n  harmony and unity. Iask for\r\n  this communication to be forwarded to students of the Course everywhere, by\r\n  all means of communication, and to as many of the study groups worldwide as it\r\n  can possibly reach. And Iask those students to communicate with the\r\n  Foundation for Inner Peace to register their feeling on these points. The need\r\n  is for simultaneous unity, freedom [and] trust throughout the Course community\r\n  so that the fundamental intimacy of the student with the Holy Spirit's\r\n  curriculum does not become disturbed or distracted by fear, dissension,\r\n  reaction or any apparent need for protection from any quarter. The address\r\n  of the Foundation for Inner Peace is: Foundation\r\n  for Inner Peace P.O.Box 1104\r\n  Glen Ellen, CA 95442 Phone:\r\n  707.939.0200 At Judy\r\n  Skutch Whitson's request, please send all Fax responses directly to her at\r\n  415.435.3311. In love Raj http://www.nwffacim.org"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" U-Include=\"../footer.htm\" TAG=\"BODY\" startspan"
    },
    {
      "tag": "p",
      "text": "Home | Overview | FAQ | Litigation | Articles | Timeline | Act | Polls | Links | Chat | Message | Guest\r\nBook Disclaimer:\r\nThe information provided on whitmorelaw.com is not intended to\r\nbe legal advice, but merely conveys general information related\r\nto selected legal issues. Your access to and use of this website\r\nis subject to additional terms and conditions .  Copyright 1999, 2000,\r\n2001  Monen & Whitmore,\r\nOmaha, Nebraska, USA. All rights reserved. Email: tom@whitmorelaw.com or john@thewebguy.org"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" endspan i-checksum=\"17708\""
    }
  ]
}