{
  "url": "http://www.jefflang.com.au/whatever.htm",
  "file_number": "520",
  "content_hash": "5b052d588883747ad2e3ded78ed076b4ea08cba8e7bc1ddbc6106be1c5fb588e",
  "total_blocks": 179,
  "retained_blocks": 17,
  "ignored_blocks": 162,
  "blocks": [
    {
      "tag": "div",
      "text": "[if gte IE 5.5000]>\r\n<script type=\"text/javascript\"src=\"assets/pngfix.js\"></script>\r\n<![endif] webbot bot=\"Include\" U-Include=\"navigate.htm\" TAG=\"BODY\" startspan Add Body Tag Above This Line Body Goes Below Here To Edit in Dreamweaver Body Goes Above Here To Edit in Dreamweaver webbot bot=\"Include\" i-checksum=\"63591\" endspan DISCOGRAPHY webbot bot=\"Include\" U-Include=\"navigatealbums.htm\" TAG=\"BODY\" startspan SOLO RELEASES Prepare Me Well Dig Deep To Bury Daddy Whatever Makes You Happy No Point Slowing Down Live At The Basement DVD Everything Is Still Disturbed Folk Vol. 2 Cedar Grove A Crowd in Every Face Native Dog Creek Disturbed Folk Ravenswood OTHER RELEASES Dislocation Blues Rolling Through This World The Silverbacks Real Scars 96 Tour Pressie CD Live at the Vineyard Bootleg CD's COMPILATIONS Compilations webbot bot=\"Include\" i-checksum=\"34963\" endspan WHATEVER\r\n        MAKES YOU HAPPY Year of Release: 2004"
    },
    {
      "tag": "p",
      "text": "Cat. Number: Track Listing: The Save Switchblade Alive In There You Should Have Waited Orange Roughie (Instrumental) By Face Not Name Rain On Troy The Day I Got Chewing Gum Stuck In My Hair (Instrumental) Rejected Novelist Fails Again Accidental Seabirds (Instrumental) You Tremble Sleeping Slip Away The Road Is Not Your Only Friend Whatever Makes You Happy (Instrumental) Limited Edition Extra Disc: Studio Outtake One. Includes: The Day I Got Chewing Gum Stuck In My Hair Parts 1 & 2, Accidental\r\n      Seabirds, Alas the Big Bear of Beauty Point, I'm Still Here (T. Waits) & Smacker\r\n      Fitzgibbon's Combing Lotion. Studio Outtake Two Includes: Orange Roughie, Hanna Barbaric, Fuzz Factory, Gaffa Crack Waxing,\r\n        Corney Chicken with Pinezies & Mentholyptus Mangles' Camera Angles. Too Easy To Kill / Hellhound On My Trail (J. Lang / Robert. Johnson) View the \"Whatever\r\n    Makes You Happy\" Recording Session Photo Album. Guitar Tunings for Whatever \r\n\t\tMakes You Happy have been added to the Tunings \r\n\t\tpage."
    },
    {
      "tag": "div",
      "text": "WHATEVER\r\n      MAKES YOU HAPPY - REVIEWS Dan Lander, Rolling Stone - July 2004 Agreat guitarist resists the urge to over play."
    },
    {
      "tag": "p",
      "text": "Jeff Lang comes to “Whatever Makes You Happy” draped in\r\nhis finest singer-songwriter regalia, letting his renowned guitar work serve\r\nthe songs rather than sit as the only attraction on the album. Tracks like “Alive\r\nin There” and “The Day I Got Chewing Gum Stuck in my Hair” intertwine\r\nhis delicate guitar with aching, ambient backings to build songs that focus on\r\nhis gentle voice and subtle turn of phrase rather than his fret work.When Lang\r\ndoes unleash his guitar genius, like on the rollicking minor blue-grass of “The\r\nRoad is Not Your Only Friend”, it is clear that he is still striving to\r\nput that guitar into the context of a good song, and his commitment to that approach\r\npays off."
    },
    {
      "tag": "div",
      "text": "Whammo Review"
    },
    {
      "tag": "p",
      "text": "Jeff Lang could potentially be the most commercially\r\n          viable of the 'blokes with acoustic guitars' revolution, swinging from\r\n          Malacca's reverence of dust to Petty's slick swagger, often applied\r\n          with punchy hooks more akin to Billy Joel than a rootsy master of strings.\r\n          He's got a powerful voice when it clicks into fourth gear and as for\r\n          his work on guitar; if it's got strings, he can play it. To me, it\r\n          sounds like there was - and possibly still is - a worship of the American\r\n          classics, but while he allows this to be an influence, Jeff doesn't\r\n          go ruining the whole sound with a thick yank drawl; the local accent\r\n          shines through enough for us to claim this music as homegrown. From\r\n            the most raw folk through to the more upbeat rock-tinged numbers,\r\n          Lang runs the full gamut of organic genres and Whatever Makes You Happy\r\n            is a worthy contribution to the short list of truly able players\r\n          that are bubbling to the surface in 2004. Initially, Iwas impressed\r\n          with a dense sound that filled the room as The Save blasted out of\r\n          my many speakers, but after Alive In There, Iwas starting to think\r\n          that Lang's sound was bigger than any of his songs. Luckily, Rain On\r\n          Troy proved his worth as a composer, aided by the guidance of his smooth\r\n          vocal tones. Current Jeff Lang fans will be interested to know that\r\n          a Special 2CD Limited Edition of this album comes with studio outtakes\r\n          and the many fans of John Butler get extra value out of the bonus material\r\n            with two live tracks recorded at the Continental in Melbourne, with\r\n            Jeff, John and Angus Diggs. Jeff Lang\r\n            probably has a more mature appeal than his peers, but if there was\r\n          any time for a push into mainstream circles, 2004 must be the perfect\r\n          opportunity and with an album like Whatever Makes You Happy, many doors\r\n      are sure to open."
    },
    {
      "tag": "div",
      "text": "RM, Shout Magazine Roots-inspired music\r\nand its assorted genres are in the middle of a massive\r\nexplosion. Jeff Lang’s new set proves that the quality and talent\r\nis there and now it is up to the marketing department to get the\r\nsounds out to the public. The album opens with an irresistible foot-tapper\r\nin The Save, a clear winner with its propulsive percussion\r\nand melodies. But then this is an entire album of appealing material\r\nthat elegantly twists its way into your subconscious. An\r\nupbeat number like You Should Have Waited emphasis the importance\r\nof shading when putting together an album like this. Everything here is\r\nin equal measure, compliments everything else and just makes you wanted\r\nhear it interpreted live. Brett Ladhams, X-Press Magazine, WA"
    },
    {
      "tag": "p",
      "text": "Jeff Lang is one of those unusual musical characters\r\n          in that he divides the listening public not into one of love or hate,\r\n          but simply into those that know and those that don’t, yet. It’s\r\n          a borderline cult obsession the man unwittingly casts through his dramatic\r\n          and interactive live shows and unwavering recorded (and live) consistency.\r\n          Hell, Lang can lure a crowd to a backwater venue in a quaint US country\r\n          town for God’s sake, and did so last year. Not to mention performing\r\n          with both the Bobs (Dylan and Geldolf) in recent times. All this background\r\n          is needed to first understand exactly what a new Jeff Lang release\r\n          means to many people, and secondly to appreciate why the polite Melbourne\r\n          singer/songwriter has done what he’s done on Whatever Makes You\r\n          Happy. Strictly speaking this new album from Lang isn’t a solo\r\n          offering. He’s gone\r\n          against the grain of the solo ethos and enlisted backing vocalists,\r\n          piano, brass and harmonica to his now core band of Angus Diggs (drums)\r\n          and Grant Cummerford (bass). The results are typically stunning, brimming\r\n            with life and the overall feel is still recognisable as having tumbled\r\n            from Lang. Check out The Save, You Should Have Waited and the slower\r\n      By Face Not Name and Rain On Troy for some inspired sounds."
    },
    {
      "tag": "div",
      "text": "Altcountry.com.au"
    },
    {
      "tag": "p",
      "text": "Time for a big fat one. “Whatever makes you happy” the new cd by Jeff Lang is destined to\r\nbecome one of those fade-proof recordings that gives a good cd collection its\r\nbones. This is a disc full of blues informed stories carried on a contemporary-roots\r\nhybrid music style - with plenty of pounding pantry percussion, some quiet whispering,\r\nand lots of legit musical goodness. On it, the guitar plays second string to the\r\n  writing as Lang gives his songs only what they need. Don’t be alarmed\r\n  though, because there’s enough\r\n  busting out lickety-split guitar (and mandolin) to keep axe heads happy. After\r\n  all, guitar art is what Jeff Lang is known for best. Unusual in construction,\r\n    instrumentals hang off of the end of some songs like post-it notes, giving\r\n    the whole recording an extended presence. Most songs are fretted with a raw\r\n    and vaguely troubled undertow. The winged and wild, “The\r\n    road is not your only friend” works up to an alarmingly neurotic shrill.\r\n    Come track 9, “Rejected novelist fails again”, and we find that\r\n    we are not alone (el sol salio anoche y me canto!) I’d flag this song\r\n    as a favourite. “Slip Away” has a gorgeous groove, reminiscent\r\n    of, say, a Kelly Joe Phelps recording. What Ilike about the production of “Whatever\r\n      makes you happy” is\r\n      the fact that Jeff didn’t go for super slick hydraulics (which he\r\n      could easily have done if he did in fact have the plump production purse\r\n      inferred by several Australian music-journalists) Nope, this is spag bog\r\n      with grit; ice cream and tomato sauce, or if you prefer, raw pineapple\r\n      with salty yeast spread. The inclusion of a dilly bag full of other talented\r\n      Aussie musicians has enabled Lang to deliver a musical picture in wide\r\n      screen format, and hints of big possibilities for future recordings. The\r\n        instrumental “Whatever makes you happy” is like a carefree\r\n        shrug at the end of the cd, and bugger me if there isn’t just the\r\n        teensiest hint of reggae. Yes. Me thinks it’s time for a big fat\r\n      one."
    },
    {
      "tag": "div",
      "text": "JEFF APTER, The Bulletin, August 2004\r\n        -"
    },
    {
      "tag": "p",
      "text": "There's\r\n            a real lost-in-space vibe about the latest album from Jeff Lang,\r\n            the Melbourne blues/folk guitar ace. Whatever Makes You Happy could\r\n            have just as easily emerged from Woodstock, 1969, as Melbourne, 2004. Now bankrolled by a major, Lang brings in some pals\r\n              (blues-belter Chris Wilson, harp-blower Matt Walker), as well as\r\n              tinkering in the studio with everything from pre-digital gear to\r\n              op-shop kitchenware. While best known for pulling off the type\r\n            of fleet-fingered stringwork rarely heard this side of trailer-park\r\n              bard Chris Whitley, don’t\r\n              overlook Lang’s knack for storytelling. It’s as if he\r\n              wrote most of this first-rate album with his car window cracked,\r\n              as he barrelled down the highway, heading for some dusty outpost"
    },
    {
      "tag": "div",
      "text": "Tony Hillier if !supportEmptyParas - Barfly 5 FLIES If 2001’s Everything Is Still lifted Jeff Lang to a new benchmark,\r\n        Whatever Makes You Happy nails him to the upper rung of creative artists.  The\r\n        Victorian’s last studio album was a prime candidate for best domestic\r\n        release of the decade; his debut recording for ABC Music is in many ways\r\n        its equal, and in some respects superior. Whatever Makes You Happy sees Lang move a little further away from his original\r\nblues base.  Long regarded as one of the country’s most innovative\r\nand versatile guitar slingers, he is now firmly established among the upper echelon\r\nof singer-songwriters, alongside the likes of Paul Kelly, Don Walker and Shane\r\nHoward.  Lang’s songs have a cinematic quality; his vignettes resonate\r\nwith vivid imagery, poetry, passion, and intelligence.  Many seem to reflect\r\nthe writer’s protracted spells on the road both here and in the USA; the\r\nloneliness of the long distance touring artist if you will. The songs are given additional depth by Lang’s sheer musical invention;\r\nthe writer’s trademark heart-tugging melodies, the dexterity of his guitar\r\nplaying and sharp sense of dynamics (two of his strongest qualities), and the\r\ntelepathic rapport he enjoys with his regular rhythm section, drummer extraordinaire\r\nAngus Diggs and bassman Grant Cummerford.  In Whatever Makes You Happy,\r\nJeff also recruits the services of some carefully selected special guests and\r\ninstrumentation, giving his songs an expanded range of stylistic setting.  On ‘By\r\nFace, Not Name’, a chilling story of rape and its aftermath, he engages\r\nin a vocal duet with Suzannah Espie with the latter’s GIT colleagues and\r\nChris Wilson on back-up vocals.  On ‘Rain on Troy’, a song of\r\ndespair that cuts to the quick, the pervading sadness is eerily echoed by Azo\r\nBell’s eloquent singing saw.  ‘You Tremble’, a disturbing\r\nlove song, employs vibraphone and looped percussion as atmospherics.  On\r\nthe boisterous ‘Rejected Novelist Fails Again’, the inherent frustration\r\nand impending sense of calamity is bolstered by trombones and tuba.  In ‘You\r\nShould¹ve Waited’ and ‘Sleeping’, Bruce Haymes’ Bruce\r\nHornsby-esque piano is complements Lang’s acoustic and electric guitars\r\nand lap steel.  Matt Walker’s harmonica proves a perfect foil to Jeff’s\r\nnational guitar in the superbly evocative ‘Alive in There’, a bluesy\r\nsong that reeks of country Australia or mid-West USA (‘It’s a dry\r\nheat that blew him through town / Why would a service station throw its shadow\r\ndown? / Does anybody live here? / Is there anyone alive in here?’).  Fiddle\r\nfollows Lang’s fast and furious mandolin and national guitar finger-picking\r\nto give the closing song, ‘The Road Is Not Your Only Friend’, a kind\r\nof New Grass Revival meets Richard Thompson feel. It’s almost a companion\r\npiece to the riveting first track, ‘The Save’, which, courtesy of\r\nDiggs’ percussion (and Lang’s guitars and trowel), hurtles along\r\nlike the Indian Pacific mentioned in the opening line. The songs on Whatever Makes You Happy are punctuated by four short, sharp instrumental\r\ninterludes (three of less than 40 seconds duration), two featuring the talents\r\nof that under-exposed guitarist and percussionist Chris Finnen.  The Adelaide\r\nmaestro’s affinity with Indian music - and no doubt Jeff Lang’s increasing\r\ninterest in world sounds, cultivated by his liaison with Bob Brozman - is evident\r\non the bonus disc of outtakes, which features some inspired jamming including\r\na heavy duty work-out.   Also included on CD2 is a medley of two songs\r\nrecorded live at Melbourne’s sadly defunct Continental Cafe with a cameo\r\nappearance from John Butler (who cites Jeff Lang as a major influence). As far as this reviewer is concerned, Whatever Makes You Happy is already a top\r\ncandidate for 2004’s Australian album of the year."
    },
    {
      "tag": "p",
      "text": "Julie Fox - Sydney Blues Society Newsletter"
    },
    {
      "tag": "div",
      "text": "Have you ever heard anyone describe Jeff Lang’s style as mellow or \r\n\t\tpeaceful – well neither had I, and never thought Iwould be using those \r\n\t\twords to convey how Ifelt on listening to this excellent offering - \r\n\t\tJeff’s long awaited 13th CD. Ihad heard touches of Jeff’s vocals reach \r\n\t\tquite high notes before, but this recording showcases an entirely \r\n\t\tdifferent format for his music. Previously as an Independent artist, \r\n\t\tJeff always seemed to be hovering on the doorstep of commercial success \r\n\t\tand acceptance in Australia, but with this latest CD, and signing to the \r\n\t\tABC label, surely the doors must open to welcome him onto mainstream \r\n\t\tplay lists. If Whatever Makes You Happy doesn’t do it then Ican’t \r\n\t\timagine what else could!"
    },
    {
      "tag": "p",
      "text": "Jeff’s new approach might have had something to do with the musicians \r\n\t\the chose to help him on this production. Featuring heavily with backing \r\n\t\tvocals is the all-girl group Git from Melbourne, whose voices blend \r\n\t\tperfectly with Jeff’s vocal pitch. Jeff also enlisted the help of fellow \r\n\t\tsinger/songwriter/guitarist Tim Hall to co-produce this album. Then we \r\n\t\thave the perfect rhythm section of Angus Diggs (drums/percussion) and \r\n\t\tGrant Cummerford (electric & acoustic bass). Several tracks also feature \r\n\t\tChris Wilson (backing vocals), Matt Walker (harp), Chris Finnen \r\n\t\t(acoustic guitar), as well as various others on piano, vibraphone, \r\n\t\tfiddle, a horn section and one guy playing singing saw! If you are talking ‘value for money’ then CD one contains 15 tracks, \r\n\t\tall written by Jeff, with some collaborations being Lang/Finnen/Diggs/Cummerford. \r\n\t\tIncluded are 4 beautiful instrumentals; although so short they are \r\n\t\talmost a teaser. Standout tracks would have to be the haunting piece By \r\n\t\tFace, Not Name, with Suzanah Espie (Git) sharing vocals and Jeff playing \r\n\t\tlap steel guitar. Rejected Novelist Fails Again has the best lyrics, \r\n\t\twith a touch of Jeff’s heavier electric guitar and horn section. You \r\n\t\tTremble, beautifully sung with Jeff using his National steel guitar and \r\n\t\tloop percussion. The Road Is Not Your Only Friend changes tack with the \r\n\t\tuse of mandolin and fiddle; frenetic Celtic music might a good \r\n\t\tdescription – works well! The title track, another too-short \r\n\t\tinstrumental, finally brings this CD to a close, but wait, there’s more \r\n\t\t– CD two contains 3 tracks – Studio outtake one and two – both \r\n\t\tinstrumentals, each running for around 20 minutes! Track 3, Too Easy To \r\n\t\tKill/Hellhound On My Trail sees Jeff back on vocals. This bonus CD was \r\n\t\trecorded live at the Continental in Melbourne and also features guest \r\n\t\tartist John Butler, who aptly sums up the situation with this comment: \r\n\t\t“Jeff Lang is the man as far as Iam concerned”! JULIE FOX"
    },
    {
      "tag": "div",
      "text": "webbot bot=\"Include\" U-Include=\"navigatetext.htm\" TAG=\"BODY\" startspan HOME | DISCOGRAPHY | TOUR \r\n      DATES | LOUNGE | FORUM | SUBSCRIBE | MEDIA | SHOP | CONTACT | SEARCH webbot bot=\"Include\" i-checksum=\"20842\" endspan"
    }
  ]
}