{
  "url": "http://www.jewellerymoscow.com/pressrel.en.html",
  "file_number": "521",
  "content_hash": "a43f6ecbe3a651910ddbb108531be53f405d60b3375efe3d2d31b8ad782ba29c",
  "total_blocks": 109,
  "retained_blocks": 6,
  "ignored_blocks": 103,
  "blocks": [
    {
      "tag": "div",
      "text": "general information product sections why exhibit? accompanying events exhibition venue how to book exhibition team press releases event programme freight & customs accommodation & visas list of exhibitors 2006 results 2005"
    },
    {
      "tag": "div",
      "text": "Search the Site:"
    },
    {
      "tag": "div",
      "text": "russian"
    },
    {
      "tag": "div",
      "text": "PRESS RELEASES"
    },
    {
      "tag": "h1",
      "text": "The novelties of jewellery fashion in Gostiny Dvor"
    },
    {
      "tag": "p",
      "text": "The main international exhibition project in jewellery \n        field \"New Russian Style / International Jewellery Moscow 2006\" will become the focal event for all jewellery buyers, distributors and \n        retailers from Russia and the CIS providing the opportunity to network, \n        learn and buy from leading suppliers from around the world. During all these unforgettable days (17-20 May 2006) the magnificent exhibition \n        venue Gostiny Dvor located in the heart of Moscow right next to the Kremlin \n        will gather the cream of global design and jewellery industries. All spectrum of styles, tendencies, philosophies and mentality of Russian \n        and European jewellery schools are personified in the collections of more \n        than 200 Russian and international exhibitors. Internationally the show will again have representation from Italy, France, \n        Germany, Turkey, China, Hong Kong, India, Korea, Lebanon and the United \n        Arab Emirates. In addition we are delighted to announce new pavilions \n        from Thailand and the largest presence ever from the United Kingdom. The only opportunity in Russia to visit a truly international event. Allowing \n        buyers to view and purchase a variety of adornments meeting the needs \n        of all trade visitors. Such multiplicity of international participants \n        permits the trade representatives to choose the best terms of goods delivery. \n        Thanks to such unique capacity to book the international goods without \n        leaving Russia 8,800 buyers gave their preference to \"International \n        Jewellery Moscow / New Russian Style\" in 2005. Last year's event \n        enjoyed a 23% increase in attendance. The Russian jewellery is represented by well-known brands which demonstrate \n        both traditional and avant-guard items. The jewellery classic and elegance \n        of gold, silver, platinum adornments with precious stones, fantastic diamonds \n        and gems are exhibited by leading Russian companies: Almaz-Holding (Moscow), \n        Krastsvetmet (Krasnoyarsk), Gringor (St-Petersburg), Jewellers of Urals, \n        Ermi (Ekaterinburg) and jewellery art studio Golden Orhideus (Izevsk). All geography of Jewellery Russia and all the cream of international jewellery \n        for New Russian Style! Such a great representation of world jewellery \n        industry in Russia becomes possible thanks to support of international \n        jewellery associations and close cooperation of leading exhibition companies \n        Reed Exhibitions (United Kingdom) and RESTEC Exhibition Company (Russia). Inspired by Moscow spring sun magnificent shine of diamonds and precious \n        metals, chatoyant rainbow of multi-coloured gems will determine the tendencies \n        of summer jewellery fashion. As always trade buyers are able to pre-arrange appointments with international \n        clients, all of which will also have translators to assist in conducting \n        business negotiations. \"New Russian Style / International Jewellery Moscow\" will offer \n        a full accompanying events programme including business negotiations with \n        foreign participants, educational seminars devoted to the international \n        cooperation in jewellery field and poduim presentations of jewellery fashion. To gain free entry into \"New Russian Style / International Jewellery \n        Moscow\" trade jewellery visitors can pre-register in Russian Jewellery \n        Trade Club: +7821 235 83 83. Organizing Committee: Saint-Petersburg: Tl.: +8 812 320 8099, 303 9860 Moscow office: Tel.: +8 495 544 3831 E-mail: junwex@restec.ru"
    }
  ]
}