{
  "url": "http://www.jidaw.com/itsolutions/vsatoutline.html",
  "file_number": "524",
  "content_hash": "7b17edf0e5f6da1be8527874b15f8b830d283481bbed89c8676e47f9c5d6feed",
  "total_blocks": 80,
  "retained_blocks": 29,
  "ignored_blocks": 51,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\" DWLayoutTable"
    },
    {
      "tag": "p",
      "text": "VSAT FIELD ENGINEERING TRAINING COURSE \r\n                OUTLINE - CERTIFIED VSAT INSTALLER PROGRAM"
    },
    {
      "tag": "div",
      "text": "Theory & Background Implementation Practical Training"
    },
    {
      "tag": "p",
      "text": "Network Architecture"
    },
    {
      "tag": "div",
      "text": "Architecture defined Star networks Mesh networks Application references"
    },
    {
      "tag": "p",
      "text": "Site Survey"
    },
    {
      "tag": "div",
      "text": "Location & look angles Infrastructure"
    },
    {
      "tag": "p",
      "text": "Site Build"
    },
    {
      "tag": "div",
      "text": "Minimum antenna mount Requirements Lightning protection Cable routing Peak & poll: Why?, What? How?"
    },
    {
      "tag": "p",
      "text": "Complete Installations"
    },
    {
      "tag": "div",
      "text": "All participants will complete one \r\n                  complete installation Installations will be done on an active \r\n                  & operational network Sufficient time will be provided for hands-on \r\n                  experience by all"
    },
    {
      "tag": "p",
      "text": "Network \r\n                Concepts"
    },
    {
      "tag": "div",
      "text": "Bandwidth: - MHz vs Mbps. - Speed vs throughput Links budget basics: - What? - Why?"
    },
    {
      "tag": "p",
      "text": "Test \r\n                Equipment Theory & hands-on:"
    },
    {
      "tag": "div",
      "text": "The field strength meter The GPS The compass What do we measure? How do we measure?"
    },
    {
      "tag": "p",
      "text": "Test Equipment"
    },
    {
      "tag": "div",
      "text": "Inclinometer Compass GPS Field strength meter Selection and training with respect to PAS1R, PAS10, NSS 7 satellites"
    },
    {
      "tag": "p",
      "text": "Equipment terminology"
    },
    {
      "tag": "div",
      "text": "Remote site components: - Antenna, dish? - BUC, block-up convertor - LNB, Radio, Modem Operating Frequencies - Ku-band - C-band - Ka-band"
    },
    {
      "tag": "p",
      "text": "Signal Transmission"
    },
    {
      "tag": "div",
      "text": "DVB TDMA"
    },
    {
      "tag": "p",
      "text": "Service Commissining"
    },
    {
      "tag": "div",
      "text": "What does it mean? Why is it needed? How do we do it? What can go wrong?"
    },
    {
      "tag": "p",
      "text": "Client Communication"
    },
    {
      "tag": "div",
      "text": "Client communication Site hand-over"
    },
    {
      "tag": "p",
      "text": "Installation"
    },
    {
      "tag": "div",
      "text": "Physical site installation Antenna built (1.2m) Peak & poll Signal strength monitoring Site commissioning with an operational \r\n                  NOC group Commissioning & hand-over"
    },
    {
      "tag": "p",
      "text": "Precision \r\n                Instruments for accomplished Engineers Quality of workmanship, field engineering \r\n                and system performance are determined by the skills and expertise \r\n                of the engineer but no engineer can perform precision works without \r\n                precision instruments. The course will also cover the following \r\n                instruments: UnaOhm SBM105C Satellite Analog Digital \r\n                Signal Analyser The SBM105 analyses the quality of satellite \r\n                receive signals and offers all measurements required by digital \r\n                communication channels. Is also offers level measurement of analog \r\n                signals as well as spectral analysis of the band. SMARTTool Precision level meter for setting and \r\n                alignment of antenna to ensure optimum signal strength and maximum \r\n                system reliability. SUUNTO Bearing Compass & Clinometer The Suunto Tandem is a liquid-filled \r\n                precision compass and clinometer in one compact aluminum housing \r\n                that is easy to use and rugged enough to protect against impact, \r\n                corrosion and water. GARMIN’s eTrex Personal Navigator This compact, easy-to-operate GPS is \r\n                perfect for measuring and recording of location coordinates with \r\n                the accuracy required for VSAT network control systems. Handheld Tools The perfect set of handheld tools to \r\n                ensure that you have the correct tool for every need while at \r\n                the same time being lightweight and convenient to carry under \r\n                all circumstances. All of which are supplied in an easy and convenient \r\n                canvass bag. Costs: NGN 50 000 (US$ 380)  p/p Venue: Lagos, Nigeria Listen to the Feedback - SUCCESS\r\n              AT PREMIER VSAT TRAINING EVENT For Registration and Payment please contact: Jidaw Systems Limited, 12 Eric Moore Street, Wemabod Estate, Ikeja, Lagos,\r\n              Nigeria Tel: 01-8958064, 4808445, 08035007778 You can also enrol online Bookings will only be confirmed after you have made payment. The VSAT Training event is the ONLY event in West Africa that brings VSAT value, learning, networking and opportunity together in one place. Do you want to be part of the current and future African Telecom boom? You MUST attend this event. Get\r\n              More VSAT Training Details"
    },
    {
      "tag": "div",
      "text": "InstanceEndEditable START OF SmartSource Data Collector TAG 1999-2003 NetIQ Corporation. All rights reserved. V6.1 $DateTime: 2003/09/30 11:23:29 $ END OF Data Collection Server TAG"
    }
  ]
}