{
  "url": "http://www.joanelloyd.com/fbthrust.htm",
  "file_number": "525",
  "content_hash": "b0c4e22f91892b2b463a6652cfffcaa0194e59947676be61e4cfbe21be22fcc9",
  "total_blocks": 20,
  "retained_blocks": 4,
  "ignored_blocks": 16,
  "blocks": [
    {
      "tag": "h2",
      "text": "Lovers' Feedback Forum"
    },
    {
      "tag": "h3",
      "text": "Can Women Come through Thrusting Alone"
    },
    {
      "tag": "p",
      "text": "Visit my Main Page or Write to me Updated 7/06 [F 42] Ilike intercourse, but Idon't recEive very much sensation that way.   Position, size and how turned on Iam beforehand make no difference to me either.  To me it's just another way to get my husband off -- I'm just as happy to go down on him, really!  I've tried masturbating during the act, and some men I've been with before Igot married have tried doing it for me, but that doesn't work for me.  With all the movement going on, Ican't focus on the sensation there or even feel it at all, especially if I'm on top.  In that position, Ihave to concentrate on the job (thrusting) and putting on the show (men need that visual stimulation!) and the verbal part (urging him on, go team!)  It's exciting, like a long passionate kiss, but nothing more.  Ido love seeing my husband have a great time though!  If only Icould get my clit surgically moved to my vaginal entrance where it would do me so much more good. updated 3/05 [F] First of all though, Ithink it is worth saying that the clitoris that most people refer to is actually just the tip of the clitoris. The full clitoris is in two halves which run down the sides of the vagina, just under the skin, like threads. They join together somewhere near the pelvic bone and then turn around through almost 360 degrees and emerge as the clitoral tip, just under the hood. For me, the two threads seem to be between the inner and outer lips. If you look far enough on the web you can get much more info on this - it is worthwhile knowing about it. The point is that thrusting will usually stimulate these two threads depending on your position. For me, they seem to get rolled around under the skin as my husband thrusts in and out. If my legs are wide open, the stimulation is not very great but if Ihave my legs together with a pillow under my hips, as one lady indicated below, then there is a lot of stimulation.. In this position my husband usually seems to ride over the tip of my clit as he thrusts and so that gets stimulated as well. Its a position Ireally like and can get me to a climax, with one proviso (see below). Ishould add that in this position Ican very easily get sore around the tip of my clit because there is so much contact. We use a lot of baby oil around there, which prevents the problem. The position that works best is for me to sit on the dressing table with some pillows behind me and lots under me so that Iam at the right height. Ican sit back and open my legs and my husband can get into me whilst supporting my thighs. The advantage of this is that my husband can thrust from a standing position and that means it is easier for him to thrust hard and fast. Also, and this is important, the angle is just right. If weve spent a lot of time on foreplay and Iam very aroused then in this position the thrusting will easily get me to a climax. In fact, when its like this Idont want him to go slow at all because that seems to calm me down too much. Iwould much rather he entered and started to thrust hard from the outset. Ithink the two things which are vital for me to climax with thrusting are the stiffness of his penis which, with the help of Cialis, is very stiff(!!) and the speed and force of the thrusting. It really does have to be very hard and very fast whatever the position we are in. Isuppose you also need a dressing table which is pretty solid and a guy that is in good shape! Updated 2/05 [M 58] I'm 58, and years ago Idecided to read all Icould find on what women had to say about the topic of love and sex. Believe me, it was worth the effort. Experience has taught me to arouse the woman thoroughly before intromission. Moreover, fully open her labia so that her clitoris exposed to the male's pelvis and pubic hair. And \"grind\" against her vulva, first in a clockwise motion, then counterclockwise. Most importantly, communicate. Tell her how beautiful she is. Look her directly in the eyes during intercourse, kiss her and let her know just how wonderful sharing the experience makes you feel. Almost certainly she will climax. Stay in her after climax, telling her that you don't want to withdraw; that you want to \"soak\" and savor her essence. My experience indicates that she will desire you more Updated 1/05 [F] Iguess Iam kind of odd in that the thrusting doesn't do much for me.  It's almost like there is too much going on down there.  In fact, when Imasturbate with a toy, Inever thrust with it.  Ifind the feeling of being filled while my clitoris is stimulated much more exciting. Updated 11/04 [F 35] Ican climax with thrusting alone, especially if I'm on top.  I've pretty much always been this way.  Ithink what gets me off is the rubbing motion more so than the thrusting though.  Iagree with the previous post that there is quite \na bit of clitoral contact on the partner's pelvic bone in the positions that \nwork for me.  Icould pretty much rub up against anything and get off (which \nis nice!)  Idon't know if this is related, but like the other woman who \nposted, Itoo am able to have multiple orgasms...as many as Ihave the energy \nto go for. [M] We actually never thought it was possible for my wife to cum through\nthrusting alone.  Her orgasms had always required clitoral stimulation.  She\neasily reached climax during penetration (from me, a vibrator or a dildo),\nbut only when either she or Ifingered her clitoris, we used a vibrator on\nher clitoris, or Igave her oral during dildo penetration.   Her first\nclimax from penetration alone came during a love making session where Iintroduced her to an above average sized dildo.  Ihad visited a local\n\"porn\" store to purchase some videos and stopped by the toy section to see\nif there was anything new or different we might like to try.  The only thing\nthat caught my eye was a half dozen or so larger than life dildos.  Ispent\nsome time obsessing over which size she might be able to accommodate, then\nmade a purchase of an 8\" life like model with a fairly good sized girth.\nSome were so large Iquestioned whether any woman could truly accommodate\nthem.  Anyway, with videos and a new toy in hand Iwent home for dinner and\nwhat Ihoped would be a fun night of sexual adventure.  As we watched one of\nthe videos and toyed a little with one of my wife's current dildos, Iintroduced her to my new purchase.  Albeit it larger than any dildo or\nvibrator she currently had tried, and larger than my cock, she was excited\nenough from the video and our foreplay to give it a try.  We put a\nlubricated condom over it and she lubricated her pussy (in and out) with a\ngood amount of KY in anticipation of a potentially difficult penetration.\nAs Iwatched, she pushed the dildo in slowly, inserting it in very small\nincrements. After 4 or 5 inches were comfortably inside her she began to\ncarefully slide the dildo in and out in a fucking motion, each thrust\npushing it into her pussy just slightly deeper.  It took her quite some\ntime, many adjustments of her hips, a pillow under her ass, and a wider\nspreading of her legs before she could manage a full penetration.  Once she\nhad it deeply in her pussy, she took a short break to catch her breath.  She\ntold me at the time that she felt that her pussy was completely stretched to\nit's limit around the dildo.  As best she could, she slowly began fucking\nher pussy as Isat there watching in amazement and excitement.  It wasn't\nlong before her strokes got longer and faster.  With one hand clutching the\nsheets beneath her and the other holding the base of the dildo, she fucked\nherself into an incredible frenzy.  Watching her orgasm like this was\nwithout doubt the most exciting sexual act Ihad witnessed to date.  As she\ncame, she could barely keep her ass on the bed, her legs were flying about\nand she screamed as if her life depended upon it.  When she finished cumming\nand after many minutes of rest, she carefully and slowly pulled the dildo\nfrom her pussy.  Many times that evening and into the next day she continued\nto talk about the intensity of her orgasm and that this was the \"first\" time\never that she had climaxed vaginally, with no clitoral stimulation.  From\nthat night on, her orgasms have been a mix of clitoral and vaginal climaxes\ndepending upon her desires and our sexual play.  She soon was able to orgasm\nfrom my thrusting alone when we fucked and always during any dildo\npenetration. Updated 10/04 [M] Iam married to a really gorgeous lady who is very capable of doing this. Iam no monster penis person; average is about where Istand in this regard. So it cant be due to my size. Of course Icould get all modest and say it is probably my technique! She interestingly does not like too much clitoral stimulation; in fact, Idont think that Ihave ever made her climax clitorally. Iknow she is not into masturbating much if at all. She does not get very wet before sex but as soon as Iam in her she seems to melt. Depending on how worked up she is she can orgasm in about 30 seconds and if Icontinue with a certain angle she has huge, long orgasms. She likes to be on top with pressure on the top side of her vagina not too deep in. Isuppose where you would say her G-Spot is. If she is rocking with almost no movement with the root of my penis firmly against this spot if does not take long to get her off. This of course is great for me as there is not too much stimulation so Ican go on for quite a while. If we are having a good evening she can have 4 or 5 orgasms, all vaginal.  Our record is 8, while mine is 3 in a night. Ihavent come across a woman like this before, though Ireally cant call myself a well traveled man in this regard. [F 36] In response to your visitor's question, \"can you climax from thrusting\nalone - without clitoral stimulation?\" - in a word 'yes', but with some\nqualifiers.  I've been able to achieve orgasm without 'direct' clitoral\nstimulation for some time.  It took some experimentation, and a lot of\npatience, but once Iwas able to find what worked, it's been fantastic. \nI've discovered a number of different positions that allow me to achieve\norgasm.  As an example, simply closing my legs together after my\nhusband's penetrated me in any face-to-face position works quite well,\nalthough if I'm on the bottom, Ialso need something under my ass, such\nas a pillow or his hands - anything to give just a touch of pelvic tilt.\n Also, having my husband enter me from behind works, but Itend to\nexperience more 'g-spot' orgasms that way. The reason that Iemphasize 'direct' clitoral stimulation is that with\nthe face-to-face positions, there is a fair amount of contact with my\nclitoris and his pubic bone, but I've never been able to cum via that\nalone - I've always had to bring my legs together in order to vary the\nangle of penetration and create that added 'tightness'.  I'm also\ncareful to point out that Ican achieve orgasm through\npenetration/thrusting - but to climax is a completely different matter\nfor me.  Ican cum many times during intercourse without ever reaching\nclimax.  When Icum, Ican feel my pussy contracting around my husband's\nerection and Iget that warm buzz washing over me.  Often, I'll even\nfeel it deeper, especially when he stimulates my g-spot, but when Iclimax, Iloose all control - and to achieve that, Ineed direct\nclitoral stimulation (as well as other parts of my body). Acouple of my girlfriends have reported similar success playing with\ndifferent positional variations, while others can only cum when they or\ntheir lovers play with their clits directly.  The best advice that I've\never heard is not to get hung up on it - if it happens, it happens and\nwe're all different, so just have fun trying. Updated 9/04 [F 57] This message is written in response to the question as to whether a woman can climax with thrusting alone and no clitoral stimulation.  Iam very happy to say that Ican, but it helps greatly if Iam on top.  My husband is quite thrilled to accommodate for he is not concerned about his location as long as each of us reaches a very pleasing climax."
    },
    {
      "tag": "p",
      "text": "Return to the Main Page Write to Joan"
    }
  ]
}