{
  "url": "http://www.keyskillsincontext.co.uk/pru/B/communication/5.php",
  "file_number": "533",
  "content_hash": "10e1ae0d7de4f8d0e60847823d8d16f819fb042efc81e0e172eacf878c5da34c",
  "total_blocks": 138,
  "retained_blocks": 4,
  "ignored_blocks": 134,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""
    },
    {
      "tag": "div",
      "text": "SEARCH BY: Please select Key Skill Company Theme PORTFOLIO ABOUT US CONTACT US"
    },
    {
      "tag": "div",
      "text": "Planning for the Future CONTEXT PROJECT A PROJECT B Communication Activity Task 1 Task 2 Task 3 Task 4 Task 5 Information Technology Application of Number PROJECT C LINKS"
    },
    {
      "tag": "p",
      "text": "Funding my Education It is now time to deliver your presentation. It is important to\r\nthink carefully about the purpose of your presentation, which is\r\nto outline the different ways in which further education may be\r\nfunded and the most cost effective methods for a variety of\r\ndifferent student career paths. It is also important to consider\r\nyour audience. You will need to make sure that the style of your presentation is\r\nsuitable and that you use a range of techniques to interest those\r\nlistening to you. Rhetorical questions, examples, case studies or\r\nanalogies are all helpful ways of retaining interest as well as\r\nnon-verbal forms of communication such as eye contact and\r\nbody language. Use an image - perhaps projected on an OHP - which will help\r\nillustrate some of your main points. Design your presentation to\r\nlast approximately ten minutes. To do this you may need to\r\nprepare cue cards to remind you of what to say next. These\r\nshould be just reminders, not a set of notes that you simply read\r\naloud. Did you speak clearly and adapt the style and content of\r\nyour presentation to suit your audience? Did you use a range of techniques to keep the attention of\r\nyour audience? Did you structure what you said to make it easy to follow? Did you use an image to illustrate a complex point? © MBA Publishing Ltd 2003 Comments or queries about this site? Contact Us ."
    }
  ]
}