{
  "url": "http://www.lib.byu.edu/~rdh/wwi/bio/l/ludendrf.html",
  "file_number": "545",
  "content_hash": "afb9572ade0ce8c5e5b25f30375136f9cc32db14d7eca0a567349e504462b28d",
  "total_blocks": 13,
  "retained_blocks": 2,
  "ignored_blocks": 11,
  "blocks": [
    {
      "tag": "div",
      "text": "Ludendorff, General Erich .  (1865-1937).  Born, Kruszewnia, Prussia. Born in Kruszczewina (Posen), W. Prussia, 9 April\n1865 to a family of small businessmen, Ludendorff chose a military career. He received his commission in 1882 at age 17, serving in the usual assignments\nand completing training for the general staff.  In 1904 came the call\nto Berlin to serve on the Great General Staff.  He worked in section\nII, responsible for deployment and mobilization plans. In 1908 he became\nhead of the section, the most prestigious position excepting the Chief\nof the General Staff."
    },
    {
      "tag": "p",
      "text": "Having an excitable and highly strung temperament,\nthe strong-willed Ludendorff proved a difficult subordinate.  Charged\nwith refining and improving the Schlieffen Plan in the years before the\nwar, he became convinced that Germany lacked the trained manpower to defeat\nthe French in a rapid campaign. Ludendorff insisted that the government\nraise additional forces. When this suggestion met disapproval, he by-passed\nhis superiors and initiated contact with politicians in an effort to influence\nthe budget.  That the German political system could not bear the\ncost of additional units was something he never considered.  To him,\nit was a matter of will.  The response was a transfer to a\n regiment in Düsseldorf, safely away from Berlin.  Ayear\nlater he was given a brigade in Strasbourg and promoted to general, but\nhis mobilization orders as quartermaster general (he should have\n been an army chief of staff as a brigadier general) of the 2d Army\nindicated he was still persona non grata in Berlin. When war came in August 1914, fortune smiled. \nIn the confusion of the attack on Liège, Ludendorff received the\nsurrender of the city, and Germany had its first war hero.  The Kaiser\npersonally decorated him with Prussia's highest award, the Pour le merité ,\nthe second of the war.  The situation in the east, where two Russian\narmies threatened to break through German\n defenses, demanded his brilliance and capability for superb staff work. \nAs a counterweight to his volatility, the High Command recalled from retirement\nGeneral Paul v. Hindenburg, a phlegmatic, no-nonsense, even cautious officer,\nto command 8th Army.  Ludendorff became chief of staff.  The\ntwo generals met for the first time en route to East Prussia.  The\nsituation they confronted was threatening and risky, but by no means hopeless.\nWith the able assistance of the 8th Army's operations officer, Max Hoffmann,\nthe Germans routed the Russians at the Battles of\n Tannenberg (August 1914) and Masurian Lakes (September 1914). The impressive\nvictories electrified Germany and cemented Ludendorff's reputation as the\nman of genius.  The image of the\n invincible duo of Hindenburg and Ludendorff took root in the German\nmind.  They became legends to a people demoralized by the bloody stalemate\nin the west.  For Ludendorff, who grew\n increasingly critical of the western war effort, the lack of success\nreflected a lack of will.  He called for \"total war.\"  Convinced\nof his own judgment, his vocal criticism of the war effort mounted, and\nhe campaigned endlessly against those who opposed him. The apostle of total war got his chance when the\nKaiser, staggered by the losses at Verdun, sent Hindenburg and Ludendorff\nwestward to take-over the German war effort.  Ludendorff took the\n title Quartermaster General and received a promotion to lieutenant\ngeneral, while Hindenburg, already a field marshal, became chief of the\ngeneral staff.  Shocked by the materiel superiority of the Allies\nand convinced that the civilian leadership lacked the will to prosecute\nthe war to the fullest,\n Ludendorff initiated the Hindenburg Program.  Largely a military\ntake-over of the economy including compulsory labor coupled with a ruthless\nexploitation of occupied territories, the unpopular\n program resulted in considerable production gains while sapping home\nfront morale.  Convinced German defense operations were too static\nand hence costly, Ludendorff introduced new tactics that\n emphasized an elastic defense in depth.  To free divisions for\nreinforcements, Ludendorff conducted a massive shortening of German lines\nby evacuating his forces Operation Alberich to the Siegfried Line\nin early 1917.  The Allies called the line the Hindenburg Line. The\nwithdrawn area was left a wasteland. Ludendorff recognized the strategy of the war had\nbecome one of attrition.  With her inferior resources compounded by\nthe strangling English naval blockade, Germany could not win with\nthis strategy.  Consumed by fears that time was running out, Ludendorff\nconvinced Hindenburg that Germany had to husband resources for a knock-out\nblow on the western front.  Shortening the lines to free up units,\nstepping up the Hindenburg Program, and wrapping up the war in the east\nwould free the resources needed for the decisive blow. Convinced that only total effort could achieve victory,\nLudendorff shrank from nothing.  Accepting the Navy's contention that\na return to unrestricted submarine warfare would bring a halt to the delivery\nof vital American munitions, Ludendorff urged its adoption knowing America\nwould enter the war.  He severely underestimated both the U.S. military\npotential and the speed with which it could be brought to bear. By now there were voices of opposition in Germany\nto his increasingly bullying manner and excessive authority.  Hardly\nan area of German life remained outside his grasp by 1918.  The\n Kaiser loathed and feared him, but he could not stand up to him. Ludendorff\ncontemptuously dismissed peace initiatives and war weariness as manifestations\nof a lack of will.  He spared no one,\n including himself and his family.  Two of his stepsons fell in\ncombat, losses which made him harder.  He relentlessly attacked those\nwho opposed his measures, including Chancellor Bethmann-Hollweg, whom he\nforced from office by mid-1917. The submarine campaign served only to bring the U.S.\ninto the war.  American forces began arriving at a rate undreamed\nof by their foes.  Only the collapse of Russia under the Bolsheviks,\nto which Ludendorff had indirectly contributed by transporting Lenin from\nSwitzerland to Russia, brightened the otherwise disastrous picture. \nConvinced any peace terms would be unacceptable, a belief fed indirectly\nby his own draconic demands upon the hapless Russians, he cobbled together\nthe esources for one last great push, the Spring Offensive of 1918. \nBy stripping units from the east, Ludendorff increased his strength in\nthe west by 30%.  Special units (Storm Battalions) trained in new,\ninfiltration tactics, used surprise and mobility to by-pass enemy strong\npoints and emerge behind enemy lines into the open. Traditional infantry\nunits following along reduced the by-passed areas.  Acomplete absence of the new weapon, the tank, constituted\na major weakness to the otherwise formidable restructuring.  Ludendorff\nhad seen tanks, but he belittled their importance and dismissed his soldiers'\nconcerns as a lack of will, a strange lapse in a man who usually incorporated\nhis subordinates' suggestions. Ludendorff's spring offensive, code-named Kaiserschlacht ,\ncalled for a series of attacks rather than a single break-through. \nThe Quartermaster General planned a number of sharp blows to collapse the\nentire western Allied front.  The first onslaught began on 21 March. \nAlthough badly shaken, the Allies finally held, and Ludendorff called off\nthe advance in early April.  His next two operations followed the\nsame pattern: extraordinary initial successes petering out owing to a lack\nof reserves and supplies.  The end had come; the Germans could not\nmake good their losses. Ludendorff collapsed under the stress.  He had\nlost his second son in the offensive, and on occasion his ravings against\ndefeatists and incompetent civilians turned into uncontrollable tantrums.  On the 28th of September, he told Hindenburg and his\nstaff that Germany must seek an immediate armistice.  The Kaiser and\nChancellor Hertling heard this sad news the next day, and\n agreed.  When Ludendorff later publicly reversed his position\nabout Germany's ability to continue the war, the Kaiser demanded his resignation. Ludendorff's post-war career tarnished his reputation.\nFearing revenge, he fled temporarily to Sweden.  He wrote his memoirs,\nblaming Germany's defeat on his innumerable foes and their lack of will\npower.  He railed at the new Republic and his new enemies, the Jews,\nJesuits and Freemasons, whom he blamed for stabbing Germany in the back. \nHe became the darling of the extreme right, marching with Hitler during\nthe Beer Hall Putsch.  In 1925 he ran for Reich President, polling\na mere 1%.  His views and demons grew more extreme, and he fell to\nbickering with Hitler and his former wartime comrades.  One-by-one\nhe broke relations with his staff and colleagues, including his wife whom\nhe suddenly left for Mathilde v. Kemnitz, a folklore specialist. She encouraged\nhis fantasies.  In 1935 he published The Total War, reversing Clausewitz's\ndictum and arguing that politics must\n serve war.  On 22 December 1937 he died, shortly after declining\nHitler's offer of promotion to field marshal with the remark, \"a field\nmarshal is born, not made.\" Reference Ludendorff, Erich, Ludendorff's Own Story, August 1914-November 1918 ,\n2 vols., New York, 1919, gives a flavor of the man.  It bears careful\nreading, for Ludendorff passes the blame for\nGermany's defeat onto others. MB Return to Names List"
    }
  ]
}