{
  "url": "http://www.linkwaregraphics.com/music/",
  "file_number": "547",
  "content_hash": "09b3c7e6d75f1db1d95525b0d0ca507a5867726a374df1741cd583908f4148a8",
  "total_blocks": 95,
  "retained_blocks": 45,
  "ignored_blocks": 50,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" IND. L REL, ATOMZ DESC CSS, JS else e cssjs Skip to side navigation Skip to site information Skip to content Skip to top navigation e tm e header You are here: Home Music Images e bc1mus content e h music"
    },
    {
      "tag": "p",
      "text": "Linkware Graphics Music Images specializes in high quality music graphics for websites, including complete website sets, rules, icons, buttons, backgrounds. You will also find music notes, clefs and other notation symbols, instruments, and much more in a variety of colors and design styles. Need something specific? Need custom graphics? We're happy to discuss your needs with you and give you a price estimate. Contact Linkware Graphics for your specific graphics needs . Jump to:"
    },
    {
      "tag": "div",
      "text": "Terms of Use Overview Music Theme Graphic Image Website Sets Miscellaneous Music Images Pro Music Images Other Music Graphics and Resources e tocimg music note"
    },
    {
      "tag": "h3",
      "text": "Terms of Use Overview:"
    },
    {
      "tag": "p",
      "text": "In order to use Linkware Graphics Music Images, you must agree to the Music Images Terms of Use . Since the images are linkware, you may use them for your non-commercial personal use as long as you provide a link to this website at http://linkwaregraphics.com/music/ . See also our Link to Us page for graphic icons, HTML markup, and more about creating your links. There is a small fee for commercial use. Contact Linkware Graphics for information. These images may not be altered or changed in any way. If you would like buttons with other text, an image or website set in a different color, or other alterations, please contact Linkware Graphics . IMPORTANT: Do not try to directly link to images on my server!!! For images available for use, please download the corresponding .zip files below each screenshot example. If you're not sure how to do this, check out the Downloading Instructions page. Thank you. See the Music Images Terms of Use for more details. Thank you! top"
    },
    {
      "tag": "div",
      "text": "old h3 was Music Website Graphics Sets"
    },
    {
      "tag": "h3",
      "text": "Music Theme Graphic Image Website Sets"
    },
    {
      "tag": "p",
      "text": "This section has coordinated graphic image website sets with a music theme."
    },
    {
      "tag": "div",
      "text": "add music templates here"
    },
    {
      "tag": "h4",
      "text": "Music Notes Graphic Image Website Sets"
    },
    {
      "tag": "div",
      "text": "Elegant Music Notes, Copper - Set 1 Copper and white eighth note music notes theme. Border background, buttons have copper accenting trim. Buttons also have copper lettering, copper eighth notes. Includes coordinating music rules, dividers, notation symbols. Variation of Elegant Music Notes, Copper - Set 2 . Coordinating website set. Elegant Music Notes, Copper - Set 2 Variation of Elegant Music Notes, Copper - Set 1 . Border background, buttons have copper accenting trim, 8th notes. Buttons also have copper lettering. Includes coordinating copper music rules, dividers, notation symbols. Coordinating website set. Elegant Music Set 1, Black, Gold, and White Black and white border background and buttons with accenting gold trim. Buttons have gold lettering. Includes black rules, dividers, gold treble clef, gold eighth notes, gold music conductor, and gold grand piano. Coordinating website set. was Elegant Music Set 1 (gold, black and white) Elegant Music Set 2, Black, Red, and White Black and white border background and buttons with rich red accenting trim. Buttons have white lettering. Includes black rules, dividers, red rules, dividers, red treble clefs for black background area and white background content area, and red music notation segno symbol. Coordinating website set. Elegant Music Set 3 (black, white, red) def: segno - see http://www.dolmetsch.com/musictheory24.htm - the modern form of the older signum sign indicating a place from which an additional instruction should be observed, as, for example, go back to the 'sign' and then 'do something' From http://www.noteworthysoftware.com/nwchelp/MNU_ADDFLOWDIRECTION.htm - This marks the place where play should resume after a Dal Segno instruction (which includes Dal Segno, D.S. al Coda, or D.S. al Fine instructions) is encountered during playback. This marker is ignored unless a Dal Segno mark is used to redirect playback to this marker later in the score. Music Notes Set, Black and White Black and white eighth note music notes theme. Border background has a cascade of black eighth notes. Matching buttons have the same eighth note pattern, black lettering. Includes matching rules, dividers, many more images that will coordinate with this coordinating website set. Music Notes Set, Blue Porcelain and White Light blue “porcelain” and white music notes theme. Porcelain and white border background and buttons. Buttons have porcelain lettering and eighth notes. Includes coordinating music rules, dividers, a harp, a cello, a treble clef, and eighth notes. Coordinating website set. was Music Notes Set 4 (blue porcelain/white) Music Notes Set, Burgundy and White Burgundy and white eighth note music notes theme. Burgundy and white border background and buttons. Buttons have white lettering and white eighth notes. Includes coordinating horn (trumpet), rule, divider, over a dozen coordinating music notation symbols. Coordinating website set. Music Notes Set, Navy and White Navy and white eighth note music notes music theme. Buttons are navy with white eighth notes and lettering. Background has left-side navy strip with white content area. Includes navy eighth note rule, divider. Also has around 15 coordinating navy music notation symbols. Coordinating website set. was set 3 (navy and white) Music Notes Set, Colored 16th Notes Primary colors 16th notes music notes theme. Includes subtle background with colored 16th notes and coordinating buttons with varied colors for 16th notes, 16th note rules, dividers in several matching colors, and other coordinating 16th notes to place where you wish. Fun, casual, coordinating website set."
    },
    {
      "tag": "h4",
      "text": "Music Staff Graphic Image Website Sets"
    },
    {
      "tag": "div",
      "text": "Music Staff Set 1 Navy and white with gray textured manuscript, staff paper border background. Coordinating website set. Music Staff Set 2 Navy and white with gray textured manuscript, staff paper border background. Coordinating website set."
    },
    {
      "tag": "h4",
      "text": "Piano, Keyboard Graphic Image Website Sets"
    },
    {
      "tag": "div",
      "text": "Piano Keyboard Set, Black, White, and Burgundy Black and white piano keyboards with burgundy highlights. Piano keyboard with burgundy trim for the left side border background. Coordinating buttons also have black and white piano keyboard, burgundy trim, black text. Included are coordinating burgundy treble clefs, quarter notes, eighth notes, and piano keyboard graphic icon images. Coordinating website set. Piano Keyboard Set, Black and White Black and white piano keyboard coordinating website set. Black and white piano keyboard for the left side border background. Coordinating buttons also have black and white piano keyboard, black text. Included are coordinating black treble clefs, quarter notes, eighth notes, and piano keyboard graphic icon images."
    },
    {
      "tag": "h4",
      "text": "Treble Clef Graphic Image Website Sets"
    },
    {
      "tag": "div",
      "text": "Treble Clef Music Set Black and white treble clef and eighth notes music theme. Coordinating website set. end musex"
    },
    {
      "tag": "p",
      "text": "Need help with the HTML? Need web page layout templates all ready to go to add the content yourself? Need someone to create your website? Hire Linkware Graphics to lend a hand to do as much or as little as you need. top"
    },
    {
      "tag": "h3",
      "text": "Miscellaneous Music Images"
    },
    {
      "tag": "div",
      "text": "Music Conductors Guidonian Hand Music Headings, Titles Musical Instruments Music Notation Symbols, Treble Clefs, Other More new images added by request, May, 2002 Pianos and Keyboards Music-Related Rules, Page Dividers Vocalists, Singers"
    },
    {
      "tag": "h3",
      "text": "Music Manuscript Paper"
    },
    {
      "tag": "div",
      "text": "Printable Music Manuscript Paper Added by request April, 2002"
    },
    {
      "tag": "h3",
      "text": "Pro Music Images"
    },
    {
      "tag": "p",
      "text": "Our upgraded line of professional music graphic images. Ready-made and custom graphic images with a music theme."
    },
    {
      "tag": "div",
      "text": "Pro Music Images Home Pro Misc. Music Images Pro Musical Instruments Music Images Pro Music Notation Symbols Music Images Pro Pianos, Keyboards"
    },
    {
      "tag": "p",
      "text": "top"
    },
    {
      "tag": "h3",
      "text": "Other Music Graphics and Resources"
    },
    {
      "tag": "div",
      "text": "WebsiteTips.com Graphics Resources (external website) Music-Related Graphic Images (external website) Music-Related Graphics Resources (external website)"
    },
    {
      "tag": "p",
      "text": "top"
    },
    {
      "tag": "div",
      "text": "e content nav"
    },
    {
      "tag": "h4",
      "text": "Music Images:"
    },
    {
      "tag": "div",
      "text": "end maintop Music Images Help, Information Music Images Terms of Use How to Download Music Image .Zip Files How to Link to Us Music Images Website Sets Music Notes Graphic Image Website Sets Music Staff Graphic Image Website Sets Piano, Keyboard Graphic Image Website Sets Treble Clef Graphic Image Website Sets Misc. Music Images Music Conductors Guidonian Hand Music Headings, Titles Musical Instruments Music Notation Symbols Pianos, Keyboards Music Rules, Dividers Singers, Vocalists Printable Music Manuscript Paper Pro Music Images Other (External) Resources WebsiteTips.com Music-Related Graphic Images Music-Related Graphics Resources"
    },
    {
      "tag": "p",
      "text": "In The Spotlight featured website, About.com week of September 10, 1999"
    },
    {
      "tag": "div",
      "text": "e cathere sponsors"
    },
    {
      "tag": "h4",
      "text": "Our Sponsors SKDesigns"
    },
    {
      "tag": "p",
      "text": "Stunning, effective, standards-based Web site design since 1996"
    },
    {
      "tag": "h4",
      "text": "Shirley Kaiser"
    },
    {
      "tag": "p",
      "text": "Pianist, Composer - Music articles, sound clips, music to heal and soothe the soul"
    },
    {
      "tag": "h4",
      "text": "WebsiteTips.com"
    },
    {
      "tag": "p",
      "text": "Web site tutorials, tips, and top resources"
    },
    {
      "tag": "div",
      "text": "e spons e catspons a href=\"http://nomhrf.org\"><img src=\"http://www.nomhrf.org/banner-125.gif\" height=\"125\" width=\"125\" border=\"0\" alt=\"Click here to visit The New Orleans Musicians Hurricane Relief Fund site.\" title=\"The New Orleans Musicians Hurricane Relif Fund banner ad.\"></a> e sidenav e content, wrap btm Skip to content Skip to top navigation Skip to side navigation Help support Linkware Graphics:"
    },
    {
      "tag": "p",
      "text": "Search: All Products Books Popular Music Music Downloads Classical Music DVD VHS Apparel Toys Baby Computers Computer, Video Games Electronics Camera & Photo Software Tools & Hardware Magazines Sporting Goods Outdoor Living Kitchen & Housewares Jewelry & Watches Gourmet Food Health/Personal Care Cell Phones & Service Outlet Keywords:"
    },
    {
      "tag": "div",
      "text": "Main Sections: Linkware Graphics Home Music Images SuperBladePro Presets Help, Information Site Information, Contact : Sitemap Accessibility Statement About Linkware Graphics Colophon, Credits Contact Us Report a Bug, Broken Link Link To Us Copyright Disclaimer Website Terms of Use Privacy Policy e btmnav"
    },
    {
      "tag": "p",
      "text": "Today is December 26, 2006 - PST Copyright © 1996-2006 Linkware Graphics, linkwaregraphics.com. All rights reserved. Created and maintained by SKDesigns . http://linkwaregraphics.com/music/ Last modified June 20, 2006 - 3:26pm PDT Page load time: 0.000983 seconds."
    },
    {
      "tag": "div",
      "text": "e footer e btm Home Music Images SuperBladePro Presets Help, Information About Contact e topnav"
    }
  ]
}