{
  "url": "http://www.lonesentry.com/articles/officercorps/",
  "file_number": "551",
  "content_hash": "7073ec87863893ba0e32cd132169aff717ed28dfd84eb75a2d558e7ab6b0dddb",
  "total_blocks": 81,
  "retained_blocks": 16,
  "ignored_blocks": 65,
  "blocks": [
    {
      "tag": "div",
      "text": "Photos, \r\n\tArticles, & Research on the European Theater in World War II \"Red Army Officers' Corps\" from Intelligence Bulletin"
    },
    {
      "tag": "p",
      "text": "Report on the restoration\r\n\tof the Red Army Officers' Corps in WWII, from\r\n\tthe Intelligence Bulletin ,\r\n\tMarch 1946. [Editor's Note: The following article is wartime or postwar\r\ninformation on foreign militaries published for Allied soldiers.  More accurate data\r\non foreign militaries is available in postwar publications.]"
    },
    {
      "tag": "div",
      "text": "RED ARMY OFFICERS' CORPS Decrees Revive Once-Hated Traditions"
    },
    {
      "tag": "p",
      "text": "The Communist Party and the Soviet Government have recently\r\ntaken several steps to increase the attractiveness of a postwar career\r\nfor officers in the Red Army. These innovations, in drastic contrast\r\nto the avoidance of special privilege in the Revolutionary period, officially\r\nrestore the traditional prestige and prerogatives of the Russian\r\nofficers' corps. The officers' corps, once the symbol of despised Czarist\r\noppression, has been gradually revived until today it is imbued with\r\nboth old and new Russian fighting tradition, and enjoys a firmly\r\nrooted authority based on wartime success and the adulation of the\r\ngovernment and the people. In order to \"free officers from personal and economic preoccupations,\"\r\nstaff orderlies are now provided for all general officers and\r\ncolonels, even those on the retired list. The new decree likewise\r\nauthorizes increased rations of free food and exemptions from war\r\ntaxes for the officers' corps. Previously, it was announced that separate\r\nRed Army officers' clubs were being built in military districts and at\r\ngarrison posts because \"under present conditions of cultural enlightenment\r\nit is necessary to have sharp differentiation and separation\r\nbetween officers and enlisted men.\" Last spring, plans to construct\r\nspecial apartment houses for officers and their families were announced."
    },
    {
      "tag": "p",
      "text": "Although uniform regulations kept officers looking pretty much like enlisted men,\r\nprior to the war Red Army officers had already gone far in rank differentiation. These\r\nprewar uniforms may be cut like those of enlisted men, but the boots are\r\nof good soft leather, the breeches of blue surge, and the tunics of quality OD wool."
    },
    {
      "tag": "p",
      "text": "These changes are a far cry from the treatment received by officers\r\nin the Red Army during the early days of the Soviet Union. During\r\nand after the Revolution in the winter of 1917-18, all ranks and grades\r\nwere abolished, and there existed only two formal and nonpermanent\r\ncategories—rank and file, and commanders. The commanders were\r\ndistinguished from their men by no insignia other than a small mark\r\non their sleeves (later by a collar tab pip), and the differences between\r\ntheir dress, pay, and treatment were correspondingly small. Socially,\r\nall Red Army men were on the same level. This entire program\r\nreflected the popular revulsion on the part of both the people and the\r\nmembers of the armed forces against the tradition of oppression of the\r\nold Czarist officers. In the first days of the Revolution, officers were subject to deposition\r\nand arrest at the hands of soldiers' committees formed in their units.\r\nOff-duty saluting and standing at attention were abolished by the\r\nFirst Order of the Petrograd soviet on 14 March 1917. Even the\r\nelection of officers was seriously discussed, and in order to assure the\r\npolitical reliability of the ex-Czarist commanding personnel, a system\r\nof political commissars was instituted in 1917. The political commissars\r\nexercised stringent control over commanders during the Civil War. (The\r\ncommissars alternately lost and regained the power of veto of\r\ncommand decisions until 1942, when they were absorbed into the\r\nregular officers' corps.)"
    },
    {
      "tag": "p",
      "text": "Under the new regulations, officers have really gone to town. This Cossack in\r\nfield uniform not only wears the re-adopted Czarist-type shoulder boards, but has\r\nother traditional gear formerly taboo. Note the beard, the Cossack hat, the\r\nCossack saber and knife. He may wear a Cossack cape and scarf-hood bashlik."
    },
    {
      "tag": "p",
      "text": "So equalitarian was the spirit of the Soviet armed forces that the\r\nvery word \"officer\" was abolished from the Soviet vocabulary in 1918\r\nas a hateful reminder of Czarist times. Instead, officers were referred\r\nto as company, division, and other unit commanders. External political\r\nconditions and the disappearance of pre-revolutionary classes in\r\nRussia gradually brought about a change in the position of Red Army\r\nofficers. During the 1920's unit commanders ate at the same mess as\r\ntheir men and shared the Red Army clubs with them. Pay and living\r\nquarters were usually poor. Revival of the officers' corps was started inauspiciously by the Decree\r\nof September 1935, at which time it was believed advisable to revive\r\nthe prestige of the army and the authority of the commanders. Regulations\r\nwere passed restoring the familiar designations of the lower\r\ngrades, reviving the rank of marshal, and granting substantial increases\r\nin pay. The decree reestablished individual ranks for commanders. This\r\ndecree was designed to insure the steady growth of the\r\ncommanders as a group, to improve their relative standing, to give\r\nincentive to greater effort, to reward loyal service, and in particular\r\nto reinforce their power and authority. The decree established service\r\nas an officer in the Red Army as a lifelong profession, and fixed\r\ndefinite terms of service for the various ranks, providing appropriate\r\ndistinguishing uniforms and insignia. The purge of the Red Army in 1937 indicated that the officer class\r\nwas not considered completely reliable. By 1940, however, the salute\r\nbecame obligatory on all occasions, and the rank of general was\r\nreintroduced."
    },
    {
      "tag": "p",
      "text": "Infantry officers in the field still follow an almost world-wide practice of dressing\r\nand appearing pretty much like their men. The officer in this group is the\r\nlieutenant with the medals (center). He wears a G.I. cap and enlisted man's\r\npocketless tunic; only his shoulder insignia and Sam Browne belt distinguish him."
    },
    {
      "tag": "p",
      "text": "The outbreak of the war with Germany showed the need for insuring\r\nthe loyalty of the officer class to the government, as well as for\r\nincreasing the respect and obedience shown to commanders by their\r\nmen. Determined efforts were made to increase the number of Party\r\nmembers in the rapidly expanding officers' corps. Distinctions of\r\nrank were emphasized progressively. The political commissars again\r\nlost their veto power in 1942 and officers received many privileges,\r\nsuch as special discounts in state stores; separate stores were\r\nestablished for those of high rank. Not until the reintroduction of the pre-revolutionary stiff shoulder\r\nboards ( pognoy ) in January 1943 was a separate classification of\r\ncommanders revived, along with new and more resplendent uniforms\r\nand other accouterments reminiscent of the old days. The Decree of July 1943 finally granted the once-despised title of \"officer\" to Red\r\nArmy commanders, and officially and for the first time in Soviet\r\nhistory established a distinct \"officers' corps.\" Other steps were taken\r\nto increase the distinction between officers and enlisted men. Differences\r\nin pay and treatment rapidly increased, and today the annual\r\npay of a private is 600 rubles, while that of a lieutenant is 7,700\r\nrubles, or almost 13 times as much. Since the Decree of July 1943 and subsequent measures, the glamour\r\nand prestige of the Soviet officers' corps has been confirmed in\r\npractice and by decree. The corps is firmly established, conscious of\r\nits dignity and special status, and proud of its traditions. As in the\r\nAmerican and other armies, the Red Army officers' corps includes\r\nlarge numbers of men recently risen from the ranks and drawn from\r\ncivil life. The Soviet press, radio, and movies have popularized and\r\nglorified the Soviet officer in the minds of the civilian population."
    },
    {
      "tag": "p",
      "text": "The uniforms decreed in 1943 (of which this is service dress) strongly mark the\r\ndifference between officers and men, and are quite gaudy. The edges of this coat\r\ncollar and front are piped in the officer's arm color (here red); his dress epaulets\r\nhave a gold base with red piping. His dress uniform would be even more colorful."
    },
    {
      "tag": "p",
      "text": "The recent legislation concerning orderlies and officers' clubs has\r\nfor the most part legalized practices that grew up during the war. In the early days of the war the recognition granted to officers was\r\nprimarily designed to strengthen their authority. Now, Soviet policy\r\nhas the avowed purpose of maintaining a strong army and improving\r\nthe quality of the officers' corps. In this connection the opening\r\nof the Suvorov Schools, primarily for the children of Red Army men\r\nkilled in battle, was a significant development in 1943. These military\r\nschools, which are directly comparable to the Czarist Cadet Schools, will\r\ngraduate each year approximately 5,000 youths whose education\r\nsince their 10th year has been largely military. Thus, it should be\r\npossible to select the majority of career officer candidates from\r\nSuvorov School students. The army of the U.S.S.R. dates its origin from 1918, but it is\r\ndeeply proud and aware of the military laurels which have in the\r\npast graced Russian arms. Soviet officers are expected to be familiar\r\nnot only with World War II triumphs but with the campaigns and\r\nstrategic principles of pre-Soviet heroes. Marshal Stalin told the\r\nRed Army on 7 November 1941: \"Let the manly images of our great\r\nancestors—Aleksandr Nevski, Dmitri Donskoi, Kuzma Minin, Dmitri\r\nPozharski, Aleksandr Suvorov, Mikhail Kutyzov—inspire you in this\r\nwar.\""
    },
    {
      "tag": "div",
      "text": "Back to Articles by Subject | Intel Bulletin by Issue | T&TT by Issue | Home Page"
    },
    {
      "tag": "div",
      "text": "Copyright 2003-2005, LoneSentry.com . All Rights Reserved. \r\nContact: info@lonesentry.com ."
    },
    {
      "tag": "div",
      "text": "Advertisement"
    },
    {
      "tag": "div",
      "text": "Web LoneSentry.com"
    }
  ]
}