{
  "url": "http://www.lums.lancs.ac.uk/news/cuttings/",
  "file_number": "552",
  "content_hash": "5644afa3d5b0228164f0a95965974facc67b60a63c846c5f7fdab70dbac0b2cf",
  "total_blocks": 82,
  "retained_blocks": 31,
  "ignored_blocks": 51,
  "blocks": [
    {
      "tag": "div",
      "text": "Login Signup Contact University Home Undergraduate Postgraduate PhD Departments People Research Leadership Executive Recruiters Alumni News Events"
    },
    {
      "tag": "h1",
      "text": "Press Centre"
    },
    {
      "tag": "p",
      "text": "You are here: Home > LUMS News > LUMS in the News"
    },
    {
      "tag": "h2",
      "text": "LUMS in the News"
    },
    {
      "tag": "h3",
      "text": "Il Sole 24 Ore: 'Women lawyers are still far from parity'"
    },
    {
      "tag": "p",
      "text": "Published 11 December 2006 Dr Daniel Muzio and Dr Sharon Bolton, both of the Department of Organisation, Work and Technology, were quoted extensively in a feature in 'Il Sole 24 Ore' (Italy's leading business and finance publication) on gender in the legal profession. Dr Bolton's and Dr Muzio's research shows that despite some significant processes of numerical feminisation, women solicitors are still faced by patterns of sexual discrimination, subordination and exclusion. Full Story"
    },
    {
      "tag": "h3",
      "text": "The Guardian: 'How to build trust'"
    },
    {
      "tag": "p",
      "text": "Published 6 December 2006 Oona Goldsworthy, one of the students in the first cohort of Lancaster's Leadership for Housing executive programme, was featured in the Guardian on 5 December. Oona collected the Guardian's 'Public Service Award' on behalf of Bristol Community Housing Federation, of which she is chief executive. View article"
    },
    {
      "tag": "h3",
      "text": "The Observer: 'Sex and the City's top jobs'"
    },
    {
      "tag": "p",
      "text": "Published 30 October 2006 Professor Cary Cooper of LUMS is quoted in a story in the Observer about women chief executives in UK businesses. \"We've pushed the glass ceiling up, but we haven't broken it,\" says Professor Cooper. \"We're seeing more and more jobs in senior and middle management going to women, but not yet in top management.\" View article"
    },
    {
      "tag": "h3",
      "text": "The Times: 'Lancaster rides to the rescue'"
    },
    {
      "tag": "p",
      "text": "Published 27 October 2006 A Times story on practical learning on MBA programmes features the Lancaster MBA, and the three periods of consulting experience that students gain while on the programme. Full Story"
    },
    {
      "tag": "h3",
      "text": "The Times: 'When best practice is not best for all the staff'"
    },
    {
      "tag": "p",
      "text": "Published 25 October 2006 Dr Sharon Bolton, of the Department of Organisation, Work and Technology, is quoted extensively in a Times feature on the UK's new Age Discrimination Act. Dr Bolton's research shows that the new legislation is unlikely to make much difference to many older workers. View article"
    },
    {
      "tag": "h3",
      "text": "Personnel Today: 'Centre for Performance-Led HR opens its doors'"
    },
    {
      "tag": "p",
      "text": "Published 23 October 2006 Personnel Today carries a feature story on the opening of LUMS' new Centre for Performance-Led Human Resources. View article"
    },
    {
      "tag": "h3",
      "text": "Evening Standard: 'Is this really our most thrilling sport moment?'"
    },
    {
      "tag": "p",
      "text": "Published 19 October 2006 Professor Cary Cooper's new research into the thrill factor in sport is covered by the London Evening Standard. \"The research allows sporting spectators to compile and rate all the feelings of tension and exhilaration that they may feel during a game. It's the mathematical proof needed in a heated sporting debate,\" said Cary Cooper, who is Professor of Organisational Psychology and Health at Lancaster University Management School. View article"
    },
    {
      "tag": "h3",
      "text": "The Independent: 'Groomed for the office '"
    },
    {
      "tag": "p",
      "text": "Published 5 October 2006 The Independent carried a feature story on 5 October on Lancaster's unique Accounting, Auditing and Finance degree developed in partnership with Ernst & Young. Full Story"
    },
    {
      "tag": "h3",
      "text": "The Independent: 'Business Masters: Get a sense of direction'"
    },
    {
      "tag": "p",
      "text": "Published 5 October 2006 Lancaster's MSc in Management was featured in a story in The Independent on 5 October which focuses on how a business Masters degree can help graduates from non-vocational degrees get started in a business career. Full Story"
    },
    {
      "tag": "h3",
      "text": "The Times: 'MBA is a public private party'"
    },
    {
      "tag": "p",
      "text": "Published 6 September 2006 Andy Bailey, Director of Lancaster's Executive MBA, is quoted in a Times story on the learning gained by students on executive MBA programmes. \"Abig part of the process is about challenging misconceptions,\" Dr Bailey says. \"Private sector students learn that profit isn't the most important motivation for all organisations and individuals; there can be other measures and drivers of success.\" View article"
    },
    {
      "tag": "h3",
      "text": "LUMS graduate one of 'world's most powerful 100 women'"
    },
    {
      "tag": "p",
      "text": "Published 5 September 2006 Dr Nahed Taher, who graduated from LUMS with an MSc in 1998, and a PhD in Economics in 2001, has been ranked 72nd in Forbes Magazine's list of the 100 most powerful women in the world. View article"
    },
    {
      "tag": "h3",
      "text": "FT: 'Initiative to point leaders in the right direction'"
    },
    {
      "tag": "p",
      "text": "Published 10 July 2006 The Financial Times carries a feature on leadership development in northern England, focusing on the Northern Leadership Academy and Lancaster University Management School's pivotal role in developing leadership initiatives. Professor Steve Bradley, Head of the Economics department, and Steve Kempster, director of the Lancaster Leadership Centre, are quoted extensively in the article. View article Older LUMS in the News can be found in the news archive"
    },
    {
      "tag": "div",
      "text": "Press Centre LUMS in the News: Recent Media Coverage LUMS News Events About the School Staff Directory Logo & Graphics Copyright Information Contact Us"
    },
    {
      "tag": "p",
      "text": "Lancaster University Management School, Lancaster LA1 4YX, UK"
    },
    {
      "tag": "div",
      "text": "Tel: +44(0)1524 594285 Travel Directions Maps Contact About LUMS Site Info Feedback Login © 2006 Lancaster University Copyright Notice Disclaimer"
    }
  ]
}