{
  "url": "http://www.marriagesavers.org/public/a_christian_declaration_on_marri.htm",
  "file_number": "559",
  "content_hash": "117b761d30f426cfe00c76e6b62bf2ce99fe0923c841d55f441fb252ed7d9b46",
  "total_blocks": 114,
  "retained_blocks": 25,
  "ignored_blocks": 89,
  "blocks": [
    {
      "tag": "h2",
      "text": "A Christian \r\n  Declaration on Marriage"
    },
    {
      "tag": "p",
      "text": "As we celebrate the 2000 th anniversary \r\n  of the birth of the Lord Jesus Christ, entering the third millennium, we pledge \r\n  together to honor the Lord by committing ourselves afresh to God’s first \r\n  institution — marriage. We believe that marriage is a holy union of one man and \r\n  one woman in which they commit, with God’s help, to build a loving, life-giving, \r\n  faithful relationship that will last for a lifetime. God has established the \r\n  married state, in the order of creation and redemption, for spouses to grow \r\n  in love of one another and for the procreation, nurture, formation and education \r\n  of children. We believe that in marriage many principles of the Kingdom \r\n  of God are manifested. The interdependence of healthy Christian community is \r\n  clearly exemplified in loving one another (John 13:34), forgiving one another \r\n  (Ephesians 4:32), confessing to one another (James 5:16), and submitting to \r\n  one another (Ephesians 5:21). These principles find unique fulfillment in marriage. \r\n  Marriage is God’s gift, a living image of the union between Christ and \r\n  His Church. We believe that when a marriage is true to God’s loving \r\n  design it brings spiritual, physical, emotional, economic, and social benefits \r\n  not only to a couple and family but also to the Church and to the wider culture. \r\n  Couples, churches, and the whole of society have a stake in the well-being of \r\n  marriages. Each, therefore, has its own obligations to prepare, strengthen, \r\n  support and restore marriages. Our nation is threatened by a high divorce rate, a rise \r\n  in cohabitation, a rise in non-marital births, a decline in the marriage rate, \r\n  and a diminishing interest in and readiness for marrying, especially among young \r\n  people. The documented adverse impact of these trends on children, adults, and \r\n  society is alarming. Therefore, as church leaders, we recognize an unprecedented \r\n  need and responsibility to help couples begin, build, and sustain better marriages, \r\n  and to restore those threatened by divorce. Motivated by our common desire that God’s Kingdom be \r\n  manifested on earth as it is in heaven, we pledge to deepen our commitment to \r\n  marriage. With three-quarters of marriages performed by clergy, churches are \r\n  uniquely positioned not only to call America to a stronger commitment to this \r\n  holy union but to provide practical ministries and influence for reversing the \r\n  course of our culture. It is evident in cities across the nation that where \r\n  churches join in common commitment to restore a priority on marriage, divorces \r\n  are reduced and communities are positively influenced. Therefore, we call on churches throughout America to do \r\n  their part to strengthen marriage in our nation by providing: Prayer and spiritual support for stronger marriages Encouragement for people to marry Education for young people about the meaning and responsibility \r\n    of marriage Preparation for those engaged to be married Pastoral care, including qualified mentor couples, for \r\n    couples at all stages of their relationship Help for couples experiencing marital difficulty and \r\n    disruption Influence within society and the culture to uphold the \r\n    institution of marriage. Further, we urge churches in every community to join in \r\n  developing policies and programs with concrete goals to reduce the divorce rate \r\n  and increase the marriage rate. By our commitment to marriage as instituted by God, the \r\n  nature of His Kingdom will be more clearly revealed in our homes, our churches, \r\n  and our culture. To that end we pray and labor with the guidance of the Holy \r\n  Spirit. May the grace of God, the presence of Christ, and the empowerment \r\n  of the Holy Spirit be abundant in all those who so commit and be a blessing \r\n  to all whose marriages we seek to strengthen. Bishop Kevin Mannoia, President National Association of Evangelicals"
    },
    {
      "tag": "div",
      "text": "Bishop Anthony O’Connell, Chairman Dr. Richard Land, President National Conference of Catholic Bishops Ethics and Religious Liberty Commission Committee on Marriage and Family \r\n        Life Southern Baptist Convention"
    },
    {
      "tag": "p",
      "text": "Dr. Robert Edgar, General Secretary National Council of Churches of Christ in the U.S.A.* *Signed 11/14/00; withdrew name 11/17/00"
    },
    {
      "tag": "h2",
      "text": "Background \r\n  on the Christian Declaration on Marriage by Michael J. McManus"
    },
    {
      "tag": "p",
      "text": "The National Association of Evangelicals, \r\n  the National Council of Churches of Christ and America's two largest denominations, \r\n  the Roman Catholic Church and the Southern Baptist Convention — had never \r\n  cooperated on anything prior to signing \"A Christian Declaration on Marriage.\" \r\n  They were moved to do so by the documented disintegration of marriage in America \r\n  and the evidence seen in dozens of American cities \"where churches join \r\n  in common commitment to restore a priority on marriage, divorces are reduced \r\n  and communities are positively influenced,\" as they put it. This memo provides \r\n  data on the scale of the problem as well as an overview of the progress that \r\n  has been made locally when churches \"provide practical ministries and influence \r\n  for reversing the course of our culture.\""
    },
    {
      "tag": "h3",
      "text": "Marriage In America Is Disintegrating"
    },
    {
      "tag": "p",
      "text": "There has been an alarming disintegration of marriage in America: Divorces tripled from 1960 and 1979, rising from \r\n    390,000 to 1,181,000. By 1997 they declined only 1.5% to 1,163,000. More marriages \r\n    now end in divorce than death. The marriage rate fell 35% between 1970 and 1998. \r\n    Only 56% of U.S. adults are married today, down from 73%. There are only 2.38 \r\n    million marriages a year. Cohabitation skyrocketed 10-fold, from 430,000 \r\n    in 1960 to 4.26 million living together in 1998. Cohabitation, not marriage, \r\n    is the dominant way male-female unions are formed. Cohabitation is a double cancer of marriage. a. For millions, cohabitation is a substitute for marriage. Aquarter of unmarried \r\n    women aged 25-39 are currently living with a partner, and an additional quarter \r\n    have done so in the past. According to the University of Wisconsin, of 100 \r\n    couples who begin living together 40 break up before a wedding. One result: \r\n    the number of never-married couples has doubled from 21 million in 1970 to \r\n    46.5 million in 1998, diverting 25 million from getting married at all. b. The second cancer is that cohabitation increases a couple's odds of divorce \r\n    by 50%. What many call a \"trial marriage\" should be more accurately \r\n    termed a \"trial divorce.\" The only question is whether they break \r\n    up before the wedding or afterward. So of the 100 cohabiting couples, 60 will \r\n    marry, but 45 will divorce. That leaves only 15 couples still together after \r\n    a decade! Children of divorce are the greatest victims \r\n    of divorce. They are twice as likely as children from an intact family to \r\n    drop out of school, three times more likely to have a child out of wedlock, \r\n    six times more likely to be in poverty or to commit suicide, and 12 times \r\n    more likely to be incarcerated. Furthermore, as Judith Wallerstein's powerful \r\n    new book, The Unexpected Legacy of Divorce, documents the impact of \r\n    divorce on kids \"grows at least into the third decade.\" Based on \r\n    interviews of 100 children of divorce over 25 years, she reports that \"From \r\n    the viewpoint of the children, and counter to what happens to their parents, \r\n    divorce is a cumulative experience. Its impact increases over time and rises \r\n    to a crescendo in adulthood. In adulthood it affects personality, the ability \r\n    to trust, expectations about relationships and ability to cope with change... \r\n    Anxiety leads many into making bad choices in relationships, giving up hastily \r\n    when problems arise, or avoiding relationships altogether.\""
    },
    {
      "tag": "h3",
      "text": "Good News: Marriage is the Key to Happiness, \r\n  Long Life, Wealth!"
    },
    {
      "tag": "p",
      "text": "As Linda Waite and Maggie Gallagher point out in their important \r\n  new book, The Case For Marriage, married people are healthier, \r\n  happier, wealthier, live longer and have better sex than those who divorce or \r\n  remain single. Oddly, this is news to our culture. Thus, secular evidence backs \r\n  up Scripture. \"The Lord God said, `It is not good for the man to be alone. \r\n  Iwill make a helper suitable for him'\" (Genesis 2:18). Selected \r\n  data in brief: Happiness: Married people are twice as \r\n    likely as those who are single for whatever reason to say they are \"very \r\n    happy.\" Some 40% of married couples say they are very happy, compared \r\n    to 15% of the separated, 18% of the divorced. What's surprising is that only \r\n    22% of the never-married and cohabitors are very happy, the same as widows. Longevity: Amarried man of 48 has an \r\n    88% chance of living until age 65, but a divorced man has only a 65% odds \r\n    of survival! Amarried woman aged 48 has an 92% chance of living to \r\n    age 65; but a divorced woman's odds are only 82%. Divorced men are twice as \r\n    likely to suffer from heart attacks, cancer and four times as likely to be \r\n    in automobile accidents or to commit suicide, reports J.J. Lynch in The \r\n    Broken Heart . Wealth: Amarried couple in their 50's \r\n    in 1994 had net assets of $132,000 or $66,000 per person. However, a divorced \r\n    person's assets are just $33,600. Surprisingly, a never-married individual \r\n    has a net worth of only $35,000; the separated, a pitiful $7,600. Sex: \"Married sex really is better \r\n    sex,\" report Waite and Gallagher. \"Married women are almost twice \r\n    as likely as divorced or never-married women to have a sex life that (a) exists \r\n    and (b) is extremely emotionally satisfying.\" Some 43 percent of married \r\n    men had sex at least twice a week vs. only 26 percent of single men."
    },
    {
      "tag": "h3",
      "text": "Churches Have Proven Answers"
    },
    {
      "tag": "p",
      "text": "Some churches have developed reforms that are preparing \r\n  couples for a lifelong marriage, strengthening existing marriages or saving \r\n  troubled ones. Catholics created strong premarital programs, but many post-marital \r\n  pioneering ministries have come from Protestants: Time: For a generation, most Catholic dioceses \r\n    have required a minimum time of marriage preparation — typically six \r\n    months from the time a priest first meets with the couple, 'til the wedding. \r\n    During that time, many couples are asked to take a premarital inventory to \r\n    give them an objective view of strengths and weaknesses and attend classes \r\n    on such issues as communication and finances. The results of better marriage \r\n    preparation is clear in a recent George Barna survey showing Catholics have \r\n    America's lowest divorce rate. Premarital Inventory: There are two widely used \r\n    premarital inventories, FOCCUS and PREPARE, each taken by about 200,000 couples \r\n    a year. Either can predict with 80% accuracy which couples will divorce. More \r\n    important, a tenth of those who take either inventory, break their engagements. Studies show their scores are equal to those who marry and later divorce! \r\n    Consequently, those couples who break an engagement avoid a bad marriage \r\n    before it begins. Mentor Couples in Marriage Preparation: Mike \r\n    & Harriet McManus trained 52 Mentor Couples in their home church to administer \r\n    a premarital inventory with seriously dating and engaged couples. From 1992-2000 \r\n    Mentors worked with 308 couples. About 50 broke off their relationship/engagement \r\n    -- 16.5% of the total. Thus, those in weak relationships discovered it on \r\n    their own and either broke up or strengthened their union. Mentors also taught \r\n    couples how to improve communication and conflict resolution. Of the 250+ \r\n    who did marry, there are only six known divorces in eight years, a failure \r\n    rate of 2.4%. Marriage Encounter has been attended by 1.6 million \r\n    Catholic couples and 600,000 Protestants. After Lead Couples share intimate \r\n    details of their marriage, attending couples write to each other on assigned \r\n    topics and discuss them privately. The process encourages participating couples \r\n    to communicate more deeply. Sixty studies show that 80% to 90% of attendees fall back in love, and permanently improve the quality of their marriage. Family Life Weekends led by evangelicals are another weekend retreat \r\n    to strengthen marriages. Retrouvaille is a similar weekend retreat developed \r\n    by Catholics. However the Lead Couples are those whose marriages once nearly \r\n    failed. These \"back-from-the-brink\" couples share details about \r\n    how they overcame years of adultery, alcoholism, physical abuse, etc., to \r\n    build solid marriages. The results are stunning. Of 60,000 couples who attended, four out of five couples have rebuilt their marriages. However, in most cities Retrouvaille is held only 2-3 times a year. Marriage Ministry is a similar proven way to \r\n    save couples headed for divorce, but it is based in local churches. Rev. Dick \r\n    & Phyllis McGinnis, formerly of St. David's Episcopal Church in Jacksonville, \r\n    Florida trained seven couples whose marriages nearly failed to help those \r\n    now in trouble. One woman had been in an adulterous affair for eight years. \r\n    Aman was a bisexual who had homosexual affairs. Another was an alcoholic \r\n    who lost his job and was out of work for two years. Yet they identified 17 \r\n    steps all experienced to save their marriages. They shared their path \r\n    of recovery with 40 troubled marriages, and saved 38 of them -- a 95% success \r\n    rate. Marriage Ministry has spread to 25 churches. In seven of \r\n    them, 40 Mentor Couples have worked with 213 troubled marriages, and saved \r\n    193 of them. That's a success rate of 90% in the transplants. Stepfamily Support Groups: Some 46% of all marriages \r\n    today involve at least one spouse who was previously married. Families with \r\n    stepchildren are the most explosive in America -- breaking up at a 65% rate. \r\n    Stepchildren resent their new \"parent\" and often drive them away. \r\n    Rev. Dick Dunn of Roswell United Methodist Church near Atlanta created a \"Stepfamily \r\n    Support Group\" led by couples with truly blended families. Result: four \r\n    out of five couples make it, the mirror opposite of usual failure. These groups \r\n    have been planted in other churches. The core idea of the best programs, summarized in one sentence: In every church there are couples with good marriages who really could be of help to other couples, but have never been \r\n  asked, inspired or trained to come alongside another couple and share their \r\n  wisdom on how to make a marriage successful."
    },
    {
      "tag": "h3",
      "text": "Mentoring Is a Biblical Concept"
    },
    {
      "tag": "p",
      "text": "The mentoring model is based on age-old Biblical principles. \r\n  In his letter to Titus, Paul urged the older women to \"train the younger \r\n  women to love their husbands and children.\" Similarly, the older men are \r\n  to set \"an example\" to the younger men. (Titus 2:3-6). A Marriage \r\n  Savers Church demonstrates, in the area of marriage, that the pastor's task, \r\n  as St. Paul instructed the Ephesians (4:12) is to \"equip the saints for \r\n  ministry\" or to \"train God’s people for service.\" What more \r\n  important ministry or service is there than saving marriages? Who is better \r\n  equipped to lead this ministry or service than married couples in long-term, \r\n  happy marriages?\" Luke 10:1 says Jesus sent his disciples out \"two \r\n  by two.\" Could this not be husband and wife, husband and wife serving as \r\n  Mentor Couples, bringing hope to the marital darkness?"
    },
    {
      "tag": "h3",
      "text": "\"Marriage Saver Churches\""
    },
    {
      "tag": "p",
      "text": "One of the most exciting developments in recent \r\n  years is to witness the emergence of \"Marriage Savers Churches\" in \r\n  all parts of America. Churches of very diverse denominations -- Mainline, Evangelical, \r\n  Pentecostal and African-American churches -- have virtually eliminated divorce! \r\n  Christ Lutheran Church in Overland Park, KS, for example, a congregation of \r\n  1,500 people, has had only two divorces in three years, couples who did not \r\n  seek help. First Assembly of God of Rockford, IL invited the McGinnises to train \r\n  14 \"back-from-the-brink\" couples in their church to work with troubled \r\n  marriages. Local therapists learned about Marriage Ministry and sent \r\n  dozens of their toughest cases to First Assembly. In three years, the Mentors, \r\n  whom they call \"Marriage Savers,\" have met with more than 100 marriages \r\n  headed toward divorce, and saved all but four of them. By contrast, even Christian \r\n  therapists save only 20% of the troubled marriages. Bread of Life, an inner \r\n  city church in Kansas City, KS has had no divorces since training Mentors. The \r\n  same is true of Killearn United Methodist Church, a congregation of 2,500 in \r\n  Tallahassee. Pearce Memorial Church in North Chili, NY has had only one separation \r\n  in two years. An American Baptist congregation, First Baptist of Sioux Falls, \r\n  SD trained 40 couples for marriage, losing none to divorce, and worked with \r\n  10 troubled marriages, losing only one. To learn more, see \"Churches\" These churches are implementing all of the reforms outlined \r\n  above. How? Each has equipped couples with solid marriages to mentor \r\n  other couples. According to their own marital histories, they are trained and \r\n  matched to assist other couples: Avoid a bad marriage before it begins Obtain \"marriage insurance\" as an engaged \r\n    couple Strengthen existing marriages Restore 80% to 90% of troubled marriages Reconcile more than half of the separated Enable 80% of stepfamilies to be successful Iwrote a new Manual To Create a Marriage Savers \r\n  Congregation with details on how to jump-start all of these reforms. The 183-page Manual has different Sections on how Mentor Couples \r\n  can help at all stages of the marital life cycle: preparation, enrichment, reconstruction \r\n  of troubled marriages, reconciliation of the separated and Stepfamilies. There \r\n  are manageable, concrete steps to make it easy for any church to launch these \r\n  ministries. Marriage Savers offers a two-day training of clergy and Mentor Couples \r\n  to immerse them in how to launch Marriage Saver Churches. It is held nationally \r\n  twice a year taught by the pioneers of the ministries outlined above. This training \r\n  is also provided to couples and pastors in cities that adopt a \"Community \r\n  Marriage Policy\" where clergy pledge to start all of these marital reforms."
    },
    {
      "tag": "h3",
      "text": "The Community Marriage Policy"
    },
    {
      "tag": "p",
      "text": "In 1986, at my suggestion, the clergy of Modesto, CA, 95 \r\n  Protestant and Catholic pastors, signed the first Community Marriage Policy \r\n  with the goal \" to radically reduce the divorce rate of those married \r\n  in area churches.\" Fifteen years later, that dream is a reality. The divorce rate has fallen 47.6%, saving about 1,300 marriages a year \r\n  that would have ended in divorce in a county of 400,000 people. (See my column \r\n  on p. 3 for details.) Marriage Savers, has helped create 136 Community Marriage \r\n  Policies or Community Marriage Covenants as some clergy call them, as of February, \r\n  2001. They are in 38 states and range in size from 20 pastors in Culpeper, Virginia \r\n  to 300 clergy who signed in Minneapolis-St. Paul. Most include a commitment \r\n  by Catholic, Mainline, Evangelical and minority pastors to: Normally require a minimum of four months marriage preparation Require the taking of a premarital inventory, a minimum \r\n    of four to eight sessions, meeting with a Mentor Couple to review the inventory \r\n    and to learn communication skills. Train mature married couples to serve as Mentor Couples \r\n    to those preparing for marriage, newlyweds or those experiencing marital difficulties Mentor Couples meet with newlyweds during their first \r\n    year of marriage Strengthen existing marriages by organizing an annual \r\n    enrichment event such as Marriage Encounter, Family Life or \"Ten Great \r\n    Dates\" Restore troubled marriages by creating a Marriage Ministry \r\n    led by \"back-from-the-brink\" couples who share how they have weathered \r\n    life's storms Help the separated to reconcile with a course, \"Reconciling \r\n    God's Way\" Establish Stepfamily Support Groups to help marriages \r\n    with stepchildren to be successful"
    },
    {
      "tag": "h3",
      "text": "Divorces Plunge in 31 Cities with Community \r\n  Marriage Policies"
    },
    {
      "tag": "p",
      "text": "Divorces have plunged in 31 of 33 cities where \r\n  the impact of Community Marriage Policy has been measured with data \r\n  on divorces from county courts. Nationally, U.S. divorces have fallen from 1,181,000 \r\n  in 1979 to 1,163,000 in 1997, a decline of only 1.5% in 19 years. By contrast, \r\n  Modesto's divorce rate plunged a remarkable 47.5% in 15 years. The divorce rate \r\n  is falling even faster in newer CMP cities. In only three years, divorces plummeted \r\n  by 18% in Corvallis, OR and Fremont, NE, by 19% in Chattanooga, and by nearly \r\n  one-third in El Paso (from 3,176 to 2,179) and in Kansas City, KS and two suburban \r\n  counties (from 1,530 in 1995 to only 1,034 in 1998), while divorces actually \r\n  rose across the river in Kansas City, MO and its suburbs! Thus, divorces in \r\n  both Kansas City and El Paso have fallen 22 times more than in the U.S. \r\n  in about one-sixth of the time (3 years vs. 19 years), or more than \r\n  100 times faster than in the U.S."
    },
    {
      "tag": "h3",
      "text": "A National Strategy to Save Marriages"
    },
    {
      "tag": "p",
      "text": "Ours is a nation of 300,000 churches. If only a third trained \r\n  10 Mentor Couples each, there would be one million Mentor Couples! Surely, they \r\n  could save half of the marriages ending in divorce. Can we make that dream a \r\n  reality? Those who created the Christian Declaration on Marriage \r\n  represent 241,177 churches:"
    },
    {
      "tag": "div",
      "text": "Organization Churches People National Council of Churches (35 denominations) 133,370 52,000,000 National Association of Evangelicals \r\n        (51 denominations) 45,000 30,000,000 Roman Catholic Church 19,584 62,018,436 Southern Baptist Convention 40,870 15,729,356 Church of God (Anderson) 2,353 234,311 Total: 241,177 159,982,103"
    },
    {
      "tag": "h3",
      "text": "Conclusion"
    },
    {
      "tag": "p",
      "text": "On the night before he died, Jesus prayed that his followers \r\n  \"may be one, Father, just as you are in me and Iam in you.\" Sadly, \r\n  the Christian church is splintered into scores of denominations and thousands \r\n  of independent churches who never seem to be one. However, in community after \r\n  community, marriage is an issue that is bonding the shattered Christian church. \r\n  Clergy of all faiths have come together in 136 cities to create Community Marriage \r\n  Policies that are driving divorce rates down. Each Covenant is what Jesus called \r\n  a \"city on a hill,\" sending out beams of hope into the marital darkness. \r\n  Every church in America has couples who could help other couples at key stages \r\n  of marriage, building a \"safety net\" under every marriage. God will \r\n  bless our effort to work together to strengthen His first institution. Jesus \r\n  called himself the bridegroom of the church. What God has joined together, the church should hold together. \r\n  This is a new vision for the 21 st Century Church — a noble reaffirmation \r\n  of our common commitment to Jesus Christ on the 2000 th anniversary \r\n  of His birth. Copyright \r\n   2001 Marriage Savers, Inc. All rights reserved."
    }
  ]
}