{
  "url": "http://www.matchtech.com/engineering/power-nuclear/",
  "file_number": "562",
  "content_hash": "1e4c2a5c0d8a1438e36fc705f9a04125352c88dbd1bb8977fcd78b169ca6730f",
  "total_blocks": 245,
  "retained_blocks": 100,
  "ignored_blocks": 145,
  "blocks": [
    {
      "tag": "h1",
      "text": "Matchtech Group plc"
    },
    {
      "tag": "div",
      "text": "human resources for a technical world set te x t size · site map · contact us · help"
    },
    {
      "tag": "div",
      "text": "Log In Matchtech Home Industry Sectors About Us Overview of Matchtech Investor Services Graduates Candidate Services Quick Job Search Advanced Job Search Careers In Recruitment Candidates Register Now Employer Services Search for Candidates Submit a Vacancy Strategic Services"
    },
    {
      "tag": "h3",
      "text": "Power Nuclear Industry News"
    },
    {
      "tag": "p",
      "text": "RWE offers municipal utilities stake in new power plant Energy Business Review 6 November 2006 16:25 Iberdrola gets Quatar power plant contract Energy Business Review 6 November 2006 16:25 Wind farm for Pietramontecorvino E4: Engineering 6 November 2006 15:58 Scottish and Southern Energy's lonely energy research investment Datamonitor 6 November 2006 15:48 RWE offers municipal utilities stake in new power plant Datamonitor 6 November 2006 15:48 Iberdrola gets Quatar power plant contract Datamonitor 6 November 2006 15:48 James Fisher sets up new company Westbury 6 November 2006 15:29 Spain limits conditions on Endesa deal The Times 5 November 2006 23:19 Billion dollar brains Engineer Online 3 November 2006 20:07 Fortum seeking Loviisa license extension Energy Business Review 3 November 2006 05:31 Fortum seeking Loviisa license extension Datamonitor 2 November 2006 21:57 PaR Nuclear wins refuelling contract Engineer Online 2 November 2006 11:06"
    },
    {
      "tag": "h3",
      "text": "Related to Power & Nuclear"
    },
    {
      "tag": "div",
      "text": "Building Structures Construction Management Controls & Automation Facilities Maintenance Petrochemical Water"
    },
    {
      "tag": "h3",
      "text": "Choose Industry Sector"
    },
    {
      "tag": "div",
      "text": "Architecture Building Services Building Structures Construction Management Environmental Engineering & Science Geotechnical Engineering Highways & Transportation Railway Infrastructure Surveying Aerospace Automotive Controls & Automation Defence Electronics & Software Systems Facilities Maintenance Food & Drink General Design Engineering & FMCG Manufacturing Engineering Marine Offshore & Subsea Overseas Vacancies Petrochemical Pharmaceutical & Biotechnology Power & Nuclear Production & Skilled Trades Production Maintenance Quality Rail Vehicles Telecoms & Broadcast Water IT Home Banking, Finance & Insurance Development ERP & CRM Helpdesk IT Management & Executives IT Sales Support & Training Science Home Clinical Science Environmental Laboratories Food & Drink Petrochemical Pharmaceutical & Biotechnology Physics & Materials Power & Nuclear Water Graduates Human Resources & Personnel Logistics & Distribution Procurement & Supply Chain Public Sector Sales & Marketing"
    },
    {
      "tag": "h2",
      "text": "Power & Nuclear"
    },
    {
      "tag": "h4",
      "text": "Industries » Engineering » Power & Nuclear Jobs"
    },
    {
      "tag": "p",
      "text": "Our Power & Nuclear Division provides specialist expertise in both permanent and contract engineering recruitment for design, construction, installation and maintenance throughout the power generation and nuclear reprocessing industries. Our experience covers a wide range of client types, from generators of both nuclear and conventional power through to EPC contractors, consultants and special purpose equipment manufacturers. Our dedication to providing professionals who exactly match individual client needs has been the foundation of our continuing success - with independent confirmation of our abilities being proven through our achievement of Preferred Supplier status with a great many clients. Candidates who are interested in Power & Nuclear careers can register now to apply online for any of the advertised vacancies or send a copy of their CV to powernuclear@matchtech.com ."
    },
    {
      "tag": "h3",
      "text": "Search for jobs"
    },
    {
      "tag": "div",
      "text": "Keywords or Job Id — help Contract or permanent Either Contract Permanent Within Industry sector -- All Sectors -- Architecture Building Services Building Structures Construction Management Environmental Engineering & Science Geotechnical Engineering Highways & Transportation Railway Infrastructure Surveying Aerospace Automotive Controls & Automation Defence Electronics & Software Systems Facilities Maintenance Food & Drink General Design Engineering & FMCG Manufacturing Engineering Marine Offshore & Subsea Overseas Vacancies Petrochemical Pharmaceutical & Biotechnology Power & Nuclear Production & Skilled Trades Production Maintenance Quality Rail Vehicles Telecoms & Broadcast Water All IT Jobs Banking, Finance & Insurance Development ERP & CRM Helpdesk IT Management & Executives IT Sales Support & Training All Science Jobs Clinical Science Environmental Laboratories Food & Drink Petrochemical Pharmaceutical & Biotechnology Physics & Materials Power & Nuclear Water Graduates Human Resources & Personnel Logistics & Distribution Procurement & Supply Chain Public Sector Sales & Marketing"
    },
    {
      "tag": "div",
      "text": "Summary of all jobs in this sector"
    },
    {
      "tag": "h2",
      "text": "Power & Nuclear Jobs"
    },
    {
      "tag": "p",
      "text": "The 20 most recent Power & Nuclear jobs are listed below. Please refine your search or click \"Show more\" at the bottom of this page to see more."
    },
    {
      "tag": "div",
      "text": "Power & Nuclear jobs RSS feed — What is an RSS feed ?"
    },
    {
      "tag": "h3",
      "text": "Location: Cardiff HOT! C&I Engineer — Contract — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Rate: £28.00 to £32.00 /hour View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Strong background in instrument design in clean conditions Reporting to the Design Manager the job holder is required to take responsibility for the design, testing and commissioning of the control and instrumentation systems on a new multi-million pound process plant."
    },
    {
      "tag": "h3",
      "text": "Location: Cheshire HOT! Expeditor — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £30,000 to £40,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Expediting experience The companys is an established international process contractor, building and designing facilities in the UK and overseas.  They have a worldwide reputation for excellence in executing technology driven projects across a wide range of business."
    },
    {
      "tag": "h3",
      "text": "Location: Cheshire HOT! Senior Buyer — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £30,000 to £40,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Solid Purchasing Experience The Company is an established international process contractor, building and designing facilities in the UK and overseas.  they have a worldwide reputation for excellence in executing technology driven projects across a wide range of business sectors."
    },
    {
      "tag": "h3",
      "text": "Location: Cheshire HOT! Project Procurement Manager — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £35,000 to £50,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: PPM skills in oil/chemical industry The company is an established international process contractor, building and designing facilities in the UK and overseas.  We have a worldwide reputation for excellence in executing technology driven projects across a wide range of business areas"
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Panel Wirer — Contract — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Rate: £12.00 to £13.50 /hour View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Previous experience Our client requires a panel wirer to work a 6 month contract based in Aberdeen."
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Procurement Officer — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (CVs being submitted) Salary: £20,000 to £25,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Procurement knowledge We are looking for candidates who are skilled in the above duties or similar duties and using the SAP system or equivalent in a similar working environment to work for a Subsea Engineering company."
    },
    {
      "tag": "h3",
      "text": "Location: Teesside Machinist — Contract — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Rate: £9.30 to £15.91 /hour View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Time or Apprentice served We are looking for two Machinists for a contract role lasting in to 2007."
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Purchasing Specialist — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £20,000 to £30,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Procurement knowledge/experience We are recruiting for one of the premier subsea engineering companies in Aberdeen. They are looking fot a Purchasing specialist to join the team as a result of a high workload."
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Sub-Contracts Administrator — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £30,000 to £40,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Admin / Commercial experience We are recruiting for an international energy services company, providing a range of engineering, production support, maintenance management and overhaul and repair services to the oil & gas, and power generation industries worldwide."
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Commercial Assistant — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (CVs being submitted) Salary: £20,000 to £30,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: IT Literate We are recruiting for an international energy services company, providing a range of engineering, production support, maintenance management and overhaul and repair services to the oil & gas, and power generation industries worldwide."
    },
    {
      "tag": "h3",
      "text": "Location: Fleet Procurement Manager — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (CVs being submitted) Salary: £40,000 to £50,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Procurement Managerial Experience The Southern Regional Construction Business is  planning to expand from 30 to 50 million over the next few years. They are seeking to recruit a Procurement Manager to take responsibility for all procurement activities within the region"
    },
    {
      "tag": "h3",
      "text": "Location: Tyneside Mechanical Engineer — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: from £25,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Prepared to work in the north east Mechanical Engineers required who can provide multi-disciplined technical solutions to a wide range of industries."
    },
    {
      "tag": "h3",
      "text": "Location: Swindon Project Manager — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £45,000 to £60,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Proven track record in the Project Management of complex projects. Our client is responsible for the successful delivery of a large investment programme in both conventional and renewable power projects."
    },
    {
      "tag": "h3",
      "text": "Location: International Customer Support Engineer (Mechanical) — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (CVs being submitted) Salary: from £25,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Mechanical maintenance Mechanical Field Service Engineer required with installation and fault finding experience"
    },
    {
      "tag": "h3",
      "text": "Location: International Customer Support Engineer (Electrical) — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (Now Interviewing) Salary: from £25,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: electrical experience Field Service Engineer required with strong electrical and control systems experience"
    },
    {
      "tag": "h3",
      "text": "Location: Aberdeen Expeditor — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required (CVs being submitted) Salary: £25,000 to £30,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Expediting Materials Experience We are recruiting for and Expeditor on behalf of an offshore diving equipment company in Aberdeen."
    },
    {
      "tag": "h3",
      "text": "Location: Selby Instrument Engineer — Contract — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Rate: £30.00 to £36.00 /hour View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Power exp Design, specification, installation, testing and commissioning of new and replacement process instruments interfacing to monitoring/control systems for the Power Generation business."
    },
    {
      "tag": "h3",
      "text": "Location: Reading Optics Specialist — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: negotiable View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Physics background Optics Specialist required for Project Orion, an exciting and ambitious new project to construct a world leading laser facility for the creation and study of hot, dense matter."
    },
    {
      "tag": "h3",
      "text": "Location: Surrey Civil & Structural Design Manager — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: £50,000 to £60,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: 15 years experience Our client is a worldwide supplier of industrial gases and equipment, specialty and intermediate chemicals, and environmental and energy systems. Asenior engineer is being sought to take on a management role. Acompany car/car allowance is provided."
    },
    {
      "tag": "h3",
      "text": "Location: Various Field Service Engineer — Permanent — Similar Jobs"
    },
    {
      "tag": "div",
      "text": "Status: Applicants Required Salary: up to £40,000 View & apply"
    },
    {
      "tag": "h3",
      "text": "Details"
    },
    {
      "tag": "div",
      "text": "Important: Service experience Commissioning, fault finding to component level and servicing the range of products manufactured and supplied by the company and associated companies.  The job requires extensive travel both within the UK and world wide."
    },
    {
      "tag": "p",
      "text": "The 20 most recent jobs in this sector are listed above. Please refine your search or click \"Show more\" to see the rest. Show more You can also view all vacancies in this sector."
    },
    {
      "tag": "p",
      "text": "Designed and Developed by Matchtech Group plc © 2002-2006 Matchtech Group plc. Company Registration No.4426336. All rights reserved · Terms of Access · Disclaimer · Privacy Statement"
    }
  ]
}