{
  "url": "http://www.mccoyconsulting.com/interest.htm",
  "file_number": "564",
  "content_hash": "0490d8a5dfe65ffee2750495a86d1acd0af932a8a67d91c4b6b30d567e317598",
  "total_blocks": 51,
  "retained_blocks": 4,
  "ignored_blocks": 47,
  "blocks": [
    {
      "tag": "div",
      "text": "Home"
    },
    {
      "tag": "p",
      "text": "About Doug McCoy Expert Testimony Articles & Manuals Speeches Helpful Links"
    },
    {
      "tag": "p",
      "text": "McCoy Consulting, Inc. Contact\n            Information Mailing\n            Address P.\n            O. Box 491540 Lawrenceville,\n            Georgia 30049 Shipping\n            Address 1000 Hurricane Shoals Rd Bldg A, Suite 160 Lawrenceville, Georgia 30043 678-407-1663\n            phone 770-962-8120 direct 770-963-7678 fax Email\n            Address doug@mccoy.net 2001 Robert Holmes' CI Development You are Visitor"
    },
    {
      "tag": "p",
      "text": "McCoy Consulting now offers\r\nindependent adjusting services for complex workers' compensation claims. Doug McCoy is Principal of McCoy\r\nConsulting, Inc. Established in January of 1997, McCoy Consulting, Inc. is an independent firm\r\nthat provides\r\n    consulting services to stakeholders in the property casualty insurance\r\nindustry and expert testimony. Mr. McCoy began his career as a multi-line claim adjuster\r\n    in the property casualty claim operation of a major insurer, holding a variety of field\r\n    and home office management assignments. During the next few years, he held numerous senior\r\n    level management positions including National Director for the Workers Compensation Claim\r\n    Department. Key accomplishments included new product development for workers compensation\r\n    claim management, productivity improvement, and strategic realignment in the managed care\r\n    and claim management environments. In 1992 Mr. McCoy became Divisional Vice President of\r\n    Commercial Lines responsible for creating a new division of the company (Tower Risk\r\n    Services), which specialized in product development and marketing of insurance products to\r\n    large national accounts. In 1994 he became the Chief Operating Officer of TMMS,\r\n    Inc., the largest workers compensation managed care organization in the country, offering\r\n    disability case management, utilization management and medical cost containment. Charged\r\n    with the overall management responsibility of TMMS, Mr. McCoy acquired in-depth industry\r\n    knowledge of the challenges and demands in an integrated setting. As an experienced COO in\r\n    this ever-changing environment, he offers practical insight concerning complex workers\r\n    compensation issues in both claim management and managed care. Mr. McCoy’s extensive industry experience includes\r\n    representation on the following committees: National Council on Compensation Insurance\r\n    Fraud Study Committee, Governor’s Study Committee on Workers Compensation, Governor's Workers' Compensation Review\r\n    Commission, Warm\r\n    Springs Institute for Rehabilitation Advisory Committee, Learning Services Head Injury\r\n    Center Advisory Committee, Pharmacy Management Services, Inc., Advisory\r\n    Committee, Georgia CompScope™ Multi-state Advisory\r\n    Committee for the Workers Compensation Research Institute of Cambridge,\r\n    Massachusetts Mr. McCoy currently serves as a member of the\r\nLicensure and Self-Insurance Sub-Committee of the Chairman's Advisory Committee for the Georgia State Board of Workers\r\n    Compensation. Mr. McCoy has spoken on numerous topics concerning claim\r\n    management throughout the country ( see\r\n    speaking engagements ) and has been featured in industry publications such as Business\r\n    Insurance, Risk and Insurance Management, Rough Notes and the Wall Street Journal. Mr. McCoy has written several Workers Compensation Claim\r\n    Management Manuals in his capacity including: Claim Management Best Practices,\r\n    Occupational Exposure to Bloodborne Pathogens, HIV in the Workplace, Fraud Awareness,\r\n    Americans With Disabilities, Art of Negotiations Training, Utilization Management\r\n    Training, and the nationally recognized Workers Compensation Training Program. \r\nMost recently LexisNexis has published his book\r\nentitled, Workers' Compensation: The Survival Guide for Business He was also Contributing Editor of Pictorial,\r\n    Managed Care Strategies. Other articles he has written include: Workers Compensation\r\n    Problems of Small Business Can be Solved by Group Self-Insurance, and ADA\r\n    Soup: Employers, Workers Compensation and the ADA. Mr. McCoy currently serves on the Board of Directors for Kids' Chance, Inc. and Kids' Chance of America. Mr. McCoy is a Certified Workers' Compensation\r\n    Professional, Legal Principles Claim Specialist, Casualty Claim Law Associate, Workers' Compensation Claim Law Associate, \r\nFraud Claim Law Associate, Senior Claim Law Associate and holds a license as a workers' compensation claim\r\nadjuster in Georgia, Michigan and Texas. He is a member of the Society of Claim Law Associates\r\n    ( SCLA ) and serves as the\r\nTreasurer for the Society."
    }
  ]
}