{
  "url": "http://www.mcz.com/sport/fatboys.htm",
  "file_number": "565",
  "content_hash": "c498eb2df205689533091b05053fe940e4a777459d09204378b4beaf959361f8",
  "total_blocks": 49,
  "retained_blocks": 2,
  "ignored_blocks": 47,
  "blocks": [
    {
      "tag": "div",
      "text": "-- edit title -- 'Fat\r\nBoys' Coming To A Field Near You"
    },
    {
      "tag": "p",
      "text": "By\r\nJoe Davidson Sacramento Bee Staff Writer (Published\r\nNov. 24, 2000) Grayling Love has\r\na fraternity, no table manners required. Valley\r\nHigh School's monstrous lineman requires that interested members have two\r\nprimary interests: Football and the need to throw down, as in large increments\r\nof food with little regard to style or tack. You know, treat every club meal\r\nlike a pie-eating contest at the county fair. Love\r\nfounded the eat-and-be-merry group with teammate Josh O'Meara, and they slapped\r\nthe appropriate title on it: \"The Fat Boys.\" Every so often the rotund\r\ngroup of 20 teenagers ambushes the Hometown Buffet in Laguna and bellies up. \"Oh,\r\nit's cool,\" Love said. \"We're proud of our fat. Our initiation for\r\nnewcomers is for them to take their shirts off and dig in on a plate of ice\r\ncream and cookies. We have them dig in until the manager makes them put their\r\nshirt back on because we're scaring the customers.\" Truth\r\nbe told, Love is more substance than flab. He's a well put-together package of\r\nsize -- 6-foot-3, 290 pounds -- agility and skill, and he's one of the most\r\nheavily recruited linemen to come out of Sacramento. His first recruiting trip\r\nnext month is enough to make any high school athlete drool with envy: Notre\r\nDame. Love\r\nloads up on honors classes such as calculus, piles on the calories and then\r\nunloads on the poor chap in front of him on game night. Love's\r\nextended fraternity -- and potential recruits to the college ranks and the\r\n\"Fat Boys\" -- includes four additional movers and shakers in the\r\nSac-Joaquin Section Division Iplayoff field. If they haven't bumped bellies\r\nbefore, they surely must now to survive the coming weeks. Elk\r\nGrove's Mitch Quist, Nevada Union's Jason Leach and the Grant tonnage of Joe\r\nWolford and Izacc Ramirez share the same bond: Loud and proud, large and in\r\ncharge. Each senior is a field-tilting jovial giant. Each is silly and quirky,\r\nattributes that belie their brutish Friday night behavior. And\r\neach is motivated to bring his team a championship, the fuel coming from the\r\nstill-digesting eats on their favorite holiday -- Thankgiving. \"Ithink the coaches worry we might eat too much on Thanksgiving,\" Love said.\r\n\"Sorry, but big guys have to eat.\" Love\r\ncould run into Leach on every snap tonight in a quarterfinal game at Nevada\r\nUnion. Like their counterparts, Love and Leach play both sides of the ball,\r\nclogging up holes as tackles or creating them with drive blocks. If Love\r\ndoesn't wind up offering Leach a \"Fat Boys\" T-shirt, he'll surely\r\nnotice the hair. Leach's\r\nmother, Carol, was only mildly surprised that she found her kitchen doubling as\r\na mini-salon the other night. Leach, who normally has light brown hair, became a\r\nfull-bore blond after a bleach job, then supervised the treatment of two\r\nteammates he brought with him, Fred Anderson and Jake Curtis. \"Ithink the bigger they are, the sillier they become,\" Carol Leach said.\r\n\"Jason's definitely flamboyant.\" He's\r\nalso an intriguing prospect. At 6-2 and 295, Leach has SAT scores similar to\r\nthat of Love's, in the 1,200 range. \"He's\r\ntoo big for our program,\" NU coach Dave Humphers said. \"We're used to\r\nhaving the 5-7, 165-pound linemen. But he's good. They must have family stock in\r\nCostco.\" Quist\r\ngot into the hair thing back in the heat of September, before the opener against\r\nNapa. The most seasoned lineman of the lot -- he's a third-year starter -- Quist\r\nthought the best way to usher in his final season would be to change his\r\nbrownish locks to a blinding blond. As for motivation, we're not just talking\r\nfootball here. \"Hey,\r\nthe girls dig it,\" Quist said. Abrute\r\nat 6-1 and 265 pounds of fury, Quist can bring a weight room to a standstill. He\r\ncan squat some 540 pounds, applying the leg strength that made him an All-City\r\nwrestler last fall. He admits to being something of \"a savage,\" having\r\nbusted six chin straps this season. Quist\r\nonly has to look across the dinner table to discover the source of his zany\r\npersonality. Older brother Mike used to do back flips at basketball games to\r\npump up the crowds. Now he coaches his kid brother on the finer points of\r\nknocking people on their duffs. Quist\r\nwas named homecoming king, an announcement that nearly brought him to tears. Said\r\nMike: \"Iwas homecoming king here a few years ago. And, like Mitch, it was\r\nbased on weight and good looks.\" At\r\nGrant, practices are often laced with barbs between Wolford and Ramirez. But in\r\nthe heat of battle, few tandems are more potent or proven. They dominated\r\nopponents down the stretch in leading the Pacers to the section championship\r\nlast fall. Tonight\r\nthey'll tangle with Quist and Co. for a berth in the City Championship game\r\nagainst the winner of the Valley-NU contest. At 6-2\r\nand 310 pounds, Ramirez says he backs down to no man. Unless his name is Mike\r\nAlberghini. Ramirez was so smitten with the Grant coach that he pleaded with his\r\nfamily to return him to Del Paso Heights so he could play for the Pacers,\r\nfollowing a six-month stay in Southern California his sophomore year. Atrue\r\nhighlight came last year, when he was chewed on so hard by Alberghini that he\r\ncried. \"Ihave no problem with that,\" Ramirez said. Ramirez\r\nand Wolford were assigned the task of being mentors to new linemen this fall. They've\r\ndone it with equal parts teaching and humor. Wolford\r\ndrives his coaches nuts with his constant yammering, about how skilled and tough\r\nhe is, how he can't wait to cash in on millions in the NFL, about how sleek and\r\n\"sexy\" he looks now that he's slimmed down a bit. Sure.\r\nFrom 276 last year to 275 now. His teammates crack that he's so hairy he's their\r\n\"Teen Wolf.\" Alberghini\r\nkeeps Wolford -- arguably\r\nthe top center in the region -- humble by saying he could make a lot of money\r\nhiring himself as a mascot -- \"He's Chuck E. Cheese without the rat\r\ncostume.\" \"That's\r\nOK,\" Wolford says. \"Everyone knows who the best player is around\r\nhere.\" Of the\r\nbunch, Love has no idea where he got his size. His mother, Catherine, is all of\r\n5-1. His dad, Grayling Sr., is barely 6-1. The closest either parent got to\r\nfootball in college was when Mom participated in the marching band at Michigan\r\nState. Love's\r\nathletic skills don't make a lot of sense, either. The first time Valley coach\r\nJay Whinery caught a glimpse of Love this summer, he asked his assistants to\r\nconfirm that Love had just jumped up and hung on the crossbar with nary an\r\neffort. Last\r\nspring, Love earned team MVP honors in baseball, gassing opponents -- including\r\ntop-ranked Laguna Creek -- with his nasty circle changeup. He cracked five home\r\nruns and was a sight to behold chugging around the bases in a uniform that\r\nlooked like it was painted on. \"He's\r\nan incredible athlete, a freak of nature,\" Valley assistant coach Abe\r\nSnobar said. \"Imean, he can throw a football 50 yards. He was our kicker\r\nlast year. And he's humble about everything.\" Except\r\neating, that is. 2000 Sacramento Bee EMail your comments to\r\nSport Authority host David Kennedy here : sports@mcz.com Return to The Sport Authority"
    }
  ]
}