{
  "url": "http://www.michaelgreer.com/keep_moving.htm",
  "file_number": "571",
  "content_hash": "0757a7fb70c89d6e5602d947b3daeb2c8c75e7190eabd364e7e4ef9a0356b6d7",
  "total_blocks": 65,
  "retained_blocks": 16,
  "ignored_blocks": 49,
  "blocks": [
    {
      "tag": "div",
      "text": "msnavigation mstheme"
    },
    {
      "tag": "p",
      "text": "Contact Greer"
    },
    {
      "tag": "div",
      "text": "mstheme msnavigation mstheme"
    },
    {
      "tag": "h1",
      "text": "mstheme KEEPING\r\nTHINGS MOVING: A To Do List and Items to Help You\r\nExecute, Control, and Close Out Your Project mstheme"
    },
    {
      "tag": "p",
      "text": "(This is a sample tool from The\r\nProject Manager's Partner , by Michael Greer.) (Get here by mistake? Return to Michael Greer's Project Management Resources\r\nhome page. )"
    },
    {
      "tag": "div",
      "text": "msthemeseparator"
    },
    {
      "tag": "p",
      "text": "Instructions : After your project plan is\r\napproved and you are up and running, you can use the checklist below and related\r\nitems to help you keep things moving according to your plan. Go through this\r\nlist at least weekly for each project you are managing. CHECK YOUR PROJECTS SCOPE. Refresh your memory about your projects goals and\r\nboundaries. In particular, make sure you have a clear picture of what the\r\ndesired results should be at this point relative to deliverables, schedule\r\ncosts, quality, and so on. (See Worksheet: Project Scope Statement* under Action\r\nItem: Describe Project Scope if you dont already have a formal scope\r\nstatement.*) CHECK YOUR DELIVERABLES. Analyze the status of each project deliverable. Are they\r\nevolving as planned? If appropriate: 1. Locate lists of quality criteria that may be applied to\r\ninspect the quality and completeness of the deliverables at this stage of the\r\nproject. 2. Check contractors proposals or contracts to make sure\r\nyou know what they should be supplying at this point. 3. Inspect all project deliverables. 4. Decide whether to accept inspected deliverables or to\r\nrequire rework. (See Worksheet: Project Deliverables Status Analyzer .*) CHECK YOUR SCHEDULE. Examine your milestones, key dates, and critical path. Are you\r\nwhere you need to be? ANALYZE VARIANCES (DEVIATIONS FROM PLAN) BY COMPARING\r\nESTIMATED TO ACTUAL. 1. Are activities taking longer than planned? (Are you\r\nexceeding estimates of duration?) 2. Are you using more resource hours than you planned? 3. Are your actual costs exceeding your estimated costs? 4. If minor variances are discovered (variances that can be\r\nresolved easily without changing the plan or scope), then resolve them. 5. If major variances are discovered (variances that change\r\nthe scope or constitute significant project issues), then handle them as\r\ndescribed in the steps below."
    },
    {
      "tag": "div",
      "text": "(See Worksheet: Variance Analyzer .*)"
    },
    {
      "tag": "p",
      "text": "ADDRESS SCOPE CHANGES. 1. Identify changes in scope (changes in deliverables,\r\nschedule, costs, etc.). 2. Handle scope changes, if necessary. (See Guidelines: Handling Scope Change * and Worksheet:\r\nProject Scope Change Order .*) LIST, TRACK, AND TRY TO RESOLVE OPEN ISSUES. 1. Make a list of all the unresolved issues, or 2. Revisit the list of open issues from the last inspection\r\nperiod and try to resolve them. (See Worksheet: Project Issue Tracker .*) REVISIT POTENTIAL PROJECT RISKS. 1. Locate the Risk Management Plan, if one has been created. 2. Note particularly whether any of the ongoing events or\r\nupcoming events are identified in the risk management plan as particularly\r\nvulnerable to risk. REPORT PROJECT STATUS. 1. After completing the checks above, if you havent already\r\ndone so, talk to your team members and determine their perspective on project\r\nstatus. 2. Create and circulate a project status report. (See Worksheet: The Project Status Report .*) DRIVE FOR CLOSE-OUT OF ACTIVITIES AND SIGN-OFF OF\r\nDELIVERABLES AS APPROPRIATE. 1. Ask yourself, What activities can Iclose out? Which\r\ndeliverables can Iget formally approved and signed-off? 2. Prepare and get signatures on sign-off forms as\r\nappropriate. (See Worksheet: Sample Project Sign-off Form * under\r\nAction Item: Close Out Project Activities.*) DECIDE WHETHER ITS NECESSARY TO KILL THE PROJECT, THEN\r\nDO SO IF APPROPRIATE. (See Appendix E: GuidelinesWhen to Kill the\r\nProject. *) CREATE A LIST OF LESSONS LEARNED. Create a list of lessons learned that describes the ways\r\nsubsequent project activities must be modified in order to prevent the\r\ndifficulties encountered up to this point. COMPLETE APPROPRIATE EVALUATION CHECKLISTS."
    },
    {
      "tag": "div",
      "text": "Complete evaluation checklists, if applicable, and file them as\r\npart of the official project records. msthemeseparator"
    },
    {
      "tag": "p",
      "text": "* This item is located in The\r\nProject Manager's Partner , by Michael Greer"
    },
    {
      "tag": "div",
      "text": "msthemeseparator"
    },
    {
      "tag": "p",
      "text": "Do you like this tool? The  latest edition of The Project Manager's Partner: A Step-by-Step\r\nGuide to Project Management contains 57 tools, checklists, and\r\nguidelines to help project managers. For more information, click on the link above or phone HRD Press at\r\n(800) 822-2801. Would you like a custom-tailored, on-site PM workshop for your organization? Click here to check out the\r\npossibilities or send an e-mail to info@michaelgreer.com ."
    },
    {
      "tag": "div",
      "text": "msthemeseparator"
    },
    {
      "tag": "p",
      "text": "(C) Copyright 2004 from Michael\r\nGreer's Project Management Resources web site.\r\n The URL is http://www.michaelgreer.com .\r\nFor more information, send e-mail to info@michaelgreer.com . -- Feel free to copy and distribute for\r\ninformational (not-for-profit) purposes. Return to Michael Greer's Project Management Resources\r\nhome page."
    },
    {
      "tag": "div",
      "text": "mstheme msnavigation msnavigation"
    }
  ]
}