{
  "url": "http://www.mndaily.com/daily/2001/01/18/news/new6/",
  "file_number": "578",
  "content_hash": "9772902a5357900272cda856ad8eac87f51820b63e86731d5e02a9a5f43afd3f",
  "total_blocks": 284,
  "retained_blocks": 13,
  "ignored_blocks": 271,
  "blocks": [
    {
      "tag": "div",
      "text": "Daily \n                          Employment"
    },
    {
      "tag": "p",
      "text": "PrimeAdplace <A HREF=\"http://www.mndaily.com/cgi-bin/webadverts2/ads.pl?banner=NonSSI;setdest=applecomputers;page=01;zone=C\">\n                          <IMG SRC=\"http://www.mndaily.com/cgi-bin/webadverts2/ads.pl?setdest=applecomputers;page=01;zone=C\"></A>"
    },
    {
      "tag": "div",
      "text": "Keyword Search Engine Begin: Keyword Search: Keyword Search Engine End Begin Uof Mlogo End Uof Mlogo Begin CampusEngine watermark End CampusEngine watermark Begin SteamTunnels Logo End SteamTunnels Logo Your \n                          Screen Resolution We recommend 800x600+ Ad space begins"
    },
    {
      "tag": "p",
      "text": "begin banner ad 1 end banner ad 1 Ad space ends Thursday, January 18, 2001 ____"
    },
    {
      "tag": "div",
      "text": "Old Backtalk Navbar\n\t\t\t<DIV ALIGN=\"center\">\n                    <Ahref=\"http://www.mndaily.com/daily/2001/01/18/feature_photos\"><img src=\"http://www.mndaily.com/newpage/images/fphotos.gif\" height=\"31\" width=\"100\" border=\"0\"></a>                    <Ahref=\"http://www.mndaily.com/daily/2001/01/18/backtalk/crossword\"><img src=\"http://www.mndaily.com/newpage/images/crossword.gif\" height=\"31\" width=\"100\" border=\"0\"></a>                    <Ahref=\"http://www.mndaily.com/daily/2001/01/18/backtalk/drdate\"><img src=\"http://www.mndaily.com/newpage/images/drdate_t.gif\" width=\"100\" height=\"31\" border=\"0\"></a>                    <Ahref=\"http://www.mndaily.com/daily/2001/01/18/backtalk/network\"><img src=\"http://www.mndaily.com/newpage/images/network.gif\" width=\"100\" height=\"31\" border=\"0\"></a><p>\t\t\t</DIV>\nEnd old backtalk navbar ONLINE EXTRA Blood transfusion from baby brother proves successful"
    },
    {
      "tag": "p",
      "text": "- STORY BEGIN - K.C. Howard - Staff Reporter With her brother's bone marrow cells thriving inside her, six-year-old Molly Nash returned home to Englewood, Colo. after 118 days at Fairview-University Medical Center. Molly received a life-saving blood transfusion from her newly born brother Adam on Sept. 26, which spared her from a fight against Fanconi anemia. The rare recessive disease causes bone marrow failure in its victims, deteriorating their immune systems. This potentially fatal illness caused several birth defects in Molly, including two holes in her heart and no thumbs or hip sockets. She was also born without a portion of her brain. \"Molly knows more about life than any child her age should,\" said  Sarah Youngerman, the public relations coordinator for the Academic Health Center. After eight reconstructive surgeries, Molly's birth defects were no longer inhibiting. Her weak immune system, however, was threatening her survival. To beat this potentially fatal disease, University doctors used umbilical cord blood from Adam. His healthy blood cells then destroyed and took over Molly's malignant bone marrow, allowing her to efficiently produce red blood cells, white blood cells and platelets. This transfusion was the first of its kind because Molly's cure -- her brother Adam -- was genetically selected as a healthy embryo and perfect blood donor for Molly. Genetic selection of children is controversial, but Youngerman said that most people are very supportive of the Nashes' decision and are happy to hear that Molly is recovering more quickly than expected. \"Adam's bone marrow has completely taken over and her white cells are cured,\" said University cord blood specialist Dr. John Wagner, who performed the procedure. He added that although the transfusion increased Molly's chances of survival, she will still be more receptive to cancer than most people. Molly will return to Minnesota for checkups in April and September. To protect herself from infections that could damage her healing immune system, Molly must stay indoors and wear a mask until her immune system has completely recovered. \"Molly is a very sophisticated girl,\" Youngerman said, \"though she knows she can't be exposed to people, even if she misses out on going to restaurants with her family.\" But in the fall, Youngerman said, Molly looks forward to attending second grade at a local school. K.C. Howard welcomes comments at khoward@daily.umn.edu - STORY END -"
    },
    {
      "tag": "div",
      "text": "NEWSIMAGE NEWSPHOTO"
    },
    {
      "tag": "p",
      "text": "NEWSHEADLINE NEWSINTRO"
    },
    {
      "tag": "div",
      "text": "SPORTSIMAGE imagenewsTIFF SPORTSPHOTO"
    },
    {
      "tag": "p",
      "text": "SPORTSHEADLINE SPORTSINTRO"
    },
    {
      "tag": "div",
      "text": "Begin Backtalk nav bar End Backtalk Navbar News Officials break ground for light rail Michigan court takes on race in admissions Mason to stay at Uafter OSU hires Tressel Entrepreneur, Ualumnus Ted Mann dies Monday of stroke at age 84 Northrop restoration seeks better student accessibility, events Blood transfusion from baby brother proves successful Carlson School earns high ratings from academic journal Feature Photos Sports Gophers start fast, hang on for Big Ten Barn-burning win Border battle weekend has huge conference implications Lawerence named Big Ten wrestler of the week Editorial/Opinions Editorial : Adecade after Gulf War, sanctions still persist Editorial : Regulating genetic engineering Balancing between prisons and the press The truth about Pygmalion finally revealed Letters to the Editor Editorial Cartoon Business Ad space begins"
    },
    {
      "tag": "p",
      "text": "begin banner ad 2 end banner ad 2 Ad space ends Mn SCHOOL OF BARTENDING BANNERAD HERE! Link to comments page here What's up with the new design? news | editorial | sports | photos | business | daily employment archives | classifieds | staff | about \n                    the daily | Associated \n                    Press © \n                    2000 Minnesota Daily, all rights reserved"
    },
    {
      "tag": "div",
      "text": "place directly before </body> tag"
    }
  ]
}