{
  "url": "http://www.mnllp.com/EEnivfamily.html",
  "file_number": "579",
  "content_hash": "bc215a4171c5f7d5ed84ce771725ed59871ab82907cfbaeaf340386efdd68f9a",
  "total_blocks": 88,
  "retained_blocks": 24,
  "ignored_blocks": 64,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\" Immigration: \n\nNonimmigrant Visa (Family-Based).  Derivative visa and/or status based\n\non a relationship to a nonimmigrant visa holder."
    },
    {
      "tag": "p",
      "text": "Nonimmigrant\n\nVisa (Family-Based) General 8 Immigration\n\nNews/Updates : News/Updates General Aforeign national can apply for a derivative\n\nnonimmigrant visa if he/she is the spouse or child of a non immigrant\n\nvisa holder (see below for the use of the B-2 nonimmigrant visa for \"cohabitating\n\npartners\")."
    },
    {
      "tag": "blockquote",
      "text": "Other Sites:"
    },
    {
      "tag": "p",
      "text": "8 For\n\nfamily members of United States Citizens , please see U.S.\n\nCitizen's Spouse:  Immigrant Visa \"Green Card,\" including the\n\n\"K\" visa categories."
    },
    {
      "tag": "blockquote",
      "text": "8 For\n\nfamily members of Legal Permanent Residents , please see Immigrant\n\nVisa \"Green Card\" ."
    },
    {
      "tag": "p",
      "text": "Nonimmigrant\n\nVisa - Family Members"
    },
    {
      "tag": "blockquote",
      "text": "As a spouse\n\nor child of a nonimmigrant visa holder, a foreign national can normally\n\nobtain a \"derivative\" visa to enter the United States to be with the principle\n\nvisa holder.  In general, he/she is allowed to stay in the United\n\nStates for the duration of the principle principle visa holder's duration\n\nof stay."
    },
    {
      "tag": "p",
      "text": "Family If the foreign national\n\nspouse/child is in the United States, he/she may be able to \"change status\"\n\n(Form I-539 and file with the US CIS Regional Service Center). If not, the foreign\n\nnational can apply directly at the U.S. Consulate/Embassy (DS-156 and other\n\nsupplements as necessary) and file with the U.S. Consulate/Embassy. The following general\n\ndocuments are necessary (whether \"changing status\" or applying directly):"
    },
    {
      "tag": "blockquote",
      "text": "1. \n\nPrinciple nonimmigrant visa holder's visa, approval letter, documentation\n\n(maintaining the particular visa \"status\"). 2.  Documents\n\nto establish the foreign national's relationship to the principle nonimmigrant\n\nvisa holder. 3.  Documents\n\nto show financial support in the United States."
    },
    {
      "tag": "p",
      "text": "Employment Authorization In general, family\n\nmembers do not receive work authorization as a derivative, except for those\n\nmarked with an asterisk ( * )."
    },
    {
      "tag": "p",
      "text": "Principle Visas\n\n(Principle Visa Holder) Derivative Visas\n\n(Family Member) B-1, B-2, D-1 B-2 F-1 F-2  (Note: \n\nAfter \"SEVIS\" was implemented, if full-time student, must obtain F-1 visa\n\n\"status.\") M-1 M-2 E-1 E-1 E-2 E-2 * H-1A/B, H2A/B, or\n\nH-3 H-4 I I J-1 J-2 L-1A/B L-2 * O-1/O-2 O-3 P-1, P-2, P-3 P-4 E, H, or L B-2 as a\n\n\"non-spouse partner\" (gender does not matter), if you are a \"partner\" of\n\na E, H, or Lvisa holder.  (See below.)"
    },
    {
      "tag": "p",
      "text": "B\n\nNonimmigrant Visa"
    },
    {
      "tag": "blockquote",
      "text": "B-1 : \n\nFor individuals visiting temporary for \"business\", i.e., engaging in commercial\n\ntransactions such as attending conferences, business meetings, executing\n\ncontracts, undertaking negotiations.  Can not be \"gainfully employed\"\n\nin the U.S.; payment/salary to B-1 nonimmigrant should be made abroad. \n\nThe B-1 or B-2 visa holders are normally allowed into the U.S. for a 6-month\n\nperiod. Note : Must have financial support and intent\n\nto depart.  Additionally, some port-of-entry offices (Western Region)\n\nmay disqualify admission of a B-1 nonimmigrant (or corresponding Visa Waiver\n\nProgram nonimmigrant [see below]) if the foreign national is entering the\n\nUnited States and will be:  a) compensated from a U.S. source (beyond\n\nreimbursement for expenses or per diem), or b) even if uncompensated, perform\n\nservices for which a U.S. worker would have to be hired or are the services\n\ninherently part of the U.S. labor market, or c) services primarily benefiting\n\nthe U.S. entity as local work or hire as contrasted with benefiting the\n\nforeign national him/herself or the foreign employer in furtherance of\n\ninternational trade). ` PDF 4 Download : US\n\nCIS Western Regional Memorandum \"Admission of B-1/WB Visitors\"  (05/02)\n\n(US CIS/DHS)"
    },
    {
      "tag": "p",
      "text": "B-2 : \n\nFor individuals visiting temporary for \"pleasure\", i.e., engaging in tourism,\n\nvisiting relatives, attending conventions, language students (less than\n\n18 hours a week).  The B-1 or B-2 visa holders are normally allowed\n\ninto the U.S. for a 6-month period.  Spouses and dependents of a nonimmigrant\n\nvisa, such as H-1B, are eligible for an H-4.  However, \"cohabitating\n\npartners\", who are not spouses or dependents, can apply for the B-2 visa. Note : Must have financial support and intent\n\nto depart."
    },
    {
      "tag": "p",
      "text": "Cohabitating Partners: The Department of State (DOS) has issued\n\nguidance that emphasize that \"cohabitating partners\" may apply for the\n\nB-2 nonimmigrant visa.  \"Cohabitating Partner\" means individuals who\n\nare not spouses or dependents, but who have lived/resided on a long-term\n\nbasis, with the principle visa holder.  The DOS states that this is\n\ntrue for \"both opposite and same-sex partners.\"  ( Note : \n\nThe individual, however, must overcome INA 214(b).)"
    },
    {
      "tag": "p",
      "text": "Medical Treatment: The VSC (US CIS) indicates that while\n\nthere are is maximum duration of status for B-2 holders who are receiving\n\nmedical treatment , or accompanying an individual who is receiving medical\n\ntreatment.  However, any period over one year will be subject to scrutiny,\n\nbecause the US CIS may make a determination that the B-2 visa holder may\n\nhave immigrant intent (intent to reside permanently in the U.S., which\n\nis contrary to the \"temporary/nonimmigrant\" nature of the B-2 visa). \n\nWith respect to medical treatment related B-2 visas, the duration of status\n\ncan be longer than a year if sufficient evidence of the need for medical\n\ntreatment and  ability to financially fund the treatment are presented. \n\nFor Medical Treatment B-2s, it is important to prove that there is no U.S.\n\ngovernment financing for medical expenses (however, the patient can receive\n\ndonations from a local church or other non-profit organization that is\n\noffering support). VWP (Visa Waiver\n\nProgram): An individuals does not need a B-1 or\n\nB-2 visa if they can use the VWP (Visa Waiver Program) for travel to the\n\nUnited States for less than 3 months.  Those who require the B-2 visa\n\nbecause VWP is unavailable, or because the duration is more than 3 months,\n\nnormally are given a 6-month period of B-1/B-2 stay in the United States. \n\nOnce in the U.S., extensions are possible, but too many may be considered\n\nas not \"temporary.\"  However, the Department of State has issued guidance\n\nstating that:  \"the fact that the period of stay in a given case may\n\nexceed six months or a year is not in itself controlling, provided the\n\nconsular officer is satisfied that the intended stay actually has a time\n\nlimitation and is not indefinite in nature.\" (See Visa\n\nWaiver Program (VWP) .) Changes to B-1/B-2\n\nVisas (Affecting Intended F & M Students): On April 12, 2002, the US CIS publish ed new rules imposing new restrictions on B-1/B-2\n\nvisitors and those who seek to obtain student visas (after entering the\n\nU.S. using a B-1/B-2 visa)."
    },
    {
      "tag": "blockquote",
      "text": "Interim\n\nRule: Prohibition on Attending School Prior to Change of Status from B-1/B-2\n\nto F-1 or M-1 Before the interim rule, visitors admitted\n\nunder B-1/B-2 visas were allowed to begin attending school before the US\n\nCIS approved their request to change status to F-1 or M-1 students. \n\nThe interim rule does not eliminate the ability of B-1/B-2 visitors to\n\nchange their status to F-1 or M-1 students.  However, it prohibits\n\nB-1/B-2 visitors from attending school without first obtaining US\n\nCIS approval.  The US CIS is instituting\n\nthis change as a direct result of the terrorist attacks of September 11."
    },
    {
      "tag": "p",
      "text": "Proposed Rule:\n\nNew Requirements for Change of Status from B-1/B-2 to F-1 or M-1 In addition to the interim rule, the US\n\nCIS issued a proposed rule that requires B-1/B-2 visitors to notify\n\nthe US CIS of their intent to attend school\n\nin the U.S. when they initially enter the US as B-1/B-2 visitors. Furthermore,\n\nif they have already received any I-20 forms from schools, they must produce\n\nthe forms to the inspecting officers at the time of admission.  Inspecting\n\nofficers will make the proper notification on I-94 Entry/Departure card\n\nthat the B-1/B-2 visitors are prospective students. (See F-1\n\nStudent Visa .) (See M-1\n\nStudent Visa .) Proposed Rule:\n\nMinimum Admission Period Eliminated Currently, visitors admitted under B-1/B-2\n\nvisas are routinely granted a 6-month period of admission, regardless of\n\nthe time they actually intend to stay in the United States.  The proposed\n\nrule will eliminate the automatic 6-month admission period for B-2 visitors,\n\nand only provide a period of time that is necessary as explained by the\n\nvisitor.  If B-2 visitors cannot explain to the satisfaction of the\n\ninspecting officers, they will be granted a 30-day period of admission\n\nonly.  If B-2 visitors can establish the need for a period of stay\n\nlonger than 30 days, an appropriate period of admission will be granted\n\nup to 6 months. Proposed Rule:\n\nMaximum Period of Admission Reduced The US CIS is\n\nalso proposing to reduce the maximum period of admission for B-1/B-2 visitors\n\nfrom 1 year to 6 months. Proposed Rule:\n\nChanges to Standards for Extension of Stay The maximum period for each extension\n\nof stay application will remain 6 months for B-1/B-2 visitors.  However,\n\nthe proposed rule will limit the conditions under which B-1/B-2 visitors\n\ncan request an extension of stay.  B-1/B-2 visitors will be eligible\n\nfor an extension of stay only in cases that have resulted from unexpected\n\nor compelling humanitarian reasons.  In addition, they must prove\n\nthat they have adequate financial resources to support their stay in the\n\nU.S. and that they are maintaining a residency abroad which they have no\n\nintention of abandoning. VWP\n\n(Visa Waiver Program)"
    },
    {
      "tag": "blockquote",
      "text": "This i s\n\nNOT a visa (no change of status, no extension of stay allowed), but is\n\nissued for those individuals with B-1 or B-2 intent, and who wishes to\n\nenter the U.S. for less than three (3) months.  You must be a national\n\nof a qualifying country (individuals who are ineligible for VWP, or those\n\nwho require US stays of more than 3 months, may seek the B-1/B-2). Note : Must have return-ticket out of the U.S. \n\nThere is no need to apply for visa \"sticker\" issuance from the US\n\nCIS, or visa \"sticker\" from the U.S. Consulate/Embassy."
    },
    {
      "tag": "blockquote",
      "text": "8 September\n\n25, 2003 8 MRP\n\n(machine-readable passport) Requirement Postponed for 21 Countries The Dept. of State (with the Dept. of\n\nHomeland Security) has officially announced the postponement of the MRP\n\nrequirement (see below) for \"visa waiver (VWP)\" travelers for nationals\n\nof 21 countries:  Australia, Austria, Denmark, Finland, France, Germany,\n\nIceland, Ireland, Italy, Japan, Monaco, Netherlands, New Zealand, Norway,\n\nPortugal, San Marino, Singapore, Spain, Sweden, Switzerland, and the United\n\nKingdom. Nationals of other countries wishing to\n\nvisit the U.S. must either have a MRP for \"visa waiver (VWP)\" entry (if\n\nqualifying country), or a visa. 8 June\n\n16, 2003 8 Entry\n\n& Departure:  Machine-Readable Passport Required for Visa Waiver\n\nProgram (VWP) Under the Visa Waiver\n\nProgram (VWP), the citizens of certain countries may visit the U.S. for\n\nbusiness or pleasure for up to 90 days without a visa \"sticker.\" \n\nEffective October 01, 2003 ,\n\nall travelers who wish to travel to the U.S. under the Visa Waiver Program\n\n(VWP) must possess a machine-readable passport (MRP) issued by their government\n\nand present it at the U.S. port of entry. Those who do not possess such\n\na passport must apply for a nonimmigrant visa (such as an B-1/2) at the\n\nU.S. Embassy/Consulate (Dept. of State) prior to traveling to the United\n\nStates. Visa Waiver Program\n\n(VWP) countries:  Andorra, Australia, Austria, Belgium, Brunei, Denmark,\n\nFinland, France, Germany, Iceland, Ireland, Italy, Japan, Liechtenstein,\n\nLuxembourg, Monaco, the Netherlands, New Zealand, Norway, Portugal, San\n\nMarino, Singapore, Slovenia, Spain, Sweden, Switzerland, the United Kingdom\n\nand Uruguay. (The list changes occasionally; please check the Department\n\nof State website for updated lists.) Also: If\n\nyou enter the U.S. under this program, you cannot extend your stay past\n\n90 days except for very limited circumstances, and you cannot change to\n\nanother nonimmigrant status while in the United States. In addition, you\n\ncannot adjust status unless an immigrant petition is based on an immediate\n\nrelative relationship. Therefore, if you are a citizen of a qualified country\n\nbut plan to stay past 90 days or to change your status in the U.S, you\n\nmay want to consider obtaining a nonimmigrant visa such as B-1 or B-2. Also: Citizens\n\nof Belgium who wish to travel to the U.S. under the Visa Waiver Program\n\nmust possess a machine-readable passport issued by the Government of Belgium\n\neffective May 15, 2003. Otherwise, they are required to apply for a nonimmigrant\n\nvisa prior to traveling to the United States."
    },
    {
      "tag": "blockquote",
      "text": "Strategic\n\nDifference:  B-1/B-2 and Visa Waiver Program The B-1 or B-2 allows individuals to extend\n\nthe stay in the U.S. (by filing an extension) or to change status (to an\n\nF-1, L-1, etc.).  VWP holders, because it is not a visa, cannot file\n\nan extension nor change status.  In the past, individuals seeking\n\nto attend school, but could not apply for an F-1 student visa, entered\n\nthe U.S. on a Bvisa, first.  Business people who wanted to start\n\na business also entered the U.S. on a Bvisa to begin initial preparations."
    },
    {
      "tag": "p",
      "text": "Related\n\nTopics"
    },
    {
      "tag": "blockquote",
      "text": "The following\n\nsites provide information that is related to adjustment applications: \n\nbars to immigrant visa \"green card\" based on public charge, etc.; social\n\nsecurity numbers (obtaining tax records, etc.); foreign national entry\n\n& departure tracking system; and database of foreign nationals used\n\nby the US CIS (prior arrest records, etc.). i8 Related\n\nTopic: Bar\n\nto Adjustment \"Inadmissibility Grounds\" Even if a foreign\n\nnational applicant substantively qualifies for a nonimmigrant or immigrant\n\nvisa \"green card,\" there are grounds of \"inadmissibility\" that may ultimately\n\ndisqualify him/her from obtaining the status."
    },
    {
      "tag": "p",
      "text": "i8 Related\n\nTopic: Social\n\nSecurity Number -- SSA, SSN, ITIN (TIN) & I-9 i8 Related\n\nTopic: Foreign\n\nNational Entry & Departure Monitoring/Tracking System \"US VISIT\" i8 Related\n\nTopic: Database\n\nof Foreign Nationals 8 Immigration\n\nNews/Updates : News/Updates 8 Main\n\nINDEX (Immigration) 8 M+N-LLP\n\nOffices LEGAL\n\nDISCLAIMER: Please be advised\n\nthat immigration laws and policies change frequently.  Furthermore,\n\nthe processing methods and times at various embassies/consulates and immigration\n\noffices vary.  Information provided by Marcos, Negron & Akaike,\n\nL.L.P. is not to be construed as legal advice.  You should always\n\nconsult a legal representative for your concerns."
    }
  ]
}