{
  "url": "http://www.netcomuk.co.uk/~rwevans1/FabianWales/essay0001.html",
  "file_number": "604",
  "content_hash": "45942136047e0d9ba375c337c311da01dad734725a87024f121cc6e88b8843fa",
  "total_blocks": 79,
  "retained_blocks": 21,
  "ignored_blocks": 58,
  "blocks": [
    {
      "tag": "h2",
      "text": "Welsh Fabian Essays"
    },
    {
      "tag": "p",
      "text": "For details of annual Fabian Membership, both local Welsh Membership \n  (5/10) and \n  UK-wide Membership (30), contact the Wales Convenor Roger Warren Evans 23 St \n  Peters Road  Newton  Swansea  SA3 4SB Tel 01792-360673 or convenor@fabiansofwales.org"
    },
    {
      "tag": "div",
      "text": "What are the Welsh Fabian Essays?"
    },
    {
      "tag": "p",
      "text": "Who \n are the Authors? Can \n Ijoin in?"
    },
    {
      "tag": "div",
      "text": "COPYRIGHT"
    },
    {
      "tag": "p",
      "text": "Fabian essays are all published on the footing that \n        the views are those of the individual authors, and not of the Fabian \n        Society.  The Author retains the copyright, and individual consent \n        must be obtained.  For reproduction of the version published here \n        on this Website, however, the consent of the Fabian Society is required, \n        and will ordinarily be given gratis on the footing that the source is \n        fully stated and acknowledged. Contact Managing Editor click through"
    },
    {
      "tag": "div",
      "text": "NB STOP PRESS Aresponse to this Essay has been submitted by Fabian Chris Castle of Cardiff, and is\n\npublished on this page, following the Essay"
    },
    {
      "tag": "p",
      "text": "You can also click through to find this essay in Welsh."
    },
    {
      "tag": "h1",
      "text": "A Language Policy for Wales"
    },
    {
      "tag": "p",
      "text": "by Roger Warren Evans, Fabian, Gower CLP \"The language issue\" has long figured prominently in the politics \nof Wales.  The issue is \nconventionally conceived in terms of the assertion of Welsh usage \" against \" \nEnglish usage. Use of the Welsh language has become one of the hallmarks of \nWelsh nationalism, of the assertion of a Welsh, Celtic cultural identity to \ncontrast with the conventions of an Anglo-Saxon \"English\" culture. It is true that the history of Wales has been scarred by the oppression of the Welsh language, and \nof Welsh speakers, by dominant English speakers.  Similar linguistic polarities \nhave scarred other European societies, in Belgium, Brittany, and the Basque \nprovinces. Against that background, \nit is understandable \nthat those opposing rule from London should have rallied around the \ntraditional language of Wales. It is no accident that one of the most \nradical Welsh political groups should have been called Cymdeithas Yr Iaith , \nor The Welsh Language Society . Afuture language policy for Wales should, however, be conceived in much broader terms: it should not be \nconstrained by the narrow conflicts of Welsh and English speakers.  Indeed, there is a \nparallel need for a UK-wide language policy to govern the use of multiple languages by the \nmodern State and its \nagencies.  As a modern multicultural society, the need is to adapt to the \nrequirements of multilingualism , and move away from the conventions of a \nmonoglot, or even bi-lingual, society. In a modern society like Wales, the need \nis for a new systematic treatment of the overall process of communication by language . Language policy has two quite \ndistinct dimensions, namely the personal and the communal. I   PERSONAL The first principle , already formulated at \nUK law for the purposes of criminal court proceedings, is that any person, when \nfaced with the prospect of condemnation and punishment, is entitled to be heard \nand to make his defence in his mother tongue .  \nIt is for the Court, as part of the conduct of a fair trial, to ensure that \nsatisfactory translation/interpretation facilities are available for that \npurpose. That principle should be \ndeveloped , as the primary arm of any language policy, for it \nconstitutes a universal human right, going far beyond rules regulating the use \nof Welsh or similar traditional languages. It applies with equal force to the \nforeign visitor accused of shoplifting in London's Oxford Street.  Wherever any \nperson is engaged with the modern State, for the purpose of either securing a \nbenefit or avoiding a penalty, the mother-tongue principle should be assiduously \nupheld. This \"mother-tongue\" principle is already well established, as a matter of Common Law and Court practice.  It \nshould be explicitly extended, however, to all situations in which the individual either faces potential adverse \nconsequences (e.g. including Customs or immigration investigations) or stands to gain or lose a valuable public benefit, according to the outcome of the \nproceedings. II  COMMUNAL The second group of principles is communal, or collective, \nin character.  For each society , the functional need is for a \nthree-way classification of languages, as deployed by the State \nwithin the \nboundaries of its territory. First : Every State needs, as a \n  prerequisite of a settled civic order, an official language .  \n  This is the official language of State, the language of official \n  pronouncements, the language of statutory legislation, the language of \n  official public announcements and orders, of the creation of new obligations \n  and punishments and benefits. Experience suggests that there should \n  preferably be a single official language .  Where states have two or more \n  official languages (Ireland, Canada) it is easy for differences of \n  interpretation to generate unnecessary complication, if not conflict. Under the Government \n  of Wales Act, it was initially intended to constitute both \n  English and Welsh as having joint official language status, but that \n  plan was abandoned at an early stage. Second : Social convention and history \n  may support the identification of a traditional \n  language , a language of culture, learning and social intercourse, \n  which may be habitually spoken by a large number of citizens but which is not \n  the official language .  Welsh \n  is a good example of such a traditional language, as is Gaelic in Ireland, and \n  Breton in Brittany.  In this respect, a single State may accommodate \n  within its borders a range of different languages, at \n  provincial or regional level and it should be possible to accommodate such \n  differentiation within a provincial frame (Catalan in Catalunya, Breton in Brittany, Cornish in \n  Cornwall) . Third : All societies must now, given \n  the increased ethic and cultural diversity within each society, deploy a range of communal \n  languages , being languages other than the indigenous traditional language, but which are spoken by significant numbers of migrants within their own communities, and \n  which may still be the mother-tongue of newly-arrived migrants or elderly residents \n  who have never been able to learn English satisfactorily. Each State should spell out, by law, the scope of these different categories \nof language, and their administrative and political implications.  In the \nUK, the need is for primary legislation, preferably without imitation to Wales.  This essay sets out the principles upon which such \nlegislation should be prepared. Official Language The UK should designate a single official language , binding upon all its \nterritories.  All official \nstatements and requirements, instructions given, benefits conferred should as a \nmatter of constitutional law be required to be stated in the official language, \nand clearly expressed. This principle has been developed as a matter of Common Law, \nand is embodied in the principles of construction (\"interpretation\") applied by the Courts in deciding the meaning of statutes and statutory \ninstruments (i.e. primary and secondary legislation). And in this sense, whether with express statutory provision or not, the official language of Wales is English. This principle extends to public requirements issued under legislation, made \nby any arm of government, national, provincial or local: in a highly mobile \nsociety, the most common of these takes the form of highway signage, but the \nprinciple also applies to the conduct of all legal proceedings, both criminal \nand civil.  Afurther vital feature of contemporary society is the \ninformational leaflet, particularly in the welfare sector, and this may shade \ninto binding or procedural or advisory administrative directives, affecting a \ncitizen's position.  All such \"official\" statements should be made in the \nofficial Language. The same should hold true of official public records \nof public proceedings, including parliamentary and Civil Service records; where \nany statement was made, in such proceedings, in any language other than the \nOfficial Language, the record should always carry an official translation.  \nAnd in all cases, the official language alone should generate legal effect. Traditional Language For most parts of \nthe UK, there is no language capable of contending for designation as a \ntraditional language, other than English itself.  But in Wales, the Welsh \nlanguage is the traditional language, occupying a very distinctive position, \nhistorically, culturally and politically.  This status has already been \nrecognised by the Welsh language legislation, the provision of S4C television, \nand the work of the Welsh Language Board.  Indeed, in some respects, this \nlegislation has already conferred on the Welsh language greater currency than a \ntraditional language should necessarily, as a matter of general principle, \nenjoy. But the concept of a traditional \nlanguage should be developed further, by way of new statutory entitlement. Place names should be designated in either the official or the traditional language, but no other.  Every place should \n  be accorded one name and one name only, whichever the language of choice. The choice of \n  language should be a matter for decision by the most relevant local authority: \n  Cardiff City Council should decide on the naming of Cardiff (either Cardiff or Caerdydd , but not both).  For Dinas Powis, the relevant \n  Authority would be the Dinas Powis Community Council. Public facilities could, at the \n  discretion of the relevant authority, also be designated in either language - cemetery or mynwent, \n  school or ysgol, church or eglwys, museum or amgueddfa. Public Documents : In the case of specific public documents (whether bearing coercive \n  force or merely advisory) the State should always, if properly requested \n  by a citizen to do so, make them available in the traditional language, as \n  well as the official language.  There should be no requirement that all \n  public documentation should be made available in the traditional language (unless of course the mother-tongue principle were engaged) .  And the State should \n  have the residual power to determine a request to be vexatious or otherwise \n  without proper foundation. Active support should be given by the State for the cultivation of the \n  traditional language, both within the educational system and otherwise. In \n  Wales, education authorities should make many more facilities available for \n  residents seeking to learn Welsh. The relevant authority should always retain a jurisdiction to avoid \n  dual-language deployment where other overriding considerations apply.  \n  For example, it is a dangerous and destructive feature of Welsh highway \n  signage that operational instructions are conveyed in both English and Welsh , \n  thus running the risk of confused perceptions in an environment where highway \n  safety should be the prime concern. Communal Languages The status of communal languages will increase in importance, as the incidence of international migration \n  increases, and new ethnic and cultural groupings become established within the \n  territory of each State.  Procedures should be put in place for the \n  official designation of a language, \n\n\n\nwithin any territorial unit of governance, as a communal language . For those speaking minority foreign languages , \n  the two most important factors are bound to be (a) learning the official \n  language, and (b) benefitting from the mother-tongue principle.  But if a \n  community became firmly established within any locality (which is the \n  common experience of migrating groups) their settlement should be \n  recognised in other ways.  For example, cultural grant facilities should \n  be accessible for the cultivation of communal languages and cultures, and \n  individuals should have the right to call for public advisory documentation to \n  be made available in the communal language (e.g. as many educational \n  authorities provide foreign-language translations of material relevant to \n  children's education) . The Welsh \n  Assembly is well suited to the development of a new statutory \n  framework, pointing the way ahead, internationally, for this dimension of UK \n  public life.  Within the UK, it is only in Wales that the \n\n\n\nrelevance of \n  these issues is widely perceived and \n\n\n\nunderstood.  There should be no \n  question of any \n\n\n\ncrude stand-off between the protagonists of English and the \n  \n\n\n\ndevotees of Welsh.  The issue is a much more \n\n\n\nprofound one, going to the \n  dignity and human rights of \n\n\n\neach individual within modern society. Wales should take the \n\n\n\ninternational lead , \n  with the promotion of \n\n\n\na new UK Language Act, embodying the \n\n\n\nabove principles."
    },
    {
      "tag": "h1",
      "text": "A Language Policy for Wales"
    },
    {
      "tag": "p",
      "text": "Response to Roger Warren Evans by Fabian Chris Castle Cji-castle@cymru.new.labour.org.uk"
    },
    {
      "tag": "div",
      "text": "RWE has offered us a reasonable attempt to reconcile \n\n\n\nWelsh peoples commonly-held assumptions, misapprehensions, \n\n\n\nprejudices and ignorance with his obvious goodwill towards non-English languages.  \n\n\n\nHowever, assumptions misapprehensions, prejudices and ignorance are features of his essay."
    },
    {
      "tag": "p",
      "text": "Iwill argue that these negative attitudes lead to a confusion of language and ethnicity.\n\n Aconfusion, which is the most disgraceful aspect of the \n\n\n\nlanguage issue. However, Iwish to begin with two more obvious examples of \n\n\n\nlinguistic prejudice. (1) In an otherwise liberal-minded article on languages and their \n\n\n\nvalue ( You are what you speak New Scientist 30 November 02) a subtle \n\n\n\npro-English linguistic chauvinism became evident. The \n\n\n\nlinguist Slobin has done research into the way that a \n\n\n\ngroup of languages (including English) have colourful verbs \n\n\n\nwhich express movement in terms that are dynamic, full of energy. \n\n\n\nOther languages (including Romance languages) are described has having prosaic verbs and lacking colourful verbs. All these terms are value laden. Would it not be better to consider why English/Russian etc are so subjective in comparisons with objective Romance languages? Are French/Spanish etc really lacking?\n\n\n\nIn this context Iask readers to note RWEs use of the words \n\n\n\ndevotee, protagonists, unnecessary complication, \n\n\n\nand [the] dangerous and destructive [bilingual] highway signage. (2) My second example is Paul Starlings Welsh Mirror .  \n\n\n\nReaders of Planet magazine will be aware of Patrick \n\n\n\nMcGuinesss close readings of the Daily Mirrors Welsh edition.  \n\n\n\nPatrick has shown that by carefully selective translation and \n\n\n\nomission the Mirror is conflating all Welsh Language activists \n\n\n\nand Welsh speakers with the most violent forms of nationalism, \n\n\n\nxenophobia, and nazi-ism. The Mirror is careful to \n\n\n\nseparate decent Welsh-speakers from this, but in Mirror terms these can only be those who are prepared to stay \n\n\n\nsilent in the face of linguistic bigotry from any English \n\n\n\nspeakers with negative attitudes towards Welsh. The true \n\n\n\nhorror is that Labour HQ at Transport House Cardiff, \n\n\n\nand some Labour representatives, are implicated in this \n\n\n\nblack propaganda."
    },
    {
      "tag": "h3",
      "text": "Dimensions of Language Policy, as proposed by RWE, which\n\nneed to be reconsidered"
    },
    {
      "tag": "div",
      "text": "Personal rights"
    },
    {
      "tag": "p",
      "text": "The mother-tongue principle could lead to unintentional \n\nbut institutional racism. \n\n\n\n  Mother tongue denotes \n\n\n\nones language of ethnic origin.  Many Sikhs may have \n\n\n\nPunjabi as their mother-tongue, yet English may be their \n\n\n\nlanguage of choice, they may be more comfortable speaking \n\n\n\nEnglish away from the home. Using their mother-tongue in \n\n\n\ndealings with the State, however, may be an important way for \n\n\n\nthem to express their ethnic identity. Aright to use Punjabi \n\n\n\nin relations with the State, if it is provided for one group, \n\n\n\nmust be available for all who speak Punjabi  including Sikh \n\n\n\nconverts who may be non-Aryan.  Punjabi in this case becomes a \n\n\n\ncommunal language, not an ethnic language. Aclose reading of \n\n\n\nRWEs essay will reveal that  ethnic language is a better \n\n\n\ndescription what he outlines. English is my mother tongue,  but Welsh is my chosen communal \n\n\n\nlanguage in dealings with the State (form filling, advice \n\n\n\nlines etc). This, for me, is an important signifier that Ihave reinstated the Cymreictod (Welshness) of my fathers \n\n\n\nfamily who were bullied and cajoled into raising their \n\n\n\nchildren as monoglot English speakers. Welsh is likely to be my language of choice in Court if Iever \n\n\n\nfeel it necessary to engage in civil disobedience. \n\n\n\nSpeaking Welsh is a major component of my sense of identity but \n\n\n\nthe language does not define my ethnicity in any way shape or form. \n\n\n\nIhave argued long and hard in the welsh language media \n\n\n\nagainst arguments for \"Cymreictod Ethnig\" (Ethnic Welshness) ."
    },
    {
      "tag": "div",
      "text": "Communal/Collective rights > Whilst RWEs assertion, that two official and \n\n\n\nequal \n\n\n\nlanguages can cause problems in interpretation of legal \n\n\n\ndocuments, is correct, that is not sufficient to argue against \n\n\n\nmaking Welsh an Official Language.  Ifail to see any logical \n\n\n\nreason or even argument against the creation of a subordinate \n\n\n\nOfficial Language status for Welsh.\n\nEnglish then would become the primary Official Language, and it alone would generate legal effect.  Ialso see no \n\n\n\nreason why other languages with a British or any other \n\n\n\norigin could not one day become subordinate Official \n\n\n\nLanguages within British towns, counties or regions."
    },
    {
      "tag": "p",
      "text": "Turning to road safety, if problems exist due to linguistic \n\n\n\nproblems with road signs, we need to seriously consider \n\n\n\nconfiscating the cars and lorries of non-English-speaking \n\n\n\ndrivers the second they reach Dover.  Iaccept that there is a \n\n\n\nproblem with the design of bilingual road signage  the \n\n\n\nconfusion is usually caused by alternating monoglot English \n\n\n\nand Welsh signage, or by changing the relative position of \n\n\n\nthe two languages, sometimes with Welsh on top, sometimes English.  \n\n\n\nBut the only way to promote Welsh is to make it visible,  and \n\n\n\naccepted as normal .  Bilingual road signs and official documents \n\n\n\nare amongst the best ways to do this.  RWEs idea of a \n\n\n\ntraditional language seems designed to make Welsh \n\n\n\ndisappear from any areas that are not ethnically Welsh-speaking  \n\n\n\ni.e. where the majority are Welsh-speakers born and bred. More Welsh Assembly work must first be carried out in Welsh .  \n\n\n\nMore work must be done to assimilate non-Welsh speakers into \n\n\n\ntheir naturally Welsh-speaking communities.  Most importantly, we \n\n\n\nmust tackle the economic and social problems which are \n\n\n\nlinguistically cleansing the traditional heartlands of the \n\n\n\nWelsh language. These processes exist in many parts of Britain. \n\n\n\nLanguage difference however makes the effect more obvious in \n\n\n\nWelsh-speaking areas. As a party, Labour must take a long, hard look at the provision of \n\nSocial Housing. We must find ways of funding real council housing \n\nand consider modifying the right to buy. We must be prepared \n\nto acknowledge that in some cases property rights militate \n\nagainst the welfare of stable communities. Language shift in Wales is an indicator of social \n\nprocesses which Labour is failing even to acknowledge - let alone \n\ndeal with.  We are not, at present, protecting working-class \n\nyoung people throughout Britain - from Cornwall to Bournmouth\n\n to Oxford to Abersoch - anywhere, in fact, where the right \n\nto buy a pretty view, an executive development or a \n\nluxury apartment is more important than the \n\nwelfare of a community."
    },
    {
      "tag": "div",
      "text": "Chris Castle CAERDYDD/CARDIFF Cji-castle@cymru.new.labour.org.uk End"
    },
    {
      "tag": "div",
      "text": "You are reading the Welsh Fabian Essays"
    }
  ]
}