{
  "url": "http://www.ohio.com/mld/ohio/sports/columnists/marla_ridenour/",
  "file_number": "618",
  "content_hash": "82e648262c88009b3bb28c7e0791a5809e4a0fff47b8b15fd21eaf7ca2df75df",
  "total_blocks": 106,
  "retained_blocks": 7,
  "ignored_blocks": 99,
  "blocks": [
    {
      "tag": "div",
      "text": "Subscriber Services Complete Forecast Search Recent News Archives Web for Jobs Cars Real Estate Apartments Shop Local All \n    Classifieds • Create an Ad • Find an Ad"
    },
    {
      "tag": "div",
      "text": "News Columnists Editorial/Opinion Business Sports • Baseball • Akron Aeros • Indians • Basketball • Cavaliers • LeBron James • Colleges • Kent State • Ohio State • University of Akron • Columnists • Patrick McManamon • Sheldon Ocker • Terry Pluto • Tom Reed • Marla Ridenour • Brian Windhorst • Football • Browns • Golf • High School Sports • Horse Racing • Motorsports • Other Sports • Game Match-Ups • Injuries • Latest Odds Entertainment Newsroom Projects Living Obituaries Visitor's Guide ONLINE EXTRAS Past Articles Beacon Forms Discussion Forums Newsletters Newspaper Ads Special Sections Traffic Reports Weather SITE SERVICES Advertise Contact Us Feedback Help Place an Ad Print Subscriptions RSS Feeds"
    },
    {
      "tag": "div",
      "text": "Sports 7-Day Archive Monday Tuesday Wednesday Thursday Friday Saturday Sunday"
    },
    {
      "tag": "div",
      "text": "PHOTO STORE » Photos to buy High-quality prints of Akron landmarks, cityscapes, nature\nscenes and more. » See a photo you want?"
    },
    {
      "tag": "div",
      "text": "Back to Home > Sports > Columnists > Tuesday, Dec 26, 2006 Marla Ridenour"
    },
    {
      "tag": "div",
      "text": "Recent and past columns from Akron Beacon Journal sports columnist Marla Ridenour. Contact Marla Ridenour at mridenour@thebeaconjournal.com ."
    },
    {
      "tag": "div",
      "text": "Edwards quiet, but Jurevicius has plenty to say Benched receiver makes quick exit, but teammate has lots to get off chest Baxter vows return After tearing the patellar tendons in both knees, he can barely walk but is determined to play next year Frye's wrist injury disputed Crennel insists it's only a bruise, rails at media for saying it is fractured and he's out for season Crennel talks like he'll stick with Frye Post a comment Despite fan frenzy for Anderson, coach remains loyal to Charlie Four Buckeyes might leave early Juniors Ginn, Pittman, Gonzalez, Barton file paperwork for NFL Emotional day for Smith Glenville coach and city honor OSU quarterback Gators' QB plan works Senior Leak steps aside at times so freshman Tebow can step in Smith wins Heisman Winning Heisman emotional for Griffith Griffin knows tears could flow if OSU's Smith receives honor Perseverance again likely will reward Troy Smith Heisman Trophy favorite gets life together with Ohio State Backup QB's run in OT is talk of the team Many hours preparing showed in his play, Derek Anderson says Tressel turns tables on play OSU coach credits Akron woman in SI Edwards explains tirade Receiver doesn't think he should be disciplined for showing passion about game Players say Edwards just venting Frye and teammates insist receiver's actions not tearing team apart Droughns watches Browns' meager rush He's on special teams; team totals just 51 yards Edwards regrets answer about hit Browns receiver backs up on comments he made about teammate Russell Tressel attends service for Bo Schembechler long a guide for OSU coach Buckeyes star wins Big Ten honors QB Troy Smith named offensive player of year His highs pale vs. team lows Browns receiver has best numbers ever, but hurts with rest of team NO. 1 BY MANY YARDS Akron duo helps OSU take title Decisive moment foretold Sideline pundits share a passing premonition about Robiskie's TD Gonzalez looks ahead, not back at big 2005 catch He's big game's `X-factor' Michigan receiver Manningham, an Ohioan, may play big role Alittle levity goes a long way behind OSU closed doors Pittman chose OSU over Michigan Post a comment OSU running back could have gone to Michigan, but Buckeyes too quick Deja vu in BCS title game? Historic hype for The Game Post a comment It's No. 1 vs. No. 2 for first time in storied rivalry It's time to make history Ohio State can finally concentrate on Michigan game Hartline catches 2 TD passes Pittman tops 1,000. Wells avoids fumbles Search Yellow Pages Business name or category City State Choose a state Alabama Alaska Arizona Arkansas California Colorado Connecticut D.C. Delaware Florida Georgia Hawaii Idaho Illinois Indiana Iowa Kansas Kentucky Louisiana Maine Maryland Massachusetts Michigan Minnesota Mississippi Missouri Montana Nebraska Nevada New Hampshire New Jersey New Mexico New York North Carolina North Dakota Ohio Oklahoma Oregon Pennsylvania Rhode Island South Carolina South Dakota Tennessee Texas Utah Vermont Virginia Washington West Virginia Wisconsin Wyoming » Browse a Category » Get Maps & Directions » White Pages Search » Email Search News \n\n\n| Sports \n\n\n| Business \n\n\n| Entertainment \n\n\n| Living \n\n\n| City Guide \n\n\n| Shop Local\n\n\n| Classifieds About Ohio.com | About the Real Cities Network | Terms of Use & Privacy Statement | Copyright | About the McClatchy Company"
    }
  ]
}