{
  "url": "http://www.pbs.org/newshour/bb/middle_east/jan-june05/negroponte_1-31.html",
  "file_number": "635",
  "content_hash": "522004ccb2e54fcdb7b4ee6a99c4a9873efcf2837518afdade71e27de3c8a0e3",
  "total_blocks": 200,
  "retained_blocks": 3,
  "ignored_blocks": 197,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 4.0 Transitional//EN\" #BeginTemplate \"/Templates/produced _transcript.dwt\" #BeginEditable \"doctitle\" #EndEditable <rdf:RDF xmlns:rdf=\"http://www.w3.org/1999/02/22-rdf-syntax-ns#\"\n         xmlns:trackback=\"http://madskills.com/public/xml/rss/module/trackback/\"\n         xmlns:dc=\"http://purl.org/dc/elements/1.1/\">\n<rdf:Description\n    rdf:about=\"http://www.pbs.org/newshour/bb/middle_east/jan-june05/negroponte_1-31.html\"\n    trackback:ping=\"http://www.pbs.org/cgi-registry/trackback.pl/newshour/bb/middle_east/jan-june05/negroponte_1-31.html\"\n    dc:identifier=\"http://www.pbs.org/newshour/bb/middle_east/jan-june05/negroponte_1-31.html\" />\n</rdf:RDF> No Ad Zone defined for this page. header table document type (focus/forum/etc.) begin headline #BeginEditable \"headline\" NEWSMAKER: \r\nNEGROPONTE #EndEditable end headline begin date #BeginEditable \"dateline\" January 31, \r\n2005 #EndEditable end date #BeginEditable \"b-head\" #EndEditable begin summary paragraph"
    },
    {
      "tag": "p",
      "text": "#BeginEditable \"intro%20blurb\" U.S. Ambassador to Iraq John Negroponte \r\ndiscusses Iraq's first multiparty elections in 50 years. #EndEditable end summary paragraph #BeginEditable \"Video%20link\" #EndEditable #BeginEditable \"realmedia%20link\" #EndEditable link to realaudio transcript #BeginEditable \"NewsHour%20Links\" Online NewsHour Special Report: Iraq in Transition Jan. 31, 2005: Update: Iraqi Prime Minister Urges Unity After Elections Jan. \r\n30, 2005: Update: Millions of Iraqis Vote in First Free Elections; 44 Die in Attacks Jan. 28, 2005: Two Middle East experts analyze the \r\nmechanics of the election and what will make Sunday's vote a success. Jan. \r\n27, 2005: Iraqi-Americans register \r\nto vote in Jan. 30 Iraqi national elections . Jan. \r\n26, 2005: President Bush urges Iraqis \r\nto vote in the Jan. 30 elections . Jan. 24, \r\n2005: Experts discuss Abu \r\nMusab al-Zarqawi's pledge of an all out war on the Jan. 30 Iraq election . Jan. 19, 2005: Update: Car Bombs Rock Baghdad Ahead of Elections Browse \r\nthe NewsHour's coverage of the Military and Middle \r\nEast #EndEditable #BeginEditable \"Extra%20Links\" News \r\nfor Students: Top \r\n                Story: Millions of Iraqis Vote in First Free Election. 01.30.05 Top \r\nStory : Violence Could Delay Iraq Elections. 09.27.04 Lesson \r\nPlan : Who Should Rule the Interim Government? #EndEditable #BeginEditable \"Outside%20Links\" United Nations News: Iraq U.S. \r\nEmbassy in Iraq U.S. \r\nDefense Department #EndEditable begin transcript #BeginEditable \"Introduction\" MARGARET \r\nWARNER: Amb. Negroponte, welcome, and thanks for being with us. We \r\nhave heard roughly that there was a 60 percent turnout. What is the latest you \r\ncan tell us or what more do you know about the ethnic breakdown of the turnout, \r\nethnic and religious? AMB. JOHN NEGROPONTE: Ithink it's very difficult \r\nto say at this time. The Independent Iraqi Electoral Commission has even pulled \r\nback a bit from giving out any estimates, and Ithink we're going to have to wait \r\nfor the next day or two before we get some reliable turnout figures. But \r\nclearly there's going to be important representation from the Kurdish areas, from \r\nthe Shiia groups, from the non-sectarian parties based here in Baghdad, and probably \r\nslightly lesser representation in terms of the proportions on the part of the \r\nSunni people living in the so-called Sunni Triangle area. #EndEditable #BeginEditable \"Part%20intro%20pull%20quote\" #EndEditable #BeginEditable \"Part%20One%20subhead\" Constructing \r\na future #EndEditable #BeginEditable \"Part%20One\" MARGARET \r\nWARNER: And give us your sense of how soon, just in practical terms, we'll actually \r\nsee this transitional national assembly sit down to meet? AMB. JOHN NEGROPONTE: \r\nWell, of course, this is the first time that all this is happening, so none of \r\nus have much of an experience base to refer back to, but the results are supposed \r\nto be known in the next seven or ten days; Ithink then there's allowance for \r\nperhaps challenges and so forth, so let's assume a couple of weeks until the results \r\nare finally certified. And then it will take some time for the new assembly \r\nto organize itself and its first act will be to pick a new presidency, which it \r\nwill have to select by a two-thirds vote, so that could take several weeks time. MARGARET \r\nWARNER: Now of course an overriding issue is how to get the Sunnis to participate \r\nin this political process that's about to unfold. How do you think that is going \r\nto go? AMB. JOHN NEGROPONTE: Well, first it is an important issue. Iwouldn't \r\ncall it \"the\" overriding issue, by any means. Ithink the overriding \r\nissue is to move the democratic process in this country forward and yesterday \r\nwas a major advance in that direction. Now, as far as the involvement of \r\nSunni or any other groups, what we've heard from the political leaders who are \r\ncandidates in this election is that they want to take an inclusive approach towards \r\nthe future political life of this country. So, Ithink you're going to \r\nsee efforts to involve the Sunni in the new executive branch, through cabinet \r\npositions and the like, and Ithink there is also the intention to try and involve \r\nthem in various ways in the drafting of a new constitution. Because under \r\nthe interim constitution of Iraq, any combination \r\nof three provinces at the time of the referendum on the constitution can block \r\nratification. So, it's very much in the interest of all concerned if only to get \r\nthe constitution ratified to include representation from all groups. MARGARET \r\nWARNER: Are you personally in touch with senior members of what's been called \r\nthe Sistani Slate, even though we know he was neither a candidate nor officially \r\nendorsed, but the United Iraqi Alliance, the Shiite-dominated slate, that is expected \r\nto get the greatest number of votes. Imean, do you have a personal reading of \r\nwhat their intentions are? AMB. JOHN NEGROPONTE: Well, we at various levels \r\nin our embassy, right down to our political reporting officers we have maintained \r\ncontact with all segments of the Iraqi political spectrum and of course some of \r\nthe members of the Sistani List are people who are either in the government - \r\nsuch as the finance minister, for example, or the vice president -- and others \r\nare individuals whom we knew when there was a - a governing council at the time \r\nof the coalition provisional authority, so Iwould say that we're quite well acquainted \r\nwith representatives of that list and in fairly constant dialogue with them. #EndEditable #BeginEditable \"Part%20One%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Two%20subhead\" Encouraging \r\nparticipation #EndEditable #BeginEditable \"Part%20Two\" MARGARET \r\nWARNER: Now what about the Sunni leaders who urged a boycott? They have at least \r\ngiven interviews in which they said they want to be part of the process, but what \r\nmore can you tell us about their intention? AMB. JOHN NEGROPONTE: Well, there \r\nis no monolithic Sunni leadership to my understanding, which is perhaps one of \r\nthe issues that has been a complicating factor. But certainly we have maintained \r\ncontact with a variety of leaders from the Al-Anbar and Nineveh Provinces, which \r\nis where many of these Sunnis reside. Ihave myself, for example, been \r\nin occasional contact with the leader of the Iraqi Islamic Party, which is Sunni-dominated. \r\nSo, again, we have reached out to those groups and intend to continue to do so \r\nin the weeks and months ahead. MARGARET WARNER: But do you think that - \r\nfirst of all - the fact of yesterday's election, the relatively high turnout, \r\ndo you think this is going to from what you know make them feel more estranged \r\nand alienated or, in fact, encourage them that, you know, this train is leaving \r\nthe station, to use an old political cliché, and they should get involved? AMB. \r\nJOHN NEGROPONTE: Right. Ithink it's actually encouraging \r\nthem to want to get on the train. In fact, Ithink initially a number of them \r\nwere really trying to test the system to see if they could somehow or another \r\ncause a delay in the elections. But when the inevitability of the elections \r\nbecame apparent, Ithink we saw a number of these Sunni groups and certainly Sunni \r\nvoters want to participate more in the political process and for example members \r\nof some of the Sunni parties that were not actively involved in the election have \r\nalready indicated to us that they would like in some way to be involved in the \r\ndrafting of the constitution. So rather than having a polarizing effect, \r\nas some have suggested, Ithink this election could well, in the end, have a unifying \r\nconsequence. #EndEditable #BeginEditable \"Part%20Two%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Three%20subhead\" Formulating \r\nan exit strategy #EndEditable #BeginEditable \"Part%20Three\" MARGARET \r\nWARNER: And what do you think - again the fact of yesterday's election and the \r\nresults means for the prospect of getting American troops out of Iraq? AMB. \r\nJOHN NEGROPONTE: Well, first of all, it's certainly a very important step in terms \r\nof the government and the people of Iraq taking on even greater ownership for \r\nthe management of their own affairs. So it's been a very, very important \r\nadvance towards political democracy. Ithink parallel to that one of our highest \r\npriorities going forward is going to be to train and equip and try to help motivate \r\nIraqi armed forces, their military and their police forces, so that they can take \r\non an ever -- a greater responsibility for their own security. We'd like \r\nto see a gradual shift from us being out on the lead on security issues to the \r\nIraqi forces being in the lead so that we can reduce our profile. MARGARET \r\nWARNER: Some of these parties started this campaign by saying they wanted U.S. \r\ntroops out quickly. And that did seem to shift toward the end. Again, how \r\ndo you read their intentions - I'm talking now about for the United Iraqi Alliance, \r\nperhaps a couple of the other major parties, in terms of whether they want to \r\nat least start talking about a timetable for withdrawal? AMB. JOHN NEGROPONTE: \r\nWell, a timetable was mentioned in some of the campaign documents of some of these \r\nparties. But when we spoke to many of these political leaders, they clarified \r\nthat they didn't want to mean to suggest that coalition forces should leave the \r\ncountry precipitously; in fact, many of them have said to us that they think that \r\nwould be dangerous and would leave a serious vacuum. On the other hand, \r\nIthink they feel, and Ithink on this point we agree with them, that it is important \r\nthat Iraqi forces themselves be enabled as rapidly as possible to take over the \r\nprimary responsibility for their security and ultimately to take over full responsibility \r\nfor the security situation in their own country. And Ithink that's an \r\nobjective that our two countries share in common. #EndEditable #BeginEditable \"Part%20Three%20pull%20quote\" #EndEditable #BeginEditable \"Part%20Four%20subhead\" Defending \r\nagainst attacks #EndEditable #BeginEditable \"Part%20Four\" MARGARET \r\nWARNER: Iknow you're not a military expert, but the interior minister was quoted \r\nor the interim interior minister was quoted yesterday - he thought it would take \r\nperhaps 18 months for the full Iraqi security forces to be able to handle things \r\non their own? Does that sound reasonable to you? AMB. JOHN NEGROPONTE: Well, \r\nwe've been reluctant to try and put a timetable on this to give a time estimate \r\nsimply because we don't want to create some kind of expectation that then subsequently \r\nmight lead to a disappointment. But what Ican assure you is that we really \r\nare working extremely hard on this issue of training, equipping, and motivating \r\nof the Iraqi armed forces. And Iwould give to you as an example the extremely \r\ngood performance that they displayed yesterday in protecting these 5,300 polling \r\ncenters throughout the country. The Iraqi forces deserve a tremendous amount \r\nof credit for the success of yesterday's election. MARGARET WARNER: Now \r\nthis 72-hour lockdown does end tomorrow. Are you braced for insurgent attacks? AMB. \r\nJOHN NEGROPONTE: Well, one never knows exactly what to predict. Of course, there's \r\nbeen a pattern, a fairly steady pattern of violence in recent weeks and months. Obviously, \r\nwe're doing our best to control and stabilize those situations and hopefully some \r\nof the lessons learned from the experience of preparing for the elections will \r\nbe helpful going forward. But I'd be very wary of trying to predict for you exactly \r\nwhat might happen in the next few days. Ithink that it is reasonable to \r\nexpect that this insurgency will continue for sometime to come and that the best \r\nway to deal with it is to keep steadily working away at it through political action, \r\nsuch as these elections, through training and equipping and motivating of their \r\narmed forces and the economic reconstruction activities that we have underway. And Ithink through that combination of measures, Ithink that we over \r\ntime will be able to effectively deal with the insurgency that Iraq is facing. MARGARET \r\nWARNER: Amb. John Negroponte, thanks for being with us. AMB. JOHN NEGROPONTE: \r\nThank you very much. #EndEditable #BeginEditable \"Part%20four%20pull%20quote\" #EndEditable"
    },
    {
      "tag": "div",
      "text": "footer nav table REGIONS TOPICS RECENT PROGRAMS ABOUT US FEEDBACK SUBSCRIPTIONS / FEEDS: search table END search table END footer nav table footer table Support the kind of journalism done by the NewsHour... Become a member of your local PBS station. PBS Online Privacy Policy Copyright ©1996-2006 MacNeil/Lehrer Productions. All Rights Reserved. END footer table"
    }
  ]
}