{
  "url": "http://www.peter-drucker.com/books/0887306144.html",
  "file_number": "642",
  "content_hash": "e116c348dfef00af93dced365f3be041ecdbc30e97577ed20e0ba71e31334d44",
  "total_blocks": 68,
  "retained_blocks": 2,
  "ignored_blocks": 66,
  "blocks": [
    {
      "tag": "div",
      "text": "\"Founding \r\n                          father of the science of management.\" — Los Angeles Times \"Our debt to Peter Drucker knows no limit.\" — Tom Peters"
    },
    {
      "tag": "p",
      "text": "Price: \r\n                    $13.00 Binding: Paperback ISBN: 0887306144 256 pages Description: The effective \r\n                    business, Peter Drucker observes, focuses on opportunities \r\n                    rather than problems. How this focus is achieved in order \r\n                    to make the organization prosper and grow is the subject of \r\n                    this companion to his classic, The Practice of Management. \r\n                    The earlier book was chiefly concerned with how management \r\n                    functions; this volume shows what the executive decision-maker \r\n                    must do to move his enterprise forward. One of \r\n                    the notable accomplishments of this book is its combining \r\n                    specific economic analysis with a grasp of the entrepreneurial \r\n                    force in business prosperity. For though it discusses \"what \r\n                    to do\" more than Drucker's previous works, the book stresses \r\n                    the qualitative aspect of enterprise: every successful business \r\n                    requires a goal and spirit all its own. Peter Drucker again \r\n                    employs his particular genius for breaking through conventional \r\n                    outlooks and opening up new perspectives--for profits and \r\n                    growth. Excerpt: Business \r\n                    Realities That executives \r\n                    give neither sufficient time nor sufficient thought to the \r\n                    future is a universal complaint. Every executive voices it \r\n                    when he talks about his own working day and when he talks \r\n                    or writes to his associates. It is a recurrent theme in the \r\n                    articles and in the books on management. It is \r\n                    a valid complaint. Executives should spend more time and thought \r\n                    on the future of their business. They also should spend more \r\n                    time and thought on a good many other things, their social \r\n                    and community responsibilities for instance. Both they and \r\n                    their businesses pay a stiff penalty for these neglects. And \r\n                    yet, to complain that executives spend so little time on the \r\n                    work of tomorrow is futile. The neglect of the future is only \r\n                    a symptom; the executive slights tomorrow because he cannot \r\n                    get ahead of today. That too is a symptom. The real disease \r\n                    is the absence of any foundation of knowledge and system for \r\n                    tackling the economic tasks in business. Today's \r\n                    job takes all the executive's time, as a rule; yet it is seldom \r\n                    done well. Few managers are greatly impressed with their own \r\n                    performance in the immediate tasks. They feel themselves caught \r\n                    in a \"rat race,\" and managed by whatever the mailboy dumps \r\n                    into their \"in\" tray. They know that crash programs which \r\n                    attempt to \"solve\" this or that particular \"urgent\" problem \r\n                    rarely achieve right and lasting results. And yet, they rush \r\n                    from one crash program to the next. Worse still, they known \r\n                    that the same problems recur again and again, no matter how \r\n                    many times they are \"solved.\" Before \r\n                    an executive can think of tackling the future, he must be \r\n                    able therefore to dispose of the challenges of today in less \r\n                    time and with greater impact and permanence. For this he needs \r\n                    a systematic approach to today's job. There \r\n                    are three different dimensions to the economic task: (1)The \r\n                    present business must be made effective; (2) its potential \r\n                    must be identified and realized; (3) it must be made into \r\n                    a different business for a different future. Each task requires \r\n                    a distinct approach. Each asks different questions. Each comes \r\n                    out with different conclusions. Yet they are inseparable. \r\n                    All three have to be done at the same time: today. All three \r\n                    have to be carried out with the same organization, the same \r\n                    resources of men, knowledge, and money, and in the same entrepreneurial \r\n                    process. The future is not going to be made tomorrow; it is \r\n                    being made today, and largely by the decisions and actions \r\n                    taken with respect to the tasks of today. Conversely, what \r\n                    is being done to bring about the future directly affects the \r\n                    present. The tasks overlap. They require one unified strategy. \r\n                    Otherwise, they cannot really get done at all. To tackle \r\n                    any one of these jobs, let alone all three together, requires \r\n                    an understanding of the true realities of the business as \r\n                    an economic system, of its capacity for economic performance, \r\n                    and of the relationship between available resources and possible \r\n                    results. Otherwise, there is no alternative to the \"rat race.\" \r\n                    This understanding never comes ready-made; it has to be developed \r\n                    separately for each business. Yet the assumptions and expectations \r\n                    that underlie it are largely common. Businesses are different, \r\n                    but business is much the same, regardless of size and structure, \r\n                    of products, technology and markets, of culture and managerial \r\n                    competence. There is a common business reality. There \r\n                    are actually two sets of generalizations that apply to most \r\n                    businesses most of the time: one with respect to the results \r\n                    and resources of a business, one with respect to its efforts. \r\n                    Together they lead to a number of conclusions regarding the \r\n                    nature and direction of the entrepreneurial job. Most of \r\n                    these assumptions will sound plausible, perhaps even familiar \r\n                    , to most businessmen, but few businessmen ever pun them together \r\n                    into a coherent whole. Few draw action conclusions from them, \r\n                    no matter how much each individual statement agrees with their \r\n                    experience and knowledge. As a result, few executives base \r\n                    their actions on these, their own assumptions and expectations. 1. Neither \r\n                    results nor resources exist inside the business. Both \r\n                    exist outside. There are no profit centers within the business; \r\n                    there are only cost centers. The only thing one can say with \r\n                    certainty about any business activity, whether engineering \r\n                    or selling, manufacturing or accounting, is that it consumes \r\n                    efforts and thereby incurs costs. Whether it contributes to \r\n                    results remains to be seen. Results \r\n                    depend not on anybody within the business nor on anything \r\n                    within the control of the business. They depend on somebody \r\n                    outside--the customer in a market economy, the political authorities \r\n                    in a controlled economy. It is always somebody outside who \r\n                    decides whether the efforts of a business become economic \r\n                    results or whether they become so much waste and scrap. The same \r\n                    is true of the one and only distinct resource of any business: \r\n                    knowledge. Other resources, money or physical equipment, for \r\n                    instance, do not confer any distinction. What does make a \r\n                    business distinct and what is its peculiar resource is its \r\n                    ability to use knowledge of all kinds--from scientific and \r\n                    technical knowledge to social, economic, and managerial knowledge. \r\n                    It is only in respect to knowledge that a business can be \r\n                    distinct, can therefore produce something that has a value \r\n                    in the market place. Yet knowledge \r\n                    is not a business resource. It is a universal social resource. \r\n                    It cannot be kept a secret for any length of time. \"What one \r\n                    man has done, another man can always do again\" is old and \r\n                    profound wisdom. The one decisive resource of business, therefore, \r\n                    is as much outside of the business as are business results. Indeed, \r\n                    business can be defined as a process that converts an outside \r\n                    resource, namely knowledge, into outside results, namely economic \r\n                    values. 2. Results \r\n                    are obtained by exploiting opportunities, not by solving problems. All one can hope to get by solving a problem is to restore \r\n                    normality. All one can hope, at best, is to eliminate a restriction \r\n                    on the capacity of the business to obtain results. The results \r\n                    themselves must come from the exploitation of opportunities."
    }
  ]
}