{
  "url": "http://www.powells.com/authors/baxter.html",
  "file_number": "651",
  "content_hash": "f3420ca4433676706688cb0ea40c721032ae5acdec91a70b2e70ff68a7f77ffe",
  "total_blocks": 216,
  "retained_blocks": 10,
  "ignored_blocks": 206,
  "blocks": [
    {
      "tag": "div",
      "text": "Skip navigation Browse Sections Bestsellers New Arrivals Sale eBooks Gift Cards"
    },
    {
      "tag": "div",
      "text": "Advanced Search Marc Acito Lorraine Adams Jonathan Ames Martin Amis Roger Angell Karen Armstrong Marty Asher Kate Atkinson Nicholson Baker John Balzar Melissa Bank Julian Barnes Dave Barry Charles Baxter Paul Beatty Alison Bechdel Aimee Bender John Berendt Bob Blumer Judy Blunt Anthony Bourdain (2002) Anthony Bourdain (2006) Barbara Boxer T. C. Boyle Joshua Braff David Brancaccio Ann Brashares Susie Bright Po Bronson Geraldine Brooks Bill Bryson James Lee Burke Robert Olen Butler Peter Carey Stephen L. Carter Michael Chabon Deepak Chopra Mary Higgins Clark Billy Collins Michael Connelly Jill Ker Conway Mark Costello Jim Crace Michael Cunningham Christopher Paul Curtis Charles D'Ambrosio Regan Daley Meghan Daum Richard Dawkins Pete Dexter Bryan Di Salvatore Roddy Doyle Barbara Ehrenreich Gretel Ehrlich Bret Easton Ellis Jeffrey Eugenides Michel Faber Helen Fielding Jonathan Safran Foer Richard Ford Jonathan Franzen Ian Frazier Alexandra Fuller Neil Gaiman Daniel Gilbert Elizabeth Gilbert Malcolm Gladwell James Gleick Molly Gloss Allegra Goodman Stephen Jay Gould Philip Gourevitch Brian Greene Melissa Fay Greene Linda Greenlaw Andrew Sean Greer Sara Gruen Mark Haddon David Halberstam Ethan Hawke Jason Headley Mariel Hemingway Amy Hempel Carl Hiaasen A. M. Homes Nick Hornby Tony Horwitz Pam Houston Samantha Hunt John Irving Pico Iyer Joe Jackson Gish Jen Ha Jin Heidi Julavits Sebastian Junger Norton Juster Thomas Keller Christopher Kimball Haven Kimmel Dave King Ross King Stephen King Maxine Hong Kingston Elizabeth Kostova Robert Kurson Anne Lamott Erik Larson William Least Heat-Moon Dennis Lehane Annie Leibovitz Jonathan Lethem Michael Lewis David Lipsky Gregory Maguire Tucker Malarkey Ben Marcus Greil Marcus Jeffrey Masson James McBride Frank McCourt David McCullough Alice McDermott Ian McEwan David Means Anchee Min Denise Mina Susan Minot Lee Montgomery Rick Moody Christopher Moore Walter Mosley Bharati Mukherjee Laurie Notaro Michael Ondaatje Susan Orlean (2000) Susan Orlean (2001) Julie Orringer Ruth Ozeki Chuck Palahniuk Michael Palin Christopher Paolini Ann Patchett Ridley Pearson Jacques Ppin Arthur Phillips Tamora Pierce DBC Pierre Michael Pollan Richard Powers Tim Powers Philip Pullman (2000) Philip Pullman (2003) Jonathan Raban David Rakoff Ian Rankin Ruth Reichl Mary Roach Marilynne Robinson Rita Rudner Salman Rushdie (2002) Salman Rushdie (2005) Richard Russo Marjane Satrapi Eric Schlosser Sally Schneider Alice Sebold Jeff Shaara Gary Shteyngart David Skover Jane Smiley Alexander McCall Smith Scott Smith Zadie Smith Dava Sobel Wesley Stace Robert Sullivan Manil Suri Sarah Susanka Anthony Swofford Paul Theroux Helen Thomas Craig Thompson Miriam Toews Colm Tibn Calvin Trillin Zoe Trope Vendela Vida Sarah Vowell Jim Wallis Pat Walsh Liza Ward Alice Waters Sarah Waters Irvine Welsh Colson Whitehead Simon Winchester Find Books Award Winners Book Clubs Hosted Bookshelves Harry Potter New Favorites Recently Arrived Used Staff Picks Read the City Author Interviews Original Essays INK Q&A Fup. Store Cat. Review-a-Day Blog Win Free Books! Daily Dose PowellsBooks.news December 12, 2006 Archived Editions More newsletters Technica November 8, 2006 Archived Editions More newsletters PowellsBooks.kids December 6, 2006 Archived Editions More newsletters Listen to Chelsea Cain on The Bookcast at Powells.com and save 20% on Does This Cape Make Me Look Fat? ."
    },
    {
      "tag": "p",
      "text": "$10.36 Trade Paper"
    },
    {
      "tag": "div",
      "text": "Read the original essay by Gillian Flynn and save 30% on Sharp Objects ."
    },
    {
      "tag": "p",
      "text": "$16.80 Hardcover"
    },
    {
      "tag": "div",
      "text": "Charles Baxter Revisits Old Friends in Five Oaks Dave Weich , Powells.com Charles Baxter is a writer's writer. Mention his name in a crowd of authors and most will voice an appreciation for at least one of his books; many will simply rave. But it wasn't until Baxter's third novel that large numbers of mainstream readers discovered the joys of his writing. A 2001 National Book Award finalist, The Feast of Love \"is as precise, as empathetic, as luminous as any of Baxter's past work,\" the New York Times cheered. \"It is also rich, juicy, laugh-out-loud funny and completely engrossing.\""
    },
    {
      "tag": "p",
      "text": "Speaking of his past work: In the eighties and nineties, alongside a pair of novels Baxter also published a book of poetry, a collection of essays on writing, and four story collections. Three stories from the bunch, written years apart, focused on a young married couple living in Five Oaks, Michigan: Saul and Patsy. Who better to describe them than Saul's mother? They had an oddball marriage, and they both knew it. Their love for each \r\n  other had created a magic circle around themselves that outsiders could not \r\n  penetrate. No one who had ever met them knew what made the two of them tick; \r\n  the whole arrangement looked mildly fraudulent, a Hallmark card sort of thing. \r\n  Saul's mother, Delia, had had an unremarkable marriage and as a still-youthful \r\n  widow could be gamely witty on the subject of matrimony. Her opinion was that \r\n  marriage was a practical economic arrangement demanded by the raising of children. \r\n  In her view, Saul was a fanatical husband, close to unpresentable when he \r\n  was around Patsy. He should recognize this devotedness of his as a social \r\n  problem. People who stay in that kind of love once they're married are a burden \r\n  to others, Saul's mother intimated. They should learn to tone themselves down. \r\n  They don't mean to show off, but the show-offing happens anyway with the gestures \r\n  and the endearments and the icky glances. In this regard, Saul and Patsy also \r\n  perplexed their other relatives and friends, who sometimes wanted to know \r\n  their secret and at other times just wanted to get away from them, quickly. Does Saul and Patsy , the novel, continue the trajectory of those original stories? Yes and no. Baxter explains, \"The trouble was that the three stories Ihad written about them were basically marriage stories, and Ididn't want to write an entire book about a marriage.\" Instead, Baxter breaks the magic circle around his central characters. What results is the author's most piercing social commentary to date. \"It is rare that a novel, even a good one, manages to evoke contemporary life without being self-conscious about it,\" the New Yorker acknowledged. \"But that is what Baxter achieves here.\" Amild warning: The plot elements of Saul and Patsy discussed in this interview occur in the first of the new novel's four sections. Which isn't to say we don't give anything away, but only events in the early going."
    },
    {
      "tag": "div",
      "text": "Saul and Patsy Signed 1st Edition by  Charles Baxter \"Baxter's prose – trenchant, funny, and apt to turn on a metaphysical dime – remains one of the pure pleasures of American fiction, and he deserves a wide readership for this book.\" James Marcus, The Atlantic Monthly More about this book/ check for other copies The Feast of Love by  Charles Baxter \"Ihad scarcely read twenty pages of Charles Baxter's superb new novel ? a near perfect book, as deep as it is broad in its humaneness, comedy and wisdom ? when Ibegan to worry Icouldn't do it justice in a review....If there is any justice, this new novel will win him the wider fame and readership he deserves.\" Washington Post Book World List Price $14.00 Your Price: $8.95 (Used - Trade Paper) More about this book/ check for other copies Burning Down the House: Essays on Fiction by  Charles Baxter \"In nine brilliant essays, Baxter displays his characteristic wit and intelligence as he muses about the influences of culture and politics on the art of storytelling.\" Ploughshares Your Price: $15.00 (New - Trade Paper) More about this book/ check for other copies How to Breathe Underwater: Stories by  Julie Orringer \"These are wonderful stories. There is a headlong narrative energy in Julie Orringer's stories that Ifind quite remarkable, and it is combined with a tremendous intelligence about the behavoir of children and adolescents.\" Charles Baxter More about this book/ check for other copies Lost in the City by  Edward P Jones \"Fine, fine work – a voice that's new and strong but steeped in the traditions of African-American literature, spoken and written, in a voice already in its quiet, assured, marvelous way, extending those traditions.\" John Edgar Wideman List Price $12.95 Your Price: $5.95 (Used - Trade Paper) More about this book/ check for other copies Look at Me by  Jennifer Egan \" Look at Me is the real thing – brave, honest, unflinching. [It] is itself a mirror in which we can clearly see the true face of the times in which we live.\" Francine Prose, The New York Observer List Price $14.95 Your Price: $7.95 (Used - Trade Paper) More about this book/ check for other copies"
    },
    {
      "tag": "p",
      "text": "Dave: Iwas introduced to your writing eight or nine years ago when Iread Shadow \r\nPlay . It was interesting to go back to it after reading Saul \r\nand Patsy . I'd forgotten that Five Oaks, Michigan, is the setting for Shadow \r\nPlay , too. Charles Baxter: Why would you remember? Dave: Right. But then Iwent back to it, and Ithought, Oh, right, \r\n the chemical plant. Baxter: It's still there, still pumping out its particular poisons. \r\n Schwartzwalder is still at work. It's nice having these other books with various backgrounds to fall back on. \r\n Igot to a point in Saul \r\n and Patsy when Ineeded to think of a company that was still doing business \r\n in Five Oaks, and Ithought, Well, WaldChem is still there. It started \r\n up in Shadow Play and it's still going. Dave: In an interview with Tin House a few years ago, you said \r\n that you didn't know whether you had the imaginative energy left to finish a \r\n book about Saul and Patsy. What happened? How did you end up writing this novel? Baxter: After The \r\n Feast of Love came out, my batteries were low. Ithought of going back to \r\n Saul and Patsy, about whom Ihad written intermittently for some time   \r\n the first of those stories came out twenty years ago   but the trouble \r\n was that the three stories Ihad written about them were basically marriage \r\n stories, and Ididn't want to write an entire book about a marriage. Ididn't \r\n think that it would be interesting, and Ididn't think Ihad the imaginative \r\n energy to carry through on a project like that. What happened was that one writer, William \r\n Maxwell , who had read the third story, \"Saul and Patsy Are in Labor,\" said \r\n to me, \"You know, Idon't think we've seen the end of Gordy Himmelman.\" Ithought, All right. I'll write another chapter with him in it and see how far Ican \r\n take it. Idid two of those chapters   or, it turned out to be three \r\n of them   when, rather abruptly and somewhat to my surprise, Gordy killed \r\n himself. Idon't know whether when Iwas talking to Tin House Iwas referring \r\n to the problem of continuing a novel about a married couple or whether Iwas \r\n talking about what to do after one of your major characters kills himself. Ispent about four months trying to figure out what Iwas going to do after that \r\n happened. Every time I've finished a book, it feels to me as if the washrag has been \r\n rung out. Everything that Iknow, everything that I've observed or taken down, \r\n I've used. Ifeel that way now. Ican't see what the next book will be. Idon't \r\n have an endless supply of subjects. But Ialso think, I'm not a factory; \r\n Idon't have to go into mass production. Productivity in and of itself is \r\n not a good thing. If there isn't another book, there's not another book. Dave: Going back and forth between stories and novels, does that offer \r\n a release for you, to be able to change gears and work on a smaller canvas after \r\n spending so much time and energy on a novel? Baxter: It used to. When Iwas a writer whose sales were respectable \r\n but kind of negligible, it didn't matter whether Iwrote novels or stories, \r\n but then The \r\n Feast of Love sold quite a few copies. And it's not that I've got this expectation \r\n directly from my editors, but Ithink they would much prefer that Iwrite novels. Ithink what Ido next is likely to be in the realm of the short story. It was always a release for me to be able to go back and forth. When Ihad \r\n characters who were feeling impulsive and who were not particularly conscious \r\n of making great plans, I'd put them into stories. And I've been thinking that \r\n Iwant to go back to that after writing this book and Feast \r\n of Love . It's about time Idid another book of stories. Dave: So you do consciously think about writing a book of stories. \r\n It's not a matter of, Now I've written twelve stories and I'll collect them \r\n together in a book. Baxter: That's the way Iused to be, but when Iwas working on the \r\n stories in Believers Iwas very conscious of working on a group of stories that were more or less \r\n about a similar theme, that is: people who are choosing to believe something \r\n or not, and whose belief would change the direction of the narrative. Now I'm \r\n more likely, if Iwrite a short story, to think, What other short stories \r\n could Iwrite that would have something to do with the story I've just written? Inever used to think that way, but Ido now. Dave: The \r\n Feast of Love was the first novel you wrote in first-person, but you \r\n use six different voices to tell the story. Baxter: Right. Dave: They're not self-standing stories, but they are distinctly different \r\n voices. In that respect, it's almost as if the novel emerges from a community, \r\n a little like a collection of stories. Like a chorus. Baxter: Iwas thinking about those old narrative forms: The \r\n Canterbury Tales or The \r\n Decameron , the sort of forms that Calvino was drawing upon in If \r\n On a Winter's Night a Traveler , a chorus of voices talking about similar \r\n subjects or one subject. At one level, Ithought, This is so literary. Idon't know that I'm going \r\n to get any reader to believe. It's assumed that there's this guy Charlie \r\n who has insomnia and is wandering around Ann Arbor collecting stories about \r\n love from people he knows. It's preposterous in a way because people won't talk \r\n about their love lives most of the time to anybody, much less to someone they \r\n hardly know. But it was a way of writing a novel using different stories. Ilove to break up the big arc with a lot of little arcs. I'm very comfortable \r\n doing that. The standard novel form doesn't interest me very much, the one that \r\n goes from Ain a smooth arc full of suspense to its ending. Ijust don't \r\n care about books like that very much. I'm really interested in jazzing the form \r\n somehow, making readers think they actually don't know where the story is going. The \r\n Feast of Love is a kind of hybrid: a novel that is made up of a lot of little stories, \r\n mosaics that create a larger narrative. Even Shadow \r\n Play is like that. It's a very episodic book. Dave: In much of your fiction, certainly in Saul \r\n and Patsy , we'll see the same scene described from two different points \r\n of view, one after the other. One moment we're experiencing the scene with Saul, \r\n then you rewind and we're with Patsy. The narratives overlap. Iwould imagine that develops in a later draft once you've worked out what's \r\n happening and now it's a matter of figuring out where to put the cameras. Baxter: That's something that I've done for a long time. There are \r\n double-narrated scenes in First \r\n Light , and that book came out in 1987. There's something about revisiting scenes from different points of view that \r\n I've always liked. It's given me the opportunity to do a Rashomon approach to narrative: everything depends on who's seeing it and from what angle. Iguess that arises in revisions and subsequent drafts, but it's so hard for \r\n me to reconstruct the writing of a book after I've written it that Icouldn't \r\n actually tell you when Ithought of, for example, Patsy arriving at home when \r\n Howie is in the living room; she's carrying Emmy and she's thinking, We've \r\n got to get out of this place. Ihave absolutely no recollection of how Idecided or why Idecided to do that particular scene twice. Ijust felt it was \r\n particularly important to do the scene from her point of view when she comes \r\n in the door and sees Howie and also to do it from Saul's point of view, when \r\n he's trying to deal with Howie and suddenly Patsy comes in. Dave: Salman \r\n Rushdie was here about a year ago. We got to talking about what he called \r\n his \"language project,\" how his writing style and interests have evolved. When he sits \r\n down to write now he has different objectives. Do you see \r\n an evolution in your own work, in your fiction? How would you say that your vision \r\n has changed? Baxter: Ithink it's getting darker. I've been surprised by some of \r\n the commentary about Saul \r\n and Patsy , as if it's this sun-drenched novel about a marriage   because \r\n that was not the book Ithought Iwas writing. Idon't think too much about what it is that I'm doing, though. Idon't think \r\n that's necessarily very good for writers. You can talk about what you're interested \r\n in and the kinds of people that you're watching, the cluster of behaviors they're \r\n involved in; and as you get older, because you're aging, you're beginning to \r\n look at different things; because you're looking at different things, you're \r\n bound to become a different writer. But it's not as if it's willful for me. \r\n It's not an act of will. Idon't say, Now Iwill write about the fate of \r\n the entrepreneur in America because it needs to be studied. Idon't work \r\n that way. It's much more a matter of thinking that Ineed to write about this \r\n group of people whom I've been watching or whose behavior interests me. Isaid half-facetiously to a reporter at the New York Times that I've \r\n gotten interested in psychopaths lately. And Igot a horrified phone call from \r\n a writer friend of mine saying, \"You're not serious.\" Isaid, \"Well, no. They \r\n didn't get my tone.\" But Iwas serious, actually. Ijust don't let the \r\n will direct things. It's a matter of what I'm drawn to next. Dave: Well, for example, how did you come to write The \r\n Feast of Love in the first-person instead of using \r\n the third-person, as you had in your previous novels? Baxter: It was partly that Ihad seen my son in a production of A \r\n Midsummer Night's Dream , and Ihad the idea that if Iwas going to tell \r\n a love story, if Iwas going to write a book on that subject, it was important \r\n to get it in the voices of the people who were experiencing it. Like a play \r\n   or, this time, a hybrid of a novel and a play. Iwanted to get the energy of colloquial language into it more directly than \r\n Iwould have been able to if Ihad done it even in a close third-person. So \r\n Idecided just to try it and see how far Icould get with it. Istarted with Bradley. He was a hard character to get moving, but once Chloe \r\n came on the scene, Ithought, Maybe this is going to work. That's why \r\n Idid it. Mostly the energy. Just the energy of spoken discourse. Dave: There's a quote from you on the back of Julie \r\n Orringer 's book, How \r\n to Breathe Underwater , where you talk about the energy of her stories. Ihaven't been reading many story collections lately, in part for reasons you alluded to earlier: story collections don't have the marketability of novels; \r\n or, another way to put it is that the people who visit Powells.com aren't likely \r\n to care as much about a new story collection as they might a new novel. But \r\n Icompletely fell into Orringer's book. And Ithink you put your finger on the reason: It was something about the energy, the \r\n way the stories propel you forward. Where does that energy come from? Baxter: This is a dumb way to answer it, but first of all it has to \r\n come from the writer; the writer has to feel it. But where does the writer get \r\n it? There are a couple explanations, both really contingent, but you can argue \r\n that when a short story writer really makes a mark Grace \r\n Paley , Ray \r\n Carver , people who can write stories and almost can't write anything else \r\n   it's because they've discovered a certain class of character and the \r\n way those characters sound that really fills the gas tank and gets the thing \r\n moving. Grace Paley's stories don't sound like anybody else's. Carver's didn't \r\n either. You felt when you were reading those stories that you were discovering \r\n a certain class of people: Carver's working class people who shop at Kmart and \r\n drink too much and are kind of going crazy over the weekends. So there's that. There's also the sense of people who are really acting impulsively. That's \r\n what Ithink short stories are really good at. There's more impulsive behavior \r\n in short story collections. There's a lot of energy derived from observing people \r\n who aren't thinking about what they're doing. Julie's book has a lot of that, \r\n a lot of those characters. Iincluded one of her stories in Best New American Voices 2001 , \r\n and in the introduction Isaid, \"If you start reading this story it's almost \r\n impossible to stop because it's about young people who are just acting out one \r\n thing after another.\" Ithink that's where the energy comes from. Dave: Have you recently read anything so good that it made you want \r\n to rush over to the table and start writing? Baxter: That doesn't happen to me often anymore, but my former student, Michael \r\n Byers , wrote a beautiful book called Long \r\n for This World . Iwas going around button-holing people, saying, \"You should \r\n read this book.\" Iwas buying copies of it because Ithought it was so good. Afew months ago, by chance, Iread Jenny \r\n Egan 's book, Look \r\n at Me . Ithink that's an amazingly good book about a lot of different things. \r\n And those things that it happens to be about are important in the society that \r\n we seem to be building for ourselves. Have you read it? Dave: Ihaven't. Baxter: It's really, really good. Siri \r\n Hustvedt 's What \r\n I Loved is a very interesting book also. Istill have these enthusiasms. Sometimes I'm reading books by my contemporaries \r\n or my former students out of sense of dutifulness, but sometimes it really blossoms \r\n into a big enthusiasm. Inoticed that Edward \r\n P. Jones has published a new novel [ The \r\n Known World ]. He is one of the best still-to-be-discovered writers in America. \r\n His book of stories, Lost \r\n in the City , is a great book. Imagine an African American Kafka . \r\n Imagine black people in Washington D.C. how Kafka might have seen them, caught \r\n up in various bureaucracies, and you'd have a sense of that book. Ithink it's \r\n just been reprinted now that his novel is out. That's a book I've recommended \r\n to a lot of people and they're just amazed when they read it. Dave: As we were walking up the stairs you mentioned that you've written \r\n an essay for The Believer about the fact that novelists no longer describe their characters' faces. Can \r\n you expand upon that? Baxter: If you're reading a novel by Dickens or Austen or Thomas \r\n Hardy , when a new character comes on, the character's face is going to be \r\n described and it's going to be used as an indication of what that person's character \r\n is like. In the twentieth century, it's very rare for writers to do that except \r\n when they have really grotesque characters they want to show you: Flannery \r\n O'Connor , William \r\n Faulkner , Richard \r\n Wright ? The characters that really get described are the ones that really \r\n look strange. One of the last writers in North America who believes in a description of \r\n a character's face as an index to character is Saul \r\n Bellow . And in this essay I've spent part of the spring putting together \r\n Iwas trying to figure out why. Why doesn't anybody do this anymore? People still describe facial reactions, but that's not quite the same thing. Paula \r\n Fox is great at facial reactions. In a book like The \r\n Widow's Children you always know how people are reacting to everybody else, \r\n but that's not as if you're going to get a sense of who they are. Ijust got interested. And Istarted to think, given our recent political \r\n history: Whose faces we are being invited to look at and whose faces don't we \r\n see? Iwas really interested during the war how we weren't getting casualty \r\n counts of the Iraqis and how the photographs of the Iraqi population often showed \r\n people shouting and angry. All of my essays come out of obsessions. They come out of nowhere, why I'm \r\n thinking these things. Dave: Ihad fun reading through Burning \r\n Down the House . Iwas intrigued by the idea of not being afraid to overstate \r\n your case. You explain in the introduction, \"The reader may notice that one \r\n of the means Iemployed to create such excitement was the wild claim. There \r\n are a number of wild claims here, an occasional manic swing toward the large \r\n statement.\" We're featuring a new collection by Lester \r\n Bangs [ Main \r\n Lines, Blood Feasts, and Bad Taste ], and reading Burning Down the House reminded of something Greil \r\n Marcus said about Bangs's writing: \"Lester was very, very good at not censoring \r\n himself. That's one of the hardest things for a writer: to figure out what you \r\n really want to say, then to say it   not to say what will sound good and will \r\n reflect well on you.\" Baxter: Gertrude \r\n Stein called this \"the excitement of unsubstantiated generalities.\" When \r\n Iwas writing that book Ijust gave myself permission to say what Iwanted to \r\n say. If the generalization seemed big, well, so what? It's my book. Ithought \r\n Icould say what Iwanted to. If you disagree with me, or if you think I'm crazy \r\n or silly, all right. Iwas trying to get some excitement back into literary criticism. There are \r\n books like Robert \r\n Hass 's Twentieth \r\n Century Pleasures , a book of essays about twentieth century poetry, that \r\n had that same excitement for me. And Ithought, Iwant to do something like \r\n that for fiction. People sometimes get upset. Ihaven't heard the last of that \"Against Epiphanies\" \r\n essay or the one about dysfunctional narratives, \"Mistakes Were Made.\" But with \r\n \"Mistakes Were Made,\" Ireally felt Iwas on to something. Iwas watching Cheney yesterday on Face the Nation : complete disavowal \r\n of responsibility for all bad outcomes. Dave: Politically, that's the norm today. The funny thing about reading \r\n \"Mistakes Were Made\" now is that you cite Nixon and Reagan and the first Bush. \r\n All of them, of course, begot Clinton. Baxter: Right, right. We were just on the frontier of disavowals in \r\n those days. We hadn't seen anything compared to what we've gotten. It's amazing. Dave: It's a bit unsettling to read that essay and, in retrospect, \r\n think, Well, yeah. Baxter: Yeah. Stating the obvious. When the essay came out, it created \r\n a little bit of a stir. People had talked about dysfunctional narratives, but \r\n they hadn't actually tied this feature of victim literature to certain features \r\n of political rhetoric we were getting. Ithink maybe that was new. Dave: The other essay you mentioned, \"Against Epiphanies,\" Ifound \r\n interesting in the context of Saul \r\n and Patsy . One of the things that Ifound endearing about Saul is that he \r\n has epiphanies throughout the course of the book, but he knows they're not going \r\n to last. So they're not epiphanies in the traditional sense, but more like moments \r\n of ecstasy. Baxter: They're not eternal verities; they're not going to last. Ihad my little joke on the epiphanic moment when Iwas working on the second \r\n one of those stories, \"Saul and Patsy Are Pregnant.\" At the end of that story, \r\n Saul grasps the entire secret of the universe, the meaning of everything, and \r\n he promptly forgets it. It doesn't get into the story. It's not an epiphany; \r\n it's about the feeling of understanding everything. It's just a feeling. Oh, \r\n yeah, that's what it is. Dave: You've been doing interviews for a long time now. Is there something \r\n you're fascinated by that everyone seems to be missing? Baxter: People in the book business, people who are in your position, \r\n are usually pretty smart. They've usually read what I've written fairly carefully. \r\n The only thing that's caught me at all by surprise lately, with this book, is \r\n that there have been a number of commentaries that have said that it's a marriage \r\n novel, it's about these Midwesterners, it's about innocence, it's about this \r\n essentially good couple? What Ithought Iwas writing about was the sense of being excluded from happiness. \r\n That's what Ithink this book is about. Saul feels as soon as the third \r\n chapter that the McPhees are living in this state of happiness and he has to \r\n stand outside of it, like the beggar at the bakery shop window. That whole sense \r\n of exclusion gets repeated with Gordy, who stands outside Saul and Patsy's house, \r\n looking inside. Then there's this whole army of kids who seem to have been deprived \r\n entry into the world that maybe somebody had suggested to them they might someday \r\n live in. That's really the only thing that nobody ever asks me about. It's always seemed \r\n to me that a lot of my work has to do with somebody watching somebody else who \r\n is happy. For me, stories begin with a kind of displacement; they're not about \r\n people who are happy, but about the people who are watching others be happy \r\n and trying to figure out how to get there or what it was that those other people \r\n did to arrive in that state. It's all over my writing. Charles Baxter \r\n visited Powell's City of Books on September 15, 2003."
    },
    {
      "tag": "div",
      "text": "Help Security and Privacy Shipping Money Back Guarantee Order by Phone Contact Us Newsletters Blog Events Partner Program Employment About Powell's Books Souvenirs Laurels! 2005 Best of the Web EPIC Official Bookseller Forbes Favorite Sexiest Staff RSS 2.0 Log Off Copyright © 1994-2006 Powells.com Terms of Use"
    }
  ]
}