{
  "url": "http://www.psycho-ward.org/story/return/ch6.shtml",
  "file_number": "658",
  "content_hash": "167515ad7b45ba290688d09daa79e882ae6bf06d3e8115d6e73501e4a67a514b",
  "total_blocks": 216,
  "retained_blocks": 4,
  "ignored_blocks": 212,
  "blocks": [
    {
      "tag": "div",
      "text": "Mozilla doesn't understand .firstChild if <a> is not adjacent to <p> (as in separated by a line break, space, or tab. So, Ijust put the last angle bracket of the <p> on a new line"
    },
    {
      "tag": "p",
      "text": "Home Guest Services Reader Responses Weekly Poll Quote of the Day Snow-Globe of Social Commentary Denizens Recommended Links Copyright Plot of the Goldfish Advice Racist Crosswalk The Inherent Communist Nature of Schools Texas-Chile Conspiracy Fun Facts to Ruin Your Day Inappropriate Fortune Cookies Letter to AOL Kiwi-Strawberry Jesus' Appeal The Plot Jingles Operation Cheddar Reader Responses The List Spoons Dangerous, Experts Say How to Never Use Another Spoon Outsiders and Others Stirring Reader Responses Majestic, the Crime-Fighting Falcon Bottom of the Barrel Comics The Perfect Villain Calmok's Adventures Is This Insane or What?! Ads Not Often Seen Technology at its Best Headlines Politics Return to Dawn Part 1 Return to Dawn Part 2 Misadventures of a Post-Apocalyptic Trombonist Pork Soup for the Soul About Split Stories -The Movie With Fred -The Doctor, the Blonde, and N. -Battle of Four Forces -Of Gaturtles and Satan -Rozy Helluva Dead -Jewel of the Damned -Chia-man's Quest -Short But Sweet Chapter 1 Chapter 2 Chapter 3 Chapter 4 Chapter 5 Chapter 6 Chapter 7 Chapter 8 Chapter 9 Chapter 10 Chapter 11 Chapter 12 Chapter 13 Chapter 14 Chapter 15 Chapter 16 Chapter 17 Chapter 18 Chapter 19 Chapter 20 Prologue: Coming Home Chapter 1: Five Years Hence Chapter 2: Hell Chapter 3: Deities Chapter 4: Watch Chapter 5: Rush Table of Contents Things Get Better The Bully Cursors TI-83+ Calculator D/Ls Movies and Sounds Birthday Cards Ridiculously Easy Games -Click Me -Click/Don't Click -Number 3 -Ball and Box -Double-Click Me -True or False? -The Right Choice Ow, My Eyes Coolest Game Ever E-quarium"
    },
    {
      "tag": "h1",
      "text": "Chapter 6"
    },
    {
      "tag": "p",
      "text": "Iawoke that morning, but not from my usual dream. Instead, Tarpeia had - no wait... that had actually happened! Slowly, Iwalked towards my door and opened it. No one was there. The whole place seemed empty. Iclosed the door. Peace at last. Imissed Tarpeia, but at least Xanthe was gone. Within minutes, Iwas ready for classes and started walking down the hall. Surprisingly, Istarted humming a happy tune. Maybe yesterday hadn't been that bad. Iwas better off alone, anyway; Ipreferred solitude. Yup, me, all alone, by myself.... At the Training Room, no one was waiting for me. No one to nag or insult me. My whistle echoed off the walls. Iwas there a bit early; no one had arrived yet. Not even Master Laywin was there. Iwas alone. Good, time for myself. What was Igoing to do with that time? The other students began filing into the room after a few minutes. Each one seemed to give me a hostile look as they came in. Tarpeia and Xanthe were missing. Maybe Master Laywin was talking with them, and Xanthe was being reprimanded (for once), Icould be saved! Yet, everyone's stare seemed to portray me as the guilty party. Ishifted in my seat, uncomfortable. This can't be right, Ithought, I'm being paranoid. Besides, it's like I'm feeling guilty. But Ididn't do anything. So Ishould be okay. Ilaughed aloud at my absurdity - which brought more stares to me. My laughter abruptly turned into a nervous chuckle. Master Laywin finally came in the room. When he looked at me, he gave an exasperated sigh. Dread coursed through my body. What was he going to do? Ifeared the worst, but he just gave the next lesson. For once, Ipaid attention, to take my mind off yesterday's events. He spoke in that same droning tone that almost always put me to sleep, \"Ihope you all enjoyed your day off.\" Irefrained from voicing my opinion. \"Yesterday was a time for fun. Today is a time for lessons. We will refine our techniques for altering sounds. You already know how to increase and decrease volume, for yourself, and for the masses.\" Iremembered that day clearly. First, we started with putting it in our mind that we heard it softer. The hardest person to convince is yourself. However, it wasn't as if we were deceiving ourselves. It was a magical technique to alter your mind's view of the world. Idon't know exactly how, Iwasn't paying attention to Master Laywin (as per usual). So Ididn't remember that day crystal clear, unlike yesterday, which no matter how much Itried to bury it, it still stuck in my mind. Master Laywin's lecture continued, \"Now you will learn to modify all aspects of sounds, including changing tones, pitch, timbre, and even one's voice. Modulating one's voice may come in handy some day.\" Every time Master Laywin mentioned something that \"may come in handy some day,\" he went off into his own world for a few seconds. Ipersonally believed he was relieving old events. Imean, what else could it be? Waves of nostalgia hit old people a lot. Yet, now Ifound myself wanting the past, before yesterday. Was the past simpler, or was Inot paying attention then? The great Master redeemed his composure. \"Yes, Iremember one day Iwas in quite a mess.\" This was a first - Master Laywin had never given anecdotal stories before. He always believed in lectures. Or maybe he had before, how could Ibe sure? Inever paid attention, and Tarpeia or Xanthe wouldn't be likely to retell Master Laywin's story. Then again, who really cared (except the old geezer himself)? \"Iwas acting as a mediator between two kingdoms ready for war. Nothing Icould do would stop them - war was inevitable. The two kingdoms hated each other a great deal. When war finally broke lose, both kingdoms wanted my head for associating with the other. Of course, Ifigured that they couldn't harm me. After all, even then, Iwas a very powerful magician. That next day, Iwas captured. Quite easily, Imight add. They locked me in a dungeon. You'd think getting out would be an easy task for a magician. However, they starved me and kept me weak. Then the day came for my execution. Isat on near the gallows as they read my sentence. Asimple spell kept me alive. Imodulated his voice, so the words changed to 'Let him free.' In addition, when the King protested, Imodulated his voice to chant 'Let him free.' The chant caught on in the crowd, and Ibarely got away.\" Master Laywin chuckled at his own wit. Ihad never realized how clever he was. He was lucky, though, you can't keep up voice modulation spells for a long time. If the crowd hadn't caught on... well, then, Isuppose Iwould be listening to a different Master now. Keltin raised his hand. \"Yes, Keltin. What is it?\" asked Master Laywin. \"Um,\" Keltin began, \"oh yeah, what're you doing about the kids who are not here?\" So far, no one had been sick yet, so we didn't know what happened when you weren't there for studies. However, Idoubted Tarpeia and Xanthe were sick. Oh well, good riddance to them. That left me... all alone... alone.... Master Laywin answered, \"Iwill privately give them a brief lesson.\" Now Iwish Iwere sick, Ithought, then Iwouldn't have to listen to him so long. Istill didn't understand why Xanthe had done what she did. Sure, she'd been mean before, but not that bad. Ever since Imet her, she seemed to grow meaner and meaner; with an exponential growth at the time Imet Tarpeia. Why couldn't she just get along with Tarpeia? Xanthe was excessively selfish. Why can't she ever think of anyone else? Or even think about my feelings for once? Ihad thought of her as a friend, but now she was my enemy. Isuddenly remembered my threat - maybe she had heeded my warning. Once class was over, Iwould have to see Tarpeia. She'd understand once Iexplained it all. The rest of the day went by quickly, and Iexcelled at the exercises, as per usual. We were all talented, but Ihad an uncanny knack for it. Ihad an uncanny knack for a lot of stuff. During the last hour, Master Laywin let us practice ourselves in the Training Room while he went to see Tarpeia and Xanthe. For once, Iconcentrated on my studies, having nothing else to do. It was good for me anyway. However, Istill missed Tarpeia, so Istrengthened my resolve to talk to her. Some of the girls were huddled together gossiping. There was no doubt in my mind that they would speak of Tarpeia. Part of my studies was to carry sounds to hear it better. Idecided to employ that technique now. \"... you hear about Tarpeia?\" asked one girl. \"Ican't believe that jerk did that,\" stated another harshly. \"And then he blamed poor Xanthe,\" said yet another. \"Now she's locked up in her room crying,\" said one more. \"Poor girl,\" said girls two and three at the same time. Poor Xanthe? It was her fault though! \"Don't forget Tarpeia!\" exclaimed the first. \"Yes. Ididn't see Cadell as that kind of person.\" Well, I'm not, Isaid silently to myself. \"Better not talk to him, he'll probably do the same thing to you,\" volunteered a girl who hadn't spoke before. \"Yea,\" agreed the fourth one who had spoken. \"Icould just -\" started girl number two. \"Iknow how you feel. He's such a jerk!\" the first finished. At that point, Ituned out, not wanting to hear more. This wasn't good. Iwas painted as the bad guy. Yet another reason to hate Xanthe's guts - and another to get back with Tarpeia. Itried to get back to studies, but curiosity got the better of me, and Ilistened again. \"It was Xanthe's birthday too,\" stated one. Her birthday? Ididn't know it was - Suddenly my mind recalled an event from about a week ago. Xanthe had said when her birthday was, and Iwas getting Tarpeia a gift instead! Nevertheless, that still gave her no excuse for what she did. What she did was absolutely unacceptable and unforgivable. Ihad to get my mind off this. Iwent back to studies. Before Iknew it, Master Laywin had returned and dismissed us. Ihurried to Tarpeia's room, to try to reason with her. Iknew she wouldn't speak to me right off, so Idisguised my voice. \"Amessage for you, milady.\" Tarpeia opened the door slowly. \"Oh... it's you ,\" she said vehemently. Her voice quavered and was full of anguish and anger when she said, \"Inever want to speak to you again, Cadell!\" She slammed the door shut in my face. \"Tarpeia, if you'll just listen...\" Itried pathetically. \"Idon't want to hear it! Go away!\" she yelled, sobbing intermittently. Defeated, Islowly walked away. If only Icould convince her that it was Xanthe. But how? How could Iget her to believe me? Suddenly, Iheard Tarpeia's sweet happy voice from afar. \"Cadell? Can you come over here?\" What! Curious, Itraced my steps to the voices origin. Lo and behold, Xanthe was standing right there. All of a sudden, it dawned on me what had happened. Xanthe had modulated her voice to sound like Tarpeia's! \"Iknow you don't want to listen to me, but-\" she started. \"Idon't, so shut up.\" Iabruptly cut her off. \"I'm sorry, okay. Iknow what Idid, and I'm sorry.\" \"You think Icare?\" Xanthe started crying, \"No, you don't get it. I'm really sorry, and Iwant to make it up to you.\" \"You think Icare?\" Irepeated coldly. \"Ican never forgive you for that day. More than one thing happened. Tarpeia won't even speak to me anymore.\" \"Ican fix that... Ican... Ican...\" she started sobbing again. \"Shut up. Idon't care. Go away.\" Instead of waiting for her to go away, Ileft myself. Sorry... hah! How could Iever forgive her ? *** Coldness bit into my skin. It was predawn, but usually it wasn't this cold. The winter solstice was nearing. Ifelt a little sadness at that, because autumn was my favorite time of the year, climate-wise. Isat up in my bed; gray, hard stones surrounded me. My room looked much the same as it did when Ifirst came here. It was hard to believe that Ihad been here for almost a season. The incident with Tarpeia seemed a lifetime ago, also, yet it had only happened two days ago.  The castle Ihad been living in for so long felt uninviting now - as if no one cared for me. Long gone were those sunny early autumnal days. Iglanced at the hourglass. It was half past the fourth hour of the day. Usually, if it was this early, Isimply went back to bed. Thoughts of Tarpeia and Xanthe clouded my mind, however, so Idecided to stay up. Iwent through my daily \"waking up routine\" very slowly. Iwas ready to go one hour later. It was still quite early, so Iwalked around the castle, as Iused to do with Xanthe often. She seemed increasingly bitter as time went on, until yesterday. Still, it was only a slight improvement, and who knows what her ends were. After maybe half of an hour's worth of wandering, Ireached the long and winding staircase leading to the roof, which Idecided to climb up, not having much else to do. The view was nice at the top. Isat on a parapet and watched the sun rise. The dawn was tranquil; most people were not up by then. The bright sun crept up the horizon and into the sky; it's rays cascading off a hill and into the castle. It was a beautiful sight; one he wished Icould share with someone. However, Istill sat up there alone. Istared over the parapet and down to the ground. It was a fair distance. Ilifted myself up, and stood upon the parapet. Jumping off from here, down to there, could solve my problem. It wouldn't matter, who would care? Okay, on three, I'll jump. One... two... three... Iheld my breath and prepared myself. Four... five... In the end, Icouldn't bring myself to do it. Ispat over the edge, disgusted at my cowardice. Idesperately wished that something would come along, that would make my life worth living. *** Tarpeia did not come to the day's studies, but Xanthe did. As she sat down at our ebony table, Iglared at her - a warning. She seemed scared and avoided eye contact. Once Iremoved my glare, Ididn't look at her again once, through most of the day's studies. Then, came our midday meal. Most days, we didn't have a true midday meal. We munched on small snacks at intermittent intervals, instead. Today was different, however. Master Laywin decided we would have one at the Lesser Dining Hall. Ididn't know why, and for the most part, Inever understood him. Great Masters are very enigmatic. Furniture in the castle was usually black ebony. The table at the Lesser Dining Hall was made from a pine evergreen. It seemed to be carved from one giant log. Pine was more suited for a dining table than ebony. It was enough to seat all of us with one seat to spare. The table was long on narrow, with only one spot at the head. Master Laywin sat there, of course. No one ever sits at the foot of a table. Itook a seat in the middle, on the left. Xanthe sat in the seat next to me, on the right. Asteady hateful glare from me made her move over one seat. We were served meat, fruit, and bread. To drink, there was apple cider. As Iwas eating, an envelope was slipped to me. On it, scrawled in Xanthe's sketchy, but ornate, handwriting was, \"Cadell.\" The bag was a bit heavy and jangled when Ishook it. Golds? Ipondered simple tossing Xanthe's message away, but curiosity got the better of me and Iopened it. My guess was correct, inside were 130 golds (in ten-gold pieces). Idiscreetly slipped the golds in my pocket, and saw no need to thank Xanthe; after all, she had stolen the money from me originally. Besides, she still owed me. Near the end of our meal, Xanthe came up to me and handed me a note. Igrabbed it from her and read it. It said, \"Now that I've paid you, can you please at least talk to me?\" Ilaughed aloud, and that brought a hopeful look to Xanthe's face. \"You still owe me,\" Isaid cruelly. Desperately, she tried to explain, \"On the way back to the castle, someone stole it. But Ican still pay you, just give me some time. I'm sorry for everything, especially how cruel I've been to you. Ipromise I'll make it up. Please...\" \"Don't give me your stories. You still owe me,\" Irepeated. Xanthe looked disheartened. Good. At that, Itore up her note into pieces and walked out of the Lesser Dining Hall, my midday meal unfinished. *     *     * Ididn't speak to Xanthe for the rest of the day. At the end of the day's studies, Iwent into my room and dropped the bar that locked the door, not having enough energy for a protection spell over my door. An hour later, Tarpeia's muffled voice came through the door. \"Cadell? Can Icome in?\" With a stifled grunt, Iwalked over, hoping it wasn't Xanthe. Idoubted it, but still.... Iopened the door, and sure enough, Tarpeia was there. \"Come in,\" Isaid, gesturing inside. \"I'm sorry Ididn't believe you before,\" she said. \"Who? What?\" Iasked, confused. \"Xanthe told me everything, the whole truth.\" \"She did?\" \"Iwas going to throw her a surprise party at the end of that day for her birthday, and then, well, you know what happened.\" \"Isure do.\" \"Still, it was her birthday.\" Ilaughed harshly, \"And that gives her an excuse?\" \"Ididn't say what she did was right.\" \"Sure sounded like it.\" \"That's the problem with you: you never listen.\" \"Who's the one that didn't listen to me?\" \"Why are you always so mean?\" \"Me! Mean! What! What about Xanthe! Remember over a hundred lashings? Remember you leaving me? Remember me being humiliated?\" \"Iremember, but -\" \"Why are you sticking up for her? When did she ever do anything nice for you?\" \"Cadell!\" \"I... I'm sorry. Ishouldn't be mad at you.\" \"I'm glad you're coming to your senses.\" \"Ishould be mad at Xanthe.\" \"You... you just don't understand.\" \"Idon't need to understand Xanthe. Iwant her to go away.\" \"Cadell, why are you like this?\" Idecided not to reply. Instead, Iembraced her and kissed her hard. For that fleeting moment, all my troubles went away. My anger melted into nothingness. My body filled with pure bliss. Tarpeia went with it, but she finally pushed me away. \"Tarpeia, Ijust want to be with you,\" Isaid, \"You know it was Xanthe, so why can't we just get back together?\" She pushed me back farther, \"I... I... Ijust can't. You wouldn't understand. It was nice. But - I'm done with you - Iget these weird feelings, that Ican't explain. We just can't be together.\" \"You're done with me?\" \"Huh?\" \"You just said that you're done with me.\" \"No, what are you talking about?\" She had a confused look on her face. \"I'm serious! Iheard you say that!\" \"Ididn't! Honest!\" The infliction in her voice didn't hint any deceiving. Yet, Iwas so sure Iheard it. Iquickly dismissed voice modulation, because Tarpeia would've heard it too, or Iwouldn't have heard something that she did say. It sounded different from the other words - almost as if Tarpeia hadn't said it; it sounded different . Yet, it seemed so far-fetched, even more than believing in magic. Idismissed the absurd idea, Imust've heard wrong. \"It doesn't matter,\" Isaid solemnly, \"Well, Iguess you can leave now.\" Isaid that, realizing Icouldn't bring her back. Ididn't understand why she didn't care for me. Igave up. For the first time in my life, Ifully gave up. She was gone. \"Bye...\" She stood up and walked out, silently. Istill sat on the bed, not wanting to move. The door slowly moved close on its own accord. Previous Chapter - Chapter 5 Next Chapter - Chapter 7"
    }
  ]
}