{
  "url": "http://www.pww.org/article/articleview/7159/1/272/",
  "file_number": "661",
  "content_hash": "1d9d78f4831bf57a6ae8ca23d601ecab55dc29fe549259857fc46d58839d5a6e",
  "total_blocks": 320,
  "retained_blocks": 15,
  "ignored_blocks": 305,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\""
    },
    {
      "tag": "div",
      "text": "Please Give Online eXtra feed is pww.org/rss/extra Bringing democracy to Cuba: chocolate and perks by W. T. Whitney Jr., 12/22/06 13:57 Treatment of Immigrant Workers Nationwide in Meatpacking Plants Violates Basic Worker Rights by Local 881 UFCW, 12/15/06 12:34 Florida event welcomes Cindy Sheehan, via phone by Jesus Eligio, 12/15/06 12:24 Honoring Louisville figure, friends travel to Cuba by World Combined Sources, 12/13/06 12:42 San Antonio rallies for Ciro Rodriguez by Roberto Botello, 12/12/06 18:32 Headlines"
    },
    {
      "tag": "div",
      "text": "Enter your email address below to receive PWW Headlines every week Your Email:"
    },
    {
      "tag": "div",
      "text": "Articles feed is pww.org/rss Home Page This Week Recent Editions Old Editions Connect Subscribe Today Support the PWW Contact the PWW Web Links Sections International National Labor Peace Analysis Site info About Us What Do You Think? Help Promote This Site Recent"
    },
    {
      "tag": "div",
      "text": "Dec. 16, 2006 Dec. 9, 2006 Dec. 2, 2006 Nov. 18, 2006 Nov. 11, 2006"
    },
    {
      "tag": "div",
      "text": "Headlines Stop victimizing workers: Labor, community groups mobilize against immigration raids Conyers calls for new American agenda Thousands shop for justice in N.Y. police killing Iraqi unions reject foreign control of oil Rallies support Goodyear strikers Huge victory for labor in southwest Texas NATIONAL CLIPS California activists assail Bombplex plan Journalists, singers: Stop corp. media grab 24th W.Va. miner killed on job Portuguese public workers battle austerity plan Winds of change buffet U.S. Cuba policies Send solidarity greetings CPUSA leaders return from China, Vietnam WORLD NOTES Striking Goodyear workers seek global support Too late Milton Friedman Dear Santa N.Y. transit union re-elects Toussaint New York hospital closings: a sick proposal 2006: The ultra-right crashed in flames EDITORIAL: Afresh start is needed EDITORIAL: Naughty and nice LETTERS Justice deported CARTOON Apocalypto is upon us Dangerous schemes Profile of a Hollywood blacklist victim Dixie Chicks still ashamed of the president European Union embraces repressive laws WHAT'S ON Chicago banquet celebrates, and dances UN upholds rights of disabled Pacific Northwest Native people  a brief history Hoosiers say no to privatization scheme Sean Bell: qu requiere la justicia Garfunas apuestan al turismo ecolgico Denuncian redadas en Swift"
    },
    {
      "tag": "div",
      "text": "php\n$GlobalSectionID=\"1\";\n$SiteTitleAppend=\"Acloser look at price indexing, oil supplies\";\n$SiteDescriptionOverride=\"Feedback from our columnists: David Kennell follows up on his April 2-8 article on Social Security; Art Perlo adds the following comments on price indexing; Wadih Halabi writes about world oil supplies\";\n?"
    },
    {
      "tag": "h1",
      "text": "Acloser look at price indexing, oil supplies"
    },
    {
      "tag": "div",
      "text": "Search WWW Search pww.org"
    },
    {
      "tag": "div",
      "text": "Archive Recent Editions 2005 Editions June 4, 2005"
    },
    {
      "tag": "p",
      "text": "Author: People Before Profits columnists People's Weekly World Newspaper, 06/02/05 12:49"
    },
    {
      "tag": "p",
      "text": "David Kennell follows up on his April 2-8 article on Social Security: In my recent People Before Profits article, Ipredicted that the hidden time bomb in the Bush Commissions assault on Social Security was a plan to reduce starting benefits progressively under the benign-sounding price indexing. Probably the original and ultimate scheme, it would do more than weaken Social Security (as would private accounts); it would destroy it. Ashort month later, Bush unveiled the price-indexing scheme. The plan is being peddled as a progressive price indexing that will only reduce benefits for the most affluent Americans. However, all workers at wage levels above $20,000 would have reduced benefits. Analyses by the Center on Budget and Policy Priorities (cbpp.org) show that when combined with private accounts, a worker making the median wage of $37,000 in 2005 would retire when 65 in 2055 with 65 percent lower defined benefits. Social Security benefits have always been progressive with higher percent replacement incomes for lower wage earners. The Social Security payroll taxes of workers are accumulated over their working years in Treasury bonds. But under the progressive price indexing scheme, the accumulated payroll taxes of 70 percent of workers would not be paid back. It would be a simple step in the future to cut off the lowest paid. However, the major goal of price indexing is the long-term cumulative decrease in starting benefits, which is predicted to cause a decline of about 1.1 percent per year. This would ensure that Social Security would wither away with time. The Social Security trust fund has never been stronger financially. It currently has a $1.7 trillion surplus, which increased $170 billion last year with only 3.3 workers per retiree. The non-partisan Congressional Budget Office calculates 100 percent benefits to 2052 and 80 percent after that. The 80 percent could be raised to 100 percent by a modest increase either in the $90,000 cap or in the payroll tax rate. The real crisis is the towering U.S. debt generated by a ballooning military budget coupled with enormous tax cuts to corporations and the wealthy. To meet this debt to banks, mutual funds, governments, and wealthy individuals holding Treasury bonds, the Bush plan would not pay back its full debt to only one of its creditors: the American working people. kennell@borcim.wustl.edu Art Perlo adds the following comments on price indexing: Bush is claiming he is increasing benefits for low-income earners, and not cutting benefits for anyone. This is a lie, by any objective reading. He is keeping income for low-earners exactly as they are presently scheduled (while almost guaranteeing they will be cut in the future). He is cutting benefits for everyone else, both from what they are currently scheduled to be, and as a fraction of their earnings. economics@cpusa.org Wadih Halabi writes about world oil supplies: Arecent People Before Profits by a guest columnist (The urgent case for nationalizing the oil industry, May 7) correctly made the call to socialize energy production and move to renewable energy while protecting oil workers. But the column also propagated the belief that world oil production is close to declining, possibly as early as 2006 (Hubberts Peak, named after an oil company geologist). Most scientists do not agree. For more than a century, Wall Street has been promoting the idea that the world is close to running out of oil to justify outrageous prices. Exxons 2005 exploration budget is actually down from last years. Wall Street and Washington will even use sanctions and wars to hold production down. Iraq and Iran are cases in point. Socializing ownership of energy production is indeed an urgent need. economics@cpusa.org"
    },
    {
      "tag": "div",
      "text": "| Printer-friendly page | Send this article to a friend |"
    },
    {
      "tag": "div",
      "text": "E-mail: p iu#$@ ww@pw iu#$@ w iu#$@ . iu#$@ org Editorial Office: 3339 S Halsted St. Chicago IL 60608 ph: 773-446-9920 fax: 773-446-9928 newcatcher@cpusa.org"
    },
    {
      "tag": "div",
      "text": "Business Office: 235 West 23rd Street New York NY 10011 ph: 212-924-2523 fax: 212-229-1713"
    }
  ]
}