{
  "url": "http://www.pyongyangsquare.com/nuclear/opinion.html",
  "file_number": "662",
  "content_hash": "f2e6b3b2d7586dfb9820f29d0498da37294e2b0e3a575da4f8f9c83de846c23b",
  "total_blocks": 171,
  "retained_blocks": 6,
  "ignored_blocks": 165,
  "blocks": [
    {
      "tag": "div",
      "text": "Print this page"
    },
    {
      "tag": "div",
      "text": "Global player wins N Korea's \r\n                  only JV bank 20 May 2004 Washington offers 'chance \r\n                  for redemption' 24 Feb 2004 North Korea talks: why now? 10 Feb 2004 Japan prepares sanctions noose 5 Feb 2004 Pessimism on the 2nd round 4 Feb 2004 Elusive talks 15 Jan 2004 No moral high ground in Beijing 20 Aug 2003 Panmunjom circus 27 July 2003 Awkward anniversaries 2 June 2003 Anti-imperialism recycled 8 May 2003 Achallenge for China 18 April 2003 Pyongyang’s lost friends 21 March 2003 Do not fear, they tell each other 18 March 2003 Postponing diplomacy 14 March 2003 UN Security Council's tough task 25 Feb 2003 Opportunity for the UN \r\n                  Security Council 19 Feb 2003 The other side of the Agreed Framework 16 Dec 2002"
    },
    {
      "tag": "p",
      "text": "Global player wins \r\n              N Korea's only JV bank article for Asia \r\n              Times Online 20 May 2004 Washington offers 'chance \r\n              for redemption' article for Asia \r\n              Times Online 24 Feb 2004 North Korea talks: why now? article for Asia \r\n              Times Online 10 Feb 2004 Japan prepares sanctions \r\n              noose article for Asia \r\n              Times Online 5 Feb 2004 Pessimism on the 2nd \r\n              round 4 Feb 2004 The DPRK announcement on 3 February 2004 that it has agreed to \r\n              resume the 6-way talks in Beijing on 25 February is a welcome development, \r\n              but there is no indication that either Pyongyang or Washington are \r\n              ready for the significant concessions necessary to make progress \r\n              on a solution for the nuclear crisis. The 6 parties have failed to agree on a pre-talks statement to \r\n              determine the scope of this round, as the DPRK had insisted in December, \r\n              and it seems the scope is minimal: the DPRK will present details \r\n              on its proposal to freeze its nuclear program, and the other parties \r\n              will have a chance to put their positions forward. As the US, South \r\n              Korea, and Japan are closely coordinating their strategy, and China \r\n              and Russia's only concern seems to be to avoid a military confrontation, \r\n              the game will be played between Washington and Pyongyang. We share the pessimism voiced by Jack Pritchard, former US negotiator \r\n              for North Korea on 21 January 2004 after his visit to Pyongyang: \r\n              ' Iam concerned that the next round of six-party talks will fail \r\n              and Pyongyang will withdraw from the diplomatic process .' Elusive talks 15 \r\n              Jan 2004 This article was published by Asia \r\n              Times Online on 24 January 2004 in the Speaking Freely section. On the first anniversary of the DPRK’s withdrawal from the \r\n              NPT there are few reasons to be optimistic about a solution of the \r\n              nuclear crisis on the Korean peninsula. Pyongyang has vowed to further \r\n              build-up its military force while claiming to be in favour of a \r\n              negotiated peaceful resolution, and in fact Washington is doing \r\n              exactly the same. As Russian Deputy Foreign Minister Losyukov put \r\n              it last week 'mistrust and excessive demands on each other' by Washington \r\n              and Pyongyang are the reasons for the continuing delay of the second \r\n              round of 6-way talks. As a sign of frustration, South Korean Foreign Minister Yoon admitted \r\n              he is hoping the talks can be held in the first half of this year. \r\n              South Korea, Russia, and Japan seem to be less and less involved \r\n              in the preparations for the talks; the conditions are set in Pyongyang \r\n              and Washington, and both think they have Beijing on their side. \r\n              Seoul and Tokyo are kept in the loop to foot the bill if economic \r\n              assistance is ever going to be provided, as they did for the KEDO \r\n              project. Japan and South Korea have paid a total of US$1.3b, or \r\n              70% of the total, while the US with only 21% seems to be firmly \r\n              in charge of the consortium. After the US hinted it is willing to provide security assurances, \r\n              Pyongyang has specified its additional demands in exchange for refreezing \r\n              the Yongbyon nuclear facilities. In fact these demands are similar \r\n              to what Pyongyang should have gotten out of the Agreed Framework \r\n              of 1994: delist the DPRK as a sponsor of terrorism, lift political, \r\n              economic and military sanctions, and supply heavy oil and other \r\n              energy resources to the DPRK. The US will not accept a mere freeze \r\n              of Yongbyon; it is prepared to provide security assurances, but \r\n              only in return of a DPRK promise to dismantle all its nuclear facilities, \r\n              irreversibly, because as US Secretary of State Powell says, ‘we \r\n              do not want to see this movie again.’ Over the last few weeks there has been intensive diplomacy to come \r\n              to an agreement on the scope of the first step to be taken by both \r\n              sides. The DPRK has been demanding such a pre-talks agreement because \r\n              it does not want to participate in a useless talking session like \r\n              the first round back in August. It looks extremely unlikely that \r\n              the US will offer any economic assistance or improved political \r\n              relations in addition to a security guarantee in this first phase. Another issue that will inevitably complicate negotiations is the \r\n              alleged DPRK uranium enrichment program, which was in fact the trigger \r\n              of the current crisis. The US will of course want to include this \r\n              program in a DPRK promise to end its nuclear activities, but last \r\n              week it became clear that even China is not convinced the DPRK actually \r\n              has such a uranium program. Chinese officials reportedly said the \r\n              US government briefing provided to them had not been sufficient \r\n              to convince China that the DPRK had such a program. In the current \r\n              climate, no country will indeed easily accept US intelligence on \r\n              the existence of WMD facilities in an axis-of-evil member country. Referring to Libya, the DPRK Foreign Ministry issued a statement \r\n              saying the US should not expect Pyongyang to follow the example \r\n              and renounce its weapons. The Workers’ Party newspaper recently \r\n              argued Iraq made a big mistake accepting the weapons inspections \r\n              and not preparing for war. How an international inspection mechanism \r\n              beyond the Yongbyon facilities will ever work in the DPRK remains \r\n              a key question. Indeed as UN inspector Hans Blix noticed, it is \r\n              hard to prove that something does not exist. If the US insists on \r\n              nationwide inspections while the DPRK continues to deny having a \r\n              uranium program, negotiations will get stuck, and the Kim dynasty \r\n              will remain in war-mode as it has been since it established the \r\n              DPRK 55 years ago. The imperialist threat might well become a self-fulfilling \r\n              prophecy. No moral high ground in \r\n              Beijing 20 Aug 2003 This article was published by Asia \r\n              Times Online on 23 August 2003 in the Speaking Freely section. Next week all eyes will be on Beijing while the six powers will \r\n              sit down to start negotiating a solution for the North Korean nuclear \r\n              crisis. Asort of mini-United Nations session, with the three heavyweights \r\n              of the five permanent members of the UN Security Council, and the \r\n              three local stakeholders: Japan, and North and South Korea. Ayear \r\n              ago, while Pyongyang's bilateral ties with Seoul and Tokyo were \r\n              blossoming after Koizumi's visit to Pyongyang, this seating arrangement \r\n              would have made some sense. However, since the start of the nuclear crisis after the visit \r\n              of US Assistant Secretary of State James Kelly to Pyongyang in October \r\n              2002, old alliances have been reinforced, and at least in the mind \r\n              of the DPRK the three (ex)communist states will be on one side of \r\n              the table, facing the US and its allies, who none of them has official \r\n              diplomatic relations with Pyongyang, on the other side. But the \r\n              Cold War divisions have blurred; both Moscow and Beijing have close \r\n              economic ties with their three former capitalist foes. They have \r\n              also stated that they will not accept the presence of nuclear weapons \r\n              on the Korean peninsula. As the regional nuclear powers, it is in \r\n              both their interest to maintain this strategic status quo . The two old comrades did suggest that they can play a role in guaranteeing \r\n              the DPRK's security, as Washington has clearly stated it will not \r\n              offer the formal non-aggression treaty Pyongyang is demanding. The \r\n              Russian Deputy Foreign Minister Losyukov said that it is only logical \r\n              that Pyongyang seeks a security guarantee; Moscow and Beijing are \r\n              ready to offer a collective security guarantee if what the US is \r\n              prepared to offer does not satisfy the DPRK. Pyongyang has already \r\n              replied that this is beside the point, it has never considered either \r\n              Russia or China to be a threat. One of the more worrying comments made over the last few weeks \r\n              was a statement by former US Ambassador Robert Grey in the Washington \r\n              Times of 14 August, which indicates that the US has come to regard \r\n              the principle of pre-emptive action as international law: North Korea must understand that absent a diplomatic solution, \r\n              the international community is prepared, however reluctantly, to \r\n              use force to put an end to North Korea's pursuit of nuclear weapons. It is unclear who Grey has in mind when he speaks of the international \r\n              community; in any case after Iraq it is rather unlikely that the \r\n              UN Security Council would allow the use of force to attack a sovereign \r\n              country that is no imminent threat to world peace. For months the \r\n              US has been pushing for a UN Security Council statement condemning \r\n              the DPRK for its nuclear program, but Russia and China have blocked \r\n              this move, knowing that it would only complicate a solution. Of the six parties involved in the talks, only the US is stressing \r\n              that the military option remains on the table. The closest the US \r\n              has got to a 'coalition of the willing', is its Proliferation Security \r\n              Initiative (PSI), a group of 8 European countries plus Australia, \r\n              Japan, and the US. They are looking at the interdiction of DPRK \r\n              ships exporting alleged WMD, and at meetings in Madrid and Brisbane, \r\n              they have so far agreed to exchange information and hold interdiction \r\n              training exercises, starting next month off the Australian coast. The priority of all six countries around the table next week will \r\n              be to defend their own national security. None of the participating \r\n              countries should put itself on the moral high ground and claim to \r\n              represent the international community. In order to make progress \r\n              and make the world a safer place, they will all need to give in \r\n              order to receive. Washington's declared reluctance to negotiate, \r\n              despite its verbal support for a diplomatic solution, will be the \r\n              key issue. Panmunjom circus 27 July 2003 This article was published by Asia \r\n              Times Online on 1 August 2003 in the Speaking Freely section. On 27 July 2003 it was exactly 50 years ago that the Korean War \r\n              came to an end with the signing of the Armistice Agreement by the \r\n              DPRK, China, and the US-led United Nations Command (UNC). In the \r\n              DPRK mass celebrations were held to commemorate the victory in the \r\n              fatherland liberation war. On the South side as well, US General \r\n              LaPorte stated in Panmunjom that the armistice represents nothing \r\n              short of victory. These claims illustrate that during 50 years of \r\n              non-war, nothing much has changed. Or has it? While the US forces did their utmost best during the various ceremonies \r\n              to stress the UN alliance against the 'communist aggression', actually \r\n              most of the 21 nations that came to defend South Korea under the \r\n              UN flag have fundamentally altered their relationship with the DPRK \r\n              over the last 50 years. Most of them now have diplomatic relations \r\n              with Pyongyang. Prime Minister Helen Clark of New Zealand, which \r\n              established diplomatice relations with the DPRK in 2001, was allowed \r\n              to make a speech at the ceremony in Panmunjom, but her call for \r\n              a peaceful solution to the present nuclear crisis contrasted sharply \r\n              with LaPorte's memories of the glorious past and a confident future. When General LaPorte presented a UN flag to Prime Minister Clark \r\n              and South Korean General Paek as a gift, Pyongyang must have been \r\n              outraged. The simple fact that the Soviet Union was absent from \r\n              the Security Council in 1950 in protest against the exclusion of \r\n              communist China, has allowed the US to continue to use the UN cover \r\n              for 50 years. This has generated the strange contradiction that \r\n              countries part of the Armistice Agreement, and thus still technically \r\n              at war with the DPRK, already have established diplomatic relations \r\n              with Pyongyang. This paradox proves that the only countries that \r\n              really matter in the UNC are the US and the ROK. Ironically the \r\n              DPRK has also been a member of the UN since 1991, when it joined \r\n              at the same time as the ROK But of course these ceremonies were all about the war veterans, \r\n              aged 70+ nowadays. They feel proud for having contributed to prevent \r\n              the third world war, and enabled the Republic of Korea to become \r\n              what it is today: a thriving democracy respected around the world. \r\n              To their convenience they often forget that for many years after \r\n              the war, South Korea was much poorer than the North, and that Seoul \r\n              only started to catch up economically during the 18 years of military \r\n              dictatorship of Park Chung-hee. Hundreds of South Koreans died in \r\n              their struggle for democracy, while the UNC was guarding the country \r\n              against the communists."
    },
    {
      "tag": "div",
      "text": "The truce village of Panmunjom reminds some visitors \r\n                  of an amusement park, and it certainly looked like one during \r\n                  the ceremonies on 27 July 2003. American rock music and stalls \r\n                  selling armistice merchandise welcomed us in the Joint Security \r\n                  Area. US veterans and their family members dressed in all colours \r\n                  of the rainbow were in the majority. After the speeches we were \r\n                  offered a lavish buffet in the main building at 20 meters from \r\n                  the Military Demarcation Line, and some US soldiers encouraged \r\n                  us to take food outside so the North Korean soldiers could watch \r\n                  us eating. 'Only the elite serves here', the US sergeant had \r\n                  proudly told us on the bus."
    },
    {
      "tag": "p",
      "text": "Whereas the exact circumstances of the start of the Korean War \r\n              53 years ago will remain a point of discussion, it is clear today \r\n              that a peace treaty, as recommended in the original Armistice Agreement \r\n              within 3 months, is long overdue. It is sad that celebrating 50 \r\n              years of status-quo has not been an incentive to the other UNC members \r\n              to urge the US to negotiate such a peace treaty with Pyongyang, \r\n              or in case Washington continues its confrontational stance, to formally \r\n              withdraw from the UNC. Awkward anniversaries 2 June 2003 This article was published by Asia \r\n              Times Online on 4 June 2003 in the Speaking Freely section. On 27 July this year it will be exactly 50 years ago that the DPRK, \r\n              the PRC, and the UN signed the armistice that brought the Korean \r\n              War to an end. On both sides of the DMZ there will be ceremonies \r\n              to commemorate this event: communist groups around the world will \r\n              celebrate the North's victory over the imperialist forces, while \r\n              the 16 nations that came to defend South Korea under the UN flag \r\n              will remember how they rolled back the communist aggression. Celebrating \r\n              these old alliances will underscore the division of the Korean peninsula \r\n              and it should in that sense be a painful affair for both Koreas. \r\n              However, Pyongyang has managed to turn its memory of the Korean \r\n              War into resistance against the US imperialists, which continues \r\n              until today and is in fact the main legitimising force of its regime. With the arrival of the crab catching season, the North and South \r\n              have also started accusing each other again of violations of their \r\n              territorial waters. On 1 June the South Korean navy even fired warning \r\n              shots at North Korean fishing boats. Last year similar incidents \r\n              led to a naval clash with 4 deaths on the South Korean side. If \r\n              the issue of the Northern Limit Line (NLL) acts as a barometer for \r\n              Inter-Korean relations, we can surely expect more fireworks soon. Before we get to the armistice celebrations in July, another Korean \r\n              anniversary will pass: on 15 June 2003 it will have been three years \r\n              since the Inter-Korean summit between Kim Jong Il and Kim Dae-jung \r\n              in Pyongyang. The result of this historic meeting was the 15 June \r\n              Joint Declaration, in which they agreed to improve economic cooperation \r\n              and promote reunification. Since then, some progress has indeed \r\n              been made: South Korean tourists were able to cross the DMZ by bus \r\n              for the first time last February to visit the Mount Kumgang resort \r\n              in the North, but that road was closed again after two weeks. Reconnection of the railway lines in the East and the West has \r\n              been delayed so many times that the latest agreement at the difficult \r\n              economic talks at the end of May to hold the ceremonies on 10 June \r\n              this year seems far too optimistic. The same goes for the announcement \r\n              that the Kaesong Industrial Park will finally have its ground-breaking \r\n              ceremony at the end of June 2003. Pyongyang and Seoul have allowed \r\n              their workers, women, athletes, and families to meet each other, \r\n              share their sadness about the national division and issue nationalist \r\n              statements calling for reunification; nevertheless on a government \r\n              level trust remains thin. As a result of the nuclear crisis, today \r\n              both sides are using the Joint Declaration merely to criticise each \r\n              others behaviour. Pyongyang recently claimed Seoul was violating the Declaration \r\n              by 'hurling mud at the dignified system of the DPRK' when the South \r\n              Korean National Security Adviser Ra Jong-yil said about Inter-Korean \r\n              cooperation that the North's regime should be distinguished from \r\n              its residents. When chief North Korean delegate Pak Chang Ryon threatened \r\n              with an 'unspeakable disaster' at the economic talks last week if \r\n              the South would turn to confrontation, Seoul suspended the talks \r\n              saying that such a statement went against the Declaration. Then \r\n              after two days of impasse, they suddenly managed to agree on yet \r\n              another optimistic timeframe for some cooperation projects. These \r\n              two examples show that even without outside powers involved, the \r\n              two Korean governments do not easily find common ground. Pyongyang does not miss a chance to bring up the Declaration whenever \r\n              it gets the impression that Seoul is getting too close to Washington, \r\n              as with president Roh Moo-hyun's US visit and joint statement with \r\n              president Bush on 14 May. The North Korean regime is aiming at nationalist \r\n              and anti-US feelings in the South with its mantra of 'achieving \r\n              reconciliation and reunification by our nation itself under the \r\n              banner of the June 15 Joint Declaration'. President Roh has a hard \r\n              time aligning his strategy for the nuclear crisis with Washington, \r\n              without damaging Inter-Korean relations. Pyongyang keeps waving \r\n              the Declaration accusing Seoul of pro-US servile diplomacy, while \r\n              it is further building up its military under the 'Songun' army-first \r\n              policy. With all that artillery aimed at Seoul no half-working Joint \r\n              Declaration should reassure anyone in South Korea. Anti-imperialism recycled 8 May 2003 There must have been extremely little to discuss at the recent \r\n              trilateral talks in Beijing. The DPRK put forward what it calls \r\n              its bold new proposal, and the US repeated it will not negotiate \r\n              before Pyongyang abandons its nuclear weapons programs. The US administration \r\n              agrees with Russia, South Korea, Japan, and China to work on a peaceful \r\n              solution based on dialogue, but it is clear that the word dialogue \r\n              has a different meaning to the governments involved. Meanwhile Pyongyang is stepping up its war rhetoric, making South \r\n              Korea and Japan nervous. The standoff with the imperialist superpower \r\n              adds legitimacy to the regime of Kim Jong Il, who continues in his \r\n              father's footsteps protecting the country against the US and Japan. \r\n              This anti-imperialist struggle is the essence of the Pyongyang regime, \r\n              and indeed of the DPRK as a state. The current crisis justifies \r\n              years of army-first policy and strengthens the leadership of Kim \r\n              Jong Il. Over the last 50 years, the DPRK propaganda has not changed \r\n              at all, but if it sounded a bit out-of-date ten years ago, unfortunately \r\n              today it seems to make sense again. The US doctrine of pre-emptive \r\n              strikes has allowed the DPRK to recycle half a century of propaganda, \r\n              and puts Kim Jong Il in his favourite role, preparing for a war \r\n              to defend the country against the US imperialists. Obviously Kim Jong Il would have to worry much more about his position \r\n              if relations with the US were improving. As soon as North Korea \r\n              becomes a normal member of the international community, the Pyongyang \r\n              regime will have to re-invent itself, to gain legitimacy in the \r\n              absence of any external threats. Maybe this insight could help foreign \r\n              governments who want to see change in North Korea to take a more \r\n              constructive approach to the Pyongyang regime. Achallenge for China 18 April 2003 It all went rather fast after Pyongyang's indication that it would \r\n              not insist on a bilateral format for talks with the US if Washington \r\n              was willing to change its hostile policy towards the DPRK. The Bush \r\n              administration is very pleased that China has finally decided to \r\n              play an active role, proposing trilateral talks in Beijing. The fact that these three parties have agreed to talk is in itself \r\n              a breakthrough, but there is little reason to believe that the Bush \r\n              administration will adopt a more constructive approach then it has \r\n              until now. Assistant Secretary of State James Kelly will demand \r\n              that Pyongyang dismantles its two nuclear programs before he will \r\n              offer anything in return. Meanwhile he will insist that South Korea \r\n              and Japan should join the talks. Pyongyang does not want to involve \r\n              Seoul and Tokyo; it has been rather frustrated by the fact that \r\n              the current crisis, which Pyongyang insists is only between the \r\n              US and the DPRK, has destroyed much of the progress it had made \r\n              with South Korea and Japan recently. From the viewpoint of Pyongyang, the security issue can only be \r\n              settled in direct talks. However, a trilateral setting with China \r\n              is the next best thing, as Pyongyang probably expects China to support \r\n              its basic analysis that the US is a threat to North Korea, and bears \r\n              responsibility for this crisis. Once they can agree on the necessary \r\n              steps to eliminate the mutual security concerns, such as international \r\n              monitoring, a non-aggression treaty etc, maybe Pyongyang will accept \r\n              South Korea, Japan, and possibly Russia, around the table to discuss \r\n              aid and economic cooperation with the North. However, such a process \r\n              requires considerable confidence between the parties, which is currently \r\n              non-existant. The question is whether China will be able to build \r\n              the necessary trust between Washington and Pyongyang. Pyongyang’s lost friends 21 March 2003 Only 6 months after the historic meeting in Pyongyang between Japanese \r\n              PM Koizumi and the North Korean leader Kim Jong Il, Japan is deploying \r\n              its Aegis surveillance ships to monitor North Korean missile operations, \r\n              and warns Pyongyang it will scrap their joint declaration if the \r\n              North carries out a ballistic missile test. On the Korean peninsula \r\n              president Roh, the heir of Kim Dae-jung’s sunshine policy, \r\n              has put the South Korean army on its highest alert since 1996, for \r\n              fear of North Korean provocations during the Iraq war. After major \r\n              diplomatic breakthroughs with Seoul and Tokyo over the last few \r\n              years, Kim Jong Il is losing his new friends fast. Washington recently surprised with signals that it is considering \r\n              withdrawing its troops from South Korea. The Pyongyang propaganda \r\n              machine was probably already preparing victory statements after \r\n              50 years of anti-imperialist struggle on the Korean peninsula, but \r\n              quite unexpectedly the new South Korean government stated that the \r\n              US troops should remain near the DMZ as a tripwire. So much for \r\n              Korean reconciliation and the compatriotic feelings that had been \r\n              warming since the Kim-Kim summit in June 2000. After 3 years of \r\n              sunshine and some slow progress on Inter-Korean projects the relations \r\n              across the DMZ are quickly cooling again. The historic overland \r\n              route to the North’s Mt Kumgang resort crossing the DMZ for \r\n              the first time in 50 years was a major breakthrough in February, \r\n              but only operated for 2 weeks. The railway lines that could link \r\n              South Korea to China and Russia are still not reconnected. They \r\n              can not even agree on the size on the building for family reunions \r\n              in Mt Kumgang. Pyongyang and Seoul have allowed their workers, women, \r\n              athletes, families to meet each other, share their sadness about \r\n              the national division, and issue nationalist statements calling \r\n              for reunification; nevertheless on a higher level trust remains \r\n              thin. The new Roh government is asking the US troops to stay, meaning \r\n              that Seoul despite all the sunshine continues to feel threatened \r\n              by Kim Jong Il. Roh has also adopted the Bush line of advocating \r\n              a multilateral setting to solve the nuclear crisis. At their planned \r\n              meeting next month in Washington, they will align their policies \r\n              further. The only matter that seems to divide the long-time allies \r\n              is urgency: the South Korean economy is starting to feel the effects \r\n              of decreasing investor’s confidence. Pyongyang’s other new friendship has proven even more superficial. \r\n              After the Koizumi-Kim meeting last September in Pyongyang, Japan \r\n              seemed ready to start serious business with North Korea. Japan is \r\n              one of the DPRK’s main trading partners, of roughly the same \r\n              size as Inter-Korean trade in 2001 (around US$400m). Unfortunately \r\n              Koizumi miscalculated the domestic impact of the issue of the Japanese \r\n              abductees, and the diplomatic process derailed after Tokyo refused \r\n              to send the abductees back to Pyongyang. For Pyongyang the issue \r\n              remains a Japanese apology and financial compensation for the past \r\n              colonial rule. However, Japan is panicking about North Korean missiles, \r\n              and threatens to abrogate the Pyongyang Declaration if the North \r\n              would test-fire a ballistic missile. Pyongyang claims Japan is violating \r\n              the Declaration with its plans to launch a spy satellite and establish \r\n              a missile defence system, and thus reserves the right to resume \r\n              ballistic missile tests if Japan carries on with these ‘hostile \r\n              acts’. In its anti-imperialist rhetoric Pyongyang has even \r\n              suggested that hard-line elements in Japan are trying to use the \r\n              North Korean missile threat as an excuse to invade Korea again. \r\n              Nevertheless the Japanese did mention the idea of preemptive strikes \r\n              in case North Korea prepared to launch a long-range missile, and \r\n              it will soon launch its satellite with a Japanese ballistic missile. Until six months ago diplomatic initiatives were well underway \r\n              to establish a new regional stability in East Asia less dependent \r\n              on the US umbrella. The loss of these two friends brings Pyongyang \r\n              back to square one, with Seoul confirming its dependence on Washington, \r\n              and Japan unwilling to come clear with its colonial past. Throughout \r\n              the nuclear crisis Pyongyang has been calling Japan and South Korea \r\n              to continue on the constructive path set out in their bilateral \r\n              declarations, but Pyongyang’s standoff with Washington has \r\n              seriously hurt the new friendships. As Japan and South Korea are \r\n              falling back into step with Washington, the difference between bilateral \r\n              talks as requested by Pyongyang, and the multilateral approach of \r\n              the Bush administration is fading. Pyongyang will get its direct \r\n              talks with Washington, but only when the situation will have escalated \r\n              far enough for South Korea and Japan to be hiding behind the US. \r\n              That moment might be very near, as Kim Jong Il has no reason to \r\n              wait. To his own frustrations he has failed to find a way to put \r\n              pressure on Washington without hurting his relations with Seoul \r\n              and Tokyo. Kim Jong Il’s diplomatic initiatives may have been \r\n              genuine, but his reputation is haunting him. Do not fear, they tell each \r\n              other 18 March 2003 What an intruiging situation; the US Ambassador in Seoul says that \r\n              the DPRK has an 'irrational fear' of the US. On the other side, \r\n              a recent official North Korean statement said it was 'quite senseless \r\n              and unreasonable' for the US to insist that the DPRK poses a nuclear \r\n              threat to the US. However, the existential fears of Pyongyang seemed a little more \r\n              justified when president Bush announced the invasion of Iraq, including \r\n              regime change. For its part, Pyongyang should not be secretive about \r\n              its alleged nuclear program, leaving the world guessing about the \r\n              North Korean nuclear capabilities. These people would have so much stuff to talk about; if only they \r\n              would sit down together. Postponing diplomacy 14 \r\n              March 2003 From different sides Americans are urging president Bush to start \r\n              negotiations with North Korea. Not only Democrats and academic experts, \r\n              but also conservative Republicans are telling the administration \r\n              that refusing to talk with Pyongyang carries considerable risks. \r\n              US Assistant Secretary of State James Kelly claims that North Korea \r\n              will soon be able to produce nuclear weapons from its plutonium \r\n              and uranium enrichment programs. However, his boss seems in no rush \r\n              to sit down and talk with Pyongyang. According to the CIA, North \r\n              Korea has been possessing one or two nuclear weapons for many years \r\n              already, and indeed a couple more would not change that situation \r\n              dramatically. Conservative opponents of the current policy want the administration \r\n              to talk with Pyongyang, to explain Kim Jong Il that he has to dismantle \r\n              his programs or else the US will strike. The proposed talks are \r\n              very short, and bound to fail because North Korea will not gain \r\n              anything substantial in return. In fact the Bush administration \r\n              is aiming for a similar outcome by pushing for a UN Security Council \r\n              statement that would condemn North Korea's non-compliance with its \r\n              IAEA Safeguards Agreement. Pyongyang would label such a narrow approach \r\n              to this crisis as unfair and reject any UN interference. The Bush \r\n              administration would then use this as a justification for the use \r\n              of force against North Korea. For this reason China is at present \r\n              blocking such a statement by the Security Council, and urging the \r\n              US to have direct talks. On the other side, US Korea experts are urging the Bush administration \r\n              to engage in a much more comprehensive dialogue with the Pyongyang \r\n              regime. These talks would include the dismantling of nuclear capabilities, \r\n              resumed missile negotiations, discussion on a peace mechanism to \r\n              end the Korean war and reduce US troops in the South, and support \r\n              for the economic development of North Korea. This is perfectly in \r\n              line with the North Korean statement that it is 'quite possible \r\n              to find a solution for the nuclear issue'. It remains a question \r\n              whether the Bush administration would consider a solution that does \r\n              not lead to its ultimate objective of regime change. Pyongyang must have had high hopes when Roh Moo-hyun took office. \r\n              South Korean president Roh supports engagement and has excluded \r\n              any military action against the North. However, his government is \r\n              moving closer to the US position of favouring multilateral talks, \r\n              and sees a continuing role for US troops in the South. This is angering \r\n              the North and it has warned that Inter-Korean relations might go \r\n              back to a state of confrontation. Seoul intends to work with the \r\n              US to resolve the crisis, but this will take time: president Roh's \r\n              visit to Washington is planned for next April/May. Meanwhile the alignment of the South Korean and US positions is \r\n              further raising military tensions on the Korean peninsula. Bush's \r\n              tactical move to involve the UN Security Council seems stuck, and \r\n              under domestic pressure, sooner or later the US will talk with North \r\n              Korea as Powell has stated. The US attitude towards such talks can \r\n              either be constructive, or they can be seen as a necessary prelude \r\n              for action. Threatened by the US military buildup and war games \r\n              across the DMZ, it is unlikely that Kim will sit back and relax \r\n              until Roh and Bush come up with a plan to talk in summer. Expect \r\n              some fireworks. UN Security Council's tough \r\n              task 25 Feb 2003 This article was published by Asia \r\n              Times Online on 27 February 2003 in the Speaking Freely section. On February 19 the United Nations Security Council decided to refer \r\n              the letter it received from the International Atomic Energy Agency \r\n              (IAEA) to its experts for further consultations before starting \r\n              the discussion in the council. Thereby they acknowledged that the \r\n              North Korean nuclear issue is a complicated matter, conveniently \r\n              oversimplified by the international press into Pyongyang's non-compliance \r\n              with the Safeguards Agreement. Meanwhile Pyongyang is arguing that \r\n              it no longer has any relations with the IAEA after it withdrew from \r\n              the Non-Proliferation Treaty (NPT) on January 10, and that the agency \r\n              therefore should not intervene in North Korea's internal affairs. \r\n              This claim is not given any attention in international media, to \r\n              the advantage of the United States, which favors multilateral talks \r\n              to resolve this crisis. In March 1993, a year after signing its Safeguards Agreement with \r\n              the IAEA, North Korea announced its withdrawal from the NPT, giving \r\n              three months' notice. The US persuaded Pyongyang to suspend this \r\n              withdrawal one day before it was going to become effective, on June \r\n              11, 1993. One year later, in June 1994, North Korea withdrew its \r\n              IAEA membership. Acouple of months later the nuclear crisis came \r\n              to an end with the signing of the Agreed Framework, which specified \r\n              that North Korea would remain party to the NPT, and the IAEA would \r\n              be allowed to monitor the freeze of certain facilities. However, \r\n              North Korea did not rejoin the IAEA, and the agreement linked full \r\n              compliance with the Safeguards Agreement to the completion of two \r\n              light-water reactors. Last month North Korea announced it was withdrawing from the NPT \r\n              with immediate effect, in fact ending the suspension of its withdrawal \r\n              in 1993. Thus North Korea joins India, Pakistan, and Israel, three \r\n              countries that are not signatories to the NPT but can get away with \r\n              that without having to fear a regime change. Maybe because they \r\n              organize elections from time to time. North Korea is certainly in breach of the Agreed Framework, because \r\n              it ended the freeze of the nuclear facilities at Yongbyon. However, \r\n              this commitment was part of a bilateral deal with the United States \r\n              in 1994 in which Washington agreed to provide formal assurances \r\n              to Pyongyang against the threat or use of nuclear weapons by the \r\n              US, and normalization of political and economic relations. Whether \r\n              the IAEA had the right to declare North Korea in breach of the Safeguards \r\n              Agreement, disconnecting the entire matter from the Agreed Framework \r\n              as Washington prefers, is a matter the UN Security Council should \r\n              examine. Pyongyang has stated that it does not object to the crisis \r\n              being discussed in the UN Security Council, as long as the role \r\n              of the United States is also brought up. IAEA chief Mohamed ElBaradei has said the Safeguards Agreement \r\n              remains in force and binding; nevertheless it is clear that Pyongyang \r\n              has a different opinion on this, so the matter needs to be discussed \r\n              at least. It is not difficult to understand why Pyongyang calls \r\n              the IAEA a \"political waiting maid of the US\" after ElBaradei \r\n              started to throw around comments on how to solve this nuclear crisis, \r\n              clearly overstepping the technical role of his agency. The first task of the UN Security Council will be to determine \r\n              whether the IAEA-North Korea Safeguards Agreement is still in force, \r\n              or whether the IAEA's specific task in North Korea was a component \r\n              of the bilateral Agreed Framework. One hopes that the UN Security \r\n              Council will thus seize the opportunity to consider the root causes \r\n              of the current crisis, and not only focus on the DPRK's strained \r\n              relations with the IAEA. Washington will try to take advantage of \r\n              the multilateral setting of the Security Council to reduce this \r\n              crisis to a non-proliferation issue, in order to alienate Pyongyang \r\n              further and hide its own Agreed Framework commitments under a multilateral \r\n              cover. Opportunity for the \r\n              UN Security Council 19 Feb 2003 The fact that the DPRK nuclear issue is going to be discussed in \r\n              the UN Security Council presents a unique opportunity for the international \r\n              community to urge both parties to the Agreed Framework to comply \r\n              with their obligations. Anuclear-free Korean peninsula is in everybody's \r\n              interest, and there seems to be an international consensus that \r\n              the US should allow bilateral talks with the DPRK. The US has hinted that it will not accept a new freeze of the DPRK's \r\n              nuclear facilities, but instead will require them to be dismantled \r\n              completely. Certainly this can be acceptable to the DPRK if it can \r\n              count on foreign assistance to rehabilitate its energy sector, e.g. \r\n              through international financial institutions. Hopefully the UN Security Council will seize the opportunity to \r\n              consider the root causes of the current crisis, and not just focus \r\n              on the non-compliance of the DPRK with the IAEA Safeguards Agreement. \r\n              If it fails to examine the DPRK version of the events, it is not \r\n              unlikely that Pyongyang will accuse the Security Council of being \r\n              a tool of the US, and it might be right in that case. The other side of the Agreed \r\n              Framework 16 Dec 2002 It should be clear that the DPRK never saw the 1994 Agreed Framework \r\n              as a simple peace-for-energy deal, where it would receive an energy \r\n              package if it agreed to stop producing nuclear weapons. The US seems \r\n              unwilling to accept the view from Pyongyang that it sees itself \r\n              threatened by the US, with its large military presence in South \r\n              Korea and Japan. In the post-Cold War era nuclear deterrence may \r\n              seem out-dated, but the DPRK's efforts do correspond with a real \r\n              fear in Pyongyang of being the next target for a pre-emptive US \r\n              attack or regime change. Receiving membership of Bush's 'axis of \r\n              evil' is not exactly the 'formal assurance that it would not threaten \r\n              or use nuclear weapons against the DPRK', as the US agreed to provide \r\n              under section 3 of the Agreed Framework. Even through the current crisis the DPRK keeps calling for a non-aggression \r\n              pact with the US. The energy deal can be considered a by-product \r\n              of the 1994 nuclear crisis; the essence was that both parties agreed \r\n              on how to remove mutual security threats. In the case of the DPRK, \r\n              that was easily done by freezing the graphite-moderated reactors \r\n              and putting the facilities under IAEA surveillance. But what has \r\n              the US done in return to reassure the DPRK? Washington has been \r\n              reluctant to normalise economic and political bilateral relations, \r\n              as agreed under section 2 of the Agreed Framework, and when Bush \r\n              finally sent an envoy to Pyongyang it was not for constructive talks. As far as the Agreed Framework's energy deal goes, the DPRK already \r\n              felt betrayed with the delay of the completion of two KEDO Light \r\n              Water Reactors by at least 5 years. Recently the US decided to suspend \r\n              Heavy Fuel Oil deliveries, and that leaves the DPRK no choice but \r\n              to reactivate its reactors frozen under the Agreed Framework, to \r\n              produce much-needed electricity. As nuclear power plants around \r\n              the world show, it is possible to produce nuclear energy peacefully. \r\n              The DPRK has repeatedly stated it seeks a peaceful solution to the \r\n              nuclear issue. The IAEA could reinforce its monitoring programme \r\n              to make sure no fuel is used for military purposes. It seems the \r\n              DPRK would not refuse such inspections if the US would agree to \r\n              sign a non-aggression treaty and finally finish the Korean War. Tom Tobback Beijing"
    },
    {
      "tag": "div",
      "text": "Pyongyang Square 2002-2004 © All \r\n            Rights Reserved close this window"
    }
  ]
}