{
  "url": "http://www.qui-gonline.org/fanfic/moriahAOTC2.htm",
  "file_number": "663",
  "content_hash": "6c1b44780bd48e6ba1e27526ffbee9508a2d91cc8a296281304459f88dc72996",
  "total_blocks": 172,
  "retained_blocks": 4,
  "ignored_blocks": 168,
  "blocks": [
    {
      "tag": "div",
      "text": "qui-gonline main A-J | K-P | Q-Z"
    },
    {
      "tag": "p",
      "text": "What's New Attack of the Clones, the AU Version Parts 5-7 By Moriah Organa"
    },
    {
      "tag": "div",
      "text": "Summary: AU version where Qui\n            isn't dead and Anakin doesn't turn. Disclaimer: All rights reserved to George Lucas, who'd probably be very\n            upset if he saw this - good thing he won't."
    },
    {
      "tag": "p",
      "text": "Part V Anakin sat cross-legged on the floor of the Queen's sitting\n            room, eyes half closed in meditation. Only a few standing lights were still burning and\n            the door to the bedroom was securely shut. Suddenly his eyes popped open and he got to his\n            feet. Amoment later the lift door opened for Qui-Gon, still accompanied by Obi-Wan and\n            Jacen. \"Captain Typho has more than enough men\n            downstairs.\" Obi-Wan was saying. \"No assassin will try that way.\" The Master nodded, face closed eyes distant. His past and\n            present Padawans looked at him and then at each other, they knew that look. \"Master?\" Anakin prodded. Qui-Gon blinked, focused on him, smiled. \"Anything to\n            report?\" \"Quiet as a tomb. The girls went to bed an hour or so\n            ago.\" Anakin glanced uneasily around the luxurious room. \"Idon't like just\n            waiting here for something to happen to her.\" \"Don't anticipate, Anakin, focus on the moment.\"\n            the Master sat down on one of the couches. \"We must be patient.\" \"I'm sorry, Master,\" Anakin shrugged at little.\n            \"I'm not much good at patience.\" An amused glance from the Master. \"Iknow.\" Obi-Wan picked up the small security monitor lying on a\n            table, frowned at the blank screen.\" \"What's this?\" \"She wouldn't let me put any cameras in her room.\"\n            Anakin explained, adding apologetically. \"Idon't think she liked the idea of me\n            watching her.\" \"What is she thinking?\" Obi-Wan looked towards the\n            bedroom door as if tempted to shake the Queen awake and demand an explanation. \"Artoo is in there with her,\" Anakin assured\n            Qui-Gon, \"set on surveillance mode. He'll pick up an intruder as quickly as the\n            cameras would.\" \"I'm not worried about intruders.\" Obi-Wan snapped.\n            \"Professional assassins have ways of killing from a distance that not even Artoo\n            could detect.\" \"Iknow but we want to catch this assassin, don't we,\n            Master?\" Anakin countered, still addressing Qui-Gon. \"You're using her as bait.\" Obi-Wan sounded\n            incredulous as well as angry. \"It was her idea.\" Anakin retorted defensively.\n            Turned back to Qui-Gon. \"Don't worry, no harm will come to her. I'm aware of\n            everything going on in that room.\" \"It's too risky.\" said Obi-Wan, also to Qui-Gon,\n            then to Anakin. \"Besides, your senses aren't that attuned, young Padawan.\" \"And yours are?\" Anakin challenged, temper fraying. Obi-Wan's look was sternly quelling. \"Possibly.\" \"Obi-Wan is older and more experienced.\" the Master\n            cut in quietly. \"And you are letting emotion cloud your mind, Anakin. Let go of fear\n            and feel the Living Force.\" His Padawn bit his lip. \"I'll try, Master.\" \"Do or do not, there is no try.\" Jacen quoted in a\n            rather good imitation of Yoda's voice. Both Anakin and Obi-Wan grinned and the tension\n            between them eased. \"Stay with us, Obi-Wan.\" Qui-Gon continued.\n            \"It may be we'll solve your problem as well as our own tonight.\"\n            ****************************************** Hours passed. The Master occupied one couch, radiating peace\n            as he meditated, Jacen the other, openly dozing. Obi-Wan and Anakin stood near the bedroom\n            door talking in undertones. \"Master risked his own future with the Order to see you\n            trained,\" Obi-Wan was saying with quiet intensity, \"will you throw that gift\n            back in his face?\" \"Of course not!\" Anakin hissed back. \"I'd\n            never do that to him.\" \"Then *think* about what you are doing, Anakin!\"\n            the young Master retorted. \"If you continue to follow your impulses you could hurt a\n            lot of people,\" nodded towards the bedroom, \"including her!\" his voice\n            softened. \"Not to mention yourself.\" \"I've thought about her and dreamed about her every day\n            for the last ten years.\" Anakin admitted painfully. Took a breath. \"You're\n            right, Padme's an attachment, like my Mother, and like Mom I've got to let her go.\" Obi-Wan put a consoling hand on his shoulder. Suddenly both\n            their heads swivled towards the door. \"Obi-Wan!\" \"Ifeel it also.\" Sabres drawn they sprinted into the Queen's Bedroom Amidala woke with a shock. She had a split second glimpse of\n            segmented, multi-legged *somethings* before they vanished in a flash of green light. Saw\n            Anakin standing over her on the bed, sabre blazing in his hand, and Obi-Wan go through the\n            window with a crash of glass and clash of blinds. \"Idiot!\" Anakin doused his sabre and ran out past\n            Master Qui-Gon. The other Padawan started to follow but the Master called him back.\n            \"No, Jacen, Ineed you here.\" Eirtae and Rabe hurtled into the room, flinging themselves\n            down beside her. \"Your Highness, are you all right?\" Amidala managed a nod, her voice wasn't working yet. Typho was right behind them with a pair of guards. \"What\n            happened?\" \"The Queen is safe.\" Qui-Gon told him but she\n            musn't stay here.\" \"She can come down to my rooms.\" Jamillia spoke\n            breathlessly from the doorway, a robe clutched around her and a handmaiden at her back. \"An excellent idea, Senator. Your Highness?\" \"Yes, yes of course.\" Amidala said shakily. She got\n            out of bed, Rabe quickly draped a dressing gown over her. She started for the door,\n            Eirtae's arm around her. Paused to look at the broken window and then at the Master.\n            \"Obi-Wan, Anakin...?\" \"They'll be all right.\" he reassured her. Eyebrows\n            quirked ruefully. \"I'm afraid both my past and present Padawans are somewhat\n            reckless.\" Amidala scraped up a smile. \"Iwonder where they could\n            have learned it from?\" and his eyes crinkled in answering amusement. \"Come on, Ammi,\" Jamillia said taking her arm,\n            \"it'll be just like at school. Remember how we used to sneak into each others rooms\n            after hours?\" they headed for the lift, the other four women clustered tightly around\n            her, and nearly collided with Jar Jar followed by a pair of armed Gungans. \"Padme! Yousa not hurtin?\" \"I'm fine, General Binks, don't worry.\" then they\n            were in the lift, the doors closing behind them, as Jar Jar demanded; \"Captain Typho,\n            whatsa goin' on herin?\" Part VI Anakin wove frantically through the nightime traffic high\n            above the rooftops of Coruscant. Flashes of blaster fire some distance away caught his\n            eye. \"That's gotta be him.\" he decked the accelerator but by the time he got to\n            the scene there was no blaster fire, no assassin droid, just a spread-eagled human body\n            falling towards the brightly lighted canyons thousands of feet below. Anakin dove steeply, pulled up and Obi-Wan landed on the\n            speeder's stern as neatly as one could please. He clambered breathlessly into the\n            passenger seat. \"Master Kenobi, fancy meeting you here.\" Anakin\n            greeted mockingly \"What took you so long?\" the other snapped. \"You know me, Obi-Wan, Ihad to find a speeder Ireally\n            liked; mach 10 engines, open cockpit, totally cool paint job -\" \"Iam underwelmed by your wit, Padawan.\" the\n            Master's voice dripped icicles, \"Where's Jacen?\" \"Back with our Master Iguess, he didn't catch up with\n            me in time.\" As they spoke Anakin spotted a sleek closed speeder leaving with\n            suspicious speed and gave chase. \"That him?\" Obi-Wan's face went blank a moment as he searched the Force.\n            \"Yes!\" \"Riiight!\" Anakin hit the accelerator again. Sensing he was being followed the assassin wove confusingly\n            through traffic lanes, between buildings and through the interlaced beams of a\n            half-finished skyscraper. Obi-Wan clung white knuckled to the side of the speeder.\n            \"Careful! Hey, easy!\" \"Sorry, Master, Iforgot you don't like flying.\"\n            The speeder dropped a few feet, just enough to miss an oncoming transport. \"Idon't like flying with *you*!\" Obi-Wan retorted. Anakin looked over at him. \"Obi-Wan, you know I've been\n            flying since before Icould walk I'm very good -\" \"Watch where you're going!\" an oncoming stream of\n            private speeders split to avoid them. Anakin dropped out of the lane. \"Sorry about that.\" Obi-Wan closed his eyes, inhaled a calming breath. \"Just\n            slow down.\" he said in carefully measured tones. Opened his eyes, pointed.\n            \"There! There he goes.\" The assassin's speeder ducked behind a line of freight\n            transports. Anakin went under them, gaining steadily as the two vehicled banked right\n            turns around tower spires and neon billboards. Attempting to elude his pursuer the\n            assassin ducked into a tram tunnel. Anakin promptly followed. \"Wait! Don't go in there!\" Obi-Wan gasped as the\n            tunnel closed around them. \"Don't worry, Master, Iknow what I'm doing.\"\n            Anakin assured him. They skimmed round a bend and right into their prey, accelerating\n            frantically towards them with a tram filling the tunnel behind. Anakin flipped the speeder upside down in a tight loop-over\n            and raced out of the tunnel barely ahead of speeder and commuter tram. Beyond speech Obi-Wan gave his companion a withering look. \"Okay, that was a mistake.\" Anakin conceeded. The\n            Assassin's speeder pulled along side, a blaster barrel protruded from a side window,\n            Obi-Wan ducked just in time. \"Oops!\" Anakin hit the brakes, dropping behind and\n            under their attacker, safe from blaster fire. The assassin dove steeply downward, skimmed\n            low over the flat roofs of a continent sized industrial complex, forcing Anakin to fall\n            behind again. \"Right. This isn't working.\" \"No kidding.\" Obi-Wan said acidly. Their prey\n            pulled further ahead, shooting through a quasi-tunnel of giant energy couplings topping a\n            power plant. \"Anakin! don't go through there!\" Ignoring him the younger Jedi accelerated right after the\n            assassin, under and through the gigantic arcs of blue lightening leaping from coupling to\n            coupling. \"How many times have Itold you, stay away from power\n            couplings!\" Obi-Wan complained as they shot free. Anakin grinned. \"Yeah, but don't you just love that\n            powerfield tingle?\" \"No actually.\" Obi-Wan scanned the skies.\n            \"There he goes!\" \"This is getting old.\" Anakin muttered as they\n            darted upward in pursuit. \"We gotta get ahead of him somehow.\" The assassin's speeder veered sharply, diving into a\n            brilliantly lighted throughway for air traffic piercing a dense range of multi-spired\n            towers. Anakin banked the other way looping around the buildings. \"What are you doing? you're going the wrong way.\" Ani shook his head, eyes unfocused. \"No I'm not. This is\n            a shortcut.\" blinked. \"Ithink.\" \"You *think*?\" Obi-Wan echoed, incredulously. They hovered above the stream of traffic emerging from the\n            throughway for long seconds. Obi-Wan, grimly. \"You've lost him.\" Anakin, calmly. \"No Ihaven't.\" Obi-Wan begining to lose his temper. \"He went completely\n            the other way!\" Anakin, even more calmly. \"We'll see.\" Obi-Wan breathed, regaining his composure. \"Anakin,\n            we've lost him. We should -\" \"Excuse me, Master.\" Anakin said politely and\n            vaulted over the side of the speeder - falling some five stories to land right on top of\n            the assassin's speeder cruising beneath them. Looking after him Obi-Wan shook his head, muttered. \"Ihate it when he does that.\" Part VII Anakin clawed for a handhold on the sleek surface of the\n            speeder as the wind tore at him. *Okay, maybe this wasn't such a brilliant idea.* He worked his way painfully forward to the transparent\n            canopy, looked in. For an instant it was a woman's face looking back at him with big dark\n            eyes then abruptly, without warning, it shifted to something grey skinned and quite\n            inhuman. *A Changeling!* The assassin, whatever she or it was, braked suddenly and\n            Anakin nearly went flying, barely catching himself on the left prong of the forked front,\n            dangling by his hands. *Calm, remember calm.\" He managed to swing over to the right prong and then work his\n            way up on top again. The assassin, back in Human form, glared at him through the canopy as\n            he ignited his sabre to cut his way in. Grabbed the blaster lying on the seat next to her\n            and fired up at him. Anakin just managed to block the bolt, not easy at such close\n            quarters, but the impact knocked the sabre from his hand. *Oh no, not again!* He shoved his hand through the hole in the canopy, grabbing\n            the assassin's wrist as she tried for a second shot. It went wild, striking the control\n            board and the speeder began to lose altitude, bucking wildly. Anakin hung on as the assassin fought for control but the\n            impact as they hit the pavement of a pedestrian way sent him flying into a row of fuel\n            drums. Picking himself up he looked around. Not one of Coruscant's\n            more salubrious districts, a varigated crowd of panhandling undersiders, criminals,\n            con-artists and slumming glitterati were lit by garish neon signs as they wandered along\n            an esplanade of gritty entertainment clubs. Afew glanced at Anakin but quickly looked\n            away, not wanting to get involved. He pushed through the crowd to the crashed speeder, saw the\n            assassin climb out and gave chase, pushing and shoving people out of his way. His quarry\n            darted through the door of one of the clubs and Anakin was about to follow when a hand\n            fell on his arm stopping him in his tracks. He started to throw it off then realized it\n            was Obi-Wan. \"She went in there!\" he panted. \"Patience.\" Obi-Wan answered, annoyingly unruffled.\n            \"Use the Force, Anakin, think. He went in there to hide, not run.\" And even more annoyingly right, as usual. \"Yes,\n            Obi-Wan.\" The older Jedi offered him his sabre. \"Ibelieve this is\n            yours?\" \"Yeah, thanks.\" Anakin tried to take it but Obi-Wan\n            refused to let go of his end. *Uh-oh, stand by for lecture.* \"A Jedi's sabre is his most precious possession. He must\n            keep it with him at all times.\" Obi-Wan scolded, transfixing him with those blue\n            eyes. Anakin restrained an urge to roll his own. \"Yes,\n            Master.\" \"This weapon is your *life*!\" the Master\n            emphasized. \"Iknow, I'm sorry.\" Obi-Wan did have a point after\n            all. \"It was an accident.\" \"Jedi don't have 'accident', Anakin. You must be more\n            focused.\" \"Iknow, Iknow. Look could we have the rest of the\n            lesson later, we've got an assassin to catch.\" Shaking his head Obi-Wan let go of his end of the lightsabre\n            and led the way into the club. \"How does our Master put up with you?\" \"He practiced on the Padawan he had before me.\"\n            Anakin returned saucily. His predecessor grinned wryly. \"He did indeed, poor\n            Master, he always picks the difficult ones.\" Anakin nodded agreement. Still, if he could manage to turn\n            out even half as well as Obi-Wan had..... It seemed to be some kind of sports bar. Giant screens lined\n            the walls showing various games and contests - including pod-racing! Anakin tore his eyes\n            away and reminded himself to focus. \"Do you see him?\" He scanned the crowd watching the screens, drinking, laying\n            bets or just talking sports talk. \"No. But Obi-Wan, Ithink he's a she and that she's\n            a changeling.\" Blond eyebrows lifted. \"In that case be extra\n            careful.\" Obi-Wan nodded towards the crowd. \"Go and find her.\" Anakin blinked. \"Me? What about you?\" \"I,\" Obi-Wan replied coolly, \"am going to get\n            a drink.\" quirked an eyebrow at him. \"Possibly more than one.\" and with\n            that he headed purposefully towards the bar leaving Anakin gaping after him. *What happened to his focus?* he wondered. The chase must\n            have been harder on Obi-Wan's nerves than he, Anakin, had realized. *Ishouldn't tease\n            him.* But flying was the only thing he did better than Obi-Wan and the temptation to show\n            off was nearly irresistable. Anakin circled the room, studying the polyglot patrons giving\n            especial attention to the females, both Human and Alien. And they eyed him in return with\n            an appreciation and invitation he'd only recently learned to recognize. *Iwish Padme would look at me like that.* suddenly a\n            familiar hum and flash of blue light spun him towards the bar. Pushing his way against the\n            backwash of patrons he broke through into the empty space that had formed around Obi-Wan\n            standing, sabre ignited, over a grey suited figure clutching at her arm. *Ishoulda known.* Anakin added aloud. \"Ican't take you\n            anywhere, can I?\" Obi-Wan just flicked him a glance, extinguished his sabre and\n            reached down to pull the assassin to her feet. \"Jedi business.\" Anakin announced to the staring\n            crowd. \"Go back to your drinks.\" and the patrons turned uneasily away, self\n            consciously resuming their activities as the two Jedi half carried their prisoner out a\n            side door into a noisome alley. \"Do you know who you were trying to kill?\" Obi-Wan\n            asked, almost conversationally, as he examined the damaged arm. \"The senator from Naboo.\" the woman mumbled. \"Who hired you?\" \"It was just a job.\" she evaded. Anakin wasn't having any of that. \"Who hired you?\"\n            he repeated, added with a touch of Force behind his voice. \"Tell us!\" \"It was a bounty hunter,\" she muttered unwillingly,\n            \"called -\" broke off with a little gasp. Her eyes glazed, then closed, and as\n            Obi-Wan lowered her to the ground she changed, becoming the wrinkled grey non-Human Anakin\n            had glimpsed in the speeder. Instinctively the two Jedi glanced over their shoulders, just\n            in time to see an armoured form rocket away from a nearby rooftop. They looked at each other then Obi-Wan felt at the dead\n            alien's neck, extracting a wicked looking multi-tipped dart. \"Atoxic dart.\" \"Well it's a clue anyway.\" said Anakin. Next -> Feedback to: moriah_organa@yahoo.com"
    }
  ]
}