{
  "url": "http://www.quietamerican.org/commentary_leaving.html",
  "file_number": "664",
  "content_hash": "fc1ff4675dab532ba7a733197793e4b5f1c50ffb1bbfa96417f7a6cd0d8d4458",
  "total_blocks": 103,
  "retained_blocks": 4,
  "ignored_blocks": 99,
  "blocks": [
    {
      "tag": "div",
      "text": "on \r\n                  leaving"
    },
    {
      "tag": "p",
      "text": "It \r\n                    is a terrible and wonderful thing to be an outsider. To travel \r\n                    is to step outside. Leaving affords an opportunity rare in \r\n                    my insulated world: a chance to be completely out of my depth. \r\n                    Even when Itravel with someone familiar, as Idid recently \r\n                    with my wife, Imay find myself in situations beyond my understanding. \r\n                    In such moments, at risk, Igain the world. By 'beyond \r\n                    understanding' Imean more than a simple intellectual failing. \r\n                    The challenges of travel, after all, include the trivial, \r\n                    such as the inability to follow instructions or read street \r\n                    signs. Trivial \r\n                    problems are to be expected, they are expected. Confronting \r\n                    them, the traveler is reassured by the poverty of their scale, \r\n                    and that of their solution: buy a phrasebook, learn to read Devanagari , perform every action with the right hand. No problem. \r\n                    If Iget on the wrong train at the border, Iwill simply go \r\n                    in a different direction. No problem. The first \r\n                    phrase Ilearn in many languages is no problem . No problem, \r\n                    because my life will parse itself into the paragraphs of travelers' \r\n                    narrative either way. The greater the snafu, the greater the \r\n                    dryness at its telling. 'That reminds me of this time, \r\n                    in the desert outside …' Trivial \r\n                    discomforts of dislocation are trivial because they are more \r\n                    than compensated for by the comfort the traveler takes in \r\n                    overcoming them. They do not dislodge my ego; au contraire, \r\n                    they ingratiate themselves to it with borrowed familiarity. \r\n                    They place me in a narrative: Icatch myself thinking, this misunderstanding, that fiasco, \r\n                    is one Ihave read about. Icongratulate myself that in proving \r\n                    equal to such woes, Ijoin a fraternity of the worldly. The wisdom \r\n                    Icollect from these moderate failures is only moderately \r\n                    valuable. If \r\n                    Itravel and come home with only it to show, the trip was \r\n                    still worthwhile. But of \r\n                    course, if this is as far as Iget, Inever really left. Occasionally, \r\n                    fortunately, the world conspires, and Iam shocked into a \r\n                    moment of genuine presence. The occasion is often a personal \r\n                    failure of fundamental understanding, where understanding transcends \r\n                    the grammar of associative consciousness. Adefining \r\n                    characteristic of these moments is that Iget that Idon't \r\n                    get it. Not getting \r\n                    it is not easy. Iam a prisoner of my ego and my autosycophantic \r\n                    confidence in my own intuitions. Awilling prisoner, for Iworship my intuition. But when \r\n                    Itravel in a different culture, intuition is a false god. \r\n                    One very hard to dislodge: it has features so familiar Iforget \r\n                    it is there. It is woven into and underpins my ritual habits. \r\n                    It is the idol packed most carefully in my pack. Understandably: \r\n                    Iwant to believe that Iunderstand where Iam. But resistance \r\n                    is necessary if Iam to see the world outside my simplifying \r\n                    representations of it. So \r\n                    the situations Iam interested in, that Ipush myself to find, \r\n                    that Imost fear, are those that defy intuition and stymie \r\n                    comprehension. These are often occasions of acute humility. (One reason \r\n                    Ihave returned to Asia is its manifest difference. Ihave \r\n                    an undergraduate's hazy understanding of Orientalism, but \r\n                    Iintuit that my romanticization of its difference is perhaps \r\n                    an example of it. So be it, if that's what it takes.) Traveling, \r\n                    Iseek to be shocked into leaving. It is a goal in the same \r\n                    way that insight is a goal of meditative practice. Some of \r\n                    the koan-like paradoxes are parallel: how does one intentionally \r\n                    put oneself beyond intention? Beyond everything. Beyond \r\n                    home and habit. Recently, \r\n                    my answer has been to shut up and listen . \r\n                    To sit for as long as Ican, as silently as Ican. Recording \r\n                    in those moments, Ido not capture what Iwitness. Ido not \r\n                    witness what Irecord. But the recording is preserved as a \r\n                    sign that points to what Iwill quickly forget. Returned \r\n                    home, my mind filled with the everyday, Ihave only these \r\n                    recordings. Every once a while, Iremember to listen, and \r\n                    slip away. Surrounding myself with them, Iremind myself to \r\n                    attend to the world. Ultimately\r\n                    this project is about sharing these things. To listen \r\n                    to my recordings is not to visit the places where they were \r\n                    made. At best, though, listening creates its own occasion \r\n                    for leaving. how to use this site artist's statement on \r\n                    leaving"
    },
    {
      "tag": "div",
      "text": "addendum"
    },
    {
      "tag": "p",
      "text": "It \r\n                    is worth contemplating that 'the shocking' does not necessarily \r\n                    shock. In Calcutta one can tour the slums. One can sample \r\n                    compassion, perhaps in penance for the license travelers otherwise \r\n                    grant themselves. Suffering does not shock. But then, \r\n                    when has it? In my city the landscape of human suffering is \r\n                    just as real and unreal as the juxtaposed landscape of privilege. If not \r\n                    the horrific, what surprises me into what Iam calling leaving? Ican \r\n                    answer only for myself: the unexpected detail and the unexpected \r\n                    kindness. The minutia of human behavior or natural phenomena \r\n                    visible only to the lucky voyeur. That which is unobserved \r\n                    when, as Iusually am, Iam in perpetual physical and mental \r\n                    motion. The revelation of alien patterns of assumption and \r\n                    expectation as deep as my own. Ionce explained my occasional struggle to escape the illusion \r\n                    of comprehension this way. Ienvision myself wearing an iron \r\n                    and leather harness. Radiating out from this harness are many \r\n                    branches. At the end of each is ensconced a burning candle. Each candle \r\n                    is an assumption, illuminating the world in a particular way \r\n                    I've learned. Try to see through the glare of candlelight. Darkness \r\n                    falls many ways. It may be thrust upon us, as on September \r\n                    11. Or, sitting still and attempting to quiet the mind, the \r\n                    candles may wink out. To be \r\n                    outside, in the dark, is to be at risk. There is often a psychic \r\n                    shock of dislocation. At times one may be at risk physically as \r\n                    well. Ido not think that a condition of danger is guaranteed \r\n                    to awaken the mind. There is more to attention than adrenaline. \r\n                    One can grow as accustomed to most anything. The mind is a \r\n                    great seeker of habit, and finding it, remakes intuition to \r\n                    the new order. Finally: \r\n                    it is a privilege to willingly enter such a state of uncertainty. \r\n                    It is a greater one to have a home to return to. Iam grateful \r\n                    for these things."
    }
  ]
}