{
  "url": "http://www.rhs.org.uk/publications/pubs/garden1103/mycorrhiza.asp",
  "file_number": "677",
  "content_hash": "3a1f8dacecedc2de5568fdbfe0484f70a3b5752baee08fd4cb189b6d34a7da87",
  "total_blocks": 69,
  "retained_blocks": 24,
  "ignored_blocks": 45,
  "blocks": [
    {
      "tag": "p",
      "text": "Skip navigation ."
    },
    {
      "tag": "div",
      "text": "Text-only version RHS Home About the RHS What's On Plants Advice Learning General Learning Education Publications Research Libraries"
    },
    {
      "tag": "h1",
      "text": "Learning"
    },
    {
      "tag": "div",
      "text": "Books | Journals | Videos | Speakers and judges | Colour Chart | Plant Bulletins | Plant Registers |"
    },
    {
      "tag": "h1",
      "text": "Publications"
    },
    {
      "tag": "h4",
      "text": "The Garden November 2003 Underground partnership"
    },
    {
      "tag": "p",
      "text": "Think all fungi are bad? Not the ones that have been pairing \r\n                    up with plant roots for 500 million years. Now available at \r\n                    garden centres, these can greatly benefit your plants, explains \r\n                    Jon Ardle Images: Tim Sandall"
    },
    {
      "tag": "div",
      "text": "The fine white strands (hyphae) of fungal \r\n                        tissue are supplying the roots they have colonised with \r\n                        water and nutrients. Formulations containing such fungi \r\n                        are now available in easy-to-use powdered form"
    },
    {
      "tag": "p",
      "text": "It is probably fair to say that, to most gardeners, fungi \r\n                    are an anathema. Whether turning the leaves of roses yellow \r\n                    and black, appearing in rings in a manicured lawn or, horror \r\n                    of horrors, as Armillaria (honey fungus) \r\n                    rampaging through a garden’s trees, moulds are costly \r\n                    nightmares. Think again. In the wild, more than 95 percent of higher \r\n                    plant species not only harbour fungi in their roots, they \r\n                    actually supply them with sugars and other foods. In return, \r\n                    the fungi furnish the plants with raw materials - water and \r\n                    nutrients from which food substances are synthesised - and \r\n                    protect them from soil-borne diseases. The relationship is \r\n                    therefore of benefit to both: a symbiosis. The close association of the roots of trees with certain \r\n                    fungi was described as long ago as 1885, by German forester \r\n                    AB Frank. The name for the association, mycorrhiza, literally \r\n                    means ‘fungus root’. It is only within the last \r\n                    30 years, however, that scientists have begun to realise that \r\n                    far from being the exception, such relationships are actually \r\n                    the norm in the plant kingdom. The fungal partner’s network of thin tubes, or hyphae, \r\n                    are much more efficient at absorbing both water and nutrients \r\n                    than even the thinnest root hairs, as hyphae have a much bigger \r\n                    surface area. Under less-than-ideal conditions, studies have \r\n                    shown that the efficiency of mycorrhizal roots can make the \r\n                    difference between life and death. Plants with mycorrhizal \r\n                    root systems are better able to resist stresses such as drought, \r\n                    heat, and even diseases - many mycorrhizal fungi secrete antibiotics, \r\n                    protecting roots from pathogenic fungi such as Phytophthora and Armillaria , nematodes and bacteria."
    },
    {
      "tag": "h4",
      "text": "Structures and functions"
    },
    {
      "tag": "p",
      "text": "There are two main types of mycorrhizal fungi, associated \r\n                    with different plant species. On trees, the most common type \r\n                    is known as ectomycorrhizae or EM, as most of its structure \r\n                    is outside the root, often forming a visible sheath over its \r\n                    surface. Hyphae also grow inside the root between the cells, \r\n                    forming a characteristic structure known as a Hartig net, \r\n                    and most EM fungi also produce fruiting structures like mushrooms \r\n                    and puffballs. The other major type, endomycorrhizae, have most of their \r\n                    structure inside the root. Also known as arbuscular mycorrhizae \r\n                    or AM, these are more primitive fungi than the EM type, making \r\n                    up only 150 of the estimated 6,000 mycorrhizal fungi species. \r\n                    However, AM is the predominant type, found on 65 percent of \r\n                    plant families, including grasses, herbaceous plants and woody \r\n                    species, with most colonising a wide range of plants. The \r\n                    branches of the tree-like structures - the arbuscules - that \r\n                    AM fungi produce have a large surface area across which the \r\n                    plant and fungus can exchange substances to the benefit of \r\n                    both. This occurs inside the root but outside individual cell \r\n                    membranes. Their microscopic structure makes AM fungi difficult to see \r\n                    and they do not form above-ground fruiting bodies, but more \r\n                    than 90 percent of vascular plants are thought to associate \r\n                    regularly with them. They send out thin hyphae into the soil \r\n                    that actively mobilise nutrients (particularly insoluble phosphates \r\n                    that are often the limiting factor in plant growth) from dead \r\n                    organic material and the soil’s mineral fraction."
    },
    {
      "tag": "h4",
      "text": "Working with nature"
    },
    {
      "tag": "p",
      "text": "The early attempts of forestry researchers to inoculate young \r\n                    trees with mycorrhizal fungi of the EM type involved macerating \r\n                    and liquidising the root systems of ‘donor’ trees, \r\n                    and dipping seedling root systems into the slurry. Results \r\n                    were patchy, and such preparations had short shelf lives. In the 1980s, EM mycorrhizal fungi were finally cultured \r\n                    on a commercial scale without host roots, and induced to form \r\n                    spores. Acompany called Plant Health Care in the USA was \r\n                    one of the first to offer a viable mycorrhizal inoculant, \r\n                    based on the species Pisolithus tinctorius , \r\n                    found on more than 100 species of trees and shrubs worldwide. \r\n                    Trials by the company produced increased growth rates of up \r\n                    to 200 percent in the seedlings of several pine species. Since then, research has continued apace with more species \r\n                    cultured, including the more difficult AM species that are \r\n                    obligate symbionts (they only grow on host roots). Companies \r\n                    such as PlantWorks in Kent are now producing formulations \r\n                    increasingly tailored to different host species and soil conditions. \r\n                    Many of these now contain both AM and EM fungi, making them \r\n                    suitable for a wide range of plants. These are beginning to \r\n                    appear in garden centres, but how useful are they to home \r\n                    gardeners? The short answer is: it varies, depending on the site, conditions \r\n                    and plants grown. For plants on poor, disturbed or contaminated \r\n                    soils, mycorrhizal inoculation can be vital. On the Betteshanger \r\n                    Colliery shale deposits in Kent, a study by Christ Church \r\n                    College Canterbury and PlantWorks showed that inoculated birch \r\n                    seedlings had mortality rates of less than 3 percent, compared \r\n                    with 60 percent in untreated plants. Mycorrhizal fungi dislike disturbed ground and are not found \r\n                    in subsoil, so in areas such as gardens of new-build houses \r\n                    or recent landscaping they are often not present and may not \r\n                    appear naturally until too late for newly-planted seedlings. \r\n                    Simply digging over beds or hoeing in a garden can disrupt \r\n                    existing mycorrhizal relationships. Acycle of negative feedbacks is common in gardens: disturbance \r\n                    damages the fungal partners of plants, making them less able \r\n                    to absorb nutrients, so the gardener adds a chemical ‘fix’ \r\n                    of inorganic fertiliser, which is toxic to the fungi, making \r\n                    them even less able to supply the plant. In organically-managed gardens and areas cultivated for wildlife \r\n                    interest, in particular, it makes sense to encourage mycorrhizal \r\n                    growth with early inoculation, minimal digging and mulching \r\n                    with organic matter that the fungi can break down slowly and \r\n                    naturally rather than using chemical fertilisers. Plants in \r\n                    such regimes are much better equipped to resist stresses such \r\n                    as drought, disease and excess heat - all of which may become \r\n                    increasingly important as global warming seems set to accelerate."
    },
    {
      "tag": "h4",
      "text": "Application"
    },
    {
      "tag": "div",
      "text": "Agel-based root-dip formulation containing \r\n                        both AM and EM mycorrhizal fungi used in the planting \r\n                        of new woods at RHS Garden Hyde Hall."
    },
    {
      "tag": "p",
      "text": "Mycorrhizal fungi are most effective in fine, actively growing \r\n                    fibrous roots, so the initial problem is physically how to \r\n                    introduce the fungus to these parts of the plant. The simplest \r\n                    method, now well-established in forestry and landscaping, \r\n                    is to apply a solution containing the inoculant by dipping \r\n                    the roots in a liquid or gel formulation (pictured, right). \r\n                    This technique is only really suitable for dormant, bare-root \r\n                    woody plants. For pot-grown plants, tablets or powdered formulations can \r\n                    be mixed into the growing medium. The nursery industry has \r\n                    been quite slow to take up this method, probably because plants \r\n                    grown in sterile media and supplied with all their water and \r\n                    nutrient needs may show little extra growth after inoculation. \r\n                    While large growth increases have been found in some cases, \r\n                    results have been mixed. Generally, though, inoculated plants \r\n                    rarely if ever perform worse than those that have been left \r\n                    untreated. Treated, pot-grown stock, when planted out and exposed to \r\n                    soil pathogens for the first time, has been shown to establish \r\n                    more quickly with better disease-resistance, and thus suffer \r\n                    less from ‘transplant shock’."
    },
    {
      "tag": "h4",
      "text": "Terravention"
    },
    {
      "tag": "div",
      "text": "Terravention can both reduce soil compaction \r\n                        and inoculate trees with mycorrhizal fungi."
    },
    {
      "tag": "p",
      "text": "Well-established plants including mature trees can also be \r\n                    inoculated, using a system known as Terravention. This physically \r\n                    blasts fungal inoculants into the rootball using pressurised \r\n                    nitrogen gas, and is particularly valuable in areas that are \r\n                    suffering from soil compaction, as the gas opens up air channels \r\n                    to some depth. The Royal Botanic Gardens, Kew reversed the \r\n                    seemingly-terminal decline of several specimens, including \r\n                    some of its oldest trees, with Terravention. A Platanus \r\n                    orientalis planted in the original garden in 1761 and \r\n                    a Sophora japonica from 1762 were both \r\n                    re-invigorated by Terravention in 1997, and a Cedrus \r\n                    deodara , marked for removal since two-thirds of its crown \r\n                    was completely defoliated, greened-up within months of treatment. \r\n                    All three continue to recover well. Success at Kew has been repeated at The Savill Garden, Windsor. \r\n                    Keeper of the Garden Mark Flanagan reports positive results \r\n                    from Terravention treatment to six important, ancient trees \r\n                    that were formerly in decline at Frogmore, near Windsor Castle. \r\n                    The Savill Garden, like Kew, is now inoculating some seedlings \r\n                    routinely at the pricking-out stage. How much of the improvement shown by such venerable specimens \r\n                    is due to the soil being better aerated, and how much to the \r\n                    introduction of fungi, is difficult to quantify. The method \r\n                    works, and has been used at RHS Garden Hyde Hall (see below). Mycorrhizal inoculation is not suited to every garden situation, \r\n                    and a few plant families, notably poppies and brassicas, rarely \r\n                    if ever form such relationships. For well-fed, well-watered \r\n                    plants, it may be unnecessary, but in many cases mycorrhizal \r\n                    fungi can act both as growth promoters and insurance policies \r\n                    against sources of stress (including diseases), contributing \r\n                    to a more natural, low-intervention, ecological form of gardening."
    },
    {
      "tag": "h4",
      "text": "Mycorrhizae at RHS Gardens"
    },
    {
      "tag": "p",
      "text": "At RHS Garden Hyde Hall in Essex, mycorrhizae-based formulations \r\n                    have been used in a number of ways. The garden suffered badly \r\n                    from waterlogging during much of 2000, so Terravention with \r\n                    inoculation was tried on several of the garden’s trees \r\n                    that had been badly affected. Many including a Lebanon cedar, \r\n                    a bird cherry and a venerable willow seem to have benefited. ‘They certainly look a lot healthier,’ says Curator \r\n                    Matthew Wilson, ‘but it’s impossible to say if \r\n                    this is the fungi, decompaction, weather or all three.’ \r\n                    Attempting to quantify the benefits of mycorrhizal inoculation \r\n                    is inherently difficult because so many other factors affect \r\n                    the plant-fungus relationship. The best results with mature \r\n                    trees have been recorded at both the New York Botanic Gardens \r\n                    and Royal Botanic Gardens, Kew where Terravention has been \r\n                    combined with turf removal under the trees out to their driplines, \r\n                    and the exposed soil has been mulched heavily. Root dips have been used in the planting of Hyde Hall’s \r\n                    new woodland areas, with treated and non-treated seedlings \r\n                    planted to compare establishment and growth. Matthew describes \r\n                    the results as ‘encouraging’, but stresses it \r\n                    is too early to draw conclusions. Arecent study at RHS Garden \r\n                    Wisley, comparing the effect of extra fertiliser and endomycorrhizal \r\n                    fungi on the resistance of Fragaria vesca (alpine strawberry) to Armillaria fungus, \r\n                    produced mixed results. Inoculation with pure AM Glomus \r\n                    intradices fungus gave the lowest death rates, but a \r\n                    mycorrhizal formulation for trees produced plants with the \r\n                    lowest weights. Fertiliser-treated plants were the heaviest."
    },
    {
      "tag": "h4",
      "text": "Contacts"
    },
    {
      "tag": "p",
      "text": "Terravent system: Contact Pinnacle Concepts, Cornwall, for \r\n                    local contractors; tel: 01209 821613; visit \r\n                    the website: www.terravent.com ; or e-mail: \r\n                    info@terravent.com PlantWorks, Sittingbourne, Kent, suppliers of TerraVital \r\n                    and Friendly Fungi ranges. Tel: 01795 411527 or visit \r\n                    the website www.plantworksuk.co.uk See also www.friendlyfungi.co.uk and www.planthealthcare.com Jon Ardle is Features Editor for The Garden back \r\n                    to The Garden contents page"
    },
    {
      "tag": "div",
      "text": "Advertise Online Accessibility Help Contact Us Disclaimer SEARCH: © The Royal Horticultural Society 2006  - Registered charity Number 222879"
    }
  ]
}