{
  "url": "http://www.buyblue.org/detail.php?corpId=7",
  "file_number": "302",
  "content_hash": "99f2ad8ec19bb5ebc5c15906148ca800489cdf1dbae9c33787f5e2cec2b3d6b2",
  "total_blocks": 129,
  "retained_blocks": 20,
  "ignored_blocks": 109,
  "blocks": [
    {
      "tag": "div",
      "text": "Home About Participate Store Contact Donate Ato Z | Categorized | Ranked Listing Login/Register"
    },
    {
      "tag": "p",
      "text": "You don't have to be a member to view all of the info on BuyBlue.org. However, creating an account lets you interact with the site in several ways , and  it's completely FREE!"
    },
    {
      "tag": "div",
      "text": "Username or e-mail address: * Password: * Create new account Request new password"
    },
    {
      "tag": "h2",
      "text": "BuyBlue Forums:"
    },
    {
      "tag": "div",
      "text": "Forums Home Economic Activism General Discussion Media Influence Research Discussion Suggestions Success Stories"
    },
    {
      "tag": "h2",
      "text": "Please Contribute:"
    },
    {
      "tag": "p",
      "text": "BuyBlue relies on unpaid volunteers and contributions.  Please consider funding our effort!"
    },
    {
      "tag": "div",
      "text": "Make a contribution!"
    },
    {
      "tag": "h2",
      "text": "Syndication"
    },
    {
      "tag": "div",
      "text": "Home"
    },
    {
      "tag": "h2",
      "text": "Bed, Bath & Beyond Inc"
    },
    {
      "tag": "div",
      "text": "view Summary Information Financials Ratings Take Action! begin content Labor & Human Rights : (1 article) Environment : (0 articles) Employment Equality : (0 articles) Corporate and Social Responsibility : (4 articles) Industry Practices : (0 articles)"
    },
    {
      "tag": "h2",
      "text": "How do we rate companies? Check out the ratings details. Help us rate this company!"
    },
    {
      "tag": "p",
      "text": "Bed Bath & Beyond has everything you need to play \"house\" for real. It's the #1 superstore domestics retailer in the US (ahead of #2 Linens 'n Things), with nearly 700 stores in 44 states and Puerto Rico. The stores' floor-to-ceiling shelves stock better-quality (brand-name and private-label) goods in two main categories: domestics (bed linens, bathroom and kitchen items) and home furnishings (cookware and cutlery, small household appliances, picture frames, and more). Everyday low prices eliminate the need for sales. Bed Bath & Beyond relies exclusively on circulars, mailings, and word-of-mouth for advertising."
    },
    {
      "tag": "div",
      "text": "Read the full bio. $80,500 to Democrats $2,500 to Republicans $0 to Others $83,000 in Total Contributions"
    },
    {
      "tag": "p",
      "text": "Write a letter or send a fax. Let this company know what you think . Talk about this company's practices in the comments below."
    },
    {
      "tag": "div",
      "text": "Active forum discussions. Login to post a new forum topic. Topic Replies Created Last reply BBB Additional Information... from an Insider! 0 1 year 15 weeks ago by Scoopster n/a"
    },
    {
      "tag": "p",
      "text": "Submitted by conversion on August 8, 2005 - 10:42pm."
    },
    {
      "tag": "div",
      "text": "email this page printer friendly version end content"
    },
    {
      "tag": "p",
      "text": "BuyBlue.org, a consumer advocacy issues website, is a non-profit corporation pending 501(c)3 status registered in the state of California. The opinions and viewpoints expressed by the authors here are their own and do not necessarily reflect the opinions of BuyBlue.org. Terms of Service , Rules & Guidelines , Privacy Policy , Hosted by Drak.net © 2004-2006 BuyBlue.org, All Rights Reserved. View Sitemeter"
    }
  ]
}