{
  "url": "http://www.ccne-ethique.fr/english/avis/a_028.htm",
  "file_number": "320",
  "content_hash": "7eab3b7e85f67ad9d1e05599d97b6f264f59c64edd57d71c2a7302fb2cfc3dce",
  "total_blocks": 266,
  "retained_blocks": 4,
  "ignored_blocks": 262,
  "blocks": [
    {
      "tag": "div",
      "text": "Opinion on blood transfusion \r\nwith reference to not making commercial use of the human body"
    },
    {
      "tag": "p",
      "text": "N28 - \r\n  December 2, 1991 The \r\nfull text of a chapter can be displayed by clicking on its title. To go back to \r\nthe table of contents, click on"
    },
    {
      "tag": "div",
      "text": "Download \r\n        opinion (36 KB)"
    },
    {
      "tag": "p",
      "text": "Contents Opinion Report 1. Developments in transfusion Technical \r\n    progress Development of indications and industrialisation of plasmatic \r\n    fractionation Developments in transfusion in other countries Transfusion in the futur 2. The French \r\n  transfusion system Particularities Evolution of the system 3. The European \r\n  directive on blood and its consequences Ethical \r\n    repercussions Consequences for the present transfusion system Consequences for public health Social consequences Opinion The National Consultative \r\n  Ethics Committee established its position on this issue in the presentation \r\n  of the initial work of the Group \"Ethics and money\" : \"When it is said that the \r\nhuman body is not for sale and not on the market, the two statements are complementary \r\n: on the one hand, the human body or one of its components cannot be the object \r\nof a contract, one the other hand, it cannot be negotiated by anyone\". The Committee re-asserts \r\n  this principle, which must apply to both the human body as a whole and to organs \r\n  and components. As regards blood donation \r\n  and more generally the French transfusion system, the Committee reiterates its \r\n  endorsement of the fundamental values which inspired the system : - voluntary unpaid donation - non-profit for subsequent \r\n  operations - dignity of the donor - interests of the patient. Areorganisation of structures \r\n  is necessary but must continue to be based on these principles, and must also \r\n  take into account all the objectives : safe collection and distribution of products, \r\n  sober and reasonable economic use, capacity to finance research and investments. \r\n  These principles entail total transparency and strict supervision of the use \r\n  of funds for scientific work and for day to day operations. Developments in European \r\n  economic co-operation should not compromise these principles. In this respect, a directive \r\n  by the Council of European Communities, dated 14th June, 1989, which calls blood \r\n  and human plasma \" raw materials \" and blood components \" pharmaceutical \r\n  items \" would seem to include these products of the body into the commercial \r\n  circuit. This interpretation of the document should not take precedence over \r\n  the principles recalled above. Purchasing blood and plasma \r\n  as one would buy a raw material and selling plasma derivatives, would be a negation \r\n  of the above principles. Any concession, on the pretext \r\n  that blood is a renewable tissue and that limited donation cannot be harmful, \r\n  would transgress the rule which ensures that human dignity is respected. Once \r\n  blood has become a commercial item, all other tissues and organs could go the \r\n  same way. In Europe a major effort \r\n  is in progress to bring nations closer together, in particular economically. \r\n  The Council of Ministers of the Council of Europe, when it adopted recommendation \r\n  n R-90-9 of 29th March, 1990 which states \" for reasons both ethical and \r\n  clinical, blood donation should be voluntary and should not give rise to remuneration \", is in fact taking a different direction. The National Consultative \r\n  Ethics Committee thereby finds reason to declare that unification will not be \r\n  achieved successfully, and therefore the ideal of arriving at harmonisation \r\n  will not be attained, if solely economic interests are taken account of, without \r\n  any reference to the ethical values which this Opinion reaffirms. Report Blood transfusion has been \r\n  for a long time one of the National Consultative Ethics Committee's particular \r\n  preoccupations ( *) \r\n  . The subject has just sprung to the foreground of national concerns in dramatic \r\n  circumstances. This report comes therefore at a time when there is coincidence \r\n  between action based on a principle and the testing of that principle by current \r\n  events. Early in 1990, our Committee \r\n  embarked on an in depth study on the theme of \"Ethics and Money\", the pertinence \r\n  of which never ceases to be patent in most of the matters we are asked to consider. \r\n  As a first step in this long term consideration of the matter, in the \" Journées Nationales d'Ethique \" in December 1990, the Committee re-affirmed \r\n  the fundamental principle of not making commercial use of the human body. Since \r\n  that time, work has progressed. One of the subjects which we feel we have completed \r\n  our consideration of, and which will be one of the major components of the final \r\n  report, is blood transfusion. As of now, it can be the subject of a report and \r\n  a firm Opinion. France played a leading \r\n  role in the development of blood transfusion. The first transfusions, the first \r\n  Transfusion Centre (Saint-Antoine, 1929), the first organised transfusion system \r\n  on a national scale, all took place in our country. Furthermore, as early as \r\n  1950, the principle of unpaid blood donation was adopted and made the French \r\n  system an internationally recognised ethical model. And yet, that which seemed \r\n  to have been established once and for all is challenged in a time of crisis, \r\n  with consequences that may turn out to be very serious or perhaps irreparable. There is a dual aspect to \r\n  this crisis. The first, which has been the subject of much discussion and comment, \r\n  is a loss of faith. The discovery that hundreds of haemophiliacs were contaminated \r\n  by the AIDS virus at a time when effective decontamination of anti-haemophilic \r\n  products had not become generalised, i.e. before mid-1985, provoked consternation \r\n  with which we entirely sympathise. Queries, criticism, and doubts abound. Who \r\n  bears responsibility or, in some cases blame, during this period ? Changes \r\n  in outlook since that time, brought about by an enormous accumulation of recently \r\n  acquired knowledge, complicates the task of judging with hindsight and taking \r\n  into account scientific uncertainties and technological hesitations of a period \r\n  now past. The courts will have the task of throwing all possible light on this \r\n  distressing issue, as devastated families and loved ones justifiably demand, \r\n  and making whatever reparation they may be entitled to. We have neither authority \r\n  to intervene in such procedures, nor any inclination to do so. The second aspect of the \r\n  present crisis, less apparent perhaps to public opinion, is in fact of much \r\n  greater scope and gravity. We refer to the fact that the principles of the system \r\n  as a whole are questioned, and that these principles are viewed in a equivocal \r\n  light although they are in no way involved in the calamitous events before 1985. \r\n  Our mission does not qualify us to evaluate the failings of the system or of \r\n  its structures, or their causes nor who is to be held responsible. But this \r\n  mission definitely empowers us to make a firm ethical stand upholding those \r\n  principles which are : absence of gain, and banning commercial use of the human \r\n  body. Changes which have been \r\n  introduced in the last few years in the Centre National pour la Transfusion \r\n  Sanguine (National Blood Transfusion Centre) could, if they were to persist, \r\n  gravely imperil the ethical principles which are at the root of the remarkable \r\n  and original qualities of the system as a whole. These changes were brought \r\n  about by revolutionary technical modifications to the process of blood transfusion. \r\n  Traditionally, transfusion was a direct transfer of whole blood, but has now \r\n  evolved so that elective use is made of the various components of blood and \r\n  plasma, according to the patient's specific needs. In this way, processes of \r\n  an almost industrial nature have appeared such as industrial extraction and \r\n  preparation of stabilised products for therapeutic purposes. This dual evolution \r\n  has led in some countries, the United States in particular, to a pharmaceutical \r\n  statute for the institutions preparing the products. Industrial logic leads \r\n  to a commercialisation of the whole process, blood is bought, and its components \r\n  are sold, after preparation. The risk of this kind of \r\n  development in France is all the less negligible since the European arrangements \r\n  which will become mandatory in 1993 move in that direction. There is danger for the \r\n  future of our system in both of its aspects : unpaid blood donation, and the \r\n  non-lucrative character of subsequent activities. We have entered into an \r\n  era of industrial logic : that cannot be avoided. We are now threatened by commercial \r\n  logic : is it avoidable ? This is the fundamental question we wish to broach \r\n  after considering : - developments in transfusion - features of the French \r\n  system - European directives on \r\n  blood and plasma, and their consequences. 1 - Developments in transfusion The expression 'blood transfusion' \r\n  now includes : collection of whole blood \r\nor of plasma only (plasmapheresis) separation of the blood \r\ncomponents : on one hand, cellular components - red blood cells, white blood cells, \r\nand platelets; on the other hand, plasma derivatives obtained by fractionation reinjection of whole blood \r\nvery rarely, usually only one or other of its components, depending on the patient's \r\nneed. The increasing complexity \r\n  of transfusion techniques is due to technical progress and to new indications. Technical progress Abloodless human dies. \r\n  This obvious fact led a very long time ago to the concept of transfusion. After \r\n  very disappointing early attempts with animal blood, the use of human blood \r\n  at the end of the 19th century raised hopes. They were frequently dashed, however, \r\n  by inexplicable failures. They remained unexplained \r\n  until Landsteiner, in 1900, discovered that all human blood was not identical \r\n  - neither identical nor, worse still, compatible. An essential breakthrough \r\n  was the discovery of the first three human blood groups, A, O, B, which are \r\n  the most important from the point of view of compatibility. This decisive step forward \r\n  and the needs engendered by World War Itriggered early applications. At the \r\n  time, transfusion was direct from arm to arm. After the war, various devices \r\n  greatly facilitated the procedure. In 1929, Arnault Tzanck, \r\n  who had been one of the pioneers of the technique, founded the first blood transfusion \r\n  centre in Paris, at the hospital Saint-Antoine. Physicians and donors were on \r\n  standby around the clock so as to be able to respond to any emergency in all \r\n  of the Paris hospitals. This was the first transfusion system. World War II brought further \r\n  progress : the preservation of blood. Blood could be stabilised and stored for \r\n  several days for transport and used elsewhere, at a later time. Moreover, it \r\n  could be checked biologically before use. After the war, blood transfusion \r\n  centres were established in the major hospitals. Some of them began to use separation \r\n  techniques so that blood cells and plasma could be used separately. This developed in response \r\n  to an increase in demand, i.e. in indications. Development of indications and industrialisation of plasmatic fractionation Initially designed to correct \r\n  a partial loss of blood volume, transfusion was in the beginning an injection \r\n  of whole blood. The only indication at the time, haemorrhage, seemed to logically \r\n  call for this kind of global compensation. However, progress in the technology \r\n  of resuscitation during World War II, revealed that the most threatening characteristic \r\n  of a haemorrhage is a collapse of circulation due to a drop in blood volume. \r\n  The idea was born of replacing as a priority the missing volume with plasma \r\n  only, if necessary. Plasma, once separated from blood cells can be easily stored \r\n  and preserved. The advantage therefore is greater availability. Once blood volume \r\n  has been restored, the loss of red blood cells has to be compensated, but it \r\n  is then only necessary to inject cells in the concentrated form which is the \r\n  result of fractionation. Thus, the concept of selective transfusion began to \r\n  emerge in the 1960s. In parallel, indications \r\n  multiplied and ceased to be purely surgical. Clinical indications included correcting \r\n  anemias, white blood cell and platelet deficiencies, or a lack of certain plasma \r\n  components such as clotting factors. In each of these cases, \r\n  it seemed logical to inject only the missing component. Furthermore, selective \r\n  transfusion saves blood. Various therapeutic products can be derived from the \r\n  same blood donation. The development of techniques \r\n  for separating blood into cells and plasma and then isolating the component \r\n  proteins of plasma, a process which is called plasma fractionation, naturally \r\n  ensued. These separation techniques \r\n  give rise to two kind of products : cellular components (labile \r\nproducts) which cannot be stored for any great length of time :a few weeks for \r\nred blood cells, and only a few days for white blood cells and platelets. plasmatic fractions, which \r\nare much more stable and can be stored for months or even years. Equipment required for each \r\n  of these two kinds of procedures varies considerably. Production of labile products \r\n  does not require any very complex equipment. It can be done by most blood transfusion \r\n  centres. Plasma fractionation, however, requires complex machinery. You could \r\n  say that labile products can be prepared in an unsophisticated environment, \r\n  processed and used in unit form, but with all the problems of verifying compatibility \r\n  at the time they are used. On the contrary, stable products fall into the category \r\n  of industrial processes in batches of several thousands of litres of plasma. \r\n  These products are standardised and can be used by anyone following prescriptions \r\n  for indications and general administrative procedures. The development of plasma \r\n  fractionation activities has led to the creation of industrial facilities processing \r\n  plasma in gigantic quantities : several hundreds of thousands of litres a year. Initially, plasma was the \r\n  result of separation of the cell components from whole blood; it was a kind \r\n  of \"by-product\" of the preparation of labile products by blood transfusion centres. \r\n  But as the growth of demand for stable fractions outpaced the growth of demand \r\n  for labile products, the result was selective collection. Certain machines can, \r\n  during the collection of blood from a donor, separate the cellular components \r\n  which are re-injected, and keep only the plasma. This is called plasmapheresis \r\n  and allows for collection of larger and much more frequent donations than is \r\n  the case with whole blood. In this way, and particularly \r\n  in certain countries, an independent plasma industry has evolved which closely \r\n  resembles the pharmaceutical industry. Developments in transfusion in other countries We are not attempting to \r\n  give an overall view of transfusion world wide. We simply wish to give an impression \r\n  of the diversity that exists using a few examples which will help to understand \r\n  the specificity and harmony of the French system which will be described below. The United States are a \r\n  special case for a variety of reasons. Firstly, because there are two types \r\n  of transfusion centres, those run by the Red Cross, and others with widely differing \r\n  statutes. Only the first category apply the ethical principles of non payment \r\n  of donors, and non-profit for the centre. But the major specific characteristic \r\n  of the country is the enormous development of a plasma industry run by a few \r\n  large companies along commercial lines. They buy the plasma obtained by plasmapheresis \r\n  and sell the fractions in the same way as medicinal drugs (they may also sell \r\n  the non processed plasma as a \" raw material \" to fractionating centres, \r\n  even in Europe as we shall see). As these companies are very dynamic they produce \r\n  quantities far higher than are needed on the American home market (needs are \r\n  evaluated at about 3 000 000 litres of plasma whereas about 9 000 \r\n  000 litres are drawn). As a result, they export a great deal of their production \r\n  at prices which on the whole are significantly lower than those practised by \r\n  fractionating centres using donated plasma. This is because as \"donors\" are \r\n  paid, conditions are imposed on them which ensure better productivity from the \r\n  plasmapheresis machines and blood centre staff. For a long time, Japan imported \r\n  blood products from the United States for two reasons : essentially because \r\n  not enough blood was collected, but even more because consumption was excessive, \r\n  particularly of plasmatic products. However, contamination of haemophiliacs \r\n  by the AIDS virus at a time when the country was virtually free of sexual contamination, \r\n  led to a radical change of policy. Self-sufficiency based on \r\n  voluntary donation and a slowing down of consumption is not far off, which is \r\n  beginning to worry American exporters and incite them to turn their eyes in \r\n  the direction of Europe. European transfusion centres \r\n  differ notably in the way they are organised and their degree of efficiency. \r\n  The French system with centres as part of a public service exercising a monopoly \r\n  is an exception. In certain countries, such as Belgium, Holland, and Denmark, \r\n  the Red Cross is in charge of organising blood transfusion and sees to it that \r\n  the rules of unpaid donation and absence of profit are respected. However, in \r\n  certain countries, Germany in particular, paying the donor is not prohibited. \r\n  Another particularity of the country, is that Germany consumes vast quantities \r\n  of plasma, albumin, and antihemophilic factors, and therefore imports large \r\n  volumes of American plasma (800 000 litres annually). Globally, Europe \r\n  just about satisfies its domestic market for labile products. For plasmatic \r\n  products however, it must import abundant quantities either as plasma, or as \r\n  finished products. Transfusion in the future In France and in most countries \r\n  with the same level of health care development, there is a levelling off of \r\n  blood and blood product consumption. It would not be unreasonable to expect \r\n  a downturn in the next few years. Several reasons may be involved. Firstly, as a consequence \r\n  of HIV contamination, there is increasing awareness of the risk of infection, \r\n  viral infection in particular. Even when they are identified and can be detected, \r\n  there is always a residual risk (at present, the risk of HIV transmission is \r\n  estimated at 1 in 100.000 to 1 in 200.000 transfusions). But more menacing is \r\n  the risk of new infections for which there is bound to be a lag before preventive \r\n  measures are applied. At first, only the medical \r\n  profession was apprehensive about transfusion risks, but the general public \r\n  is also becoming wary. Such fears are going to be the most powerful agents for \r\n  reducing consumption which had reached in some cases excessive levels. Apart from a more selective \r\n  choice of indications, another trend is to find new methods to either replace \r\n  blood with artificial substances (as we have seen previously, plasma substitutes \r\n  to replace blood volume), or to use the patient's own blood for a transfusion \r\n  instead of blood supplied by a donor. This is called autologous donation and is used in elective surgery when it is possible to predict some time in \r\n  advance that transfusion will be needed. Plasmatic fractions are \r\n  likely to modify to the greatest extent the present situation. They are pure \r\n  proteins, clearly identified and it is thought there could be hopes of creating \r\n  them by genetic engineering. Two American firms have already manufactured a \r\n  factor VIII which is out of the experimental stage and awaiting approval. The \r\n  French National Transfusion Centre is also working on a factor VIII but is a \r\n  little less advanced. Requirements for plasmatic factor VIII, which was the \r\n  component which conditioned the level of plasma consumption, should take a sharp \r\n  downward turn over the next few years. The same should apply to albumin which \r\n  has been synthesised by several genetic engineering processes. Finally, another \r\n  project of the National Transfusion Centre is to manufacture an anti-Dimmunoglobulin \r\n  to be used clinically to prevent Rhesus immunisation. Therefore, over the next \r\n  decade, there should be a complete reversal of the situation regarding plasmatic \r\n  proteins. However, the need for red blood cells, and even more for leukocytes \r\n  and platelets are nowhere near to being satisfied by anything but blood donation. 2 - The French transfusion system Particularities The French transfusion system \r\n  has some distinctive ethical and organisational features. After a short period \r\n  of time after the war when donors received financial compensation, partly justified \r\n  by the need to travel urgently demanded by the direct transfusion method, voluntary \r\n  donation became the rule. Deferred transfusion made possible by techniques to \r\n  preserve blood helped to achieve this, and also anonymity. Donation free of charge \r\n  introduced by the pioneers of transfusion, both medical staff and donors, later \r\n  influenced the whole organisation of the transfusion system. In 1952, a law was passed \r\n  setting up the transfusion system which includes Departmental Centres (one for \r\n  each département (French administrative areas), Regional Centres \r\n  (a total of 16) and the National Centre which also takes on certain special \r\n  tasks in education and research. Some Regional Centres and, \r\n  of course, the National Centre, have developed industrial activities for the \r\n  fractionation of plasma (a total of 7 centres). This system has the monopoly \r\n  of collecting, preparing, and distributing blood and all its derivatives. As \r\n  a logical follow-up to non lucrative donation, non profit making is mandatory. \r\n  This is implemented through the setting of a \"disposal\" price (and not a sales \r\n  price) for each of the products, by the government department in charge. In this way, although the \r\n  Centres do not all have the same legal status (some are hospital-based or community-based, \r\n  and in some cases they are associations) but all together render a public service. Another special feature \r\n  of the French system is the role played by donors. They are members of associations \r\n  which group together at national level to form the French Federation of Voluntary \r\n  Blood Donors (Fédération Française des Donneurs de Sang \r\n  Bénévoles). Donor associations at community level and the Federation \r\n  at national level cooperate with blood transfusion establishments, specially \r\n  for the purpose of promoting blood donation. The esteem and gratitude owed to \r\n  the voluntary donor is apparent in the partnership statute conferred on him. Evolution of the system The system has had to adapt \r\n  to the constant increase in demand.. It now collects approximately 4 million \r\n  donations a year. This is entirely sufficient for labile products, and almost \r\n  enough to satisfy demand for stable products. For the first time, in the last \r\n  two years, fortunately limited quantities of plasma have had to be imported. Adapting to the growth in \r\n  demand has required efforts from all the Centres, and more particularly the \r\n  fractionation Centres who in recent years have developed quasi industrial facilities \r\n  to prepare the various fractions and process about 1 million litres of plasma \r\n  a year. Yield efficiencies (extraction rate of the various proteins) have been \r\n  improved constantly. The best performances are on a par with state of the art \r\n  technology. It is worth noting that if all the fractionation Centres had attained \r\n  that level, imports would not have been necessary in the last two years. The National Blood Transfusion \r\n  Centre has played a leading role in this evolution. Its educational activities \r\n  in transfusion (most transfusion specialists are trained there), and research \r\n  activities (work conducted by Professor Salmon enjoys international recognition) \r\n  are worthy of note. The greatest effort however has been in the field of plasma \r\n  fractionation and a powerful industrial tool is in the making. Wishing to make the best \r\n  use of this industrial capacity, the management have created in the past two \r\n  years a joint stock company grouping a network of commercial subsidiaries, called Espace Vie . The creation of Espace \r\n  Vie has been described as necessary to adapt to pharmaceutical status developments \r\n  which are said to be inevitable in the light of European regulations which will \r\n  be studied below. There is no denying, however, \r\n  that creating a group of commercial subsidiaries could risk gravely tarnishing \r\n  the altruistic image of the transfusion system. There is a potential source \r\n  of flagrant contradiction of the non-profit principle of an organisation which \r\n  must be entirely devoted to the sole interests of the patient and respect for \r\n  the spirit of generosity of which the first example is set by donors. Donor associations and quite \r\n  a few physicians working in the transfusion centres did not entirely approve \r\n  the move. Furthermore, excessive financial commitments compromised the economic \r\n  balance of the National Centre. The governmental authorities \r\n  in charge of the Centres, became aware of the grave consequences of the move \r\n  and are studying the matter in preparation for further action. It is clear that the study \r\n  must consider mainly the National Blood Transfusion Centre because of the change \r\n  in its structures, but must also extend to a consideration of the whole French \r\n  transfusion system particularly in the light of the implications of the European \r\n  directive on blood and derivatives. 3 - The European directive on blood and its consequences The Council of European \r\n  Communities approved directive N 89-381 on 14th June 1989, \"setting up special \r\n  arrangements for medication derived from human blood and plasma\". The essential point in this \r\n  directive is that it confers the status of medicinal items to plasma derivatives. \r\n  It hopes that States will achieve self-sufficiency using non paid donors, but \r\n  it does not prohibit paid plasma from being imported, it does not demand non-profit \r\n  status for the fractionation facilities which may be part of the private sector, \r\n  and it provides for commercial distribution of the products. The economic inspiration \r\n  of this directive which aims to allow free circulation and production of \"medication \r\n  derived from human blood and plasma\" outranks very clearly ethical considerations \r\n  which take second place. If the European Directive \r\nis implemented, there would be serious repercussions on: - ethics, - the present transfusion \r\n  system, - public health, - society. Ethical repercussions Accepting the possibility \r\n  of buying blood and plasma as a \"raw material\", and commercial sale of processed \r\n  products, is above all, a denial of a fundamental principle of our legal system, \r\n  i.e. refraining from making commercial use of the human body. Quite recently, our Committee, \r\n  when it presented the initial work of the Group \"Ethics and money\" recalled \r\n  our attachment to this principle : \"When it is said that the \r\nhuman body is not for sale and not on the market, the two statements are complementary \r\n: on the one hand, the human body or one of its components cannot be the object \r\nof a contract, one the other hand, it cannot be negotiated by anyone\". Any concession, on the \r\n  pretext that blood is a renewable tissue and that limited donation cannot be \r\n  harmful, would transgress the rule which ensures that human dignity is respected. \r\n  Once blood has become a commercial item, all other tissues and organs could \r\n  go the same way. We point out that our refusal \r\n  should start with the rejection of wording such as \" raw material \" to \r\n  designate blood and plasma, and \" medication \" to describe products prepared \r\n  by processing blood and plasma. The terminology, which is \r\n  in itself alienating, opens the way to a deviation of concepts, principles, \r\n  and practices. However, in order to ensure \r\n  maximum safety, it is advisable that all the guarantees which attach to the \r\n  status of pharmaceutical items should be strictly applied to blood derivatives, \r\n  which does not however confer on them the status of medication as such. Consequences for the present transfusion system The French transfusion system \r\n  is based on a law passed in 1952 which set up a co-ordinated set of departmental, \r\n  regional, and national Centres. Together, they render a \r\n  public service to which was given the monopoly for collecting blood, preparing \r\n  derivatives, and distributing blood and components. If the European Directive \r\n  is implemented, this system will face threefold competition from the major commercial \r\n  companies : the companies could set \r\n  up fractionation units in France, they could buy plasma abroad, \r\n  at a lower cost price than donated plasma, they could, either through \r\n  these units, or through their manufacturing facilities abroad, market lower \r\n  priced products for two reasons. Firstly, because of the lower cost of the plasma, \r\n  but also because they do not have to bear the cost of supplying the labile fractions. \r\n  Commercial firms concentrate on the sole profitable side of the business, i.e. \r\n  stable products. The labile sector is more difficult to manage and to run profitably. \r\n  It would remain the responsibility of the national transfusion system, thereby \r\n  increasing the deficit. But the most threatening outcome concerns voluntary \r\n  donors who would cease to feel concerned if the principle of voluntary donation \r\n  was dropped. They have made this sentiment known through their associations. Altogether, the entire transfusion \r\n  system as it is today would very soon be endangered and made incapable of performing \r\n  a task which is essential for public health. Areorganisation of structures \r\n  is necessary but must continue to be based on a renewed assertion of ethical \r\n  principles, and must also take into account all the objectives : safe collection \r\n  and distribution of products, sober and reasonable economic use, capacity to \r\n  finance research and investments. These principles entail total transparency \r\n  and strict supervision of the use of funds for scientific work and for day to \r\n  day operations. Consequences for public health Accepting that blood and \r\n  plasma can be bought has further detrimental consequences for public health. \r\n  It is obvious that in such transactions, there is a tendency to overstep the \r\n  limits for volumes drawn which have been the rule for the sake of the donor's \r\n  health. Both the collecting agency and the donor may be responsible for such \r\n  abuses. Also, the purchase of blood \r\n  increases possible risks of contamination either by infectious agents, or by \r\n  drugs, in two ways : there is a higher representation of the more deprived sectors \r\n  of the population who are more exposed to risks of contamination of various \r\n  kinds, and vendors are more likely to conceal risk factors. Finally, in a system entirely \r\n  governed by the law of the market, consumption might be encouraged even for \r\n  marginal or aberrant indications. On the contrary, the unpaid character of the \r\n  donation obliges collection and distribution agents not just to respect the \r\n  non-profitable nature of the operation, but also sober and reasonable use, with \r\n  a verification of indications, and a limitation, insofar as is possible, of \r\n  the consumption of blood products which can be of immense therapeutic benefit, \r\n  but nevertheless is not devoid of serious risk. We recognise that the European \r\n  Directive, by demanding therapeutic drug status which implies safeguards, and \r\n  in particular checks and trials before a product is put on the market, seeks \r\n  to give maximum protection. However, as we have already stated, it should be \r\n  possible to demand identical safeguards without giving medication status. Social consequences Afree gift is part of a \r\n  social concept of solidarity which is all the more unselfish because the gift \r\n  is anonymous. The collecting agency, responsible for non-profitability and conscientious \r\n  use, is the public medium for this notion of mutual help and the recipient is \r\n  aware of the priceless value of what he has been given. In this way, the transfusion \r\n  system, as it was designed in France, is a creator of social bonds. A \"market\" \r\n  system cannot be expected to produce such wholesome results. On the contrary, \r\n  it would create inequalities and in particular incite preferential removal of \r\n  substance from the more deprived section of the population. The European Directive \r\n  appears to be inspired above all by economic considerations to promote free \r\n  trade within the Community, but brings with it, in exchange for very limited \r\n  safeguarding improvements, so many risks for the purity of the ethical principles \r\n  involved and the potency of our transfusion system that one may legitimately \r\n  wonder whether it is compatible with ethical principles which are reasserted \r\n  above. This questioning of the \r\n  medication status could for that matter be to some extent justified by a similar \r\n  trend in the United States, although for very different motives. At the request \r\n  of the commercial companies themselves, the medication status is about to be \r\n  dropped. The reason is that the status implies a degree of security which cannot \r\n  now, and probably not in the future, be totally guaranteed. Thus, liability \r\n  for risks which are difficult to foresee and estimate are becoming increasingly \r\n  troublesome to insure. For those reasons, in the United States the notion of \r\n  \"service\" is reinstated for transfusion, implying for the manufacturer simply \r\n  an obligation to use adequate means and approved practices. It would be paradoxical \r\n  if Europe where to adopt a solution which is contrary to its ethical principles \r\n  and which even in purely economic terms, is highly risky. Notes (*) \r\n  see Opinion of 13th May 1985. (c) \r\n  1999, Comité Consultatif National d'Ethique pour les sciences de la vie \r\n  et de la santé"
    }
  ]
}