{
  "url": "http://www.cdc.gov/ncidod/eid/vol4no3/hopkins.htm",
  "file_number": "321",
  "content_hash": "9fb6856c53943dbd115775de60afc65f5b2d7fc8df7b570e0e9a083205d6bc49",
  "total_blocks": 30,
  "retained_blocks": 8,
  "ignored_blocks": 22,
  "blocks": [
    {
      "tag": "p",
      "text": "Special Issue"
    },
    {
      "tag": "h2",
      "text": "The Guinea Worm Eradication Effort: Lessons for the Future"
    },
    {
      "tag": "p",
      "text": "Donald R. Hopkins The Carter Center, Atlanta, Georgia, USA The dracunculiasis (Guinea worm) eradication campaign has specific implications for\r\nefforts to control other emerging infectious diseases. Guinea worm, a painful disfiguring\r\ndisease, affects primarily adults, who often become ill in very large numbers (usually 30%\r\nor more of a village's population) during the planting or harvest season. The disease used\r\nto be transmitted in parts of Asia and in Africa in open standing stagnant water. The\r\nintermediate host of the parasite, the copepod, contains the larva of the worm in such\r\nopen drinking water; these organisms are barely visible in a glass of drinking water held\r\nup to the light. Thirteen years ago, the disease was still endemic in parts of the Indian\r\nsubcontinent, a small part of Pakistan and India, Yemen, and the band of countries across\r\nAfrica from east to west."
    },
    {
      "tag": "h3",
      "text": "The Guinea Worm Eradication Campaign"
    },
    {
      "tag": "p",
      "text": "Several interventions have been used to end transmission of Guinea worm disease: health\r\neducation (teaching people to filter their water through a finely woven cloth and not to\r\nenter water when they or their neighbors are infectious), safe drinking water from such\r\nsources as underground borehole wells, and vector control (using Abate). The Guinea worm campaign, like other campaigns in the past, has illustrated the\r\nimportance of political mobilization, including the mobilization of national leaders. For\r\nexample, General Amadou Toumani Tour (a charismatic former head of state of the Republic\r\nof Mali), with the encouragement of President Carter in 1992, made the eradication of\r\nGuinea worm disease in Mali and in the nine other French-speaking countries in West Africa\r\nhis personal mission. The campaign faces a problem common to many other efforts to control infectious\r\ndiseases in the industrialized and the developing world: underreporting. For example, in\r\nGhana, as in Nigeria 10 years ago, and in many other countries, only three or four\r\nthousand cases of Guinea worm disease were officially reported; but the actual numbers\r\nwere much higher. In 1989 when Ghana conducted a nationwide village-by-village search,\r\nalmost 180,000 cases were found. Sudan began its eradication program late because of civil\r\nwar. In 1996 and 1997, an apparent decline of cases in Sudan was due to less complete\r\nreporting because of increased fighting in 1997."
    },
    {
      "tag": "h3",
      "text": "The Campaign's Implications for Other Diseases"
    },
    {
      "tag": "p",
      "text": "The Guinea worm campaign has demonstrated very graphically the possibility of\r\nvillage-based monthly reporting in Africa. In Ghana and Nigeria at the beginning of this\r\nprogram 10 years ago, such reporting did not exist. Now in those countries, more than\r\n6,000 disease-endemic villages have volunteers who report to the national capital monthly. The Guinea worm campaign has also demonstrated very clearly the efficacy of health\r\neducation. In the beginning, many were skeptical because Guinea worm could not be combated\r\nwith a vaccine, and eradication efforts had to rely on behavior change. However, behavior\r\nhas changed. While we have been successful in helping to bring safe drinking water to many\r\ndisease-endemic villages, the fastest and most effective intervention has been health\r\neducation, which helped people understand where the parasite was coming from, how they\r\nwere being infected, and the importance of using cloth filters to protect themselves and\r\ntheir families. The campaign has underscored the potential of local volunteers. Many years ago in the\r\nAmericas, village volunteers were used as part of malaria control efforts. The\r\nonchocerciasis control program in Africa is also using village volunteers successfully.\r\nThe Guinea worm campaign has been another illustration of how volunteers can be used to\r\ndiagnose, report, and provide, in this instance, on-the-spot treatment to neighbors for a\r\nspecific infection. Those responsible for the campaign's success are often not members of\r\nthe general health services. With the help of the World Bank, the Guinea worm campaign demonstrates the importance\r\nof disease eradication to the national economy. The World Bank has estimated that the\r\neconomic rate of return on the investment in Guinea worm eradication will be on the order\r\nof 29% per year once the disease is eradicated. That figure is based on a very\r\nconservative estimate of the average amount of time infected workers are unable to perform\r\nagricultural tasks. The campaign has also created a group of trained health-care workers of a different\r\ngeneration from those involved in the smallpox eradication program. These workers have\r\ngone from beginning to end, from hearing the doubters and seeing the difficulty of\r\ninitiating the campaign to tasting victory in their own countries. These workers can\r\ncontribute to subsequent campaigns. Moreover, the concept of eradication, which was in\r\ndisrepute only 5, 10 years ago, has been revived. Soon we will confirm that a nonviral\r\ndisease for which vaccine is not available can be eradicated. Like the smallpox eradication campaign, the Guinea worm campaign has illustrated very\r\nvividly in many different ways and at many different levels (from international to village\r\nlevel) the power of data. In the Guinea worm campaign, we have used surveillance data to\r\npromote health policy. One key lesson from the smallpox campaign we are deliberately\r\napplying in the Guinea worm campaign is to distill what needs to be done in terms of\r\ninterventions to a handful, or almost a handful, of indexes (seven on an international\r\nlevel) to know what is most important and (as rapidly as possible) how well we are doing.\r\nThat unleashes inordinate amounts of energy. Finally, the Guinea worm eradication campaign will have illustrated again the power of\r\ndemonstration. Eradication can happen because it has happened. Top of Page | Current Issue | Upcoming Issue | Past Issue | Search | Home NCID Home CDC Home"
    },
    {
      "tag": "h5",
      "text": "Emerging Infectious Diseases National Center for Infectious Diseases Centers for Disease Control and Prevention Atlanta, GA"
    }
  ]
}