{
  "url": "http://www.cdc.gov/youthcampaign/research/resources.htm",
  "file_number": "322",
  "content_hash": "526a43e739b75ec982a48aa5b5eeae85e7bf62e1abe731e29ded71f05f1ce8a6",
  "total_blocks": 162,
  "retained_blocks": 13,
  "ignored_blocks": 149,
  "blocks": [
    {
      "tag": "div",
      "text": "Formative Research Process Evaluation Outcome Evaluation Resources & Reports"
    },
    {
      "tag": "div",
      "text": "Home Overview Partners Materials Research Press Room Contact Us"
    },
    {
      "tag": "h1",
      "text": "Resources and Reports"
    },
    {
      "tag": "p",
      "text": "Some of documents on this page may be available in Portable Document\r\nFormat (PDF). You will need Acrobat\r\nReader (a free application) to view and print these documents."
    },
    {
      "tag": "div",
      "text": "Evaluation Resources Formative Research Exploratory Brand Development Concept & Message Publications"
    },
    {
      "tag": "h3",
      "text": "Evaluation Resources"
    },
    {
      "tag": "p",
      "text": "Longitudinal Survey (PDF 200K) The Youth Media Campaign Longitudinal Survey (YMCLS) is an annual \r\nnational telephone survey of young people, ages 9 to 13 years, and their \r\nparents. Working with research corporation Westat, CDC designed the YMCLS to \r\nmeasure the physical activity-related beliefs, attitudes and behaviors of youth \r\nand their parents and to monitor youth exposure to the VERB campaign. Survey \r\nresults guide the campaign's evolution and provide important information about \r\nthe impact of the VERB campaign. A Computer-Assisted Telephone Interviewing \r\ntechnique was used to administer the survey. The appearance and structure of the \r\nsurvey reflects the software that is used for survey delivery. The interviewer \r\nreads all of the text  questions and response options  except for those in all \r\ncapital letters. Words or phrases that are in all capital letters are \r\nautomatically displayed to the interviewer and indicate possible coding options. \r\nText in parentheses at the end of a response category indicates a skip pattern \r\n(e.g., GO TO S2). We administered the first YMCLS (YMCLS 2002) during spring \r\n2002 before the launch of the national VERB campaign, to provide the baseline \r\nfor future studies. The baseline YMCLS 2002 was administered to more than 3,000 \r\n9-13 year olds and their parents nationally. Continuous Tracking Survey (PDF 265K). The Continuous Tracking Survey is an ongoing survey that collects data from a \r\nsample of 9-13 year olds to better understand their impressions of the campaign \r\nand its messages. The survey provides campaign planners and brand strategists \r\nwith information about how widely the campaign is being seen and how it is being \r\nunderstood. The appearance and format of the survey reflects the interview \r\nstructure that is used. VERBs \r\nFormative Research Process (PDF 150K) This document describes the VERB campaign's concept and message testing \r\nqualitative methodology. It contains sample screening questionnaires and \r\nmoderator guides. Logic Model Logic models are often developed for public health programs and campaigns. Alogic model links campaign inputs and activities with campaign outcomes. The model can be used as a tool to: Identify the short-term, intermediate, and long-term outcomes for the campaign; Link those outcomes to each other and to campaign activities; Select outcomes to measure depending on the stage of the campaigns development; Show how it may take time before long-term outcomes can be associated with the campaign. Back to top ^"
    },
    {
      "tag": "h3",
      "text": "Formative Research Reports"
    },
    {
      "tag": "p",
      "text": "Exploratory Research Reports New! Inspiring Childrens Physical Activity: Exploratory \r\nResearch with Parents (PDF 500K) This research helped understand factors that would influence parents to \r\nencourage their childs participation in physical activity and evaluate a range \r\nof concepts for promoting physical activity. The report summarizes the results \r\nof focus groups and in-home interviews conducted with mothers of 9- to \r\n13-year-olds in 2003. Lifes First Great Crossroad (PDF 400K) Summarizes findings about the lives of todays tweens, including the choices they make and how friends, family, and media help shape their behavior. Message Strategy Research to Support Development of the Youth Media Campaign (PDF 1.3MB) Presents insights  from interviews and focus groups with tweens, parents, other tween influencers, and industry professionals  that helped guide the development of messages for the Youth Media Campaign. Review of Literature to Support Development of the Youth Media Campaign (PDF 460K) Compiles information on tweens and topics relevant to development of the Youth Media Campaign. Youth Media Campaign Summary of Interviews Regarding Kids with Disabilities (PDF 165K) Summarizes interviews conducted to learn most effective ways of including kids with disabilities in concept and message testing and in future campaign messages and events. Interviews, conducted from July through August 2002, were with individuals who have developed messages for people with disabilities or who are from organizations that promote physical activity among people with disabilities. Back to top ^ Brand Development Research Reports Executive Summary of the General Market Formative Research to Support Brand Development for the Youth Media Campaign (PDF 66K) Summarizes findings of 25 in-home interviews conducted with tweens and their parents and influencers to better understand the motivations, images, and language that connect with both tweens and their families. Executive Summary of the African American Formative Immersion Research to Support Brand Development for the Youth Media Campaign (PDF 105K) Summarizes findings of focus groups conducted with tweens and parents of predominantly minority-populated urban areas to better understand the African American audience segment of the Youth Media Campaign. Executive Summary of the American Indian Formative Immersion Research to Support Brand Development for the Youth Media Campaign (PDF 21K) Summarizes findings of in-depth interviews conducted with American Indian tweens, parents, and influencers living in rural and urban environments to better understand this audience segment of the Youth Media Campaign. Executive Summary of the Asian American Formative Immersion Research to Support Brand Development for the Youth Media Campaign (PDF 97K) Summarizes findings of focus groups conducted with tweens and parents to better understand the Asian American audience segment of the Youth Media Campaign. Executive Summary of the Hispanic/Latino Formative Immersion Research to Support Brand Development for the Youth Media Campaign (PDF  \r\n71K) Summarizes findings of  in-depth interviews with low-income Hispanics/Latinos who are mostly Spanish language-dominant; migrant families and new immigrants were included. Research was conducted to better understand the Hispanic/Latino audience segment of the Youth Media Campaign. Back to top ^ Concept and Message Testing Reports VERBs \r\nFormative Research Process (PDF 150K) This document describes the VERB campaign's concept and message testing \r\nqualitative methodology. It contains sample screening questionnaires and \r\nmoderator guides. New! Lessons Learned from VERB: Findings for General \r\nMarket Tweens and their Parents (PDF 305K) This report presents recurrent themes and recommendations based on three years \r\nof concept and message testing among general market tweens and parents. New! Synthesis of Learning across 3 Years of Concept and \r\nMessage Testing among African American Tweens and Parents (PDF 145K) This report presents recurrent themes and recommendations based on three years \r\nof concept and message testing among African American tweens and parents. New! Synthesis of Learning across 3 Years of Concept and \r\nMessage Testing among American Indian Tweens and Parents (PDF 145K) This report presents recurrent themes and recommendations based on three years \r\nof concept and message testing among American Indian tweens and parents. New! Synthesis of Learning across 3 Years of Concept and \r\nMessage Testing among Asian American Tweens and Parents (PDF 145K) This report presents recurrent themes and recommendations based on three years \r\nof concept and message testing among Asian American tweens and parents. New! Synthesis of Learning across 3 Years of Concept and \r\nMessage Testing among Hispanic/Latino Tweens and Parents (PDF 145K) This report presents recurrent themes and recommendations based on three years \r\nof concept and message testing among Hispanic/Latino tweens and parents. Back to top ^"
    },
    {
      "tag": "h3",
      "text": "Publications"
    },
    {
      "tag": "p",
      "text": "Effects of a Mass Media Campaign to Increase Physical Activity Among Children: \r\nYear 1 Results of the VERB Campaign * This article presents the year 1 effects of the VERB campaign on the levels of \r\nphysical activity among children 9 to 13 years of age. VERB  A \r\nSocial Marketing Campaign to Increase Physical Activity Among Youth VERB applies sophisticated commercial marketing techniques to address the public \r\nhealth problem of physical inactivity of American children, using the social \r\nmarketing principles of product, price, place, and promotion. This article \r\ndescribes how the principles of social marketing were applied to develop the \r\nstrategies and tactics of the VERB campaign. The VERB \r\nCampaign Logic Model: A Tool for Planning and Evaluation This article describes the VERB campaign logic model and how it is used as a \r\ntool to share information, to facilitate program planning, and to provide \r\ndirection for evaluation. Commentary on \r\nthe VERB Campaign  Perspectives on Social Marketing to Encourage Physical \r\nActivity Among Youth In this commentary, Adrian Bauman, PhD, an international expert on physical \r\nactivity and media campaigns, provides a perspective on the VERB campaign as an \r\nexample of social marketing to encourage physical activity among youth. Physical Activity Levels Among Children Aged 913 Years \r\n United States, 2002 As part of the VERB campaign evaluation, CDC is using the national YMC \r\nLongitudinal Survey to collect data about attitudes and behaviors of children \r\nand their parents. This report presents selected findings from the baseline survey. Back to top ^ * Links to non-Federal organizations are provided \r\nsolely as a service to our users. Links do not constitute an endorsement of any \r\norganization by CDC or the Federal Government, and none should be inferred. The \r\nCDC is not responsible for the content of the individual organization Web pages \r\nfound at these links. This page last reviewed July 21, 2006"
    },
    {
      "tag": "div",
      "text": "Accessibility | Privacy Policy Notice | FOIA"
    },
    {
      "tag": "p",
      "text": "Home | Campaign Overview | Partners | Materials | Research | Press Room | Contact Us CDC Home | Search | Health Topics A-Z United States Department of Health and Human \r\n    Services Centers for Disease Control and \r\n    Prevention National Center for Chronic Disease \r\n    Prevention and Health Promotion Youth Media Campaign"
    }
  ]
}