{
  "url": "http://www.cduniverse.com/search/xx/music/pid/1107874/a/Greatest+Hits.htm",
  "file_number": "323",
  "content_hash": "f4c9ecb150efe876deb83c6c0bd070708a5955dac28bc9f1c4c16fe942f3c187",
  "total_blocks": 505,
  "retained_blocks": 3,
  "ignored_blocks": 502,
  "blocks": [
    {
      "tag": "div",
      "text": "Search ---POP MUSIC--- Artist Title Song Soundtrack Label ---CLASSICAL--- Composer Performer Orchestra Work Catalog Greatest Hits CD Greatest Hits CD Richard Marx price stuff Our Price: $9.65 Availability: Usually ships in 1-2 days Format: Detailed Information List Price $11.98 (You save $2.33) Category Rock , Country , Pop , Rock/Pop Label Capitol / EMI Records Orig Year 1997 All Time Sales Rank 868 CDU Part# 1107874 Catalog# 21914 Discs 1 Street Date Nov 04, 1997 Studio/Live Studio Mono/Stereo Stereo Guest(s) Luther Vandross; Lionel Richie Other Formats Richard Marx Greatest Hits (1997) $7.99 Customers Who Bought This Also Bought: Let's Talk About Love Dion, Celine $12.15 So Far So Good Adams, Bryan $11.29 Ladies & Gentlemen: The Best Of George Michael Michael, George $17.59 Hits Collins, Phil $15.25 Track Listing Click to listen to Sound Samples Song Title 1 . Don't Mean Nothing 2 . Endless Summer Nights 3 . Now And Forever 4 . Should've Known Better 5 . Angelia 6 . Hold On To The Nights 7 . Angel's Lullaby 8 . Take This Heart 9 . Satisfied 10 . Until I Find You Again 11 . Hazard 12 . Way She Loves Me, The 13 . Keep Coming Back 14 . Children Of The Night 15 . Touch Of Heaven 16 . Right Here Waiting Notes Personnel includes: Richard Marx, Luther Vandross, Lionel Richie (vocals).\r\nProducers: Richard Marx, David Cole, Humberto Gatica, Randy Jackson.\r\nIncludes liner notes by Richard Marx.\r\nAlthough he began his career singing backup for musicians such as Lionel Richie and Madonna, Richard Marx made his mark on the pop music scene in 1987 with his hit single, \"Don't Mean Nothing.\" Over the next ten years, Marx racked up thirteen top five singles and four multi-platinum albums; his biggest are included on GREATEST HITS, including familiar songs like \"Hold Onto the Nights,\" the sweet ballad \"Now and Forever,\" and the kicky, uptempo \"Satisfied.\" Other standouts include \"Angel's Lullaby,\" which was included on the Pediatric AIDS Foundation benefit cd, FOR OUR CHILDREN TOO, and which Marx wrote for his young sons: \"Iwas never alive til the day Iwas blessed with you/Ihold you late at night/Knowing what Iwas put here to do.\" Customer Reviews Average Rating: 5 out of 5 stars (9\r\n\t\t\treviews submitted) List All Reviews"
    },
    {
      "tag": "p",
      "text": "Top notch collection Excellent collection of recordings by the Chicago-born artist.  Major tracks that were major hits, Satisfied, Hold on to the Nights, Right Here Waiting, Angelina, Endless Summer Nights, Should Have Known Better as well as Hazard. Especially liked Keep Coming Back with the magnificent vocals of the late Luther Vandross.  Marx covers his career of music on this one CD.  Has nice dance songs as well as the soft ballads, Enjoy! :) Submitted by David\r\n\t\t\t\t\t in Middletown, NJ USA You will not be able to stop dancing!!!!!!!!!!!!!!!!!!!!! Awesome music!!!--can we say WOW??!!!!\r\nBuy it today if you don't have it!--listen to the whole thing!!!!!--it's great!!--simply great music!!!!\r\n: )  !!! Submitted by Jigsaw\r\n\t\t\t\t\t in Williamsburg, VA, USA Great Buy!! If you love Richard Marx music you would truly appreciate this CD.  Ibought it and don't regret it!!! It is the BEST !!! Richard is a gifted songwriter and singer. Thanks Richard for writing such wonderful lyrics about life and love and how to appreciate it!! Submitted by sahsc in Trinidad, West Indies Sounds like Bryan Adams Great cd. Submitted by Blake\r\n\t\t\t\t\t in Brandon,MS High Quality Collection This is a great collection of songs from Marx.  Since his 1987 debut, he has evolved over the years. From the first album, you get \"Endless Summer Nights,\" \"Hold On To The Nights\" and \"Should Have Known Better\". There are good songs as well off his follow-up Repeat Offender as well as from Rush Street. His ballads are very powerful and hit any mood you may be in. He is also versatile and that he can rock, see \"Satisfied\" and \"Take This Heart\". This is a complete compilation of a talented artist with moving comments of each song's history. Submitted by wolverinedave22 in Middletown,NJ USA"
    },
    {
      "tag": "div",
      "text": "List All Reviews Have you heard this album? cdu4asppid music 1107874 cdu4pidall cdu4pls3 ver209cdu cdu4all  12/26/2006 7:19:09 PM 1. K.O.B. (Kings Of Bachata) Aventura 2. Blues Breakers With Eric Clapton (Deluxe Edition) Mayall, John 3. Peter Lieberson: Neruda Songs / Lorraine Hunt Lieb Lieberson, Lorraine Hunt 4. Hip Hop Is Dead Nas 5. Love (Special Edition) Beatles › All Time Top Sellers This Week 1. Far Beyond The Sun (Ntsc/Rc-0) Malmsteen, Yngwie 2. 21 Omarion 3. Rocky Balboa: The Best Of Rocky Various Artists 4. Oh! Gravity Switchfoot 5. Back To Black Winehouse, Amy Next Week 1. Catfish Rising Jethro Tull 2. Roots To Branches Jethro Tull 3. Sparkle Sparkle 4. Into White Simon, Carly 5. The Essential Elvis Presley Presley, Elvis 1. Plays Well With Others Bergeron, Wayne 2. 20th Century Masters: The Millennium Collection: T Mcentire, Reba 3. Anna Netrebko - Russian Album Netrebko, Anna 4. Los Duenos Del Bandidaje Wibal & Alex 5. Dance With Me T.S.O.L. › Alt/Indie › Blues › Box Sets › Classical › Country › Dance › Heavy Metal › International › Jazz › Latin › Live Performance › Oldies › R & B › Rap/Hip Hop › Rock/Pop › Soundtrack Music Features & More › Accessories › Audiobooks › Calendars › DVD Audio › Enhanced CD › Super Audio CD › Bargain Bin › Radio Top 20 › Top Music Charts Browse Movies › Action/Adventure › Comedy › Drama › Horror › Music Videos › TV on DVD Japanese Soccer Anthem Japanese Soccer Anthem Our Price: $9.07 You Save: $8.92 › More Bargains Help Policies Special Features › Shipping \r\n          Information › Help \r\n          Section › Order \r\n          Status › FAQs › How \r\n          to Order Demo › Safe \r\n          Shopping Guarantee › Privacy \r\n          Policy › Contact \r\n          Us › About \r\n          Us › Affiliate \r\n          Program › Gift \r\n          Certificates › Wish \r\n          List ©1996 - 2006 CD Universe; Portions copyright 1948 - 2006 Muze Inc. For personal non-commercial use only. All rights reserved. To link directly to this page: \r\n\t\t\t\t\thttp://www.cduniverse.com/productinfo.asp?pid=1107874 Stats: TotalPageTime=0.234375 from Web11,  DataTime=0.140625 from Data19"
    }
  ]
}