{
  "url": "http://www.ci.nyc.ny.us/html/dep/html/history.html",
  "file_number": "335",
  "content_hash": "8516764a0435ce8106261fb23749c8bb103f39937937698f90498e22dbf77b38",
  "total_blocks": 29,
  "retained_blocks": 4,
  "ignored_blocks": 25,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2//EN\" T HE C ITY OF N EW Y ORK D EPARTMENT \r\n   OF E NVIRONMENTAL P ROTECTION"
    },
    {
      "tag": "h3",
      "text": "New \r\n    York City's Water Supply System History"
    },
    {
      "tag": "p",
      "text": "Early Manhattan settlers obtained water for domestic purposes from shallow privately-owned wells. In 1677 the first public well \r\n     was dug in front of the old fort at Bowling Green. In 1776, when the population \r\n     reached approximately 22,000, a reservoir was constructed on the east side \r\n     of Broadway between Pearl and White Streets. Water pumped from wells sunk \r\n     near the Collect Pond, east of the reservoir, and from the pond itself, was \r\n     distributed through hollow logs laid in the principal streets. In 1800 the \r\n     Manhattan Company (now The Chase Manhattan Bank, N.A.) sank a well at Reade \r\n     and Centre Streets, pumped water into reservoir on Chambers Street and distributed \r\n     it through wooden mains to a portion of the community. In 1830 a tank for \r\n     fire protection was constructed by the City at 13th Street and Broadway as \r\n     was filled from a well. The water was distributed through 12-inch cast iron \r\n     pipes. As the population of the City increased, the well water became polluted \r\n     and supply was insufficient. The supply was supplemented by cisterns and \r\n     water drawn from a few springs in upper Manhattan. After exploring alternatives for increasing supply, the City decided to \r\n     impound water from the Croton River, in what is now Westchester County, and \r\n     to build an aqueduct to carry water from the Old Croton Reservoir to the \r\n     City. This aqueduct, known today as the Old Croton Aqueduct, had a capacity \r\n     of about 90 million gallons per day (mgd) and was placed in service in 1842. \r\n     The distribution reservoirs were located in Manhattan at 42nd Street (discontinued \r\n     in 1890) and in Central Park south of 86th Street (discontinued in 1925). \r\n     New reservoirs were constructed to increase supply: Boyds Corner in 1873 \r\n     and Middle Branch in 1878. In 1883 a commission was formed to build a second \r\n     aqueduct from the Croton watershed as well as additional storage reservoirs. \r\n     This aqueduct, known as the New Croton Aqueduct, was under construction from \r\n     1885 to 1893 and was placed in service in 1890, while still under construction. \r\n     The present Water System was consolidated from the various water systems \r\n     in communities now consisting of the Boroughs of Manhattan, the Bronx, Brooklyn, \r\n     Queens and Staten Island. Since 1842, there have been no significant interruptions of service other \r\n     than brief annual shutdowns for the purpose of routine inspections during \r\n     the period from 1842 to the Civil War. In 1905 the Board of Water Supply was created by the State Legislature. \r\n     After careful study, the City decided to develop the Catskill region as an \r\n     additional water source. The Board of Water Supply proceeded to plan and \r\n     construct facilities to impound the waters of the Esopus Creek, one of the \r\n     four watersheds in the Catskills, and to deliver the water throughout the \r\n     City. This project, to develop what is known as the Catskill System, included \r\n     the Ashokan Reservoir and Catskill Aqueduct and was completed in 1915. It \r\n     was subsequently turned over to the City's Department of Water Supply, Gas \r\n     and Electricity for operation and maintenance. The remaining development \r\n     of the Catskill System, involving the construction of the Schoharie Reservoir \r\n     and Shandaken Tunnel, was completed in 1928. In 1927 the Board of Water Supply submitted a plan to the Board of Estimate \r\n     and Apportionment for the development of the upper portion of the Rondout \r\n     watershed and tributaries of the Delaware River within the State of New York. \r\n     This project was approved in 1928. Work was subsequently delayed by an action \r\n     brought by the State of New Jersey in the Supreme Court of the United States \r\n     to enjoin the City and State of New York from using the waters of any Delaware \r\n     River tributary. In May 1931 the Supreme Court of the United States upheld \r\n     the right of the City to augment its water supply from the headwaters of \r\n     the Delaware River. Construction of the Delaware System was begun in March \r\n     1937. The Delaware System was placed in service in stages: The Delaware Aqueduct \r\n     was completed in 1944, Rondout Reservoir in 1950, Neversink Reservoir in \r\n     1954, Pepacton Reservoir in 1955 and Cannonsville Reservoir in 1964. Water for the system is impounded in three upstate reservoir systems which \r\n     include 19 reservoirs and three controlled lakes with a total storage capacity \r\n     of approximately 580 billion gallons. The three water collection systems \r\n     were designed and built with various interconnections to increase flexibility \r\n     by permitting exchange of water from one to another. This feature mitigates \r\n     localized droughts and takes advantage of excess water in any of the three \r\n     watersheds. In comparison to other public water systems, the Water System is both economical \r\n     and flexible. Approximately 95% of the total water supply is delivered to \r\n     the consumer by gravity. Only about 5% of the water is regularly pumped to \r\n     maintain the desired pressure. As a result, operating costs are relatively \r\n     insensitive to fluctuations in the cost of power. When drought conditions \r\n     exist, additional pumping is required."
    },
    {
      "tag": "div",
      "text": "Last updated #BeginLibraryItem \"/Library/Date.lbi\" #BeginDate format:Am1 June 27, 2005 #EndDate #EndLibraryItem New \r\n   York City's Water Supply The watersheds of the water supply\r\n       system The water quality of your drinking\r\n       water Watershed Maps See the current\r\n          reservoir levels The Groundwater System Ahistory of the water supply system About DEP | Help Center | Education Information | DEP News | Contact Us | DEP Homepage! #BeginLibraryItem \"/Library/NYC.GOV Footer.lbi\" Go to NYC.gov \r\nHome Page Contact \r\nUs | FAQs | Privacy \r\nStatement | Site Map #EndLibraryItem #BeginDate format:Am1 June 27, 2005 #EndDate"
    }
  ]
}