{
  "url": "http://www.collectics.com/education_imperial.html",
  "file_number": "340",
  "content_hash": "db79915267eaf232305eb66c59921156971a021aefd84bf60581873568f09cc7",
  "total_blocks": 155,
  "retained_blocks": 19,
  "ignored_blocks": 136,
  "blocks": [
    {
      "tag": "div",
      "text": "html public \"-//w3c//dtd html 4.0 transitional//en\""
    },
    {
      "tag": "div",
      "text": "Collectics\nVariety Consignment \n                              Shop & Antique Mall Antiques \n                              & Collectibles Bookstore Collector Book Reviews Reference \n                              & Education Program Online Museum 1890-1935 Tiffany Lamps & Glass Gallery Museum \n                              & Historic Site Directory Collecting & Crafts Directory Site \n                            Search Engine Collecting \n                            Books Topic Search Collectics \n                            Speed Shopping Discover \n                              Collectics The\nCollectics Quiz Gift\nCertificates Featured\n\nItems Antique Appraisals Consignments Send\nA Gift Hint Tell\nYour Friends! Link\nTo Us Secure Order Form About\nUs Contact \n                                Us Cool\nStuff Our \n                            Cool Specialty Stores Collectics\nGift Certificates"
    },
    {
      "tag": "div",
      "text": "Kitchen \n                                & Dining Pottery & Ceramics Porcelain \n                                & China Glass \n                                & Crystal Lamps \n                                & Lighting Bakelite, \n                                Lucite, Plastic Vintage \n                                Jewelry Vintage \n                                Accessories Bronze \n                                & Metalware Memorabilia, \n                                History Vintage \n                                Advertising Toys, \n                                Sports, Children Art \n                                Deco & Art Nouveau Art, \n                                Prints, Needlepoint Crafts \n                                & Doll Clothes Clothing \n                                & Textiles 1950s \n                                & 1960s Retro Miscellaneous Collector \n                                Bargains The \n                                Holiday Shop Rare & Notable Books \n                                & Music Animal Collectibles Silver \n                                & Pewter Antiques \n                                & Collectibles Bookstore Reference \n                                & Education Program Collectics \n                                Online Museum 1890-1935 Collectics \n                                Collector Book Reviews HOME The \n                                Collectics Reference & Collector Education pages are \n                                designed to further knowledge of major collecting \n                                areas, periods, artists, and manufacturers of the decorative \n                                arts. To learn more, our Antiques \n                                & Collectibles Collector Bookstore lists only the \n                                best reference books and price guides, compiled \n                                by top dealers and auction houses. Our Collector Book Reviews feature editorial reviews \n                                and descriptions of the bestselling books for collectors."
    },
    {
      "tag": "p",
      "text": "Collector Book Reviews"
    },
    {
      "tag": "div",
      "text": "Reference \n                                Topic Index Collector \n                                Bookstore Peanuts \n                                © United Feature Syndicate, Inc."
    },
    {
      "tag": "div",
      "text": "THE\nIMPERIAL GLASS COMPANY"
    },
    {
      "tag": "div",
      "text": "Sponsored \n        by:"
    },
    {
      "tag": "p",
      "text": "Cars, \n                                        Planes, Figurines"
    },
    {
      "tag": "div",
      "text": "Capodimonte \n                                      Porcelain"
    },
    {
      "tag": "div",
      "text": "The \n                Imperial Glass Company was established in 1901 by an ex-riverboat \n                captain and experienced glassmaker Edward Muhleman, although they \n                didn't begin producing the iridescent Carnival \n                glass for which they became best known until 1909. In the \n                early days of its formation it made pressed glass as was the fashion \n                of the day, glasses, compotes, bowls, and other household tableware \n                and accessories. In 1904, Imperial moved into a new facility on \n                the river in Bellaire, Ohio, already a center of American glassmaking. \n                When they began making Carnival glass, it immediately became their \n                most popular production line and it was produced in huge quantities \n                for middle America and beyond. Imperial was closely identified \n                with more sculptural and geometric forms than contemporaries like Fenton and Northwood , \n                who became better known for evoking nature through grapes, leaves, \n                and other natural shapes. Imperial produced a much wider variety \n                of glass than simply Carnival glass however, although they always \n                made more utilitarian pieces than their contemporaries and as \n                such bring in general slightly lower prices in today's market. \n                They produced new colors such as \"smoke\", a light blueish-grey \n                color, and \"clambroth\", much the color of ginger ale, and they \n                produced marigold glass in huge quantities. In their Carnival \n                glass lines, they were particularly well known for the rich iridescence \n                of their pieces and especially their purple glass which was much \n                less commonly found from other manufacturers."
    },
    {
      "tag": "p",
      "text": "Many of the staffers \n                  at Imperial were German and Bohemian craftsmen who had been \n                  influenced and skilled in the work of Austrian and Bohemian \n                  producers of the period such as Loetz , \n                  and they sought to bring ever more highly skilled techniques \n                  to Imperial production. They produced almost the total spectrum \n                  of American glass styles of the era including slag glass, stretch \n                  glass, opalescent glass, milk glass, black glass, and novelty \n                  glass animals. Imperial was more successful than most other \n                  American manufacturer's of Carnival glass in exporting to Europe, \n                  and they continued to operate through the depression years of \n                  the 1930s in producing a cheaper range of green, pink, and blue Depression \n                  glass from earlier Imperial Glass molds. Candlewick glass \n                  was a pattern of elegant depression era glass produced in the \n                  1930's by the Imperial Glass Company, still popular for entertaining \n                  because of the sheer variety of service pieces available. Candlewick \n                  glassware is recognized by the bead work, usually found at the \n                  edges of a plate or on the stem of a cake plate. What sets it \n                  apart from other, similar glassware of the era is the quality \n                  and clarity of the glass. Imperial stayed in business \n                  through the hears of World War II and even began producing reproduction \n                  Carnival glass in the 1960s as collector interest began to be \n                  revived. They also acquired other struggling but formerly well \n                  known glass companies including A. H. Heisey in 1958 and Cambridge \n                  Glass Works in 1960. Using the old molds, Imperial continued \n                  to produce Heisey and Cambridge designs marketed as Heisey or \n                  Cambridge \"by Imperial.\" Lenox bought the company in 1973, beginning \n                  a period of decline until finally ceasing operations in 1983."
    },
    {
      "tag": "p",
      "text": "Reference\n& Education Topic Index"
    },
    {
      "tag": "p",
      "text": "Buy\nperiod Imperial, Fenton, Carnival, and other depression glass on the Collectics Glass\n& Crystal pages, or search the entire site for great antiques, \n                  collectibles, and crafts for every collector!"
    },
    {
      "tag": "p",
      "text": "Match ALL words Match ANY word"
    },
    {
      "tag": "div",
      "text": "Collectics \n                Antiques & Collectibles Bookstore"
    },
    {
      "tag": "p",
      "text": "The best collector \n                  books about antiques and collectibles collecting compiled by \n                  top dealers and auction houses, plus Topic \n                  Search with Amazon.com & free Collector \n                  Book Reviews !"
    },
    {
      "tag": "div",
      "text": "Imperial \n                Carnival Glass The \n                Art of Carnival Glass (Schiffer Book for Collectors)"
    },
    {
      "tag": "div",
      "text": "Tell\nus what you thought about Collectics About\nUs Contact\nUs Please \n                        support our free programs like Reference & Education \n                        and the Online Museum by visiting our Featured \n                        Sponsors & Amazon.com \n                        Store Amazon.com Top\nSellers If\nyou enjoy yourself, please tell\nyour friends !"
    },
    {
      "tag": "div",
      "text": "Copyright\n© Collectics. All rights reserved."
    }
  ]
}