{
  "url": "http://www.commondreams.org/views/022400-108.htm",
  "file_number": "343",
  "content_hash": "cdb4b00095ffe716efc7475c87bb526609c5ca31bbcbbee139d2d88499a460c3",
  "total_blocks": 91,
  "retained_blocks": 4,
  "ignored_blocks": 87,
  "blocks": [
    {
      "tag": "div",
      "text": "Home | Newswire | About \n        Us | Donate | Sign-Up | Archives Featured Views print starts here Printer Friendly Version print ends here referralblast starts here E-Mail This Article referralblast ends here #BeginTemplate \"/Templates/views.dwt\" #BeginEditable \"doctitle\" #EndEditable #BeginEditable \"Contact\" Published on Thursday, February 24, 2000 in the New Republic http://www.thenewrepublic.com/030600/reich030600.html #EndEditable #BeginEditable \"Header\" The Case For Bill Bradley #EndEditable #BeginEditable \"author\" by Robert Reich #EndEditable #BeginEditable \"Body\""
    },
    {
      "tag": "p",
      "text": "Iworked closely with Al Gore in the first Clinton administration, \r\n\r\n              and Iadmire him. Gore is earnest and smart. For the past seven \r\n\r\n              and a half years he's taken on god-awful projects that no one else \r\n\r\n              wanted to do--like \"reinventing government\"--and has done them well. \r\n\r\n              He's been loyal to a fault. Contrary to his public persona, he has \r\n\r\n              a droll sense of humor that occasionally tips into deadpan sarcasm. \r\n\r\n              So why do Isupport Bill Bradley? And why do Icontinue to support \r\n\r\n              him, even when his boat seems to be sinking? Maybe it's because \r\n\r\n              Ikept clean for Gene, passed out leaflets as a kid for Stevenson, \r\n\r\n              and would have voted for Wilson in 1912. I'm a sucker for decent, \r\n\r\n              smart, soft-spoken idealists with lofty visions about where the \r\n\r\n              country should go and what we can do together. For good or ill, \r\n\r\n              that description fits Bradley, not Gore. Start with the issues. I'll spare you the wonky details about Bradley's \r\n\r\n              plans for health care, education, campaign finance, gun control, \r\n\r\n              and child poverty. Nobody wants to hear about them, which is part \r\n\r\n              of Bradley's problem. Yet his are by far the boldest and most ambitious \r\n\r\n              proposals put forward by any candidate in this election. Bradley's health care plan has taken a lot of knocks from Gore, \r\n\r\n              but the criticisms are unfounded. Yes, the Bradley plan would end \r\n\r\n              Medicaid as a separate program. But the ill-fated Clinton-Gore health \r\n\r\n              plan of 1994 also folded Medicaid into a comprehensive system, which \r\n\r\n              is exactly what poor people need if they want to get jobs with better \r\n\r\n              wages and not worry about losing their coverage. Unlike the convoluted \r\n\r\n              plan of 1994, Bradley's proposal builds on the same system that \r\n\r\n              federal employees already use, and it provides subsidies to people \r\n\r\n              based on need. It covers almost everybody. By comparison, Gore's \r\n\r\n              new health care plan leaves most uninsured people between the ages \r\n\r\n              of 18 and 55 still uninsured. Gore says that we can't afford Bradley's plan, that if we tried \r\n\r\n              to fund it we wouldn't have enough money left over to fix Medicare. \r\n\r\n              But, hell, if we could afford the universal health insurance that \r\n\r\n              Clinton and Gore were peddling in 1994, when the federal deficit \r\n\r\n              was still in the stratosphere, we can afford Bradley's proposal \r\n\r\n              now that we're enjoying unprecedented budget surpluses. The nation \r\n\r\n              is richer than it's ever been. If we can't get universal health \r\n\r\n              care now, when can we? Besides, there's greater urgency today. When \r\n\r\n              the Clinton-Gore plan was dreamed up, 39 million Americans lacked \r\n\r\n              health insurance. Now the number is 44 million and rising. The only way we couldn't afford the Bradley plan would be if we \r\n\r\n              were to use a big chunk of the surplus to eliminate the federal \r\n\r\n              debt, as Clinton and Gore both want to do. But getting rid of the \r\n\r\n              national debt should not be a priority. As long as the debt doesn't \r\n\r\n              rise as a proportion of national product (and by that measure it's \r\n\r\n              been falling now for several years), the critical issue isn't how \r\n\r\n              large it is in absolute dollars but what the borrowed money is used \r\n\r\n              for. Borrowing to give Americans healthy bodies and our kids good \r\n\r\n              schools is a sound investment that is no less important to the nation's \r\n\r\n              future prosperity than a factory made slightly cheaper to build \r\n\r\n              because interest rates were driven lower by debt repayment. Clinton \r\n\r\n              talked this way in 1992. Bradley is talking this way now. Gore isn't. Sure, there's a case to be made for paying down the debt temporarily \r\n\r\n              so we can add debt again years from now when baby-boomer retirees \r\n\r\n              begin to draw on Social Security and boomer bodies begin deteriorating \r\n\r\n              en masse. But productivity is rising so fast that the nation will \r\n\r\n              probably be able to take care of doddering boomers without adding \r\n\r\n              much debt. And besides, wealthy Americans are becoming so much wealthier \r\n\r\n              that a tiny wealth tax would suffice to cover the boomers even if \r\n\r\n              productivity gains didn't. (Lest he get blamed for this harebrained \r\n\r\n              Reich idea, Bradley has not suggested it.) The point is that we \r\n\r\n              can now afford to get on with the great unfinished agenda. We don't \r\n\r\n              have to settle for the Dick Morris policy miniatures that have been \r\n\r\n              the leitmotiv of Clinton and Gore since 1996--ideas that sound grand \r\n\r\n              but are wimpy relative to the scale of the problems they're supposed \r\n\r\n              to address. Nothing bold will happen after January 2001 unless a \r\n\r\n              Democratic candidate for president stirs public ambition during \r\n\r\n              the campaign and creates a mandate for it to happen. Gore said the other day that he'd continue to pay down the debt \r\n\r\n              even when the economy slows, \"just as a corporation has to cut expenses \r\n\r\n              if revenues fall off.\" He added that a recession should be viewed \r\n\r\n              as an opportunity to push cuts further \"before any other options \r\n\r\n              are considered.\" This is worse than Reaganomics. It's Coolidgeomics. \r\n\r\n              \"He should wash his mouth out with soap,\" Nobel laureate economist \r\n\r\n              Robert Solow told The Wall Street Journal when he heard this \r\n\r\n              statement. If Americans want to elect a president who believes the \r\n\r\n              debt must be eliminated at all costs, let them elect a Republican. \r\n\r\n              Ipromise you he'll be a one-termer. The economy will shrivel, and \r\n\r\n              the Dems will be back in the White House for at least the next eight \r\n\r\n              years. It's not just health care and the budget. Gore is to the right \r\n\r\n              of Bradley on almost every important issue. Bradley wants to hold \r\n\r\n              military spending where it is and give a big boost to education. \r\n\r\n              Gore wants to increase military spending by $127 billion over the \r\n\r\n              next decade--$12 billion more than the increase he proposes for \r\n\r\n              education. Bradley voted against the Republican welfare plan, which \r\n\r\n              Clinton ultimately signed. Gore was for it. (Before you conclude \r\n\r\n              that \"welfare reform\" was successful and Bradley's vote against \r\n\r\n              it was a mistake, watch what happens in the next recession when \r\n\r\n              there's no safety net for the unemployed poor.) Bradley has committed \r\n\r\n              himself to labor-law reforms like large penalties for employers \r\n\r\n              who fire workers for trying to form unions. Gore is vaguer about \r\n\r\n              labor reform. And so on. Now, you may believe the nation should move further to the right. \r\n\r\n              Or you may be among those who believe Clinton has repositioned the \r\n\r\n              Democratic Party in the center and thereby breathed new life into \r\n\r\n              it. Both are respectable views in Democratic circles. But they ignore \r\n\r\n              the vast and growing party of nonvoters. Many of these people didn't \r\n\r\n              get much out of the 1990s boom. The median family income, adjusted \r\n\r\n              for inflation, is only slightly higher than it was ten years ago, \r\n\r\n              even though the median family is working a total of six weeks longer \r\n\r\n              every year. A Democrat can ignite these nonvoters' passions and \r\n\r\n              interests only with a large vision of what we can do together as \r\n\r\n              a nation, not with promises of teensy incremental improvements in \r\n\r\n              health care, weensy reforms of schools, military buildups, and debt \r\n\r\n              elimination. Why does the AFL-CIO support Gore over Bradley? Isuspect it's a matter of \"the devil \r\n\r\n              you know....\" Most union presidents have been in and around the \r\n\r\n              Clinton-Gore White House since January 1993. They haven't been delighted \r\n\r\n              with what it's brought them, but they'd rather stick with a sure \r\n\r\n              thing. And they've convinced themselves that, despite Gore's lukewarm \r\n\r\n              support of unions in the past and the dominance of anti-union Democratic \r\n\r\n              Leadership Council folk in Gore's inner circle, as president he'd \r\n\r\n              be more sympathetic to their cause than Bradley. I'm not so sure. \r\n\r\n              Last week Gore told the AFL-CIO executive council that, if they succeeded this year in derailing \r\n\r\n              China's admission to the World Trade Organization, once he was elected \r\n\r\n              president he'd scrap the current agreement and negotiate a much \r\n\r\n              tougher one, including labor protections. But the very next day \r\n\r\n              he reassured Washington business lobbies that he was fully behind \r\n\r\n              the China trade deal the White House had negotiated. Union leaders \r\n\r\n              are winking at one another, thinking they know where Gore really \r\n\r\n              stands. Business leaders are winking at one another, too, thinking \r\n\r\n              they know. Is this clever politics on Gore's part or the kind of \r\n\r\n              slick double-talk that would quickly undermine confidence in a Gore \r\n\r\n              administration? Lurking beneath all the substantive issues is the poison of money \r\n\r\n              in politics. Here, again, Bradley is a bolder reformer than Gore. \r\n\r\n              Bradley is calling not only for an end to soft money but for public \r\n\r\n              financing of election campaigns, including those for the House and \r\n\r\n              Senate. He's even proposing a two-to-one match of private donations \r\n\r\n              with public financing for presidential primaries. This goes way \r\n\r\n              beyond anything Gore, or even John McCain, has proposed. Bradley isn't a sudden convert to campaign finance reform--despite \r\n\r\n              Gore's claim on \"Meet the Press\" a few weeks ago that Bradley \"went \r\n\r\n              seventeen years in the United States Senate before he ever sponsored \r\n\r\n              a campaign finance reform bill.\" Quite the contrary: As a senator, \r\n\r\n              Bradley joined in sponsoring campaign finance reform bills in each \r\n\r\n              of six straight Congresses, from 1985 to 1996, including the main \r\n\r\n              campaign finance reform bills considered and acted on by the Senate. \r\n\r\n              In 1991 he was an original cosponsor of S.3, the only comprehensive \r\n\r\n              campaign finance reform bill to pass Congress in the last quarter-century, \r\n\r\n              which was vetoed by President George Bush. Then-Senator Gore did \r\n\r\n              not cosponsor this bill. Indeed, Gore hasn't exactly distinguished himself on the subject \r\n\r\n              of campaign finance. Buddhist temples and \"no controlling legal \r\n\r\n              authority\" aside, he has some explaining to do about his role in \r\n\r\n              a more serious breach of the spirit, if not the letter, of the campaign \r\n\r\n              finance laws. Starting way before the 1996 general election, Clinton \r\n\r\n              and, presumably, his vice president oversaw the creation of \"issue \r\n\r\n              ads\" that beat up on Bob Dole and the Republicans. The ads were \r\n\r\n              developed and run by the same political consultants who designed \r\n\r\n              the official Clinton-Gore campaign ads. But, rather than being paid \r\n\r\n              for by the Clinton-Gore campaign, which had agreed to abide by spending \r\n\r\n              limits, the ads were funded with unregulated money from the Democratic \r\n\r\n              National Committee, which raked in about $1.5 million a week to \r\n\r\n              air them wherever they'd have the most impact. Dole and the Republican National Committee didn't know what hit \r\n\r\n              them. By the time they woke up, it was too late. The Clinton-Gore \r\n\r\n              loophole not only helped the administration win the 1996 election \r\n\r\n              but thereafter established \"soft money\" as a slush fund for negative \r\n\r\n              political advertising. The Republicans are now fully intent on exploiting \r\n\r\n              the loophole this time around, to the tune of at least $200 million \r\n\r\n              if George W. Bush emerges as the likely nominee. That's roughly \r\n\r\n              twice what the Democratic National Committee can possibly pull in. \r\n\r\n              The only protection the Dems now have against the weapon Clinton \r\n\r\n              and Gore created in 1996 goes by the name of McCain, who has sworn \r\n\r\n              off soft money. Some people say none of this really matters. This campaign is \r\n\r\n              about character, and the \"new,\" feisty Gore is simply more appealing \r\n\r\n              than the rather impassive Bradley. Six months ago Gore was pedantic \r\n\r\n              and wooden, and his campaign was top-heavy with K Street lobbyists \r\n\r\n              and corporate public relations flacks. But, as the story goes, Gore \r\n\r\n              had the courage to change. He fired the flacks, moved his headquarters \r\n\r\n              from Washington to Nashville, and transformed himself into a hyperkinetic \r\n\r\n              dynamo. By contrast, although Bradley was hot several months ago, \r\n\r\n              his stolidity got boring. He didn't fight back hard enough against \r\n\r\n              Gore's attacks, he lost the expectations game in Iowa and New Hampshire, \r\n\r\n              and now the mantle of maverick reformer has shifted to McCain. And \r\n\r\n              Bradley still won't, or can't, remake himself into a winner. So, by the new tautological logic of presidential \"character,\" \r\n\r\n              Bradley doesn't have what it takes. He's toast unless a miracle \r\n\r\n              happens: Gore slips on some bit of dung left over from the 1996 \r\n\r\n              election, McCain fizzles and independents suddenly rediscover Bradley, \r\n\r\n              or Bradley himself emerges from a telephone booth as a new, supercharged \r\n\r\n              Bill--so fierce and fiery, so snappy and witty, so quick with mud \r\n\r\n              slings, barbs, zingers, ripostes, and repartees that he obliterates \r\n\r\n              Gore in upcoming debates, dazzles the press, and gets his face on \r\n\r\n              the front of every newsweekly in the country. In this post-Clintonian \r\n\r\n              world, success is character, character is success, and makeovers \r\n\r\n              create comeback kids--if they have enough will to come back in any \r\n\r\n              form that succeeds. The ability to make oneself over into a winning personality isn't \r\n\r\n              the true test of character, however, and it shouldn't be the criterion \r\n\r\n              we use in deciding on the next president of the United States. Character \r\n\r\n              has to do with consistency, truth-telling, fidelity to principle, \r\n\r\n              and courage. These will be the qualities Americans seek next Election \r\n\r\n              Day. McCain's appeal is based on them, and, were he to emerge as \r\n\r\n              the Republican standard-bearer, the Democrats would be hard-pressed. \r\n\r\n              Which of the two Democratic candidates best measures up? To my mind, \r\n\r\n              Bill Bradley. ROBERT B. \r\n\r\n              REICH , secretary of labor in the first Clinton administration, \r\n\r\n              is University Professor of Social and Economic Policy at Brandeis \r\n\r\n              University and national editor of The American Prospect. ### Copyright 2000, The New Republic #EndEditable"
    },
    {
      "tag": "div",
      "text": "#EndTemplate print starts here Printer Friendly Version print ends here referralblast starts here E-Mail This Article referralblast ends here FAIR USE NOTICE This site contains copyrighted material the use of which has not always been specifically authorized by the copyright owner. We are making such material available in our efforts to advance understanding of environmental, political, human rights, economic, democracy, scientific, and social justice issues, etc. We believe this constitutes a 'fair use' of any such copyrighted material as provided for in section 107 of the US Copyright Law. In accordance with Title 17 U.S.C. Section 107, the material on this site is distributed without profit to those who have expressed a prior interest in receiving the included information for research and educational purposes. For more information go to: http://www.law.cornell.edu/uscode/17/107.shtml . If you wish to use copyrighted material from this site for purposes of your own that go beyond 'fair use', you must obtain permission from the copyright owner. Common Dreams NewsCenter Anon-profit news service providing breaking news & views for the progressive community. Home | Newswire | Contacting Us | About Us | Donate | Sign-Up | Archives"
    },
    {
      "tag": "p",
      "text": "Copyrighted 1997-2006 www.commondreams.org"
    }
  ]
}