{
  "url": "http://www.cpa.ed.ac.uk/edit/2.03/018_Itsafamilyaffair.html",
  "file_number": "354",
  "content_hash": "ff28450bf14fa0489ab831356f2370ab521c4320e5cbaf85f3eec15c79a2b479",
  "total_blocks": 147,
  "retained_blocks": 7,
  "ignored_blocks": 140,
  "blocks": [
    {
      "tag": "div",
      "text": "HTML PUBLIC \"-//W3C//DTD HTML 3.2 Final//EN\" Start of inhead.html CSS Imports End of inhead.html Start of header.html Start of CPA Banner Logo & CPA Logo Links University \nHomepage C&M Homepage C&M Contacts C&M Search End of CPA Banner Logo & CPA Logo Links Start of navigation bar (Search & CPA Links) Search CPA Toolbar CPA Link Combo C&M Links... Press Releases Experts Directory Dynamic Diary Grants Directory Commercial Services Directory EBulletin Giftshop Image Gallery Server Statistics End of  navigation bar (Search & CPA Links) php include( $_SERVER['DOCUMENT_ROOT'].\"/includes/wan-leftnav.inc\"); ? this is for PHP files DO NOT REMOVE Start of wan-leftnav.inc Start of Left Side Bar LHS MENU BELOW HERE Home Latest News Dynamic Diary Degree Regulations & Programmes of Study <tr>\n\t\t<td class=\"sidebar2\"><a class=\"leftnav\" href=\"/edit\"><span class=\"leftNavFont\">EDIT Magazine</span></a></td>\n\t\t</td>\n\t</tr>\n\n\t<tr>\n    \t<td valign=\"top\" height=\"1\" class=\"sidebar\">\n\t\t<img src=\"/images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>\n\t</tr> eBulletin Experts Directory Corporate Identity Giftshop Services Staff Contact tr>\n\t\t<td class=\"sidebar2\"><a class=\"leftnav\" href=\"/\">navLink 5</a></td>\n\t</tr>\n\t<tr>\n    \t<td valign=\"top\" height=\"1\" class=\"sidebar\">\n\t\t<img src=\"/images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>\n\t</tr>\t\t\t\t\t\t\t\t\t\t\t\t\t\t\n\t<tr>\n\t\t<td class=\"sidebar2\"><a class=\"leftnav\" href=\"/\">navLink 6</a></td>\n\t</tr>\n\t<tr>\n    \t<td valign=\"top\" height=\"1\" class=\"sidebar\">\n\t\t<img src=\"/images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>\n\t</tr>\t\t\t\t\t\t\t\n\t<tr>\n\t\t<td class=\"sidebar2\"><a class=\"leftnav\" href=\"/\">navLink 7</a></td>\n\t</tr>\n\t<tr>\n    \t<td class=\"sidebar\" valign=\"top\" height=\"1\">\n\t\t<img src=\"/images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td class=\"sidebar2\"><a class=\"leftnav\" href=\"/\">navLink 8</a></td>\n\t</tr>\n\t<tr>\n    \t<td valign=\"top\" height=\"1\" class=\"sidebar\">\n\t\t<img src=\"/images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>\n\t</tr LHS MENU ABOVE HERE End of Left Side Bar End of wan-leftnav.inc LHS MENU ABOVE HERE <img src=\"/images/CPABanner.jpg\" alt=\"\"  border=\"0\" width=\"644\" height=\"100\" align=\"right\"> End of header.html"
    },
    {
      "tag": "h3",
      "text": "Edit"
    },
    {
      "tag": "h2",
      "text": "It's a family affair"
    },
    {
      "tag": "p",
      "text": "Anew research centre at the University of Edinburgh has its focus firmly on the family. DR SARAH CUNNINGHAM-BURLEY and DR LYNN JAMIESON are in no doubt as to the importance of better understanding of family life. Divorce and separation has replaced death as the most common cause of the removal of a parent from a child's family household. Family and personal relationships are crucial to the quality of life and health of individuals and to the economic and social well being of society.  Family issues are at the heart of key areas of government action, for example in health care, education, welfare and work, as well as within efforts to reduce poverty and promote social inclusion: family policy itself links across these areas.  Damaged personal life may be one of the causes of individual stress and ill health, violence and social disruption, and arouses considerable public concern. It is important to have detailed understanding of trends in personal relationships, family formation and dissolution, as well as of the impact of cultural, social and economic change on personal and family life. Attention needs to be paid to the experiences of different sectors of the population, rich and poor, majority and minority. Research shows that differential access to resources and information can radically affect the course of personal life. Information must also be collected across the life-course. Adults and children or even older and younger adults and older and younger children often do not experience the same household event, such as divorce or bereavement or moving home, in the same way. Anew initiative - the Scottish Centre for Research on Families and Relationships (CRFR Scotland) - has been funded by the Scottish Higher Education Funding Council to help gather and stimulate the gathering of such information. The Centre will have its headquarters at the University of Edinburgh, but the initiative involves collaboration with the University of Aberdeen, the University of Glasgow, Glasgow Caledonian University and a wider network of links. CRFR's focus on families and relationships acknowledges the diversity of ways in which families are created and maintained, and the importance of wider networks of kin and friends which form the basis of our personal lives. Scotland shares trends in personal life that are common to a number of European societies, including changes in how people enter and leave partnerships, have children and make homes for themselves. Over the 1980s the popularity of marriage seemed to decline - the average age of first marriage rose, numbers of marriages fell and couples living together without being married increased. Now, most couples marrying for the first time have lived together before marriage, some cohabiting couples never marry and cohabitation without marriage is a pattern that seems here to stay. However, it cannot be assumed that people no longer want permanent partnerships. The limited evidence suggests that never married couples setting up home together often have a plan to marry or a sense that they are checking out that this is the 'right one' before marriage. This is one of many areas needing further research. At the same time as the number of marriages declined, divorces have risen, levelling in the 1990s. Research shows that non-married cohabiting couples are as likely or even more likely to separate. These trends, delayed marriages, more cohabiting without marriages, and increased separation, along with falls in family size, are associated with a growing proportion of births outside of marriage. There is debate about whether children have a more or less stable family life than in the past. Most children born 'outside of marriage' in Scotland are registered by two parents, living at the same address. Single-parent households are often a consequence when partners separate. Divorce and separation has replaced death as the most common cause of the removal of a parent from a child's family household. The effects of divorce on wider relationships with kin and friends, and the subsequent contraction or expansion in how the members of a former household see their family is not yet fully mapped or understood. While some researchers have exceptionally talked to children about these issues, their perspective is often particularly neglected. Households made up of couples remain the most common household type, but couples with dependent children are now outnumbered by those with no children. Couples who choose to be childless remain a minority but one that has grown slightly and may grow further. The numbers of people living alone have also grown and are now about a quarter of all households. The combination of longer life and fewer births mean that elderly people form a growing proportion of many populations and particularly those living alone. The numbers of single young people living alone have also increased in recent years, particularly in urban centres. Relatively little is known about the family, kinship and friendship relationships of those who live alone although they are a growing sector of our society. One important change of the last decades concerns the interaction between men's and women's family relationships and their engagement in paid employment. By the end of the twentieth century, in the majority of couple households below retirement age, both men and women were in paid employment, although many more women worked part-time than men. The notion that marriage should be a partnership of equals gained strength in the latter half of the twentieth century. Surveys of attitudes clearly demonstrated increased support for gender equality in paid work, in housework and in childcare among both men and women, but with higher support for equality expressed by women. Although women's greater involvement in paid work has resulted in some men doing more housework, research continues to show that many women carry more responsibility for housework and childcare, even when both partners work full-time. Some commentators are confident that this is a temporary lag and greater equality is inevitable, while others doubt this. For example, research of the 1980s showed that male unemployment was as likely to generate a situation of greater tension between men and their wives as greater domestic equality. More recent studies suggest that the balance of work and family life remains problematic for many men and women. Balancing family and work may be particularly stressful for low paid workers. The stresses are different for different groups and at different stages of the life course. These are again issues that need further research. There is considerable debate about changes in the meaning of 'family', in how people feel about family obligations and what people typically want from their personal life, in the context of these trends. Studies of people's attitudes and ideals reveal that most men and women value family relationships very highly. Studies also show that people continue to have a strong sense of obligation to help family members, although this is not seen as an absolute rule but a matter that has to be negotiated. Agreat deal of work remains to be done to understand such trends, their meaning, the consequences and casualties, and the exceptions and variations among Scotland's diverse population across the life-course. CRFR will be an essential resource for evidence based policy and practice, through encouraging, providing and collating accessible briefings on research findings, and through networking academics, policy makers and practitioners. The Centre will encourage the practice, within the research community, of writing accessible research briefings, and will provide an infrastructure for dissemination to a wide audience, producing reviews of published research in key areas relevant to policy. Dissemination will take place both electronically through a web-site and research and user networks, and by a programme of face-to-face events. In this way, we shall contribute significantly to the development of users' knowledge base, and help deal with some of the tensions between those conducting research and the interests of specific sectors. We hope the CRFR will become a focal point for putting users in contact with academics who would provide expert briefing on specific topics. However, these links will also engage users in contributing to the research agenda, through the commissioning of specific projects, and through planning larger programmes dealing with wider and cross-cutting issues. Scottish devolution heightens the importance of consolidating and developing expertise within Scotland and of extending knowledge about families and relationships in Scottish society.  Devolved government brings the potential for further divergence between Scotland and the rest of the United Kingdom in relation to legislation and policies affecting families and relationships - an example within the first year of devolution has been the repeal of Section 2a of the Local Government Act. Detailed evidence based knowledge needs to be available to policy makers and practitioners in their work to improve social functioning and lessen social exclusion. The Scottish Parliament carries much of the legislative responsibility with respect to marriage, divorce, parenthood, children, education, housing and social work services. At the same time, the internal procedures and boundaries of government have been reconfigured in order to enhance opportunities for joined-up approaches to such issues.  New ways of working include the extensive investigative powers of parliamentary committees and the restructuring of Executive portfolios to refocus on issues once divided between departments, for example, bringing together children and young people, health and community care, and in the approach to social exclusion and equality. Precisely because family policy is a cross-cutting issue for government and the voluntary sector, a strength of the CRFR will be its ability to address policy needs in and across a number of areas, both reflecting and shaping policy agendas. This distinctive combination of changes in governance, and the possibility of further divergence in family policy north and south of the border, make it particulary important that there is a Scottish-based research Centre.  This will not only serve Scottish society, but also promote Scottish input into British and European debates. Couples with dependent children are now outnumbered by those with no children.Family and personal relationships are crucial to the quality of life and health of individuals and to the economic and social well being of society.  Family issues are at the heart of key areas of government action, for example in health care, education, welfare and work, as well as within efforts to reduce poverty and promote social inclusion: family policy itself links across these areas.  Damaged personal life may be one of the causes of individual stress and ill health, violence and social disruption, and arouses considerable public concern. It is important to have detailed understanding of trends in personal relationships, family formation and dissolution, as well as of the impact of cultural, social and economic change on personal and family life. Attention needs to be paid to the experiences of different sectors of the population, rich and poor, majority and minority. Research shows that differential access to resources and information can radically affect the course of personal life. Information must also be collected across the life-course. Adults and children or even older and younger adults and older and younger children often do not experience the same household event, such as divorce or bereavement or moving home, in the same way. Anew initiative - the Scottish Centre for Research on Families and Relationships (CRFR Scotland) - has been funded by the Scottish Higher Education Funding Council to help gather and stimulate the gathering of such information. The Centre will have its headquarters at the University of Edinburgh, but the initiative involves collaboration with the University of Aberdeen, the University of Glasgow, Glasgow Caledonian University and a wider network of links. CRFR's focus on families and relationships acknowledges the diversity of ways in which families are created and maintained, and the importance of wider networks of kin and friends which form the basis of our personal lives. Scotland shares trends in personal life that are common to a number of European societies, including changes in how people enter and leave partnerships, have children and make homes for themselves. Over the 1980s the popularity of marriage seemed to decline - the average age of first marriage rose, numbers of marriages fell and couples living together without being married increased. Now, most couples marrying for the first time have lived together before marriage, some cohabiting couples never marry and cohabitation without marriage is a pattern that seems here to stay. However, it cannot be assumed that people no longer want permanent partnerships. The limited evidence suggests that never married couples setting up home together often have a plan to marry or a sense that they are checking out that this is the 'right one' before marriage. This is one of many areas needing further research. At the same time as the number of marriages declined, divorces have risen, levelling in the 1990s. Research shows that non-married cohabiting couples are as likely or even more likely to separate. These trends, delayed marriages, more cohabiting without marriages, and increased separation, along with falls in family size, are associated with a growing proportion of births outside of marriage. There is debate about whether children have a more or less stable family life than in the past. Most children born 'outside of marriage' in Scotland are registered by two parents, living at the same address. Single-parent households are often a consequence when partners separate. Divorce and separation has replaced death as the most common cause of the removal of a parent from a child's family household. The effects of divorce on wider relationships with kin and friends, and the subsequent contraction or expansion in how the members of a former household see their family is not yet fully mapped or understood. While some researchers have exceptionally talked to children about these issues, their perspective is often particularly neglected. Households made up of couples remained the most common household type, but couples with dependent children are now outnumbered by those with no children. Couples who choose to be childless remain a minority but one that has grown slightly and may grow further. The numbers of people living alone have also grown and are now about a quarter of all households. The combination of longer life and fewer births mean that elderly people form a growing proportion of many populations and particularly those living alone. The numbers of single young people living alone have also increased in recent years, particularly in urban centres. Relatively little is known about the family, kinship and friendship relationships of those who live alone although they are a growing sector of our society. One important change of the last decades concerns the interaction between men's and women's family relationships and their engagement in paid employment. By the end of the twentieth century, in the majority of couple households below retirement age, both men and women were in paid employment, although many more women worked part-time than men. The notion that marriage should be a partnership of equals gained strength in the latter half of the twentieth century. Surveys of attitudes clearly demonstrated increased support for gender equality in paid work, in housework and in childcare among both men and women, but with higher support for equality expressed by women. Although women's greater involvement in paid work has resulted in some men doing more housework, research continues to show that many women carry more responsibility for housework and childcare, even when both partners work full-time. Some commentators are confident that this is a temporary lag and greater equality is inevitable, while others doubt this. For example, research of the 1980s showed that male unemployment was as likely to generate a situation of greater tension between men and their wives as greater domestic equality. More recent studies suggest that the balance of work and family life remains problematic for many men and women. Balancing family and work may be particularly stressful for low paid workers. The stresses are different for different groups and at different stages of the life course. These are again issues that need further research. There is considerable debate about changes in the meaning of 'family', in how people feel about family obligations and what people typically want from their personal life, in the context of these trends.Studies of people's attitudes and ideals reveal that most men and women value family relationships very highly. Studies also show that people continue to have a strong sense of obligation to help family members, although this is not seen as an absolute rule but a matter that has to be negotiated. Agreat deal of work remains to be done to understand such trends, their meaning, the consequences and casualties, and the exceptions and variations among Scotland's diverse population across the life-course. CRFR will be an essential resource for evidence based policy and practice, through encouraging, providing and collating accessible briefings on research findings, and through networking academics, policy makers and practitioners. The Centre will encourage the practice, within the research community, of writing accessible research briefings, and will provide an infrastructure for dissemination to a wide audience, producing reviews of published research in key areas relevant to policy. Dissemination will take place both electronically through a web-site and research and user networks, and by a programme of face-to-face events. In this way, we shall contribute significantly to the development of users' knowledge base, and help deal with some of the tensions between those conducting research and the interests of specific sectors. We hope the CRFR will become a focal point for putting users in contact with academics who would provide expert briefing on specific topics. However, these links will also engage users in contributing to the research agenda, through the commissioning of specific projects, and through planning larger programmes dealing with wider and cross-cutting issues. Scottish devolution heightens the importance of consolidating and developing expertise within Scotland and of extending knowledge about families and relationships in Scottish society.  Devolved government brings the potential for further divergence between Scotland and the rest of the United Kingdom in relation to legislation and policies affecting families and relationships - an example within the first year of devolution has been the repeal of Section 2a of the Local Government Act. Detailed evidence based knowledge needs to be available to policy makers and practitioners in their work to improve social functioning and lessen social exclusion. The Scottish Parliament carries much of the legislative responsibility with respect to marriage, divorce, parenthood, children, education, housing and social work services. At the same time, the internal procedures and boundaries of government have been reconfigured in order to enhance opportunities for joined-up approaches to such issues.  New ways of working include the extensive investigative powers of parliamentary committees and the restructuring of Executive portfolios to refocus on issues once divided between departments, for example, bringing together children and young people, health and community care, and in the approach to social exclusion and equality. Precisely because family policy is a cross-cutting issue for government and the voluntary sector, a strength of the CRFR will be its ability to address policy needs in and across a number of areas, both reflecting and shaping policy agendas. This distinctive combination of changes in governance, and the possibility of further divergence in family policy north and south of the border, make it particulary important that there is a Scottish-based research Centre.  This will not only serve Scottish society, but also promote Scottish input into British and European debates. Dr Sarah Cunningham-Burley, Dr Lynn Jamieson, Dr Kathryn Backett-Milburn and Dr Fran Wasoff are Co-Directors and Debbie Kemmer is Senior Research Fellow of the Scottish Centre for Research on Families and Relationships at the University of Edinburgh. PULL QUOTES: Divorce and separation has replaced death as the most common cause of the removal of a parent from a child's family household. Couples with dependent children are now outnumbered by those with no children. The numbers of people living alone have also grown and are now about a quarter of all households. Research of the 1980s showed that male unemployment was as likely to generate a situation of greater tension between men and their wives as greater domestic equality. Studies of people's attitudes and ideals reveal that most men and women value family relationships very highly. Anew research centre at the University of Edinburgh has its focus firmly on the family. Dr Sarah Cunningham-Burley and Dr Lynn Jamieson are in no doubt as to the importance of better understanding of family life. It's a family affairResearch of the 1980s showed that male unemployment was as likely to generate a situation of greater tension between men and their wives as greater domestic equality. Dr Sarah Cunningham-Burley, Dr Lynn Jamieson, Dr Kathryn Backett-Milburn and Dr Fran Wasoff are Co-Directors and Debbie Kemmer is Senior Research Fellow of the Scottish Centre for Research on Families and Relationships at the University of Edinburgh. Edit : It's a family affair Start of footer.html this Ptag is used to close any opened p tags"
    },
    {
      "tag": "div",
      "text": "php readfile($_SERVER['DOCUMENT_ROOT'].\"/includes/wan-rightnav.inc\"); ? For PHP files Start of wan-rightnav.inc Start of Right Navigation Bar (Quicklinks) <tr>\n\t\t<td valign=\"top\">\n\t\t\t<img src=\"/images/arrowBlackDown.gif\" alt=\"\" border=\"0\">\n\t\t\t\t<span class=\"smallFont\">QUICKLINKS</span>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t<!~~<form name=\"mainindex\" method=\"post\" action=\"http://www.ed.ac.uk/cgi/redirect.cgi\" class=\"jumpindex\">~~>\n\t\t<form name=\"mainindex\" method=\"post\" class=\"jumpindex\">\n\t\t<td>\n\t\t\t\t<!~~<font face=\"verdana\" size=\"-1\" color=\"#cccc66\"><b>\n\t\t\t\t<select name=\"redirect\" size=\"1\" WIDTH=\"100\" STYLE=\"width: 100px\"onChange=\"selectUrl(document.forms[0])\" class=\"jumpindexelement\">~~>\n\t\t\t\t<select name=\"redirect\" size=\"1\" WIDTH=\"120\" STYLE=\"width: 120px\"onChange=\"window.location=this.options[this.selectedIndex].value\" class=\"jumpindexelement\">\n\t\t\t\t<option value=\"http://www.ed.ac.uk/quicklinks.html\" selected><b>Quick Links...</b></option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/quicklinks.html\">~~~~~~~~~~~~~~-</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/misc/academic.html\">Academic Units</option>\n\t\t\t\t<option value=\"http://www.dev.ed.ac.uk/\">Alumni</option>\n\t\t\t\t<option value=\"http://www.ucs.ed.ac.uk/\">Computing</option>\n\t\t\t\t<option value=\"http://www.student-counselling.ed.ac.uk/\">Counselling</option>\n\t\t\t\t<option value=\"http://www.disability-office.ed.ac.uk/\">Disability Office</option>\n\t\t\t\t<option value=\"http://www.iprs.ed.ac.uk/diary/\">Events</option>\n\t\t\t\t<option value=\"http://www.registry.ed.ac.uk/student/exam.htm\">Exams</option>\n\t\t\t\t<option value=\"http://www.health-service.ed.ac.uk/\">Health Service</option>\n\t\t\t\t<option value=\"http://www.humanresources.ed.ac.uk/\">Human Resources</option>\n\t\t\t\t<option value=\"http://www.lib.ed.ac.uk/\">Library</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/maps/\">Maps</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/news/\">News</option>\n\t\t\t\t<option value=\"http://www.cpa.ed.ac.uk/prosp/\">Prospectuses</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/news/termtimes.html\">Semester Times</option>\n\t\t\t\t<option value=\"http://www.eusa.ed.ac.uk/\">Students' Assoc.</option>\n\t\t\t\t<option value=\"http://www.registry.ed.ac.uk/StudentHandbook/\">Student Guide</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/presentstudents/services.html\">Student Services</option>\n\t\t\t\t<option value=\"http://www.ed.ac.uk/misc/support.html\">Support Services</option>\n\t\t\t\t</select>\n\t\t\t\t</td>\n\n\t\t\t\t<td>\n\t\t\t\t<!~~<input type=\"image\" src=\"/images/Go.jpg\" border=\"0\" value=\"Go\" title=\"Go\" alt=\"Go\" VALIGN=\"bottom\" />~~>\n\t</td></form>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<img src=\"/images/arrowBlackDown.gif\" alt=\"\" border=\"0\"><span class=\"smallFont\">UNIVERSITY LINKS</span>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/\" title=\"Home\"><span class=\"smallFont\">Home</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/studying/undergraduate/\" title=\"Undergraduate Prospectus 2004\"><span class=\"smallFont\">UG Prospectus 2004</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/studying/postgraduate/\" title=\"Postgraduate Prospectus 2004\"><span class=\"smallFont\">PG Prospectus 2004</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/news/ebulletin/\" title=\"EBulletin\"><span class=\"smallFont\">EBulletin</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/annualreport/\" title=\"Annual Report\"><span class=\"smallFont\">Annual Report</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/news/acyearcomp.html\" title=\"Term Dates\"><span class=\"smallFont\">Term Dates</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/search/\" title=\"Search\"><span class=\"smallFont\">Search</span></a></p>\n\t\t</td>\n\t</tr>\n\t\t<tr>\n\t\t<td valign=\"top\" height=\"1\">\n\t\t<!~~<img src=\"images/spacer.gif\" width=\"1\" height=\"1\" alt=\"\"></td>~~>\n\t\t<img src=\"/images/rightMenuDiv.gif\"  alt=\"\"></td>\n\t</tr>\n\t<tr>\n\t\t<td valign=\"top\">\n\t\t\t<p><img src=\"/images/arrowBlackRight.gif\" alt=\"\" border=\"0\"><a href=\"http://www.ed.ac.uk/contact.html\" title=\"Contact\"><span class=\"smallFont\">Contact</span></a></p>\n\t\t</td>\n\t</tr>\n\t<tr>\n\t\t<td><img src=\"images/spacer.gif\" width=\"1\" height=\"20\" alt=\"\">\n\t\t</td>\n\t<tr> End of Right Navigation Bar (Quicklinks) End of wan-rightnav.inc Start of Footer Bar Statistics | Contact | Search"
    },
    {
      "tag": "p",
      "text": "Communications & Marketing, The University of Edinburgh Centre, 7 - 11 Nicolson Street,\n\t\t\t\t   \tEdinburgh, Scotland EH8 9BE. Tel (University Switchboard) :+44 (0)131 650 1000. Unless explicitly stated otherwise, all material is copyright The University of Edinburgh."
    },
    {
      "tag": "div",
      "text": "End of footer.html"
    }
  ]
}