{
  "url": "http://www.cri.ca/publications/june03_communique/licence_application.html",
  "file_number": "355",
  "content_hash": "b34c33a0e7e7779862c29a2d525d733ba6c18748471b7bc3517eac68f6f8f545",
  "total_blocks": 123,
  "retained_blocks": 5,
  "ignored_blocks": 118,
  "blocks": [
    {
      "tag": "div",
      "text": "OPERATIONS JOINT \r\n                    VENTURES PUBLICATIONS > Review 2005 Archive > Communiqu Archive > Community \r\n                          Updates Archive > Pamphlets NEWS \r\n                    RELEASES ENVIRONMENT SAFETY \r\n                    & QUALITY OUR \r\n                    COMMUNITIES CONTACT \r\n                    US AREVA \r\n                    Group LINKS"
    },
    {
      "tag": "p",
      "text": "AREVA > Home > Publications > Communiqué > June \r\n              2003 Communiqué McClean Licence Application: Moving to End the Uncertainty"
    },
    {
      "tag": "div",
      "text": "The McClean Lake mill (top of photo) and TMF \r\n                  have been operating and monitored for four years with no harm \r\n                  to the environment."
    },
    {
      "tag": "p",
      "text": "Last fall, when a federal court decision quashed McClean Lake's \r\n              1999 operating licence over a technicality, the threat of closure \r\n              felt very real for some 200 people working at the operation. Both \r\n              COGEMA Resources and the Canadian Nuclear Safety Commission (CNSC) \r\n              immediately filed appeals, and then successfully applied for a \"stay\"in \r\n              the decision until the appeal is settled. COGEMA Resources is confident that the arguments for the appeal \r\n              are sound and believes that the original decision should be overturned. \r\n              But until the court case has run its course, there is a cloud of \r\n              uncertainty over McClean Lake. In a move to protect the company, \r\n              customers, employees and contractors from this uncertainty, COGEMA \r\n              Resources has filed an application with the CNSC for a new operating \r\n              licence for the McClean Lake mine and mill. The application for \r\n              the new licence triggers a new environmental assessment of the project. \"This is an entirely redundant exercise,\" said COGEMA Resources \r\n              President and CEO Tim Gitzel. \"McClean Lake has already been through \r\n              an eight-year environmental assessment and licensing process and \r\n              has delivered outstanding environmental performance since production \r\n              started four years ago.\" In fact, the ruling that quashed the operating licence was not \r\n              based on the performance of the McClean Lake facility, but on a \r\n              technical question about the implementation of the federal government's \r\n              environmental assessment process. Due to the long time frames involved \r\n              in environmental assessment, Gitzel said it is prudent to have the \r\n              licensing process running parallel to the appeal.\"Undertaking another \r\n              environmental assessment and licensing process does nothing to change \r\n              the protection of the environment at McClean Lake. It is simply \r\n              insurance to protect our people and customers against risks created \r\n              by the September 2002 court decision,\" Gitzel said. The new licence application is for exactly the same activities \r\n              and facilities currently operating at the McClean Lake site: the \r\n              mill, tailings management facility (TMF), mining operations, water \r\n              treatment plants, camp and other supporting facilities. COGEMA Resources \r\n              is asking that the existing licence be revoked when the new EA is \r\n              approved and a new licence is issued. As part of the licence application and environmental assessment \r\n              process, the company has initiated public consultation programs \r\n              to give stakeholders an opportunity to ask questions, voice concerns \r\n              and participate in discussions. \"In early meetings with the Athabasca Economic Development and \r\n              Training Corporation and Athabasca Environmental Quality Committee, \r\n              we found that most comments and questions pertained to the impact \r\n              of the quashed licence on employment and business opportunities,\" \r\n              said Bob Pollock, COGEMA Resources vice-president, environment, \r\n              health and safety. \"There's general recognition that environmental \r\n              protection and economic opportunities go hand in hand. Most people \r\n              are confident we're doing a good job with the environment, so they \r\n              are more concerned about the economic impact.\" Residents of Athabasca communities shared their opinions at a series \r\n              of meetings in early June, when Pollock and a team travelled to \r\n              Uranium City/Camsell Portage, Fond du Lac, Stony Rapids and Black \r\n              Lake. At the sessions, residents were given a basic background on why \r\n              COGEMA Resources applied for a new licence and what is involved \r\n              in the new environmental assessment. \"We wanted to make it clear \r\n              that we believe we have strong arguments in the appeal, but we are \r\n              applying as an insurance policy rather than continue to live with \r\n              any legal uncertainty,\" Pollock says. \"We also wanted to know what \r\n              local residents had to say about the McClean Lake operation so that \r\n              we can be sure that the new EA covers all of the issues that are \r\n              important to Athabasca Basin residents.\" Other public meetings are planned for Wollaston Lake, La Ronge \r\n              and Saskatoon. Watch the COGEMA Resources web site (www.cogema.ca) \r\n              for ongoing developments on the court case and licence application. \"Even our American competition friends were wishing us well. We \r\n              have their support and they want us to win for North America,\" said \r\n              team mate Kelly Kirkpatrick. \"We were treated so well in Washington, \r\n              we would have felt like winners whatever the contest results.\" The EA \"screening\" study will be conducted over the summer and \r\n              fall. Following that will be CNSC licensing hearings. In 2004, subject \r\n              to regulatory approvals, a new licence will be issued."
    },
    {
      "tag": "div",
      "text": "Contact | Site Map Main subsidiaries AREVA Group Nuclear Energy AREVA NC AREVA NP Transmission & Distribution AREVA T&D"
    }
  ]
}