{
  "url": "http://www.cuke.com/excerpts-articles/cc%20excerpts/Final%20Season,%20ch19%20Ryuho.html",
  "file_number": "360",
  "content_hash": "30d89e3fc056f2cf4b1d455f3e713649189caa400b65fe46b64690be9f4024e0",
  "total_blocks": 274,
  "retained_blocks": 22,
  "ignored_blocks": 252,
  "blocks": [
    {
      "tag": "div",
      "text": "About the Book Read the Jacket Notes Book Reviews Readers' Comments Author's Notes Bibliography Author Events About the Author Errata"
    },
    {
      "tag": "p",
      "text": "About Suzuki Roshi"
    },
    {
      "tag": "div",
      "text": "Interviews Suzuki Stories Photograph Gallery Lectures Suzuki Archives Projects Sangha News Excerpts from Crooked Cucumber"
    },
    {
      "tag": "p",
      "text": "Part II, America,\r\n      1971, Chapter 19 - Final Season: Autumn Interview with\r\n      Ryuho Yamada In Memoriam Main Excerpts Page Ryuho in Thank You and OK! I'm putting this last chapter of Crooked Cucumber on cuke.com\r\n        because Ryuho Yamada plays a role in it and I'm putting stuff on the\r\n        site about Ryuho. His parts herein are encased in yellow . What Idon't say in the book is that after Suzuki, with his wife present, had\r\n        announced that he had cancer to his disciples, who were there in the\r\n        city and who'd come from outside not knowing why, and to Ryuho, Ryuho\r\n        was said to be the only one who cried. And he cried hard, sitting on the\r\n        floor. He was devastated and he emoted without reservation though he'd\r\n        only known Suzuki for two weeks at the time. - DC T"
    },
    {
      "tag": "div",
      "text": "o observe things in a\r\n      flashthat is nonduality."
    },
    {
      "tag": "p",
      "text": "Silas had given some lectures that summer at Suzuki's behest. In early\r\n      September Suzuki asked Silas to come see him. As they talked, seated in\r\n      the tatami room of Suzuki's apartment, Suzuki fingered his mala, a\r\n      Buddhist rosary. It had large sandalwood beads, each carved into the shape\r\n      of a skull. Silas looked at the skulls and at Suzuki, and he felt deeply\r\n      apprehensive. Suzuki was very ill. His skin was yellow; the doctor said he had\r\n      hepatitis. Okusan was taking care of him with assistance from Yvonne, who\r\n      also kept him abreast of Zen Center matters. They were very careful to\r\n      avoid infection and didn't share any food with him, as had been their\r\n      habit. Aside from attending an occasional zazen, the last time he'd done\r\n      anything in public was the lay ordination for fifty-five students at the\r\n      end of August. He hadn't even been able to attend his own ordination of\r\n      four new priests in September. Katagiri, now called Katagiri-roshi at\r\n      Suzuki's request, performed it for him by proxy, having come up from\r\n      Tassajara where he was leading the practice period. Ed Brown was first in\r\n      line, then me, then Lew Richmond, who'd been studying with Suzuki since\r\n      1967, and Angie Runyon. Suzuki's absence was conspicuous. It was a somber occasion. Afterward\r\n      we all went to his apartment to greet him and stood at his bedside. He\r\n      acted like it was the happiest day of his life. After leaving his room Iwent up on the roof of the building, walked amidst the potted plants,\r\n      looked out over San Francisco, and cried. Ayoung monk named Ryuho Yamada\r\n      arrived from Japan in late September. Over tea, Okusan learned that he\r\n      knew the healing arts of shiatsu (pressure-point massage) and\r\n      acupuncture. She asked him to give her a treatment, and he passed the\r\n      test. He was supposed to have gone straight down to Tassajara, but now he\r\n      was needed in the city. Every afternoon he worked on Suzuki for a couple\r\n      of hours. Ryuho was a thick-spectacled,\r\n      enthusiastic, naive young monk, and he immediately started gobbling up the\r\n      strange experience of Zen in America. He knew quite a bit of English and\r\n      spent a lot of time talking with students. \"Ryuho-san, if you\r\n      continue to live in America, and you want to be a success in America, you\r\n      have to be majime. If you are not majime you will not be\r\n      appreciated.\" Suzuki was sitting up in bed, talking in Japanese to\r\n      the new monk. Okusan had told him the same thing. \"Just be majime and\r\n      you'll have nothing to worry about.\" Majime is usually translated as\r\n      \"serious,\" but it includes the qualities of sincerity and\r\n      enthusiasm. In Japan, Ryuho knew he could easily get by as a priest with\r\n      canned majime; there were centuries of tradition and the cloud of\r\n      vagueness to hide in. But in America the students were straightforward,\r\n      and everything was clear. He loved the communal aspects of Zen Center: the\r\n      natural food, women and men living together on an equal basis. Even\r\n      Suzuki's wife was willful and would tangle with him. The students saw in\r\n      Ryuho, as in other Japanese monks, qualities that they admired. Aperfect\r\n      place for Japanese monks, he thought. They can learn from us, and we can\r\n      learn from them. Ryuho discovered Suzuki could\r\n      be short-tempered. Once Ryuho commented on a Buddha statue, casually\r\n      saying it was just a piece of wood. Suzuki barked at him not to speak so\r\n      flippantly: until he knew the true meaning of the statue he should shut\r\n      up. Then as quickly as the anger came, it was gone. Ah, thought Ryuho,\r\n      he's innocent and honest, like a child. \"So, you've come to see our yellow roshi,\" Yvonne said, and\r\n      that's how Albert Stunkard learned Suzuki was ill. \"Yellow?\" he asked. \"Yes, he has hepatitis.\" Dr. Albert Stunkard was chairman of the department of psychiatry at the\r\n      University of Pennsylvania. In September 1971 he had come out to work at\r\n      Stanford Hospital for a year, largely because he wanted to be near Suzuki,\r\n      whom he had studied with in the past. Stunkard, one of the senior Zen practitioners in the States, had\r\n      started his study when he was a doctor to Japanese prisoners being tried\r\n      for war crimes in Tokyo in 1946. One of them had told him about D. T.\r\n      Suzuki. He met the great scholar and subsequently became his student and\r\n      occasional doctor. Stunkard had studied with Nakagawa, Yasutani, and other\r\n      teachers as well. He met Shunryu Suzuki for the first time at Sokoji in\r\n      1967, and Suzuki embarrassed him by asking him to deliver the lecture for\r\n      that evening. Entering Suzuki's bedroom, Stunkard saw that Suzuki was scratching. Achill went down Stunkard's spine. He knew there were two types of jaundiceone\r\n      infectious (hepatitis), the other obstructive. An obstruction to the\r\n      outflow of bile causes itching. The obstruction couldnt be gallstones\r\n      because Suzuki's gall bladder had been removed. Stunkard felt terrible but\r\n      didn't say anything at the time. He just asked if he could confer with\r\n      Suzuki's doctor. a I"
    },
    {
      "tag": "div",
      "text": "f you were not born in\r\n      this world, there would be no need to die."
    },
    {
      "tag": "p",
      "text": "To be born in this world is to die, to disappear [laughing]. On October 10, 1971, Shunryu Suzuki called his Bay Area disciples\r\n      together. They were asked to wear their robes. At ten o'clock they entered\r\n      the apartment and gathered around his bed, joining his team of caregivers Ryuho sitting on the floor ,\r\n      Okusan by the door, looking tired, and Yvonne at the bedside fussing with\r\n      Suzuki over an office cassette recorder. Mel had driven in from Berkeley\r\n      and Bill from Mill Valley. Also present were Silas, Reb, Lew, and Angie,\r\n      all of whom lived in the building. Claude came from his home in San\r\n      Francisco. Everyone was quiet. There was a feeling of tense anticipation. Suzuki sat up in bed, propped up by pillows. He was frail and thin, and\r\n      his skin had become a darker yellow, but his spirits were good. He smiled\r\n      warmly, glad to be with so many of his closest students. He hadn't seen\r\n      them much in the past six weeks. They re- turned his smiles and stood in a semicircle around his bed. On Page\r\n      Street cars passed, and birds chirped in the rubber tree outside the\r\n      window. Suzuki cleared his throat and turned on the tape recorder. Then he\r\n      softly told them what they feared to hear. As you know, my doctor thought Ihad hepatitis, but my symptoms didn't\r\n      change for such a long time, so he thought it might not be hepatitis,\r\n      maybe cancer. So Iwent into Mt. Zion Hospital again three days ago and\r\n      they checked me outand the doctors discussed my illness. The day before\r\n      yesterday my doctor came and told me, \"You have cancer.\" And he\r\n      explained exactly what is happening. So now Iam telling you. Suzuki immediately set about putting people at ease and giving a\r\n      positive spin to the news. He spoke as if it were no big deal, adding that\r\n      it was a great relief to find out that he had cancer and not hepatitis,\r\n      because now he could eat and drink whatever he wanted, and they could\r\n      share food with him without worrying about contagion. Imyself selfishly feel good, but on the other hand, Iam very sorry\r\n      for you. But Ithink buddha will take care of everything, so Iwon't worry\r\n      too much. How long I'll live Idon't know. No one knows actually. Iasked\r\n      the doctor, \"Two years?\" \"At most,\" he said. Iam not\r\n      so sure about it. So Iwant you to be prepared. If Ilive longer, it is\r\n      better, of course, for me and for you. Ithink Ican live one more year\r\n      for sure, Ifeel that way. Idon't feel so discouraged or weak. So maybe Iwant you to allow me to be a lazy monk, that's all. Ishall be a very bad\r\n      example, but [laughing] instead, you should be a good example. Okay?\r\n      That's all that Iwant you to doto prepare. Most things you can decide\r\n      among yourselves. If necessary, Ican join your discussions. Physically, Iget tired quite easily. Thank you very much. Abruptly he turned to Claude, the oldest, whose counsel he had valued\r\n      since they first met in 1963. \"Claude, Iwant you to stay here, even\r\n      though Iam no more. Okay? Please.\" Claude, cornered, affirmed that\r\n      he would. \"Thank you,\" Suzuki said, going on to make a point about their roles as priests and about the priest's\r\n      responsibility within the larger Buddhist community. \"You shouldn't\r\n      feel you have to do exactly what Idid, you know. You are free to develop\r\n      our way as people want you to do. That is the bodhisattva idea.\" He leaned close to the mike when he said this. He was speaking to\r\n      Richard Baker, for whom the tape was being made. Suzuki's tone of voice\r\n      said, you should come back now and assume this responsibility. Richard and\r\n      Suzuki had been corresponding with Yvonne's assistance throughout his stay\r\n      in Japan. Since the spring there had been discussion of Richard's\r\n      returning in the fall or winter to assume some of Suzuki's\r\n      responsibilities. Richard had been resistant to the ideahe didn't feel\r\n      ready for that. Now Suzuki was twisting his arm. After some joking with his disciples, Suzuki had the tape rewound and\r\n      played. At the exchange with Claude he listened carefully, stopped the\r\n      machine, and acted pleased that Claude was on tape saying he would stay,\r\n      although his answer was fairly inaudible. Suzuki bowed to his crestfallen\r\n      disciples and they bowed back, going out with tears in their eyes to share\r\n      the tragic news with the community. The day before, when Yvonne had gone to the hospital to pick up Suzuki,\r\n      she'd found him sitting on the edge of his bed with legs dangling below\r\n      his hospital gown. Okusan was in the hall saying goodbye to some visitors.\r\n      The nurse had just brought his lunch, and he patted the bed and motioned\r\n      to Yvonne to come over. She knew something was up. He slowly mouthed the\r\n      words, \"Ihave cancer,\" with a big grin on his face. She was\r\n      confused because the two things didn't go togethercancer and grinning.\r\n      As she sat next to him, he pulled over the food tray. \"Ihave cancer.\r\n      That means we can eat together again.\" He took a forkful from his\r\n      plate and fed it to her. Yvonne threw her arms around him and cried. \"This cancer is my friend, and my practice will be to take care of\r\n      this sickness,\" he told her. Dr. Stunkard, who had first realized Suzuki had cancer, talked to him\r\n      about going to the cutting-edge Stanford cancer unit, but Suzuki decided\r\n      against it, saying, \"This doctor is my doctor, and Ihave to respect\r\n      him. It wouldn't be appropriate to see another doctor.\" Stunkard\r\n      tried to tell him things were different in America, but Suzuki stood firm.\r\n      After talking further with his colleagues at Stanford, Stunkard decided\r\n      that Suzuki had made the right decision. The type of cancer he had was not\r\n      responsive to treatment, it had spread, and radiation and chemotherapy\r\n      would just make him sicker. \"You know we often talked about teaching in the past,\" Suzuki\r\n      said to Stunkard. \"So many of these young people are afraid of dying.\r\n      Ican show them that you don't need to be afraid of dying. It's a\r\n      wonderful teaching opportunity.\" \"Iwish you were doing some other kind of teaching,\" Stunkard\r\n      said. \"Yes, Idon't want to die. Idon't know what it's going to be like\r\n      when Idie. Nobody knows what that's going to be like. But when Idie,\r\n      I'll still be a buddha. Imay be a buddha in agony, or Imay be a buddha\r\n      in bliss, but I'll die knowing that this is how it is.\" a W"
    },
    {
      "tag": "div",
      "text": "herever you go you will\r\n      find your teacher, as long as"
    },
    {
      "tag": "p",
      "text": "you have the eyes to see and the ears to hear. Ryuho continued to do shiatsu\r\n      on Suzuki every day. He concentrated on points in Suzuki's back that\r\n      corresponded to the liver. He pressed his feet and legs and arms. Suzuki\r\n      was weak but alert. If Ryuho's mind wandered while working, Suzuki would\r\n      immediately tell him to concentrate. Ryuho was intrigued by the\r\n      people who came to see Suzuki: disciples, students, friends, scholars,\r\n      artists, teachers, priests, members of the Japanese congregation at\r\n      Sokoji, other Buddhist teach- ers. There was Maezumi,\r\n      the teacher of the L.A. Zen Center, who'd known Suzuki since 1959, and\r\n      Bishop Sumi from Zenshuji in L.A. Eido Shimano, Nakagawa's disciple and\r\n      the teacher at the Zen Studies Society in New York, dropped by to pay his\r\n      respects one day. Bob Halpern visited. He had been studying with the Tibetan teacher,\r\n      Trungpa, in Boulder. On Suzuki's bedside table was a large postcard Bob\r\n      had sent. Instead of a note, he had drawn a picture of Trungpa's altar,\r\n      which had a Buddha in the center, Trungpa's Tibetan guru on the left, and\r\n      Suzuki-roshi on the right. Trungpa came a few days later. Suzuki spoke to\r\n      him optimistically about the future of Buddhism in America. Trungpa sat by\r\n      Suzuki's bed, holding his hand for over an hour. Almost every day some old-timer would enter Suzuki's room and stay for\r\n      half an hourBetty, Della, Jean, Mike Dixon, and others. Suzuki had\r\n      asked Philip to come as much as possible, and he would drive in every few\r\n      days from Santa Rosa. Okusan told Philip that Suzuki said to let him in\r\n      any time he came. Philip said he'd break down the door if he couldn't get\r\n      in. Grahame sent a letter from Tokyo expressing concern and saying that\r\n      he'd come as soon as he could, in late December, when he would be visiting\r\n      Pauline and the children in Mill Valley. He was fully involved with the\r\n      English language school he had started and could not get away until then. Ryuho stood by and listened as\r\n      Alan Watts and Jano paid their respects. He couldn't understand what they\r\n      were saying, but it was a lively meeting, considering Suzuki's condition.\r\n      Watts was in fine form. Jano teased her husband, and Ryuho worried that\r\n      Suzuki would die on the spot, he was laughing so hard. Louise brought her newborn daughter to visit wearing a tiny rakusu, the\r\n      last that Suzuki had inscribed. The little one's name was Johanna. Suzuki\r\n      was sitting on a low table in the tatami room. In front of him was his\r\n      well-worn pocket-sized dictionary, brought from Japan and often carried\r\n      back and forth between Tassajara and the city. He picked it up and said,\r\n      \"This will live longer than Iwill.\" Suzuki expressed great regret over his cancer. \"Before my\r\n      disciples are ready to come out of the oven, Iwill be going into\r\n      it.\" Louise was surprised at his sadness, because she still had the\r\n      idea that a Zen teacher wouldn't have that kind of feeling. Suzuki told Bill Kwong the opposite, saying: \"I've put my cookies\r\n      in the oven, they've come out fine, and now I'm going to crawl in.\"\r\n      He'd say different things at different times, but clearly he was thinking\r\n      about his disciples and what to do for them before he died. Richard Baker was coming back. There was going to be a ceremony to make\r\n      him the new abbot. Page Street and Tassajara were abuzz with talk about\r\n      it. How could this be? He'd received transmission, but still, how could he\r\n      take on Suzuki's role? What about Katagiri? What about the other priests?\r\n      What about Bill Kwong, who'd been with Suzuki almost from the first and\r\n      who had a zendo in Mill Valley? What about Silas, who was giving lectures,\r\n      Jean in Carmel Valley, Mel in Berkeley, and other disciples? Suzuki told Claude that he wanted to give transmission to a number of\r\n      his disciples before he died. Especially, he emphasized, he must complete\r\n      Bill Kwong's transmission ceremony. But there were others. He was thinking\r\n      of giving transmission to six to twelve disciples. He wanted to ask\r\n      Noiri-roshi to come over from Japan to work with these students for\r\n      several months in preparation for the ceremony. Claude asked what would be\r\n      the difference between Richard's transmission and these, and Suzuki said,\r\n      \"They will be the same as Richard'sno difference.\" Claude conferred with a few people, and they all agreed that Suzuki was\r\n      too ill to do this. Okusan was also opposed to her husband's plan. Noiri\r\n      needed a special diet, and she'd have to take care of them both, which\r\n      would be too much for her. Suzuki made it clear how much he wanted to do\r\n      it, but Okusan told him to leave it to Richard, who was coming back and\r\n      could carry out Suzuki's wishes. She and Claude agreed; and after they\r\n      told Suzuki how they felt, he gave up and didn't mention it againnot\r\n      even to Richard. Suzuki asked Okusan to go back to Japan after he'd passed his authority\r\n      to Richard in the Mountain Seat Ceremony. He said he wanted to do\r\n      saitokudo, reordination. She knew that he wanted to spend the remaining\r\n      time with his students and to let them take care of him, to be as close to\r\n      them as possible. He'd read a book Katagiri had given him by Kodo Sawaki,\r\n      with an introduction by Katagiri's second teacher, Eko Hashimoto. It\r\n      stressed that priests should practice celibacy and not live with women. It\r\n      didn't seem very practical to Okusan. She said, \"I'd comply with your wish if you were getting well, but\r\n      Icouldn't possibly leave you in this condition. Who would cook rice gruel\r\n      and other Japanese food for you? You need someone who can understand your\r\n      needs by a single wink.\" She wrote to Hoitsu immediately, and he wrote right back, urging her to\r\n      stay with her husband by all means, or they'd just have to send someone\r\n      else from the family to take care of him. Hoitsu sent a similar letter to\r\n      his father. So Suzuki gave up on that idea too. One by one he had to let\r\n      go of his wishes. When he had enough energy to walk down the stairs to the basement,\r\n      Suzuki still went to zazen occasionally. Afterward he couldn't get back\r\n      up. He wanted to make it on his own but couldn't. Sometimes Reb and Peter\r\n      would make a chair out of their arms, and he'd sit and enjoy the ride. He\r\n      made it fun. He was very sweet about such dependence. His life was not in\r\n      his own hands anymore. a Z"
    },
    {
      "tag": "div",
      "text": "en is the practice of\r\n      all existence with everything elsestars, moon, sun, mountains, rivers,\r\n      animate and inanimate beings. Sometimes the pain in our legs practices\r\n      zazen. Sometimes our sleepy mind practices zazen on a black cushion, on a\r\n      chair, or even in bed."
    },
    {
      "tag": "p",
      "text": "Richard Baker returned with Virginia and Sally. As soon as they\r\n      arrived, he went to see Suzuki. Soon Suzuki-roshi would pass to him the enormous responsibility of taking care of Zen\r\n      Center and all the people who came there. He would be the chief priest.\r\n      \"I'm so sorry for what I'm about to do to you,\" Suzuki said to\r\n      him, tears filling his eyes. \"How could someone with your intuition choose to marry someone as\r\n      difficult as me?\" Okusan asked. \"Because you are ridiculously honest,\" he said. \"What should Ido when you die?\" she asked him. \"Stay here,\" he said. \"Don't go back at all.\" He\r\n      said everyone would be happy if she stayed, that her ten years in America\r\n      would make it hard for her to adjust to Rinso-in. But how could she be\r\n      helpful at Zen Center? she wanted to know. \"You are fair in your dealings with people. It will work out\r\n      naturally.\" \"Should Ibecome a nun?\" \"Oh, that would be best.\" \"I'm too old for that. Maybe I'll be a monk in my next life.\" That got him laughing, which started him coughing. Okusan helped him\r\n      over onto all fours so she could pound his back. He stopped coughing.\r\n      \"You're lucky you have someone to take care of you to the last\r\n      moment,\" she said in a teasing voice. Suzuki raised a hand in a faint gassho. Then he farted loudly.\r\n      \"That's for you,\" he said. a N"
    },
    {
      "tag": "div",
      "text": "irvana is seeing one\r\n      thing through to the end."
    },
    {
      "tag": "p",
      "text": "Knowing that their father could pass away at any time, Suzuki's\r\n      daughter Yasuko and son Hoitsu arrived for the first time in the States\r\n      with godfather Amano, to say their farewells. They were shocked to see him\r\n      so jaundiced and weak. They stood at his bed saying a few polite phrases,\r\n      not knowing what to do. But Su- zuki was more open and easygoing than in the old days, and before long\r\n      they were talking comfortably with him and among themselves. Okusan was\r\n      making noodles in the cramped kitchen. Then Philip, a familiar face, came\r\n      to visit. At Page Street, and later at Tassajara, his children witnessed with\r\n      amazement what Suzuki had accomplished in his twelve years in the States.\r\n      It was hard for Yasuko and Hoitsu to imagine that their father was a\r\n      dharma teacher with many disciples, and that a book of his lectures was\r\n      selling well. They were impressed that everyone called him Roshi and\r\n      amazed to hear from Americans such enthusiastic praise for his lectures.\r\n      \"Mother always said his problem was that he didn't know how to\r\n      lecture about Buddhism, that he didn't express himself well enough,\"\r\n      Hoitsu said. Their father had hardly ever said anything to them about\r\n      Buddhism, so they didn't even think of him as someone with a particularly\r\n      good understanding of it. But the evidence of his effort lay before their\r\n      eyes. Yasuko, Hoitsu, and godfather Amano arrived at Tassajara in time to\r\n      attend Bill Kwong's head monk ceremony, at which Katagiri officiated. One\r\n      after another the American students put their hands in gassho and asked\r\n      the head monk questions about dharma and life. Hoitsu couldn't believe\r\n      what he was seeing and got tearythey were doing the ceremony sincerely,\r\n      spontaneously, and in good form. Icame up from Tassajara to pay a visit to my dying teacher. Richard\r\n      answered the door. I'd already spent time with Richard at Tassajara, so we\r\n      just greeted each other briefly. \"Right now is a good time to see\r\n      Roshi,\" he told me. Knowing me well, Richard was quite firm about the\r\n      time limit. \"Don't spend any longer than five minutes unless\r\n      Suzuki-roshi absolutely insists that you stay longer.\" \"Okay, Ipromise,\" Itold him. After I'd put on my robes Iwent to his room. Okusan led me into the\r\n      bedroom and directed me to a chair next to his bed. Suzuki looked up and\r\n      smiled. We bowed. He looked terrible. With some difficulty he pulled\r\n      himself up and sat on the edge of the bed, close to me. Then he slapped his thighs like he'd do to indicate pleasure. Ijust sat there moping. \"Ifeel fine,\" he said. \"Idon't\r\n      feel so serious.\" That was all Ineeded. \"Okay,\" Isaid\r\n      snapping out of it. He asked me what Iwas doing at Tassajara, and Isaid Iwas the\r\n      assistant director. He acted impressed. Then he gave me a little advice.\r\n      He said that, as a priest, Ishould have two specialties, one primary and\r\n      one secondary. My first one, he said, should be to take care of guests,\r\n      something I'd done since Tassajara opened. And the second one could\r\n      possibly be scholarship. His point wasn't to tell me what to do. He\r\n      trusted that my seniors at Zen Center and Iwould work out the details on\r\n      our own. It didn't matter to him so much what Idid, Ithink, but he knew\r\n      Ineeded some wholesome activity to be engaged in through the years that\r\n      would both express my true nature and keep me out of trouble. Iwas touched by his concern. Here he was wasting away, and all his\r\n      attention was on another, giving me a boost, conspiring with me to the end\r\n      to have faith in myself. We talked a while longer and then Isaid Ihad to go. \"No, no,\r\n      stay,\" he said. Iremembered what Richard had said, and Ialso\r\n      thought Suzuki should lie down and rest, so Istood up and bowed. Then he\r\n      said, \"If you leave Iwill be unhappy. If you stay Iwill be\r\n      happy.\" \"Okay,\" Isaid. He asked me if I'd met his family\r\n      and Isaid yes, that I'd shown them around Tassajara. So he called them\r\n      all in and we talked and visited for half an hour. It was lots of fun, and\r\n      Icompletely forgot that Suzuki was dying and this was the last time we\r\n      would meet. Idon't even remember saying goodbye to him. \"With these hands Ihave done many things in my life,\" Suzuki\r\n      told Hoitsu. \"Inever imagined all the things Iwould do with these\r\n      hands in America. Now my work is almost finished. It would be good to go\r\n      back to Japan and die there.\" \"Would you like to go back to Japan with me?\" Hoitsu asked. \"Iwill crawl if necessary,\" his father answered. Hoitsu was surprised to hear his father say that. Since his third year\r\n      in America it had seemed that he would never return. Seeing his two eldest children and Amano must have awakened a nostalgia for\r\n      his homeland. The ceremony was a week off. They could bring Suzuki back\r\n      with them right after that. Hoitsu talked to Okusan, Yasuko, and Amano;\r\n      with help from Okusan, he talked to Suzuki's doctor, who said Suzuki could\r\n      do it. Hoitsu went to tell his father. \"Master, the doctor said you can come back with us.\" Suzuki looked up at Hoitsu and laughed. \"Isn't it obvious there's\r\n      no way Icould leave here? Can't you people even take a joke?\" \"You were just telling us what we wanted to hear,\" Hoitsu\r\n      said. \"Yes, of course. Iwill become American soil.\" Yasuko saw her father in a new light in America. Putting a positive\r\n      spin on his misfortune, he told her he'd lived longer than he'd expected,\r\n      that his master So-on had died at the age of fifty-five, he was now\r\n      sixty-seven. The twelve extra years were his time in America. (Suzuki's\r\n      chronological accuracy was sometimes offSo-on actually died when he was\r\n      fifty-seven.) He was thin, soft, and open to her. She'd never felt closer\r\n      to him and was sorry she'd seen so little of him since he left Japan. She\r\n      could finally forgive him for the death of her mother and saw his\r\n      accomplishments in America not only as atonement for but as partially\r\n      motivated by her death. She thought of the time in the fifth grade when he'd taken her to\r\n      Shizuoka City and, embarrassed to be seen with him, she'd walked on the\r\n      other side of the street. She didn't feel that gap now. \"The bond between children and parents is never lost,\" he\r\n      told her. Godfather Amano felt he had accomplished the purpose of his trip. He\r\n      had seen Suzuki, his temples, his students. He could see that Suzuki was\r\n      going to die. \"I'd better go back now,\" he said. He too had\r\n      cancer and trouble with his bowels; and though he wasn't dying or sick\r\n      like his old friend, it was difficult for him to stay. But Suzuki wanted\r\n      him to witness Richard's Mountain Seat Ceremony. \"Father,\" Suzuki said to him, \"there is one more\r\n      important job Ineed to do as a monk. Please see it and report it to the membership at\r\n      Rinso-in. Tell them what Ihave done since Ileft them and came\r\n      here.\" \"Father, please fulfill Hojo's wishes,\" said Okusan. Finally Amano agreed to stay. It was more difficult every day for Suzuki to talk, but he could do it,\r\n      especially with Okusan, with whom he could communicate with much less\r\n      effort. \"Iwon't interfere with Zen Center at all once Ihave handed\r\n      it over to Richard. It's entirely up to him whether it will be ruined or\r\n      not,\" Suzuki said to his wife. He even told her and Richard that he\r\n      didn't want any more Japanese priests to come to Zen Center as teachers.\r\n      \"From now on, they should come as students.\" a T"
    },
    {
      "tag": "div",
      "text": "he most important point\r\n      is to continue our way"
    },
    {
      "tag": "p",
      "text": "and to have a good successor. On Sunday, November 21, at ten in the morning, the halls and courtyard\r\n      of Zen Center were filled with people talking softly and waiting. They had\r\n      come for the Mountain Seat Ceremony in which Richard Baker was to be\r\n      installed as the chief priest of Zen Center. The foyer and hallway were\r\n      lined with rows of chairs. The buddha hall, where the ceremony was to take\r\n      place, was too small for the five hundred guests. Chinese, Tibetan, and\r\n      Japanese priests of various sects attended with some of their disciples.\r\n      Many of the key figures in Suzuki's life in America were there: Wako and\r\n      Emi Kato, Reverend Ogui, George Hagiwara, and many from the Japanese\r\n      congregation of Sokoji. Bill McNeil stood in a corner in a leather jacket;\r\n      poets and artists from the old Beat days came in the front door. So many\r\n      people who had become deeply connected in the past twelve years, so many stories like fibers running\r\n      among them, so many for whom Suzuki had opened dharma gates or been there\r\n      with a nudge when their lives turned. The bell downstairs was being struck every minute, informing the crowd\r\n      that it was time to settle down. People patiently sat or stood where they\r\n      were. They could hear a procession moving from Katagiri's apartment up the\r\n      street, into the building, and to its various altars. The rumble of the\r\n      deep buddha drum echoed in the hallsthe high chin-chun! of\r\n      handheld bells a half-tone apart and the kachin! of wooden\r\n      clackers, the music of the moving rite. On the second floor the procession\r\n      stopped outside Suzuki's room, where Richard offered incense and said:\r\n      \"Although Idon't know how Icame, through your heart-teaching Iam\r\n      always here.\" Katagiri-roshi, Kobun-sensei, and a few of Suzuki's senior monks\r\n      accompanied Richard down the stairs to the hushed buddha hall. Richard\r\n      wore a blue and gold robe with bright-colored flying phoenixes, which\r\n      Suzuki had given him for this day. He carried a ceremonial horsehair\r\n      whisk. The assembled crowd was utterly hushed when the spine-chilling sound of\r\n      intermittent thuds and jangling bells jolted everyone to attention. Suzuki\r\n      was walking with the staff Alan Watts had given him. Affixed to the top\r\n      was a bronze headpiece with rings. At his sides were Hoitsu and Okusan.\r\n      They helped him down the stairs and past those seated and standing along\r\n      the way, to the double doors of the buddha hall. With each step he struck\r\n      the floor with his staff, as if continuing to plant the dharma in America.\r\n      There he was, his reddish-brown okesa draping over a yellow koromo. All\r\n      eyes were on him. Many people hadn't seen him in his illness, and even to\r\n      those who had, his appearance was crushing. He was so dark, weak, and\r\n      shrunken. Yet as he moved into the buddha hall toward the specially built\r\n      Mountain Seat altar, his enormous effort and dignity shone through. Reaching the brocade-covered altar, still supported on both sides, he\r\n      slowly pulled out from the sleeve of his robe a bowing cloth. Gathering\r\n      his strength, he laid it out properly, bowed down to the floor, and rose, somehow, drawing strength from the depth of his will,\r\n      calm and powerful, the way frail old Kitano-roshi had risen from his bows\r\n      at Eiheiji, amazing and inspiring the young Suzuki. Hoitsu helped him to a\r\n      cushioned ceremonial chair to the right of the altar. He sat and looked\r\n      with eyes straight ahead yet downcast, as in zazen. People were just catching their breath when Richard Baker stepped\r\n      forward. After the Heart Sutra was recited, Richard stood before\r\n      the Mountain Seat altar and said in classical style: \"This Mountain\r\n      Seat, climbed many times before, is the everywhere bodhimandala. With the\r\n      help of my Master and everyone here, in the ten directions and the three\r\n      times, Iwill climb this mind-seal altar. Do not wonder about it at\r\n      all.\" He offered incense to buddhas, bodhisattvas, and ancestors, to Trudy\r\n      Dixon, Katagiri-roshi, and \"to my own subtle and compassionate\r\n      teacher, Suzuki Shunryu-daiosho,\" to whom he said, drawing from\r\n      Suzuki's own Mountain Seat Ceremony at Sokoji in 1962: This piece of incense Which Ihave had for a long long time Ioffer with no-hand To my Master, to my friend, Suzuki Shunryu-daiosho, The founder of these temples. There is no measure of what you have done. Walking with you in Buddha's gentle rain Our robes are soaked through, But on the lotus leaves Not a drop remains. Richard sat on a red lacquered chair before the altar. Katagiri spoke\r\n      for Suzuki loud and clear: \"Dragons and Elephants! Accept this holder\r\n      of Buddha's First Seat!\" Then Richard Baker said, in what may be called the first lecture of his\r\n      abbotship, \"There is nothing to be said.\" Amondo followed, ritualized yet impromptu questions, which Richard answered quickly and dramatically. Telegrams were read, formal\r\n      congratulations were made, and the ceremony was over. Suzuki was helped to face the altar, where he made another slow,\r\n      painful prostration from which he rose almost by himself. Then he started\r\n      down the aisle to leave. Halfway to the opened doorway he stopped in the\r\n      midst of his sangha, disciples, students, former students, admirers, old\r\n      friends, visiting teachers, and guests. There was utter silence. He looked\r\n      to the left, then decisively rolled the staff several times between his\r\n      hands; the rings at the top burst out jangling. He looked to the right and\r\n      rolled his staff again, and again the rings rang out. It was the sound of\r\n      an ultimate effort. It was the sound of his love and his freedom. Tears and sobbing began on all sides. Hearts cracked open. Everything\r\n      was suspended in his presence, in an immense shared feelinga car\r\n      honking on the street, pigeons cooing, the crying in the room, and a deep\r\n      stillness. Time stopped. Amoment that started the day he arrived in\r\n      America continued as he was helped out of the room, striking his staff to\r\n      the floor as he went. He left behind him a room full of palms pressed\r\n      together saying thank you, saying goodbye, saying what could not be said. After the ceremony, Suzuki met with his disciples. Twenty or so sat on\r\n      the tatami in his sitting room. It was done. He'd passed on Zen Center,\r\n      Page Street, and Tassajara to Zentatsu Richard Baker, who sat next to him\r\n      a head higher in his fancy robes, his eyes down, the weight of what he'd\r\n      received all over him. Suzuki turned to him, nodded, and smiled. The room\r\n      was hushed. In a faint voice Suzuki said thank you to everyone and to\r\n      Richard and then, nodding toward Katagiri, another breathy thank you\r\n      \"for all you've done, for which Iam so grateful.\" All of a\r\n      sudden a howl arose. It was Katagiri who crawled toward Suzuki crying out,\r\n      \"Don't die!\" Sobbing, he hugged frail Suzuki, who said in a soft\r\n      rasp, \"Daijobu. Daijobu\" (It's all right). Katagiri had said goodbye to Suzuki and was on his way back to\r\n      Tassajara for the last few weeks of the practice period. He left in\r\n      sadness and with some discomfort at his situation. Seven years he'd served\r\n      Suzukihard work, low pay, no time off. Katagiri was dependable and had\r\n      a seamless constant practice. He'd come to be seen as a coteacher by many.\r\n      Suzuki and Katagiri had contained their feelings, speaking little through\r\n      the years. Until the meeting with his disciples following Richard's\r\n      Mountain Seat Ceremony, Suzuki had never verbally expressed his gratitude. Suzuki was still troubled by Katagiri's intention to leave. He wanted\r\n      him to remain a senior dharma teacher for the whole community. \"Maybe\r\n      Katagiri can still help,\" he said to Okusan as he went to sleep. Katagiri wasn't the only person he had troubled thoughts about.\r\n      Unfinished business pressed at Suzuki. Bill. Silas. He wanted to take care\r\n      of his disciples. Suzuki's style was to let things happen, nudging them,\r\n      patiently waiting, acting skillfully by not acting rashly. He hadn't known\r\n      how quickly his illness would overcome him. Some disciples were disturbed.\r\n      Afew had postponed or given up careers to devote themselves to studying\r\n      with this dying man. Would he leave no final instructions? So far Suzuki's instructions were not about practical matters but about\r\n      dying with dignity. It was tragic for his students to see the\r\n      deteriorating physical condition of their dear teacher, yet at the same\r\n      time it was marvelous to witness his composure and see how undiminished he\r\n      was at heart. In his last meeting with Hoitsu before his son returned to Japan,\r\n      Suzuki implored, \"Take care of Bill Kwong for me. Make sure Bill gets\r\n      transmissionyou can do it for me.\" Suzuki wanted Hoitsu to be available to help his disciples in whatever\r\n      way he could, but Hoitsu knew his father didn't want him to interfere with\r\n      Richard. \"Leave Zen Center to Richard,\" he'd said several times.\r\n      Hoitsu also knew that leaders need assistance, and his father knew it too.\r\n      Richard would need help from his elders, like Katagiri and Claude, and from his peers, like Bill and Silas. Even if\r\n      he disagreed with them, he should work with and respect them. Suzuki knew\r\n      there was rivalry but hoped it could move toward cooperation. \"It is\r\n      done,\" he said to his son. \"All Ican do now is hope.\" With the trust he had in Richard and in others, and considering his\r\n      patience and acceptance of problems, Suzuki's hope might have included\r\n      more possibilities than were imagined by his students. If some disciples\r\n      couldn't work together, maybe they could work separately. If there were\r\n      sharp differences, maybe time would smooth the edges. Ultimately, if\r\n      people were sincere, it would be okay. He might have looked at his\r\n      students through his dying eyes and thought, as when Tatsugami landed,\r\n      \"You have no idea how much you're going to suffer.\" Amano came to his bedside to say goodbye. \"I've finished all my\r\n      duties,\" Suzuki told him. \"Please report the details to the\r\n      members.\" \"Hai,\" Amano answered in the affirmative. Suzuki gave Amano his mala bracelet with the skull-shaped beads. He\r\n      told Okusan to roll up a scroll for Yasuko and to give Hoitsu the staff\r\n      with the bronze rings he'd carried in the ceremony. The clanger on top of\r\n      the staff was the last item he wanted to return to Rinso-in, of those he\r\n      had borrowed when he'd left in 1959. \"Well, we're leaving now,\" said Amano. \"Okay. Goodbye, Father. Have a good trip,\" Suzuki said\r\n      softly. Hoitsu couldn't believe how casually the two said farewell, as if it\r\n      were just another day. Sitting on the plane before takeoff, Yasuko was crying. She wanted to\r\n      get off and stay with her father. Hoitsu told her they had to go back now\r\n      to help Amano explain to people what their father had been doing in\r\n      America these twelve years, what he had created and was leaving behind.\r\n      Nobody had really understood why he left. Now Amano, Yasuko, and Hoitsu\r\n      knew and could tell the others, who should feel some pride in this too. a T"
    },
    {
      "tag": "div",
      "text": "he ancient bodhisattvas\r\n      were not afraid of, but found joy in failure, poverty, and deathand in\r\n      doing small things."
    },
    {
      "tag": "p",
      "text": "Ahospital bed was put in a second-floor room overlooking the\r\n      courtyard. There Suzuki could have a sense of the rhythm of the building\r\n      and some time in the sunlight. The buddha hall was right below; during\r\n      morning service he'd listen to the sounds of chanting, drums, and bells\r\n      coming through the window and the open door. Okusan would wash his face,\r\n      and he'd have a glass of orange juicethat was his service. He was too\r\n      weak to get out of bed. Ryuho would get lost looking at\r\n      Suzuki's face as he gave him shiatsu treatments. It was spacy and\r\n      changing, he said, and it didn't look Japanese. He could obviously die at\r\n      any timeOkusan and the doctor said so, too. His skin was dark, almost\r\n      the color of the brown okesa robe. But to Ryuho the light of his eyes was\r\n      powerful. Yvonne was there every day, staying with him while Okusan cooked, did\r\n      laundry, and cleaned. They took turns caring for him and massaging his\r\n      back, legs, armswherever he'd indicate. Yvonne would be sitting by his\r\n      bed and a skinny arm would come out from the covers and go into the air.\r\n      She'd rub it for a while; then he'd pull it back under the covers. Later\r\n      the other arm would appear. She and Okusan massaged and moved him enough\r\n      so that he hadn't gotten any bedsores. He never complained and always\r\n      appreciated the attention he received. There was a bottle of painkillers on the table. He refused them, as\r\n      after the gallbladder operation. He had tried them once because his doctor\r\n      told him to, but he didn't like the state of mind that resulted, so he\r\n      asked Yvonne to take them away. Still, he told Richard that sometimes he\r\n      felt like he was being tortured. One day Suzuki asked Yvonne to come close to him, and when she did he apologized for not having ordained her as a priest, saying\r\n      again that he lacked confidence in training women. \"Ididn't\r\n      recognize your seriousness to practice,\" he said. Suzuki asked Yvonne about Silas and was pained to hear that he had\r\n      already left to lead sesshins in Portland and Quadra Island near\r\n      Vancouver. Silas had come to say goodbye, but Suzuki had been sleeping. He\r\n      sat next to him for a while and then left. Silas did not see eye to eye\r\n      with Richard and had argued that the membership should have had a chance\r\n      to approve of Richard as the new abbot. But most people just wanted to do\r\n      what Suzuki wanted. The board members were all students and couldn't\r\n      accept Silas's democratic and legal approach. He hadn't seen much of\r\n      Suzuki since Richard returned. Now Suzuki was thinking about Silas. Within a week of the ceremony, Suzuki had almost completely stopped\r\n      talking. Then he stopped eating. His body was soft and weak and thin, the\r\n      size of an eight-year-old child. It had always had a childlike quality,\r\n      but with great strength and energy, the power to move large stones. Now it\r\n      was a dark, dying child's body. Okusan\r\n      told Ryuho not to bother coming anymore. Either Okusan or Yvonne\r\n      stayed close by. They still massaged him gently, but to Yvonne it seemed\r\n      that mainly they were just breathing together. She felt there was almost\r\n      nothing they needed to do. Just leave him alone, be with him, and respond\r\n      to his few requests. They wiped his face. When he stopped drinking, they\r\n      kept his lips and mouth moist with a washcloth. Richard came every day. Sometimes he would talk to Suzuki with Okusan's\r\n      help. She said he could hardly hear now. \"Where will Imeet\r\n      you?\" Richard asked, standing in gassho at the foot of the bed.\r\n      Suzuki's hands came out from under the covers in gassho. Then, with index\r\n      finger extended, he drew a circle in the air, bowed into it, and returned\r\n      his hands under the covers. Richard bowed in return. a T"
    },
    {
      "tag": "div",
      "text": "hat we are here means\r\n      we will vanish."
    },
    {
      "tag": "p",
      "text": "On the evening of December 3, Suzuki was moved from the hospital bed\r\n      overlooking the courtyard to his own bed in his apartment.\r\n      \"Tomorrow,\" he told Okusan in a hoarse whisper, \"Imust\r\n      talk to Richard about Silas.\" Okusan went into the tatami room and spread out the futon. For the\r\n      first time she didn't put on her pajamas, but left her clothes on and lay\r\n      down exhausted to sleep. Suzuki's son Otohiro had been there for a couple of days and said he\r\n      would stay till the end, which he knew was near. He slept on Okusan's bed,\r\n      up against his father's in the small room. At about two in the morning\r\n      Otohiro shook Okusan awake. \"Mother! Mother! Father wants a\r\n      bath.\" \"No no no.\" She went in and told her husband to go back to\r\n      sleep. He repeated that he wanted a bath. The thought of it made Okusan\r\n      anxious. He hadn't been in a tub for a long time. \"It's okay,\" he said. Otohiro wasn't going to argue. He knew the old man would be stubborn to\r\n      the end. Okusan went into the bathroom and started to fill the tub.\r\n      Otohiro carried him into the bathroom slowly and placed him in the tub.\r\n      Suzuki started gasping for air, breathing fast. \"It's all over,\"\r\n      he said between short breaths. \"Calm down, calm down,\" Otohiro spoke soothingly in his ear\r\n      holding him. \"Breathe slowly, breathe slowly.\" Otohiro breathed\r\n      loudly and slowly, and his father's breath slowed down till they were both\r\n      breathing together at the same slow rate. Suzuki asked for the bar of scented soap that Della had given him. He\r\n      never used anything scented, but he took it and slowly made a good lather,\r\n      and they helped him to clean himself thoroughly. Then he took a long,\r\n      relaxed bath. Afterward Suzuki lay on the bed and sighed. Slowly and faintly he\r\n      spoke. \"Ahhhh, what a good feeling,\" he said, with a wisp of\r\n      pleasure on his face. \"Don't wake me in the morning.\" \"Maybe you're thirsty,\" said Okusan. \"Would you like\r\n      some orange juice or ice cream?\" \"Orange juice.\" He drank some orange juice, closed his eyes,\r\n      and went to sleep. Okusan went back to her futon and Otohiro lay down next to his father\r\n      in the bed. Before long it was four and he heard the wake-up bella\r\n      handbell run through the halls to get people up for zazen. It was not just\r\n      any day's zazen, but December 4, the first day of a five-day sesshin that\r\n      would culminate on Buddha's Enlightenment Day, the eighth of December.\r\n      Over a hundred people were participating. Otohiro could hear people\r\n      opening and closing doors carefully, running water in the bathroom across\r\n      the hall. Then came the sharp sound of the wooden han being hit,\r\n      indicating that the new abbot, Zentatsu Baker-roshi (as Suzuki said to\r\n      call him), was on his way to offer incense at various altars. The last\r\n      altar was the one in the zendo, where he would open the sesshin and begin\r\n      the first period of zazen. The sound of a bell could be heard faintly coming from the distant\r\n      zendo. Otohiro felt his father move slightly. Suzuki's hand reached over\r\n      and clutched his arm. \"Get Baker,\" came a thin whisper. Otohiro jumped out of bed and ran into the tatami room. \"Mother!\r\n      Something's happening with father! He said to get Baker!\" Without a word Okusan leapt up and went quickly down to the zendo. Richard had just sat down on his cushion and straightened his robes\r\n      when Okusan opened the side door. Lew was sitting in the space nearest\r\n      her. \"Get Zentatsu!\" she whispered urgently. Richard took long strides to the zendo door and then dashed up the\r\n      stairway to Suzuki's room. Okusan and Otohiro left Suzuki alone with\r\n      Richard. He was still conscious, and with the last strength of his life he just barely reached his hand out to his beloved\r\n      disciple. Half sitting, half kneeling by the bed, Richard held his hand\r\n      and touched his forehead to Suzuki's. They rested that way for a few\r\n      moments, then Richard felt the man most dear to him slip away, let go of\r\n      his life. Slowly, Shunryu Suzuki-roshi faded awayso gently that Richard\r\n      could not tell when he died; he just knew it had happened. Richard let go of Suzuki's hand. He waited a moment and felt for a\r\n      pulse. Then he went outside to Okusan and Otohiro. Richard had his hand on\r\n      his heart. He spoke in Japanese, his voice cracking, as he told them,\r\n      \"Suzuki-roshi's life has ended.\" Interview with\r\n      Ryuho Yamada In Memoriam Main Excerpts Page Ryuho in Thank You and OK! ***"
    },
    {
      "tag": "div",
      "text": "Home | What Was New | Contest | Digressions | Links | Jacket\r\n        Notes | Book\r\n        Reviews | Reader's\r\n        Comments Author's Notes | Bibliography | Author Events | About\r\n        the Author | Errata | Interviews | Suzuki Stories | Photos | Suzuki Lectures | Archives\r\n        Project | Sangha News | Contact Me"
    },
    {
      "tag": "p",
      "text": "This site designed by The Empty Wig Original site designed by Sheryl B."
    }
  ]
}