{
  "url": "http://www.darjnet.com/darjeeling/darjeeling/travel/train/train.htm",
  "file_number": "368",
  "content_hash": "438570fd1e917aadb4e42edb446ee62871f27c4c7438f28e1eaba6b6f2199b5b",
  "total_blocks": 57,
  "retained_blocks": 3,
  "ignored_blocks": 54,
  "blocks": [
    {
      "tag": "p",
      "text": "Toy\n        Train Ride to Darjeeling Toy Train passing through Batasia Loop The Darjeeling Himalayan Railway is lovingly\n        called the \"Toy Train\". The Toy Train ride is a romantic approach to the\n        Himalayas, a mysterious region. The landscape can only be described as spectacular and the\n        views of the Himalayan peaks breathtaking. The Darjeeling Toy Train is one of the most\n        famous narrow (2 feet ) gauge trains. This joy ride begins at New Jalpaiguri, a busy railway station in\n            the plains. The plains are much more warmer than the hills and as the train climbs up the\n            mountains the climate gets much colder. Therefore it is advisable to keep warm clothes\n            handy as one needs them. Leaving New Jalpaiguri station the train passes through the\n            outskirts of Siliguri town and reaches Siliguri station. After a short halt the train\n            leaves Siliguri station and crosses the Mahanadi bridge over the Mahanadi river which\n            flows from the Himalayan foothills. After six miles train reaches Sukna station from where the real\n            ascent begins. Here the train normally stops for the engine to take water. The traveller\n            can now notice the change of local people who have sharp mongoloid features and are mostly\n            Nepali. From here the blue mountain ranges of the foothills are visible and the train\n            quickly rises from the plain passing through tea gardens and forest of teak and sal."
    },
    {
      "tag": "div",
      "text": "Toy Train passing through forest near Sukna"
    },
    {
      "tag": "p",
      "text": "The train now passes through Rangtang station (1404 ft/430 m) and a little\n        further away the train may stop for water again. From here the view of wooded mountains is\n        really beautiful. The train moves on with the view of tea gardens, tea factories and\n        forests. It then passes Chunbhati. Before the railway line was built, there was a bungalow\n        here where the travellers travelling in palki (palanquin) used to rest for the day. The\n        train is now fairly among the mountains and a panoramic view of the deep valley and higher\n        range of mountains is visible. Then the train passes the Tindharia Railway workshop to\n        reach Tindharia station (2,822 feet/860m). Toy Train climbing the mountain Tindharia, in the old times, was the spot where travellers used to\n            stop for tea. From here one can get an extensive view of the hills. Leaving Tindharia one\n            can see the jagged rock-faced mountains up ahead called Giddapahar (Eagle's Craig) which\n            the train later has to pass through. Using \"zig-zag reverses\" the train leaves\n            Gayabari station (3,400 feet/1040m). After this station the train stops for water near Pagla Jhora (Mad Torrent).\n        During the monsoon this small stream swells up and is big enough to wash away the road and\n        railway line. Shortly after this the train reaches Mahanadi Bazar station (4,000\n        ft/1,225m). Just near this town is the source of the Mahanadi river which the train had\n        earlier crossed shortly after leaving Siliguri. Leaving Mahanadi the train travels west\n        through Gidhapahar (Eagle's Craig) with an excellent view of the valley, the hills and tea\n        gardens and reaches Kurseong station (4,864 feet/1485m). Kurseong is a thriving little hill station. Here one can get the first glimpse\n        of a hill town and the hill people. Leaving Kurseong the train passes through Kurseong\n        bazar and goes on in its journey. The sight of Tibetan prayer flags as the train passes\n        over Hussel (whistle) khola (stream) makes the traveller feel that he is now truly in the\n        mountains. The train passes through small forests of maple, chestnut, pear, cherry,\n        criptomeria (introduced from Japan), etc. and cardamom plants. Now the train reaches Tung (5656 ft/1725m) which gives us an\n            excellent view of the Kurseong ridge. As the train passes along the road, one may notice\n            by now that through the journey from New Jalpaiguri to Darjeeling there are over 100 road\n            crossings and most of the time the train runs along parallel with the cars and other\n            vehicles. Toy Train in one of the road crossings The journey new leads through Sonada (6552 ft. /2000m). As the train passes\n        through Sonada bazar, one can get a glimpse of Tibetan chorten (stupa) on the way. Now the\n        train passes through Senchel Reserve forest with oaks, chestnuts, walnuts, magnolias,\n        rhododendrons, etc. During spring one can see the bright blooms of rhododendrons, cream\n        magnolias and orchids in this moss-laden forest. On top of this hill is a famous tourist\n        spot Tiger Hill with a unique view of the Himalayas and also of the sunrise. This forest\n        region is well known worldwide for bird-watching. The train now passes through a small town called Jorebunglow. The road here is\n        very narrow and often there are traffic jams since all the traffic in and out of\n        Darjeeling pass this point. This must be the only place where the train may have to stop\n        for a while in case of a traffic jam or have to back up a bit to ease the traffic. The\n        train now reaches Ghoom (7407 ft/2260 m) the highest point of the journey. Toy Train near Darjeeling town Leaving Ghoom the train descends towards Darjeeling. On the way\n            the train passes through Batasia Loop with its memorial to the Gorkha soldiers. From the\n            Batasia Loop you can get a spectacular view of Darjeeling town with the Kanchenjunga and\n            other snowy mountains in the back-drop. From now onwards uptill Darjeeling, the snowy\n            peaks are in full view for the travellers' eyes. Finally the train enters the Darjeelins\n            Station, the destination of the journey. Darjeeling, a town with all its charm and beauty\n            awaits the weary traveller. SPECIAL TOY TRAIN\n            JOY RIDE During Tourist seasons, that is, March to May and October to December, special Toy Train Joy Ride is arranged from Darjeeling to Ghoom and back. Copyright 2000 Photos : Das Studio, Darjeeling 2000 Old Photos : From the collection Das Studio, Darjeeling Copyright 2000 : darjnet.com, Darjeeling Contact us : darjnet@yahoo.com"
    }
  ]
}