{
  "url": "http://www.dealtime.com/xDN-Sport_and_Outdoor--personal_fitness-weight_training_equipment-weight_lifting_equipment_guide~V-rows",
  "file_number": "369",
  "content_hash": "4b8fbd243da6cc1aa3daee49fff321a37fafd360d1cc5482cb6fed087692ac63",
  "total_blocks": 251,
  "retained_blocks": 38,
  "ignored_blocks": 213,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Strict//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd\" [if IE]>\n <link rel=\"stylesheet\" type=\"text/css\" href=\"http://img.shopping.com/jfe/FE_20061212_cobrands51_build_69/css/sdcIe.css\"/>\n<![endif] Books Cars Clothing Computers Electronics Flowers & Gifts Health & Beauty Home & Garden Jewelry Kids & Family Movies Music Office Sports Video Games Search for: in All Categories Books Cars Clothing & Accessories Computers & Software Electronics Flower & Gifts Health & Beauty Home & Garden Jewelry & Watches Kids and Family Movies Music Office Sports & Outdoors Video Games Back to: Sports and Outdoors You found   17 items in"
    },
    {
      "tag": "h2",
      "text": "Sport and Outdoor Personal Fitness Weight Training Equipment"
    },
    {
      "tag": "h1",
      "text": "Weight Lifting Equipment Guide"
    },
    {
      "tag": "div",
      "text": "Compare prices on 17 products Product Description Store name & Rating Price Featured Product"
    },
    {
      "tag": "h2",
      "text": "Hampton Fitness 55 - 100 lbs Satellite Series Dumbbell Club Pack"
    },
    {
      "tag": "div",
      "text": "Authorized Hampton Fitness Dealer for Dumbbells , Sport and Outdoor. The Hampton Fitness 55 - 100 lbs Satellite Series Dumbbell Club Pack contains Dum... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $4,058.99 Featured Product"
    },
    {
      "tag": "h2",
      "text": "BodyCraft Flat/Incline/Decline Weight Bench"
    },
    {
      "tag": "div",
      "text": "Authorized BodyCraft Dealer for Weight Benches , Sport and Outdoor. The BodyCraft FlatInclineDecline Weight Bench is the most flexible Weight Bench av... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $299.00 Featured Product"
    },
    {
      "tag": "h2",
      "text": "Bowflex SelectTech 5.1 Adjustable Bench"
    },
    {
      "tag": "div",
      "text": "Authorized Bowflex Dealer for Weight Benches , Sport and Outdoor. The Bowflex SelectTech 5.1 Adjustable Bench is an outstanding addition to any workou... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $199.00 Enter your ZIP code to see tax and shipping Price + Tax + Shipping = Total Price"
    },
    {
      "tag": "h2",
      "text": "Xodus Flat Exercise Weight Bench"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Xodus Dealer for Weight Benches,Sport and Outdoor. The Xodus Flat Exercise Weight Bench is a multi-use bench to perform all ... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $55.97"
    },
    {
      "tag": "h2",
      "text": "Xodus Folding Basic Weight Bench"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Xodus Dealer for Weight Benches,Sport and Outdoor. Multi-purpose bench trains beginners on incline, decline, and flat surfac... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $99.97"
    },
    {
      "tag": "h2",
      "text": "Stamina Strength Performance Series Adjustable Fitness Bench"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Weight Benches,Sport and Outdoor.The Stamina Strength Performance Series Adjustable Fitness Bench slides ... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $199.00"
    },
    {
      "tag": "h2",
      "text": "Stamina Ab/Hyper Bench"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Weight Benches,Sport and Outdoor.The Stamina AbHyper Bench gives you terrific core strength, ripped abs a... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $105.99"
    },
    {
      "tag": "h2",
      "text": "Hampton Fitness Heavy Pro Style Gray Curled Barbell"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Hampton Fitness Dealer for Barbells,Sport and Outdoor. The Hampton Fitness Heavy Pro Style Gray Curled Barbell has standard ... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $302.99"
    },
    {
      "tag": "h2",
      "text": "Stamina 50 lbs Versa-Bell Adjustable Dumbbell"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Dumbbells,Sport and Outdoor. Convenience, strength, durability, safety -- all at a baseline price. The in... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $149.00"
    },
    {
      "tag": "h2",
      "text": "CAP Barbell 3 - 8 lbs Neoprene Dumbbell Set"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized CAP Barbell Dealer for Dumbbells,Sport and Outdoor. The CAP Barbell 3 - 8 lbs Neoprene Dumbbell Set consists of 3, 5 and 8 p... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $51.99"
    },
    {
      "tag": "h2",
      "text": "Stamina 25 lbs Versa Bell Set"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Dumbbells,Sport and Outdoor.The Stamina 25 lbs Versa Bell Set brings you an innovative design with a quic... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $149.00"
    },
    {
      "tag": "h2",
      "text": "Bowflex SelectTech 552 Dumbbells"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Bowflex Dealer for Dumbbells,Sport and Outdoor.The leader in strength technology has put a home gym worth of results in a su... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $399.00"
    },
    {
      "tag": "h2",
      "text": "Stamina Strength Performance Series Flat Bench"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Weight Benches,Sport and Outdoor.The Stamina Strength Performance Series Flat Bench is the foundation for... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $131.99"
    },
    {
      "tag": "h2",
      "text": "Stamina 50 lbs Versa Bell Set"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Stamina Dealer for Dumbbells,Sport and Outdoor.The Stamina 50 lbs Versa Bell Set brings you an innovative design with a quic... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $289.00"
    },
    {
      "tag": "h2",
      "text": "BodyCraft Deluxe Flat/Incline/Decline Weight Bench"
    },
    {
      "tag": "div",
      "text": "Authorized BodyCraft Dealer for Weight Benches , Sport and Outdoor. The BodyCraft Deluxe FlatInclineDecline Weight Bench is the most flexible Weight B... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $349.00"
    },
    {
      "tag": "h2",
      "text": "Phoenix Adjustable Slant Board"
    },
    {
      "tag": "div",
      "text": "Free Shipping. Authorized Phoenix Dealer for Weight Benches,Sport and Outdoor. The Phoenix Adjustable Slant Board gives you the option of using slant ... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $59.98"
    },
    {
      "tag": "h2",
      "text": "Bowflex SelectTech 3.1 Adjustable Bench"
    },
    {
      "tag": "div",
      "text": "Authorized Bowflex Dealer for Weight Benches , Sport and Outdoor. The Bowflex SelectTech 3.1 Adjustable Bench can turn your space into the ultimate ho... Read more at Weight Lifting Equipment Guide In stock Weight Lifting Equipment Guide Review this store $149.00 Showing 1-17 of 17 Why are these stores listed? Sponsored Listings ( About ) NASM Personal Trainer NASM Personal Trainer Certification Earn 43% more as a personal trainer www.nasm.org Fit-Trail Fitness Trails Outdoor exercise systems on jogging trails or in clusters www.fittrail.com Your Fitness Pal Lose Pounds. Get in Shape. Set fitness goals! www.yourfitnesspal.com Weight Lifting Equipment All the Weightlifting Equipment. Deals in Weightlifting Equipment! Weightlifting.TrueLocal.com Outdoor Fitness Equipment Fitness trail and exercise products Perfect for all fitness levels. www.triactiveamerica.com home | about | privacy | user agreement | site index Copyright © 2000-2006 DealTime Ltd."
    }
  ]
}