{
  "url": "http://www.dec.state.ny.us/website/dfwmr/wildlife/guide/trapping.html",
  "file_number": "371",
  "content_hash": "3f2f5d13d07241475b666a1938ef3b6ff8456ed857469ea7656dd986dabff2db",
  "total_blocks": 71,
  "retained_blocks": 43,
  "ignored_blocks": 28,
  "blocks": [
    {
      "tag": "div",
      "text": "Add the page heading here"
    },
    {
      "tag": "h1",
      "text": "Trapping Regulations"
    },
    {
      "tag": "div",
      "text": "If there is a sub-heading, add it here <h2>_page subheading_</h2> Add links to program home page and other main program page here. Delete text if not needed"
    },
    {
      "tag": "p",
      "text": "More information from this division:"
    },
    {
      "tag": "div",
      "text": "Fish, Wildlife and Marine Resources Bureau of Wildlife Main heading for link list: modify or delete to suit needs of page"
    },
    {
      "tag": "p",
      "text": "Trapping"
    },
    {
      "tag": "div",
      "text": "Trigger Regulations for body-gripping traps used in the Southern Zone for beaver Trapping Seasons Trapping Licenses Rights of Trappers Trapper Education Legal Traps Legal Trapping Methods Checking Traps Pelt Sealing Coyote Reporting Buying and Selling Fur The following code is required on any page that includes a link to a PDF file, and a Department phone number must be inserted. Delete if the page does not link to any PDF file. <div class=\"floatalignright\"><a href=\"/website/site/pdf.html\"><img src=\"/website/graphics/site/pdfbutton.gif\" width=\"71\" height=\"23\" alt=\"graphic link to PDF information/help\" border=\"0\" align=\"top\" ></a><br><span class=\"pdftext\">For help with the PDF(s)<br>on this page call (518)402-8924</span></div> Remove comment tags from next line if the page has more links below the body text <p class=\"toplinksub\"><a href=\"#links\">Other Links of Interest...</a></p> Puts line above text.  Do not remove. Main body of page begins here. Begin with a heading which may be deleted if page contains few or no links."
    },
    {
      "tag": "h2",
      "text": "Trapping Regulations"
    },
    {
      "tag": "div",
      "text": "If page includes a photo, remove the comment from the code below and modify or repeat as needed <div class=\"imagealignright\"><img src=\" \" width=\" \" height=\" \" alt=\" \" border=\"1\"></div> Start body text here. All paragraphs must have opening and closing p tags."
    },
    {
      "tag": "p",
      "text": "Definition of Trapping To trap means to take, kill or capture wildlife with traps, deadfalls and other devices commonly used to take wildlife, including the shooting or killing of lawfully trapped animals. It also includes all related activities such as placing, setting, staking or checking traps or assisting another person with these activities."
    },
    {
      "tag": "h3",
      "text": "Rights of Trappers"
    },
    {
      "tag": "div",
      "text": "No one may disturb a trap lawfully set by another person. No one may remove a lawfully trapped animal from another person's trap. No one may harass a trapper while he or she is trapping."
    },
    {
      "tag": "h3",
      "text": "Trapper Education Course"
    },
    {
      "tag": "p",
      "text": "Required for persons who have never possessed a trapping license. The trapping course is at least 8 hours in length and is free. For information on trapper education courses in your area, contact the nearest DEC regional Sportsman Ed Coordinator ."
    },
    {
      "tag": "h3",
      "text": "Legal Traps"
    },
    {
      "tag": "div",
      "text": "Trigger Regulations for body-gripping traps used in the Southern Zone for beaver How to Measure Traps You must put your name and address on all your traps. Foothold traps larger than 4 inches set on land must have a pan tension device and be covered when set. Teeth are not allowed on foothold traps. On land, foothold traps must be 5 3/4 inches or smaller. During beaver or otter season, foothold traps up to 7 1/4 inches are allowed if set under water. When the beaver or otter season is closed, foothold traps set in water for mink or muskrat may not be larger than 5 3/4 inches. Afoothold trap larger than 7 1/4 inches is never legal to use. Body-gripping traps more than 7 1/2 inches may never be used on land. Body-gripping traps more than 7 1/2 inches may only be used in water during an open beaver or otter season. Snares cannot be used for trapping. Box or cage traps are legal for all species. You cannot use a cage trap that is designed to take more than one muskrat at a setting."
    },
    {
      "tag": "h3",
      "text": "Trapping Methods"
    },
    {
      "tag": "p",
      "text": "Land"
    },
    {
      "tag": "div",
      "text": "You may not set a trap in such a manner that it causes a captured animal to be fully suspended in the air. You may not set a trap on a public road. You are allowed to set a trap in a culvert or ditch unless the property is posted or the landowner does not allow trapping. Foothold traps larger than 4 inches must be covered when set on land."
    },
    {
      "tag": "p",
      "text": "Water"
    },
    {
      "tag": "div",
      "text": "You may set a trap in a permanent body of water only when the mink, muskrat, otter, or beaver season is open. You may not disturb a beaver lodge, beaver dam, or muskrat house or den. Traps may not be set on or within 15 feet of a beaver lodge at any time. Traps may not be set on or within 15 feet of a beaver dam except during an open otter season. You may not set a trap on or within 5 feet of a muskrat house."
    },
    {
      "tag": "p",
      "text": "Land or Water"
    },
    {
      "tag": "div",
      "text": "You may use any legal method to kill a trapped animal. You do not need a hunting license to use a firearm to kill a legally trapped animal. You may not set or stake a trap prior to 7:00 a.m. on opening day. You are not allowed to set a trap within 100 feet of a house, school, playground or church unless you have permission from the owner of the land where the trap is set."
    },
    {
      "tag": "h3",
      "text": "Checking Traps"
    },
    {
      "tag": "p",
      "text": "Traps must be checked at least once in each 24 hours except:"
    },
    {
      "tag": "div",
      "text": "If you are trapping in WMUs 5C, 5F, 5G, 5H, 5J, 6F, 6J, or 6N, traps must be checked at least once in each 48 hours. If you are trapping for beaver, otter, mink or muskrat in WMUs 5A, 6A, 6C, 6G or 6H, traps set in water must be checked at least once in each 48 hours. Written descriptions of Wildlife Management Units are available using this link."
    },
    {
      "tag": "h3",
      "text": "Pelt Sealing"
    },
    {
      "tag": "p",
      "text": "Beaver, otter, bobcat, fisher and marten must have a plastic seal attached to the pelt or unskinned animal before:"
    },
    {
      "tag": "div",
      "text": "It is sold or ownership is transferred to another person, or It is mounted or tanned, or It leaves New York State, or 10 days have passed since the close of the season where the fur was taken. The plastic pelt seals can be removed when the pelt is processed for taxidermy, tanning or manufacturing."
    },
    {
      "tag": "p",
      "text": "Here is how you get your pelts sealed. It is a 2 step process. Step 1— Filling out your furbearer possession tag Click for printable tag."
    },
    {
      "tag": "div",
      "text": "Apossession tag must be filled out for each animal you take. Possession tags must be filled out immediately after you reach your motor vehicle, camp or home, whichever comes first. Possession tags must stay with the animal or pelt at all times but they do not need to be attached to the pelt."
    },
    {
      "tag": "p",
      "text": "Step 2— Getting your pelt sealed All Species"
    },
    {
      "tag": "div",
      "text": "Acompleted furbearer possession tag must be submitted to obtain a plastic pelt seal. You can give your pelts to another person (other than a taxidermist) so he or she can get the pelts sealed or get them skinned. You must give that person your trapping license or a copy of your license and your completed possession tags while he or she has your pelts."
    },
    {
      "tag": "p",
      "text": "Beaver"
    },
    {
      "tag": "div",
      "text": "Furbearer possession tags for beaver can be submitted by mail, FAX (518) 402-8925 or in person. You also may report a beaver using the DECALS call-in system. Call 1-866-GAME-RPT. Once you have submitted your possession tag(s) for beaver you will be sent or given the plastic pelt seal(s) and instructions. Immediately upon receipt of seal(s), you must attach the seal(s) to the pelt(s)."
    },
    {
      "tag": "p",
      "text": "Otter, Bobcat, Fisher and Marten"
    },
    {
      "tag": "div",
      "text": "Only authorized Department representatives can attach the plastic pelt seals to otter, bobcat, fisher or marten. Call the regional wildlife office to make arrangements to get your otter, bobcat, fisher, or marten sealed. Prior to having a marten sealed, you must submit the entire carcass."
    },
    {
      "tag": "h3",
      "text": "Coyote Reporting"
    },
    {
      "tag": "div",
      "text": "Report your coyote by calling the DECALS call-in system.  Call 1-866-GAMERPT (1-866-426-3778). You may use the furbearer Possession Tag to write down the information before you call."
    },
    {
      "tag": "h3",
      "text": "Buying and Selling Fur"
    },
    {
      "tag": "div",
      "text": "Species requiring a pelt seal cannot be bought or sold or given to another person unless it has the plastic pelt seal on it. All other species may be bought, sold, and transported without restriction. Furbearers may be bought or sold either skinned or unskinned. People who buy fur do not need a fur buyer's license in New York. If the page includes a bottom section of links, remove the comment tags enclosing the next two lines. <hr class=\"clearboth\">\n<p class=\"toplinkhead\"><a name=\"links\"></a>Other Links of Interest</p> If the page includes a bottom section of links, remove the comment tags from the appropriate codes below, and repeat as necessary. For links to pages on DEC's web site: <div class=\"toplink\"><a href=\" \"> </a> </div> For links to pages not on DEC's web site: <div class=\"toplink\"><a href=\" \"></a>  <span class=\"leaving\"><img src=\"/website/graphics/site/leaving.gif\" width=\"108\" height=\"14\" alt=\"leaves DEC's web site\" border=\"0\"></span></div> Do not modify the following 3 lines"
    },
    {
      "tag": "p",
      "text": "Back to top of page"
    },
    {
      "tag": "div",
      "text": "Do not modify the following 3 lines"
    }
  ]
}