{
  "url": "http://www.directionjournal.com/spirituality/rumme.htm",
  "file_number": "376",
  "content_hash": "db964022e55530c7534ef79a8c01cb24398a8dc39099f21a33a7c2edfbea707c",
  "total_blocks": 93,
  "retained_blocks": 18,
  "ignored_blocks": 75,
  "blocks": [
    {
      "tag": "div",
      "text": "| Home | Articles | Order | Subscribe | Back \r\n  Issues | Video | Books | Congress \r\n  Papers | Links | Directory | FreeMail | BBS |"
    },
    {
      "tag": "p",
      "text": "Stepping Off A 100 Foot Pole Beyond the \r\n    Limits of Reason & Faith by \r\n    Daigaku Rumme Crystal clear \r\n    on all sides Open and unobstructed \r\n    in all directions Emanating light \r\n    & making the earth tremble in all directions Subtly exercising \r\n    spiritual powers at all times Tell me, how \r\n    is it manifested?! Wansong \r\n  Xingxiu Zenji (1166-1246CE China) @ Many \r\n  years ago Iwas ordained a Zen monk. Entering the small monastery in rural Japan, \r\n  where Istill live, provided the form and direction to the spiritual quest which \r\n  had been developing since my youth. In 1986, ten years after having entered \r\n  the monastery, Ifirst came in contact with the Alexander Technique and immediately \r\n  noticed parallels between it and Zen. Since then Ihave often reflected on those \r\n  similarities and in the context of spirituality and Alexander discoveries, Iwould like to share a few of my observations. Spirituality has been an \r\n  important component in the lives of men and women since the dawn of human history. \r\n  Religion did not arise simply because people wanted to appease powerful forces. \r\n  It helped them relate to their environment and ground themselves in it. Primarily, \r\n  though, religion has been the means to explain the tragedy and suffering of \r\n  this beautiful, yet terrifying world. Through the thousands and thousands of \r\n  years of human existence, spirituality has constantly changed and adapted. Religion \r\n  has shown itself to be very pragmatic. When one idea of God or gods ceases to \r\n  work, it is discarded in favour of another. Although the West in the twentieth \r\n  century is often characterised by its secular belief in humanism, there is now \r\n  growing interest in the nontheistic religions of the East, particularly Buddhism. \r\n  Perhaps the two main reasons for this are the teaching that everything is one \r\n  unity, together with the living tradition of practising under a teacher and \r\n  personally experiencing this for oneself. In my own case, Iwas drawn \r\n  to Zen because of a deep question about how a person ought to live. How, Iwondered, \r\n  could one person possibly bring about any change in the immense problems which \r\n  face the world: war, poverty, various forms of discrimination, the destruction \r\n  of the environment and so on. Like many who came of age in the 1960's, Iwas \r\n  seeking an alternative to the materialistic lifestyle which we perceived to \r\n  be the main cause of these problems. However, in the course of seeking, reflecting, \r\n  and asking what could be done to resolve these problems, Irealised that in \r\n  order to change the world Ihad to change myself. Isaw that the root cause \r\n  of all suffering is the greed, anger, and folly arising from the ego-self. Zen \r\n  seemed the most direct and down-to-earth practice to achieve freedom from an \r\n  egocentric viewpoint. Once that liberation is realised it would then be possible \r\n  to 'return to the marketplace' to aid in imparting that peace and freedom to \r\n  others. To die and be reborn in this manner is certainly no easy task, and many \r\n  years have passed since Ibegan this journey. Yet Iam still very much dedicated \r\n  to this way of liberation. The Alexander work came \r\n  into my life at a time when Iwas having much difficulty with pain in my lower \r\n  back. In fact it seemed that if the condition did not improve Iwould have to \r\n  quit sitting through the long retreats of intensive zazen which we have several \r\n  times a year in the monastery where Ilive. Very fortunately the person who \r\n  was to become my main Alexander teacher came to live with us at the monastery. \r\n  Largely through her great generosity, patience and dedication Iwas able to \r\n  overcome my back problem. This is no small feat as Iam a tall (196cm), thin \r\n  (70kg) man with a scoliosis of the spine, living in an environment constructed \r\n  for people who are much, much shorter. In more ways than one, my health has \r\n  been seriously affected by the strain of misusing my body. Now, though, in large \r\n  part thanks to the Alexander work, Iam in good health. It would be fun simply \r\n  to write about the challenges Ihave faced living in the monastery: short handles \r\n  on everything from brooms to shovels, low sinks, extremely low thresholds, long \r\n  periods of sitting and standing still and so on. However, as Imust be as brief \r\n  as possible, Iwill confine myself to the topic of spirituality&emdashspecifically \r\n  Zen&emdashand the Alexander Technique, a subject which could easily fill a \r\n  book. There is a deep religious \r\n  aspect to the Alexander work which is perhaps often overlooked, namely trust \r\n  or belief. Alexander is praised for the highly scientific approach he took&emdashboth \r\n  in the way he found, and applied, his discovery. However, there is not as great \r\n  a gap between science and religion as we tend to think."
    },
    {
      "tag": "blockquote",
      "text": "Science demands \r\n  the fundamental belief that there is a rational explanation for everything, \r\n  it also requires an imagination and courage which are not dissimilar to religious \r\n  creativity … Atruly creative philosopher or scientist, has like the mystic \r\n  to confront the dark world of uncreated reality and the cloud of unknowing in \r\n  the hope of piercing it. 1"
    },
    {
      "tag": "p",
      "text": "Albert Einstein, commenting \r\n  on the relation between religion and science, said:"
    },
    {
      "tag": "blockquote",
      "text": "To know what is \r\n  impenetrable to us really exists, manifesting itself to us as the highest wisdom \r\n  and the most radiant beauty, which our dull faculties can comprehend only in \r\n  their most primitive forms&emdashthis knowledge, this feeling is at the centre \r\n  of all true religiousness. 2"
    },
    {
      "tag": "p",
      "text": "Alexander clearly documented \r\n  the critical point in his study that would enable him to pass from the 'known \r\n  to the unknown.'"
    },
    {
      "tag": "blockquote",
      "text": "Inow saw that \r\n  if Iwas ever to succeed in making the changes in use Idesired, Imust subject \r\n  the processes directing my use to a new experience, that is of being dominated \r\n  by reasoning instead of feeling. This meant that Imust be prepared to carry \r\n  on with any procedure Ihad reasoned out as best for my purpose, even though \r\n  that procedure might feel wrong. In other words, my trust in my reasoning process \r\n  to bring me safely to my 'end' must be a genuine trust, not a half-trust needing \r\n  the assurance of feeling right as well. 3"
    },
    {
      "tag": "p",
      "text": "From the point of view \r\n  of Zen, there are two interesting points in all of this (Ishould say that while \r\n  Zen is a religion, it is also a rigorous study of reality and, more specifically, \r\n  the self). First of all, the idea that science can rationally explain everything \r\n  is a belief. It is a belief that modern man has nearly substituted for the belief \r\n  in God. Yet explanation, no matter how precise, can never be the reality itself. \r\n  Say the word 'fire,' for example. Why doesn't it burn your mouth? Say the word \r\n  'water.' Why doesn't it quench your thirst? In these simple examples, we can \r\n  see that descriptions, whether they be words, picture images or thoughts, are \r\n  not the thing itself. Consequently, it is one of the axioms, not only of Zen \r\n  but of other mystic traditions as well, that reality itself is fundamentally \r\n  unknowable. In this way it is possible to use reason to see the limits of the \r\n  intellect and to understand that it must be transcended, but to become reality \r\n  itself requires great belief."
    },
    {
      "tag": "div",
      "text": "\"If only we could realise"
    },
    {
      "tag": "p",
      "text": "that everything is one!\" The second important point \r\n  in this connection is that faith or trust implies doubt. No one believes that \r\n  the sky is blue, that water is wet, or that salt is salty. These truths are \r\n  self-evident. For Alexander the question at the centre of his doubt was: 'What \r\n  am Idoing to myself to cause my difficulties?' This doubt was an essential \r\n  factor, in combination with his faith in reasoning, in fostering the determination \r\n  necessary to find a resolution to his problem. In Zen there is a similar \r\n  process. Without genuine belief in the Buddhist teaching that all beings are \r\n  essentially in a state of liberation as-they-are, we will always look outside \r\n  the present moment. It is precisely the doubt that we personally have not realised \r\n  this liberation, together with the faith that we already are liberated, which \r\n  will motivate us to actually make it our own. What is amazing is that Alexander \r\n  accomplished this without a teacher, but then so did Shakyamuni Buddha. For \r\n  those of us following in their footsteps, it makes it that much easier. Yet \r\n  it is necessary that we also do what they did. As Alexander put it so succinctly&emdashif \r\n  you will do what Idid, you will be able to do what Ido. If we can truly do \r\n  what they did, it becomes our own, at which point reason and faith are no longer \r\n  necessary. What is the practice required for making their realisations our own? \r\n  There are some intriguing parallels. Zen is the direct realisation \r\n  of the oneness of all things. In a word, it is to forget the ego-self which \r\n  is the source of all such distinctions as right and wrong, likes and dislikes, \r\n  you and me, life and death. There is a well known Zen story of a monk named \r\n  Joshu who asked his master, \"What is the Way?\" He wanted to know the means by \r\n  which he could attain true peace and freedom. His master said, \"Everyday mind \r\n  is the Way.\" Each activity in our life, from morning till evening, is the Way \r\n  itself. Joshu was not satisfied though. He was not interested in mere intellectual \r\n  understanding. So he asked again, \"What sort of practice can Ido in order to \r\n  truly realise that everyday mind is the Way?\" The master replied, \"If you look \r\n  for it, you'll only go in the wrong direction.\" Practice with the intention \r\n  of trying to understand 'everyday mind' will only separate you from it further. \r\n  Joshu was getting more and more confused and somewhat desperately asked, \"But \r\n  if Idon't do anything, how can Iever understand the Way?!\" His master said, \r\n  \"The Way is neither knowing nor not knowing. Knowing is delusion, not knowing \r\n  is indifference. When you have reached the true Way beyond doubt, you will find \r\n  it as vast and boundless as outer space. How can it be talked about on the level \r\n  of right and wrong?\" With these words, Joshu attained sudden realisation. The \r\n  important point of this story is that true liberation is neither in intellectual \r\n  understanding nor in shrugging it off indifferently. Human beings can only think \r\n  of the past and the future. Once something is perceived it is already past. \r\n  For this reason, the moment 'now' is unknowable. It is beyond knowing and not \r\n  knowing. It is beyond right and wrong, profit and loss, enlightenment and delusion, \r\n  life and death. In a word, it is the timeless, eternal reality which mystics \r\n  and scientists struggle to apprehend. Yet since it is unthinkable (the Unthinkable), \r\n  it precedes consciousness and so it is also of course beyond apprehension. Many people assume that \r\n  if all evil could somehow be eradicated only good would remain. But this is \r\n  impossible. Good and evil can only exist in opposition to each other. This has \r\n  great significance for the Alexander work. Alexander clearly saw the problem \r\n  arising from knowing. \"You can't do what you don't know, if you keep doing what \r\n  you do know.\"5 If we can simply give up the desire to be right, then, wrong \r\n  immediately disappears and we are left with the present moment which is empty \r\n  of either one. No one can think two thoughts \r\n  at the same time. It simply is not possible to think of being right and being \r\n  wrong at the same time. One thought must disappear before another can arise. \r\n  This one thought is the unknowable 'now.' By perceiving 'me', the ego consciousness \r\n  divides one thing into two: past and future, you and me, right and wrong. We \r\n  are constantly choosing between what we like and what we do not. Yet these are \r\n  merely ideas, they do not actually exist. 'Endgaining' is the term \r\n  Alexander gave to the unconscious tendency for people to become fixated on the \r\n  result of a process, rather than paying attention to the means by which it is \r\n  attained. It was his genius to describe how the habit of wanting to do what \r\n  feels right comes from our deep-seated fear of being wrong and making mistakes. \r\n  In Zen, we have a remarkably similar term, 'seeking mind.' This is a condition \r\n  of constantly seeking outside the present moment. We are exceedingly insecure, \r\n  for example, if we do not know. Continually we want more information and more \r\n  experience to prove that we do know. The problem is that one answer is simply \r\n  the seed for the next question&emdasha never ending cycle of illusion. In Zen \r\n  we say \"take a step off a 100 foot pole.\" To truly awaken to the nature of reality \r\n  it is necessary to let go of what we know and what we do not know. Agreat leap \r\n  of faith is required to take us from the 'known to the unknown.' Acorollary to this is \r\n  Alexander's discovery that he only had to think of reciting and it would affect \r\n  the physical use of his body. He was one of the first Westerners, at least in \r\n  the modern age, to realise that mind and body are one. This is a teaching, though, \r\n  which has existed in Buddhism for 2500 years. In Zen we are taught to see with \r\n  the whole body, likewise to hear - smell - taste - feel and think with the whole \r\n  body. We are assured that if we practice this way single-mindedly we will attain \r\n  satori, liberation from the illusion of self. The six sense functions \r\n  (including thinking) work automatically. No one has ever had to train themselves \r\n  in order to see or hear or smell. Moreover, there is no central organising function \r\n  (self) within us which controls us. For example, if the eyes are open, there \r\n  is nothing inside of us which can give the order not to see. If the eyes are \r\n  open, there is seeing. Even if we have never seen a certain object before, we \r\n  can recognise it instantly. Likewise with the ears. No matter how many sounds \r\n  we might hear at one time, they do not get jumbled up into one noise. There \r\n  is nothing more mysterious than the powers of these sense functions. We do not \r\n  even really know what thought is or where it is located. This brings us back to \r\n  the fact that we can only think one thought at a time. One thought must disappear \r\n  before another can arise. This includes the thought of 'me.' To think \"Iam \r\n  seeing such and such\" is, in fact, two thoughts. Consequently the significance \r\n  of mind and body being one unity is that when there is seeing, it isn't me who \r\n  sees, but rather that there is only seeing, no seer and nothing seen. When there \r\n  is thinking, there is only thought, no thinker and nothing thought of. This \r\n  is our reality now, moment to moment. It means that we are always one with our \r\n  environment."
    },
    {
      "tag": "blockquote",
      "text": "Human beings are \r\n  aware that something is wrong with their condition; they feel at odds with themselves \r\n  and others, out of touch with their inner nature and disoriented. Conflict and \r\n  a lack of sympathy seem to characterise our existence. Yet we are constantly \r\n  seeking to unite the multiplicity of phenomena and reduce them to some ordered \r\n  whole. 4"
    },
    {
      "tag": "p",
      "text": "If only we could realise \r\n  that everything is one! That each moment as-it-is is the result which we are \r\n  seeking! Astronomers estimate that \r\n  the Milky Way with its hundreds of billions of stars is revolving at the speed \r\n  of 500,000 miles per hour around its centre. At the molecular level, biologists \r\n  tells us that 98% of the atoms in the human body are replaced in less than one \r\n  year and that within the span of four years every single atom of the human body \r\n  is replaced at least once. Yet no one is conscious of these facts in their everyday \r\n  life. In the same way no one is aware of the extremely high rate of speed at \r\n  which thought arises. In the Buddhist teaching, there are said to be thousands \r\n  of changes per second, a constant flux of change. While it is not possible to \r\n  change that reality, it is possible to stop interfering with it by trying to \r\n  use it for our own illusory advantage. This brings us to the correlation between \r\n  the 'non-doing' of inhibition and zazen."
    },
    {
      "tag": "div",
      "text": "\"Once something \r\n  is perceived"
    },
    {
      "tag": "p",
      "text": "it is already \r\n    past. For this reason the moment \r\n    now is unknowable.\" Central to the teaching \r\n  of Buddhism is the law of cause and effect. Past causes have created the present \r\n  result. The present result will be the cause of future results. My Zen master \r\n  always says that if we want to know our condition five, ten or even twenty years \r\n  from now, all we have to do is look at our condition now. Each time we put off \r\n  something we know we ought to do, we create the stimulus for putting it off \r\n  again. Conversely, each time we withhold consent to react in a habitual manner, \r\n  we break a link in the chain which binds us. In other words, if you \r\n  want to change your life, you must do it now. Essentially the greatest change \r\n  we can make is to give up seeking results elsewhere and simply accept our reality \r\n  as it is now. Zazen is the practice of abandoning ourselves to the present moment. \r\n  If we can let go of our opinions and ideas in the form of expectations, intentions, \r\n  and desire for meaning, we can see that each moment is exactly what we are seeking, \r\n  even if we are anxious or confused. This also includes, of course, reflecting \r\n  on the past and planning for the future, yet with the detachment of knowing \r\n  that there is never anything other than the moment 'now.' Alexander discovered in \r\n  the course of seeking for a solution to his vocal problem that it was necessary \r\n  at the critical moment to inhibit his habitual response of 'doing' what felt \r\n  right. This was the first step. Others have since called this 'letting yourself \r\n  be.' By stopping the unconscious tendency to depend on his habitual feelings \r\n  of rightness, he could go on to the second step. This was to give a series of \r\n  reasoned-out guiding orders. In this way he was able to achieve his end not \r\n  by doing it, but by allowing it to happen. He had realised that mind and body \r\n  are one. By resisting the impulse to 'do' and then projecting through thought \r\n  the appropriate directions, he was able to give himself a new experience. Later \r\n  he always emphasised that by withholding consent to do what feels right, the \r\n  ends would come of themselves. In Zen, the Buddhist teaching \r\n  serves the purpose of guiding orders or directions. In fact we refer to the \r\n  teaching as 'a finger pointing at the moon.' The 'moon' is liberation, awakening \r\n  to the true nature of the self. The teachings of impermanence, no-self, and \r\n  the timeless, tranquil nature of the unknowable moment 'now', all point to the \r\n  necessity of forgetting the ego-self. The precepts and the Bodhisattva vows, \r\n  on one hand, and the practice of zazen on the other, provide the means whereby \r\n  to attain it. In any case, it is the moon which is the goal and not the finger. \r\n  As in the Alexander work, inevitably there is a tendency at the beginning to \r\n  'do' the practice of directions. However, with time and perseverance, together \r\n  with a skilful teacher, the habit of 'doing' will give way to 'just being.' \r\n  This is the ability to devote ourselves completely to each task simply for its \r\n  own sake. No longer is there finger or moon, for we realise that essentially \r\n  moon and finger are one. We are then free to work 100% for the sake of all living \r\n  beings. It is not my intention \r\n  to say that Zen and the Alexander Technique are the same. Certainly different \r\n  people will view them in different ways. Perhaps many will think Iam trying \r\n  to compare two things which are on completely different levels. However, Ido \r\n  think that for some people they can be compatible practices and even be complementary \r\n  in a beneficial manner. Alexander did speak of religion in a way strikingly \r\n  similar to Zen when he said:"
    },
    {
      "tag": "blockquote",
      "text": "The essence of \r\n  the religious outlook is that religion should not be kept in a compartment by \r\n  itself, but that it should be the ever present guiding principle of life underlying \r\n  the \"daily round\", the \"common task\". So also it is possible to apply this principle \r\n  of life in the daily round of one's activities without involving a loss of attention \r\n  in these activities. 5"
    },
    {
      "tag": "p",
      "text": "This is the way of 'everyday \r\n  mind'. Zen is the practice and \r\n  realisation of transcending the dualism of self-and-other through attention \r\n  to all activities in our everyday life. Many people associate Zen with a certain \r\n  posture of sitting cross-legged, but this is merely a position of 'mechanical \r\n  advantage.' This would be akin to thinking that the 'monkey position' is the \r\n  Alexander Technique. In fact, zazen is not meditation. Zazen is zazen. It is \r\n  both the end as well as the means by which to forget the distinction between \r\n  self and meditation. In this connection, Alexander was possibly right when he \r\n  wrote:"
    },
    {
      "tag": "blockquote",
      "text": "You see, a person \r\n  cannot capitulate to subconscious guidance to the extent which 'meditation' \r\n  demands in practice, without seriously affecting the psychophysical self in \r\n  reaction to living .6"
    },
    {
      "tag": "p",
      "text": "Zen is to forget the self \r\n  whether sitting still or in activity. Zen is to breathe with the whole body, \r\n  to work, laugh, play, and cry with the whole body. Yet to truly make that our \r\n  own and not simply get stuck in intellectual understanding requires great effort. As we approach the end \r\n  of the twentieth century, the world is undergoing tremendous change. There is \r\n  a wide array of extremely serious problems facing human life on this planet&emdashwidespread \r\n  destruction of the environment, overpopulation, AIDS, severe famine and poverty, \r\n  unprecedented crime and violence. What will be the future role of spirituality? \r\n  Can the Alexander work provide a spiritual discipline to help us face these \r\n  problems? Towards the end of his life, Alexander said, \"After working for a \r\n  lifetime in this new field, Iam conscious that the knowledge gained is but \r\n  a beginning.\" He knew that the \"knowledge of the self is fundamental to all \r\n  other.\" What new horizons are there for the Alexander work? Can it provide the \r\n  means whereby people can learn to stop the increasing greed for instant gratification, \r\n  for our constant desire to know that we are right? Can it truly enhance the \r\n  knowledge of the self? For me it is clear that \r\n  Alexander put his finger directly on the problem when he said, \"You want to \r\n  feel out whether you are right or not. Iam giving you a conception to eradicate \r\n  that. Idon't want you to care a damn if you're right or not. Directly you don't \r\n  care if you're right or not, the impeding obstacle is gone.\" 7 That obstacle is nothing \r\n  other than the ego-self. - Daigaku Rumme ENDNOTES 1. Armstrong, Karen, A \r\n  History of God , Alfred A. Knopf:New York (1993) p.172, 338. 2. Armstrong, p.338. 3. Alexander, F. M., The Resurrection of the Body , edited by Edward Maisel, \r\n  Delta:New York (1974) p.158. 4. Armstrong, Op. cit ., pp.101-2. 5. Maisel, Op .cit. , p. 8. 6. Maisel, Op. cit. , p.xliv. 7. Maisel, Op. cit. , p.9. 8. Calligraphy & translation by Daigaku Rumme. POSTSCRIPT For those readers interested \r\n  in any of the points related to Zen that are briefly mentioned in this article, \r\n  please see The Essence of Zen by my master, Sekkei Harada Roshi. This \r\n  book, recently published by Kodansha International, is a translation Idid of \r\n  a collection of Dharma talks given by him in Europe and the US. The material \r\n  covered in this book presents the basic teaching of Zen in relatively easy-to-understand \r\n  terms. Information about his monastery can be found on the web at : http://www.semui.co.jp/hosshinji May all beings awaken to \r\n  their innate freedom! ABOUT \r\n  THE WRITER Daigaku Rumme was born \r\n  in Mason City, Iowa, USA in 1950. His father was sent as a missionary to Japan \r\n  in 1961 where he lived until he returned to Iowa for college. He graduated in \r\n  1972, as, he writes: \"a properly dis-illusioned young man. Iwas unable to think \r\n  of any sort of occupation which seemed mean-ingful, plus Iwanted to do something \r\n  that would change the world, not just be part of the status quo.\" At that time he came across \r\n  a copy of Shunryu Suzuki's book Zen Mind, Beginner's Mind and eventually, in \r\n  1976, decided to enter Hosshinji, a Japanese Zen Monastery. He ordained as a \r\n  monk two years later, in 1978. While living in Japan, \r\n  and in return trips to the States, he he has taken hundreds of Alexander lessons \r\n  with many different teachers. He continues living at the monastery&emdashmeditating, \r\n  studying and acting as a translator for his revered spiritual master, Sekkei \r\n  Harada Roshi. Hosshinji \r\n  Fushihara 45-3, Obama-Shi Fukui-Ken 917-0054 Japan. Email - hosshin@lilac.ocn.ne.jp Tsü Shin \r\n    Shu Gen Throughout the body are \r\n    hands and eyes 8 | Home | Articles | Order | Subscribe | Back \r\n    Issues | Video | Books | Congress \r\n    Papers | Links | Directory | FreeMail | BBS | LEGAL NOTICE - Copyright\r\n     DIRECTION 2004 all materials. Copyright \r\n    & Disclaimers"
    }
  ]
}