{
  "url": "http://www.divorcenet.com/states/colorado/co_art09",
  "file_number": "379",
  "content_hash": "aa62a56beab5ea935ef53ed63ee218898475d2286bdb9431afa532482691b6cf",
  "total_blocks": 105,
  "retained_blocks": 38,
  "ignored_blocks": 67,
  "blocks": [
    {
      "tag": "div",
      "text": "Skip to content."
    },
    {
      "tag": "h1",
      "text": "DivorceNet"
    },
    {
      "tag": "div",
      "text": "Sitemap | Contact Us <label for=\"searchGadget\" class=\"hiddenStructure\">Search</label> <input id=\"searchGadget\" name=\"SearchableText\"\n      type=\"text\" size=\"25\" value=\"\" alt=\"Search\"\n      title=\"Search\" accesskey=\"accesskeys-search\"\n      class=\"visibility:visible\" value=\"search\"\n      tabindex=\"30001\" /> <input class=\"searchButton\" type=\"submit\"\n      value=\"Search\" accesskey=\"accesskeys-search\"\n      tabindex=\"30002\" /> You are here: Home » States » Colorado » Top 10 Myths About Common Law Marriage The wrapper table. It contains the three columns. There's a table-less\n           alternative in the plone_tableless skin layer that you can use if you\n           prefer layouts that don't use tables. start of the left (by default at least) column"
    },
    {
      "tag": "h5",
      "text": "Navigation"
    },
    {
      "tag": "div",
      "text": "<a href=\"http://www1.divorcenet.com/bbs6/\"><img src=\"http://www.divorcenet.com/site_icon.gif\"> Community Forums</a>\n                <br/> Colorado Community Forum DivorceNet States Colorado"
    },
    {
      "tag": "h5",
      "text": "CO Professionals"
    },
    {
      "tag": "div",
      "text": "Colorado Divorce Lawyers Colorado Collaborative Divorce Lawyers Colorado Military Divorce Professionals Colorado Divorce Mediators Colorado Financial Professionals Colorado Child Custody Experts Colorado Pension & QDRO Experts Colorado Private Investigators Colorado Real Estate Professionals Colorado Mortgage & Lending Professionals Colorado Divorce Coaches Colorado Mental Health Professionals Colorado Legal Document Assistants Colorado Appraisers Paternity Testing Experts in Colorado Other Professionals in Colorado"
    },
    {
      "tag": "h5",
      "text": "divorce forms"
    },
    {
      "tag": "div",
      "text": "Customized \n                Online Divorce Forms: Fast, Affordable and Easy end of the left (by default at least) column start of main content block"
    },
    {
      "tag": "h1",
      "text": "Top 10 Myths About Common Law Marriage"
    },
    {
      "tag": "div",
      "text": "By The Harris Law Firm P.C. Published:  July 17, 2004"
    },
    {
      "tag": "p",
      "text": "Believe it or not, the concept of \"Common Law Marriage\" is still alive and kicking in the State of Colorado! The fact is, many people are tripped up when the legal ramifications of this relic in the law rears its ugly head. Here are the \"Top 10 Myths About Common Law Marriage\": Myth 1 : If Iam married by common law, it wont affect my legal rights after a break-up, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . You could be subjected to the same claims for property division or maintenance (alimony), as you would face in a traditional divorce."
    },
    {
      "tag": "p",
      "text": "Myth 2 : Ican't be common law married unless Ihave been cohabitating for 10 years, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . There is no set time period under Colorado law to be declared common law married."
    },
    {
      "tag": "p",
      "text": "Myth 3 : It doesn't matter if my friends and family think Iam married, so long as Iknow the truth, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . In a legal dispute, count on your \"ex\" to claim otherwise and get all of his/her buddies to support that claim, especially if there is money involved. The key is whether you \"hold yourself out\" as married, and that vague term can get pretty expensive to legally prove, one way or the other."
    },
    {
      "tag": "p",
      "text": "Myth 4 : If Ihave children with my significant other, Iam automatically common law married, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . Not necessarily. The key is whether you hold yourself out as \"husband\" and \"wife\"."
    },
    {
      "tag": "p",
      "text": "Myth 5 : Itold my insurance carrier that Iam married so my boyfriend/girlfriend can get benefits. This isolated action can't hurt me, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . Any public declarations you make about your marital status can come back and hurt you later."
    },
    {
      "tag": "p",
      "text": "Myth 6 : So what if Iam considered common law married, Ican simply \"annul\" the marriage, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . If you are held to be common law married, you will have to go through a full-blown dissolution of marriage proceeding."
    },
    {
      "tag": "p",
      "text": "Myth 7 : Ican't be common law married unless Ihave plans to go through with the ceremony, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . You may be considered common law married even if you and your significant other have never even considered \"taking the plunge\" publicly."
    },
    {
      "tag": "p",
      "text": "Myth 8 : So what if Ifiled a joint tax return, that is a federal issue, and it can't be used against me in a state court, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . It can and almost definitely will be used against you by your ex's lawyer."
    },
    {
      "tag": "p",
      "text": "Myth 9 : As long as my relationship with my ex-boyfriend/girlfriend stays strong, common law marriage doesn't matter to me, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . If you die unexpectedly, your significant other may be entitled to inherit your assets, potentially depriving your biological heirs of a lot of money."
    },
    {
      "tag": "p",
      "text": "Myth 10 : Okay, so maybe Ihave a common law situation. Ishouldn't have to worry about this unless my relationship is about to end, right?"
    },
    {
      "tag": "blockquote",
      "text": "Wrong . You should be as informed as possible about your rights, as there are almost always steps you can take to protect yourself. Be informed, be cautious, and be proactive!"
    },
    {
      "tag": "div",
      "text": "If you are an authenticated member, you can view the creation date of this article Last modified:  March 17, 2005 - 01:39 PM View author's page Send this article Print this article <p tal:define=\"staffname python: 'DivorceNet Staff';\n\t\t       author_is_staff here/authorIsStaff;\n                       author here/getAuthor;\">\n<b tal:condition=\"not:author_is_staff\">\n<i>Visit This Author's Page:</i><br>\n<img src=\"link_icon.gif\" alt=\"Divorcenet.com Member\"> <a href=\"PLACEHOLDER\" style=\"text-decoration:underline\" tal:define=\"\n                          username author/Title;\n                          url string:${here/portal_url}/Members/${author/getId}\"\n           tal:attributes=\"href url\" \n           tal:content=\"username\" />\n</b></p> <p>\n<b><i>Divorcenet Tools:</i></b><br>\n> <a href=\"http://www1.divorcenet.com:8000/ss?click&1&3e2d9fd4\" target=\"_blank\">\nCustomized online divorce documents: fast, affordable and easy</a><br>\n> <a href=\"http://divorcenet.uslegalforms.com/\">Over 36,000 online legal forms</a><br>\n> <a href=\"http://www.divorcenet.com/states/new_jersey/planning/books/predivorcelist\">\nFind hidden income: Pre-Divorce Document Checklist</a><br>\n> <a href=\"http://www.divorcenet.com/states/new_jersey/planning/books/divfinancialsheet\">\nGet organized: Divorce Financial Worksheet</a>\n</p> <tal:allowed condition=\"python:isDiscussionAllowed and isViewTemplate\"> end of main content block start of right (by default at least) column"
    },
    {
      "tag": "h5",
      "text": "divorcenet forums"
    },
    {
      "tag": "div",
      "text": "Colorado Divorce Forum"
    },
    {
      "tag": "h5",
      "text": "Related resources"
    },
    {
      "tag": "div",
      "text": "State resources Colorado Contempt of Court/Enforcement FAQ's Colorado Divorce FAQ's Colorado Grounds for Divorce Colorado Property Division FAQ's Community Resources for Families in Colorado Springs National resources Divorce Financial Worksheet - New Edition! Pre-Divorce Document Checklist Survival Manual for Men in Divorce (2004 Edition)"
    },
    {
      "tag": "h5",
      "text": "divorcenet tools"
    },
    {
      "tag": "div",
      "text": "Find Hidden Income: Pre-Divorce Document Checklist Get Organized: Divorce \n        Financial Worksheet DNA Paternity Testing end of the right (by default at least) column end column wrapper advertise with us | about us | disclaimer | privacy statement | © Lawtek 1995- 2006 | powered by plone START OF SmartSource Data Collector TAG © 1999-2004 NetIQ Corporation. All rights reserved. V7.0 $DateTime: 2003/10/28 16:26:23 $ END OF SmartSource Data Collector  TAG Google Analytics END OF GOOGLE ANALYTICS"
    }
  ]
}