{
  "url": "http://www.dpi.qld.gov.au/kids/",
  "file_number": "383",
  "content_hash": "3cd1fb0cf00d4c4c26de3af587b5ad113ae2fb8d61a25d8abd83e16f2efef5b4",
  "total_blocks": 56,
  "retained_blocks": 28,
  "ignored_blocks": 28,
  "blocks": [
    {
      "tag": "div",
      "text": "html PUBLIC \"-//W3C//DTD XHTML 1.0 Transitional//EN\" \"http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd\" START SITE WIDE STRUCTURE CUETemplate2.0 DPI&Fstyles primary nav scripts primary nav stylesheet END SITE WIDE STRUCTURE End Site Header Start System Generated End System Generated Start Site Template Header START SITE HEADER AND MASTER NAVIGATION CONTROLS primary nav script keyboard navigation module"
    },
    {
      "tag": "h1",
      "text": "Department of Primary Industries & Fisheries"
    },
    {
      "tag": "h2",
      "text": "Tools"
    },
    {
      "tag": "h3",
      "text": "Accessibility"
    },
    {
      "tag": "div",
      "text": "ACCESS KEYS Access keys | Skip to primary \r\r\n        navigation | Skip \r\r\n        to content | Skip to footer | END ACCESS KEYS BROWSER SUPPORT Problems viewing this site END BROWSER SUPPORT HEADER"
    },
    {
      "tag": "h3",
      "text": "Search"
    },
    {
      "tag": "div",
      "text": "Search Advanced search »"
    },
    {
      "tag": "h3",
      "text": "Global links"
    },
    {
      "tag": "div",
      "text": "Home | Site map | Contact us | Help | END HEADER PRIME NAV"
    },
    {
      "tag": "h2",
      "text": "Primary navigation"
    },
    {
      "tag": "div",
      "text": "Business & trade Biosecurity Business & trade services Business development Farm business management Industry trends Trade & export Plant industries Field crops & pastures Fruit & vegetables Health, pests, diseases & weeds Lifestyle horticulture Plant industries services Research & development Transporting plant materials Animal industries Beef Dairy Pigs Poultry Sheep Aquaculture Other animals Animal industries services Animal welfare & ethics Health, pests & diseases Research & development Transporting & selling livestock Fisheries Aquaculture Commercial fisheries Recreational fishing Exotic pest fish Fisheries services Habitats Policy & legislation Research & development Species identification Sustainable fishing Forestry Forest industry development Forestry Plantations Queensland Research & development Private hardwood plantations Pests & diseases Timber & its uses Forestry services Services Animal industries services Business & trade services Fisheries services Forestry services Plant industries services Bookshop Conference facilities Email lists Events Library News Newsletters About us The organisation Contact us Research capabilities Employment END PRIME NAV MAIN END HEADER HERE END SITE HEADER AND MASTER NAVIGATION CONTROLS End Site Template Header Start Project Homepage Content Start project header Home > End project header End Project Template Header Start Page Content"
    },
    {
      "tag": "h1",
      "text": "Teaching resources"
    },
    {
      "tag": "h2",
      "text": "Agriculture"
    },
    {
      "tag": "p",
      "text": "AgAware \r\r\n    (Queensland Studies Authority) is a project designed to develop and facilitate \r\r\n    educators' access to quality curriculum materials which use agriculture as \r\r\n    a context for students' demonstrations of core learning outcomes from a number \r\r\n    of key learning areas. It is hoped that, in the process, students will gain \r\r\n    greater insights into agriculture."
    },
    {
      "tag": "h2",
      "text": "Animal welfare"
    },
    {
      "tag": "p",
      "text": "Animal welfare DPI&Fis the government's lead agency for animal welfare activities \r\r\n    in Queensland. Part of our aim is to educate the community \r\r\n    about animal welfare. Help an Animal Smile section \r\r\n    provides a range of activities for children including puzzles, activity books \r\r\n    and fact sheets."
    },
    {
      "tag": "h2",
      "text": "Biotechnology"
    },
    {
      "tag": "p",
      "text": "Biotechnology information for \r\r\neducators Information about biotechnolgy education resources. The links will help schools \r\r\n    looking to incorporate biotechnology into their science curriculum access \r\r\n    information."
    },
    {
      "tag": "h2",
      "text": "Fire ants"
    },
    {
      "tag": "p",
      "text": "Fire ants are a serious  pest in Queensland. See the school \r\r\n    resources section for activities, lesson plans and teacher kits."
    },
    {
      "tag": "h2",
      "text": "Fish, fisheries and marine habitats"
    },
    {
      "tag": "div",
      "text": "Aquatic invaders An educational module about pest fish such as carp and tilapia and their impacts on our aquatic environment. This education module was developed to meet learning outcomes of the new Science and Studies of Society and Environment (SOSE) curriculum developed by the Queensland Schools Curriculum Council. The activities focus on providing outcomes in levels 35."
    },
    {
      "tag": "p",
      "text": "Nature's nautical nurseries An education module for upper primary students about the connection between \r\r\n    habitat protection and ensuring fisheries resources for the future."
    },
    {
      "tag": "div",
      "text": "Brochures, booklets and posters Fisheries information brochures,leaflets, activity books and posters cover children's activities, fish, aquaculture, habitats and more."
    },
    {
      "tag": "p",
      "text": "Last updated 21 July 2006"
    },
    {
      "tag": "div",
      "text": "End Page Content Start Project Template Footer End main content area or features Start project footer End project footer End Project Homepage Content Start Site Template Footer BEGIN SITE FOOTER HERE /MAIN FOOTER"
    },
    {
      "tag": "p",
      "text": "Copyright | Disclaimer | Privacy | Link to us | Access keys | Other languages © The State of Queensland (Department of Primary Industries and Fisheries) 1995 - 2006. Queensland Government"
    },
    {
      "tag": "div",
      "text": "END SITE FOOTER HERE GOOGLE ANALYTICS JAVASCRIPT - added 2006-10-06 End Site Template Footer"
    }
  ]
}