{
  "url": "http://www.ecchk.org/T01/tapestry-01Q1-e1.htm",
  "file_number": "389",
  "content_hash": "72432708806ec61fd72ddc82bb111d3a230d706119a380db455b57098645d885",
  "total_blocks": 133,
  "retained_blocks": 11,
  "ignored_blocks": 122,
  "blocks": [
    {
      "tag": "p",
      "text": "Home > Community of Love > Tapestry, Spring 2001 Issue > Content"
    },
    {
      "tag": "p",
      "text": "Special Interests SARS Peace \n              Amidst Storms A \n              Personal Experience Our \n              Prayer Tapestry 2003: Sep ; Mar 2002: Dec ; Sep ; Jun ; Mar 2001: Dec ; Sep ; Jun ; Mar Resources • HKSAR \n              Info Centre • HK Weather Forecast • HK Postage Rates • Gospelcom.net • Crosswalk.com • Executable \n              Outlines • Christian \n              Apologetics • Web \n              Evangelism Guide • CrossSearch"
    },
    {
      "tag": "p",
      "text": "Book \nReview Reaching Out Without Dumbing Down by Ken Jung Whenever \nmy nineteenth-month-old son, William, sees a commercial on television he immediately \nstops what he's doing and gives it his undivided attention. Commercials make him \nconcentrate. Commercials grab his attention. Aquick glance at the table of contents \nof Marva Dawn's work produces the same effect. It grabs your attention. In \nPart Two, for instance, she discusses themes such as \"the Idolatries of Contemporary \nCulture\" and \"Worship as a Subversive Act.\" We can tell that we \nwill not be reading something concocted from the evening news or the back pages \nof the Saturday tabloids. Peering down the page further, Iobserve chapter five, \n\"God as the Center of Worship: Who is Worship For?\" and six, \"The \nCharacter of the Believer: Having Content or Being Content?\" Worship is risky \nbusiness. My personal favorite? How about chapter nine, \"Worship Out to Kill \nUs: The Word.\" Ouch. Like a hot knife cutting through butter, this book pierces \nmy heart and leaves me spiritually disorientated, displacing my ego, leaving me \nalone in the wilderness. Let me first say that Dawn is not merely writing \nfrom the ivory tower of academia. True, she has a PhD in Christian ethics and \nScripture from Notre Dame, but she also is a church musician. Reaching Out \nWithout Dumbing Down was not penned by some stuffy, armchair theologian. Rather, \nthe thoughts and words have been coined by someone who has rolled up her sleeves \nand has thrown herself into the arena of worship. Atrue gladiator indeed!"
    },
    {
      "tag": "h2",
      "text": "God \nis the Subject of Worship"
    },
    {
      "tag": "p",
      "text": "The most dominant feature is her two-fold recovery \nof God and the nature of worship: 1. God is the subject of worship. 2. \nGod is the object of worship. \"Since salvation is entirely God's gift and \nnot deserved or earned, Christian worship,\" observes Dawn, \"above all \nmakes clear who is the giver of that and every other gift, and challenges the \nworld to respond to who he is.\" p.76. In other words, God is the subject \nof worship because he is the sole author of our salvation. He is the \"Creator, \nProvider, and Sustainer; Deliverer, Redeemer, and Lord; Sanctifier, Inspirer, \nand Empowerer.\" p.76. From beginning to end the story of redemption provides \ncountless examples and details proclaiming God's love in action: saving his people \nfrom their sins and giving them new life in the Spirit."
    },
    {
      "tag": "h2",
      "text": "God \nis the Object of Worship"
    },
    {
      "tag": "p",
      "text": "God is the object of worship as well. \"Christian \nworship is about offering or sacrifice...The gifts of worship flow from God the \nsubject, and return to God as the object of our reverence.\" P. 80. This spiritual \ntruth protects us from any sense of pride and compels us to give God all the glory \nand honor. (The reformers of the 16th century proclaimed this same truth: \"Sola \nDei Gloria!\" or to God alone be the glory!) \"All of us are the actors \nand all of our worship acts are directed toward God. And yet, we must add paradoxically, \nbecause God is the subject, we always remember that we can only be actors because \nhe acted first.\" p.82. This means nothing less than to treat each movement \nin the worship service- praise, prayer, preaching, offering, communion, and any \nothers as acts of worship. Many regard the praise element as worship (and it is), \nbut we need to rediscover how all the elements work together and help others worship \nGod more fully."
    },
    {
      "tag": "h2",
      "text": "Worship \nand Culture"
    },
    {
      "tag": "p",
      "text": "Worship does not occur in a vacuum and this is one of the stronger \npoints of Dawn's book as well. Nobody worships God freely, in the sense that we \nare completely independent from the world. She highlights various components of \nour society...television and how television affects our worship of God. While \nleaning very heavily on other writers, possibly too much, she still nevertheless \ndrives her points home and they hit the target. Regarding television, she notes: \n\"Besides extensively depriving our culture of exposition, television's nature \nalso intensifies the appeal to emotions. Its images distort watchers' ability \nto reason and justify choices.... The cultivation of the television age has enormous \nconsequences for the Church... Since television transforms the method by which \npeople are persuaded by the truth , how will we inculcate the truths of \nfaith?\" p. 23-24. Technology plays a role in shaping our minds as well: \n\"Indeed, advances in technology bring us many advantages, but the advantages \nare always coupled with profound losses...primarily the loss of community. The \ncomputer is a good example... Separated from friends, Iconverse with you from \nmy study...but Icannot hear your input nor see your face nor feel your handshake \nor hug.\" p. 27. As a result, church worship often reflects the cultural \nmilieu that surrounds us and becomes more of an entertainment parody rather than \na service set apart for the proclamation of the Gospel and the glory of God. Is \nthere a way out of this mess? Marva Dawn thinks so: \"We could ask better \nquestions. We could plan worship that keeps God as the subject, that nurtures \nthe character of the believer, that forms the Christian community to be a people \nwho reach out in God's purposes to the world.\" p. 304. Overall, Irecommend \nMarva Dawn's book and would place it in the intermediate category for the reading \naudience. At times, the lengthy quotes make you feel like you are reading someone \nelse's opinion; she can come across as too cerebral, lacking heart-filled emotions; \nand one of her criticisms is not based on experience (she doesn't own a television). \nAlthough you may disagree with her points about culture and/or a public worship \nservice it is impossible for you to ignore her. As a result of reading Reaching \nOut Without Dumbing Down Ihave begun to reform the Sabbath Service in the following \nareas: communion, prayer, offering, and silence. Needless to say, Ibelieve her \nwork is worth reading and will impact your view of and how you practice public \nworship."
    },
    {
      "tag": "p",
      "text": "In \nThis Issue"
    },
    {
      "tag": "p",
      "text": "Introduction Worship Pastor's \nPen Good \nWorship Bad Worship Feature Recovering \nReverence Dance \nto Worship A \nSliver of God's Fingernail You \nCan't Outgive God Worship \nAround the World Worship \nLike an Egyptian Special Events God \nis in Control Book Review Reaching \nOut Without Dumbing Down Children's Ministry Teaching \nChildren to Worship The Edge Report The \nSpiritual Edge Comic Strip Site \nMap Contact \nECC Contact Site Editor Copyright \nNotice Back to Top of Page Privacy Policy © 2003 Evangelical Community Church"
    }
  ]
}