{
  "url": "http://www.enchantedlearning.com/subjects/dinosaurs/questions/QnsAug00.shtml",
  "file_number": "398",
  "content_hash": "fbaf8296c91e14a2dfaefb0241f927c02b61f8be756da302415214c63453041c",
  "total_blocks": 238,
  "retained_blocks": 6,
  "ignored_blocks": 232,
  "blocks": [
    {
      "tag": "div",
      "text": "Advertisement. EnchantedLearning.com is a user-supported site. As a bonus, site members have access to a banner-ad-free version of the site, with print-friendly pages. Click here to learn more. Join Enchanted Learning Site subscriptions last 12 months. Click here for more information on site membership. $20.00/year or other amount (directly by Credit Card ) $20.00/year or other amount (via PayPal ) $20.00/year or other amount (for sending a check by mail ) As a thank-you bonus, site members have access to a banner-ad-free version of the site, with print-friendly pages. (Already a member? Click here. ) Zoom Dinosaurs DINOSAUR QUESTIONS Current Questions Top 16 Questions Old Questions Ask A Question For Site Supporters Only By Date By Type of Dinosaur General Dino. Qns. Qns. About Other Animals Geological Era Qns. Old Questions May-Oct. 2002 Feb.-April 2002 Jan. 2002 Late Dec. 2001 Early Dec. 2001 Late Nov. 2001 Early Nov. 2001 Late Oct. 2001 Early Oct. 2001 Late Sept. 2001 Early Sept. 2001 Late August 2001 Early August 2001 Late July 2001 Early July 2001 Late June 2001 Early June 2001 Late May 2001 Early May 2001 Late April. 2001 Early April. 2001 Late March. 2001 Early March. 2001 Late Feb. 2001 Early Feb. 2001 Late Jan. 2001 Early Jan. 2001 December 2000 November 2000 October 2000 September 2000 August 2000 July 2000 June 2000 May 2000 April 2000 Mar. 2000 Feb. 2000 Jan. 2000 Dec. 1999 Nov. 1999 Oct. 1999 Sept. 1999 Aug. 1999 July 1999 June 1999 May 1999 April 1999 March 1999 Feb. 1999 Jan. 1999 Dec. 1998 Nov. 1998 Oct. 1998 Sept. 1998 Aug. 1998 July 1998 June 1998 May 1998 April 1998 March 1998 Jan-Feb. 1998 1997 Questions from August 2000 Please check the Top Fifteen Dinosaur Questions listed below and the Dino and Paleontology Dictionary first! What color were the dinosaurs ? How (and when) did the dinosaurs go extinct ? Which dinosaurs were the biggest ? Which dinosaur was the smallest ? Which dinosaur was the largest meat-eater ? How many teeth did T. rex have (and how big were they) ? What is the first dinosaur ever found ? What is the oldest dinosaur ever found ? Did birds evolve from the dinosaurs ? What does the word dinosaur mean, what does saurus mean , and how are dinosaurs named ? How many dinosaurs were there? What kind of habitat did the dinosaurs live in? How do you know what the enemies of a dinosaur were? Were there any swimming dinosaurs? Were there any flying dinosaurs? Ienjoy hearing from visitors.  You can send your questions and I'll answer them as soon as possible.  Thank you for writing! (Due to the large volume of questions coming in, Ican't answer them all.  I'll try to answer as many as Ican, as soon as Ican. Jeananda Col , Washington, USA) Don't forget to scroll down to find the answer to your question - they're in reverse order by the date they were asked. Q: How tall was a Janenschia\rrobusta?When and where were their fossils found? from Kim O., \r?, \r?, \r?; \rAugust 30, 2000"
    },
    {
      "tag": "p",
      "text": "A: Only incomplete remains have been found, but Janenschia was about 80 feet (24 m) long.  For more information on Janenschia, click here . Q: WHAT EVIDENCE SUGGEST THAT\rDINOSAURS WERE COLD-BLOODED OR WARM-BLOODED from AM, \rgarden grove, \rCA, \rORANGE; \rAugust 30, 2000 A: Click here for a page on that topic . Q: What is the fastest running\rdinasour from alex t, \rhouston, \rtx, \r?; \rAugust 29, 2000 A: No one knows for sure.  The fastest runners were probably the bird-like meat-eaters (long-legged, lightly-built theropods), like Gallimimus , Ornithomimus , and Coelophysis . Q: need  more information on\rmoschops from ?, \r?, \r?, \r?; \rAugust 29, 2000 A: More than what?  For a page on Moschops, click here . Q: What is the\rdefinition of bird-hipped? from ?, \r?, \r?, \r?; \rAugust 29, 2000 A: Dinosaurs are divided into two groups based on hip structure, the Order Ornithischia (bird-hipped) and the Order Saurischia (lizard-hipped). The Ornithischian dinosaurs were plant-eaters that had a hip structure similar to that of birds, but they were not the ancestors of birds.   The pubis bone (part of the structure of the hip) points downwards and to the front in the Saurischians and points downwards and toward the tail in Ornithischians.  The Ornithischian pelvis is wider than the Saurischian pelvis. This may have made Ornithischians more stable while moving.     Ornithischian skulls also had small, reduced openings (antorbital fenestrae) between the eye socket and the nares (nostrils), unlike saurischians. For more infromation on Ornithischian dinosaurs, click here. Q: have they ever found\rdinasaur fossils in Jacksonville, Florida or anywhere in\rFlorida? from shane h, \rjacksonville, \rfl, \rusa; \rAugust 29, 2000 A: No, because Florida was underwater during the time of the dinosaurs.  The climate was warmer then, so there was no polar ice.  This made the sea levels higher than they are today, and Florida was part of a shallow sea. Q: What name is given\rto our climate in Bakersfield from moxy d., \rbakersfield, \rcalifornia, \ru.s.a.; \rAugust 28, 2000 A: Ahigh-altitude desert. Q: On which\rcontinent have the most dinosaur bones been found; second;\rthird; etc? from Anthony s, \rDuvall, \rWA, \rUSA; \rAugust 27, 2000 A: The most dinosaur fossils have been found in Asia and North America (roughly equal), Europe, Africa, South America, and then Australia.  The fewest number have been found in Antarctica.  This list doesn't necessarily reflect the relative abundance of dinosaurs; it mosty reflects the places that paleontologists have looked the most.  For a list of dinosaur fossils found by continent, click here . Q: Do you have any\rpictures of a megadon? from ?, \r?, \r?, \r?; \rAugust 27, 2000 A: Megalodon probably looked like a huge Great White Shark that was more streamlined.  For more infromation on Megalodon, clicke here . Q: What is the\rpronounciation and meaning of the\rQuetzalcoatlus? from Carolyn D, \rSydney, \r?, \rAustralia; \rAugust 26, 2000 A: Quetzalcoatlus was named after the Aztec feathered god Quetzalcoatl.  It is pronounced  KET-sal-koh- AHT -lus.  For more information on Quetzalcoatlus, click here . Q: In What\rtemperature did the t.rex lived in? from Amirah f.,\rSingapore, \rSingapore, \rSingapore; \rAugust 26, 2000 A: T. rex lived in a humid, semi-tropical environment, in open forests with nearby rivers.  For more information on T. rex , click here.  The seasons were mild. Q: I AM LOOKING FOR\rANY INFORMATION ON  A DINASAUR FROM THE JARRASIC PEROID IN\rFRANCH THE SPELLING Ihave for this dinosaur is\rdactylotheuthis, Iam not sure if this is the propper\rspelling. If you have any information on this dinosaur or\ron it's teeth, anything close to this spelling would be\rhelpful from sh, \rsanat barbara, \rcalifornia, \rusa; \rAugust 25, 2000 A: I've never heard of Dactylotheuthis.  For a list of the known dinosaur genera, click here . Q: Which dinosaur\rhad the largest feet and how big were they? from\rMichele, \rUxbridge, \rMA, \r?; \rAugust 25, 2000 A: The huge Jurassic period sauropods had the biggest feet, leaving footprints the size of a bathtub. Q: What was the\rsmartest dionsaur? from Cody, \rFort Worth, \rTexas, \rNorth America; \rAugust 25, 2000 A: The smartest dinosaurs (the ones with the largest brain to body mass ratio) were the troodontids (like Troödon ). Q: This barely has\ranything to do with dinosaurs, but Ireally want to know\rwhy can't mammals be green? from Brad, \rWoodville, \rON, \rCanada; \rAugust 25, 2000 A: Ihave no idea, but that's a great question.  Green is a wonderful camouflage color, and you'd think it would be rather common, at least in small mammals.   The three-toed sloth does appear green, but the green color is due to algae colonies that live on its brown fur.  The Green Ringtail Possum looks almost green (its fur is a mixture of black, grey, yellow, and white hairs). Q: Iwas wondering\rif there was any like dino digs that kids could join or\rprograms. Also if there where any dinos that were found\raround chicago?? Thanks i apperciate your help\ralot!! from Princess, \rPrincessville, \ra place in the clouds, \rClouds; \rAugust 24, 2000 A: For a page on digs you can visit, click here . Q: What is the size\rof the brain of a dinosaur? from Adam S., \rCanton, \rOh., \rUSA; \rAugust 24, 2000 A: It varied quite a lot. Stegosaurus had a brain about the size of a walnut, and the huge Giganotosaurus had a brain the size of a banana. Q: Ihave a\rDinosaur toy that has its name on it but Ican't read the\rfirst initial. Can you help?\rthe remaining letters are:-\rLOPHOSAURUS\rby the look of it it would walk on its hind legs, has a\rfrill around its neck and a hood on its head\rthank you for you time from Jan M, \rLEETON, \rNSW, \rAUSTRALIA; \rAugust 24, 2000 A: That's Dilophosaurus.  For information on Dilophosaurus, click here . Q: What during age\rdid dinosaurs first appear? from saerom park, \rmt.roskill, \r?, \r?; \rAugust 23, 2000 A: Dinosaurs evolved about 230 million years ago, during the Ladinian Age of the mid-Triassic period (towards the beginning of the Mesozoic Era ). Q: How could Iobtain a copy of Predatory Dinosaurs of the World, by\rGregory Paul?  I've seen it mentioned quite a bit on some\rwebsites I've been reading lately, and many very cool and\runique theories are supposedly presented in it. But it is\rout of print! And chance of a new edition ever coming out?\rAny way to get it if there isn't?  At any\rprice. from Brad, \rWoodville, \rON, \rCanada; \rAugust 23, 2000 A: You could probably check it out at your local library (Ijust check my library, which has 11 copies).  Idon't know about a new edition. Q: How come\rmicro-organisms didn't decompose dinosaur\rbones? from Caillin P, \rMelbourne, \rVictoria, \rAustralia; \rAugust 23, 2000 A: Most dead animals are eaten or destroyed soon after death.  Only a small number of organisms fossilize.  These select few were quickly buried after their death (by sinking in mud, being buried in a sand storm, etc.) and were in conditions that did not favor decomposition (for example: low-oxygen water, very dry conditions, etc.). Q: Which was bigger\rthe Diplodocus or the Triceratops? from Tammy A, \rOromocto, \rNew Brunswick, \rCanada; \rAugust 22, 2000 A: Diplodocus was longer and heavier.  Diplodocus was about 90 feet (27 m) long and weighed roughly 10-20 tons; Triceratops was about 30 feet (9 m) long and weighed roughly 6-12 tons. For more information on Diplodocus , click here.  For more information on Triceratops, click here Q: Witch lived on\rEarth first Dinosaurs or cockroches? from Stephanie\rB., \rActon, \rOntario, \rCanada; \rAugust 22, 2000 A: Cockroaches similar to modern-day species are found in upper Carboniferous rock, roughly 300 million years old.  Dinosaurs evolved much later, about 230 million years ago, during the Triassic period . Q: What does EQ\rmean? from justin wicks, \rmackay, \rQueensland, \raustralia; \rAugust 21, 2000 A: EQ stands for encephalization quotient.  It is a ratio of the mass of an animal's brain to the  mass of its body. This helps determine the relative intelligence of extinct animals.  For more information, click here . Q: Was Megaladon\rthe largest shark ever found , besides the whale\rshark? from Tiffany P, \rGermantown, \rMaryland, \rAmerica; \rAugust 21, 2000 A: No one knows exactly how long Megalodon was - it is estimated to have been anywhere from 40 to perhaps even 100 ft long (a minority opinion).  The largest sharks today are the whale shark (50 feet long) and the basking shark (40 feet long). For more information on Megalodon, click here . Q: What is the\rLargest Butterfly? from George H, \rHouston, \rTx, \r?; \rAugust 20, 2000 A: The Queen Alexandra's Birdwing, which has a wingspan of about a foot.  For more information on the Queen Alexandra's Birdwing, click here . Q: What other\rthings became extinct when dinasaurs did? How do we\rknow? Who found this evidence? from Viv, \r?, \r?, \r?; \rAugust 20, 2000 A: Many other organisms, like pterosaurs,  plesiosaurs, mosasaurs, ammonites, some families of birds and marsupial mammals, over half the plankton groups, many families of teleost (bony) fishes, bivalves, snails, sponges, sea urchins and others went extinct during the K-Textinction , 65 million years ago. Determining when an organism went exticnt is tricky because it involves NOT finding fossils of that organism after a certain point.  The evidence comes from hundreds of paleontologists and geologists who find, identify, and date fossils. Q: Hi, Ireally\rneed to ask you a question, quick because Ihave a\rproject due tommorow and there is one thing that I`m\rstuck on...\rHow did the Ichthyosaurs survive evolution, PLEASE\rANSWER SOON!!!!\rThanks sooooo Much\rJADE from Jade L, \rDurban, South Africa, \r?, \r?; \rAugust 20, 2000 A: Evolution is a process in which the gene pool of a population gradually changes in response to environmental pressures, natural selection, and genetic mutations.  Organisms don't survive evolution; they are molded by its forces (natural selection, etc.) or if they are unable to adapt quickly enough, they die out. Ichthyosaurs evolved during the Triassic period, reached their\rpeak during the Jurassic period, and disappeared during the Cretaceous period, about 95 million years ago.  For more information on Ichthyosaurs, click here Q: Asmall red\r(wine, actually) bird was seen in our neighborhood.  It\rhas a very bright orange beak.  It's about the size of\ra robin, has a grayish head, and wine colored wings.\rWhat could it be? from Jean L, \rKingsport, \rTN, \rUSA; \rAugust 19, 2000 A: It sounds like it could be a femal cardinal .  They are mostly gray-buff with red wine colored wings and tail, a bright orange-to pink beak (it is a short, wide bill), and a pale gray-red feather crest on the head. Q: Becasuse\rsaurouds had such long necks the blood flow would have\rto be \rtremendos to reach the brain! Does that mean when it\rlowered it's head to ground level the blood flow would\rshoot the head off?! from Jonathan L, \rWirral, \r?, \rEngland; \rAugust 19, 2000 A: That would explain why most of the skullls are missing (no, no, that's just a joke). Seriously, the sauropods must have had tremendously high blood pressure in order to get blood up to the brain, but paleontologists think that their arteries may have a series of valves (like we have in our veins) that kept the blood from going backwards down the neck, and keeping the pressure even along the length of the neck regardless of position (head up or head down). Q: Were oppossums around\rat the time of dinosaurs?? Is there a web page with this\rinformation? from Cortney W, \rHOT SPRINGS, \rArkansas, \rUSA; \rAugust 18, 2000 A: Yes, some early relatives of the opossum lived during the late Cretaceous period , towards the end of the time of the dinosaurs.  An early relative of the opossums, Deltatheridium , an early marsupial, dates from about 80 million years ago (about 15 million years before the dinosaurs went extinct). Q: Which dinosaur is\rbigger the Stegoceras or the Stygimoloch? from Alic, \r?, \r?, \r?; \rAugust 18, 2000 A: The pachycephalosaurids Stegoceras and the Stygimoloch were about the same size, about 7 feet (2 m) long), weighing roughly170 pounds (78 kg), but only the skull of Stygimoloch has been found, so this is an estimate. Q: why do dinos\rmigrate? from jim, \rqeuzon, \rmetro manila, \rphilippines; \rAugust 18, 2000 A: It isn't known definitively that any dinosaurs migrated, but some (like Edmontosaurus ) may have migrated seasonally, to feed and reproduce in appropriate areas (the same reason that modern-day animals migrate). Q: What dinosaur\rhas pebbly skin and a toothless, spoon-shaped beak that\ris perfect for eating plants?  Its long crest on top of\rits head slotes backwards and it likes to travel in\rherds. from Tim C., \rFayetteville, \rNC, \rUSA; \rAugust 17, 2000 A: That sounds like Parasaurolophus . Q: What dinosaur\rlived 65 million years ago from jordan o, \rperth, \rWilletton, \rwa; \rAugust 17, 2000 A: Some of the many dinosaurs that lived during the very late Cretaceous period included T. rex , Triceratops , Alioramus, Microceratops, Protoceratops , Anatotitan , Ankylosaurus , Edmontosaurus , Alamosaurus , and many others.  For more late Cretceous dinosaurs, click here . Q: We are doing\rdinosaurs at school,my question to answer is about\rextinction and the theories.  Iknow about the K-T\rTheory but Ihave heard others like eating themselves\rto extinction, (running out of food), and the farting\rone.  Do you know of any other possible theories.\rThankyou from Rita P., \rTauranga, \rBay of Plenty, \rNew Zealand; \rAugust 17, 2000 A: For other K-Textinction theories, click here . Q: What is a\rmegalodon from Tommy S, \rBrigeton, \rNJ, \rUSA; \rAugust 15, 2000 A: Megalodon was a huge, ancient shark.  For information on Megalodon, click here . Q: what is a\rcynadont? from Geoff.A, \rBathurst, \rN.S.W, \rAustralia; \rAugust 15, 2000 A: Cynodonts are extinct animals that had had multi-cusped post-canine teeth (they had many points).  Some ate meat, others were herbivores.  They lived from the Permian period (before the dinosaurs evolved) until the late Triassic period (when the dinosaurs were just beginning to appear).  Cynodonts ( synapsids ) led to the true mammals .  Cynodont means \"dog teeth\", since their teeth looked like those of dogs. Q: What does the\rTstand for in T-Rex? from Amanda A, \rMillstone, \rWV, \rUSA; \rAugust 15, 2000 A: T. rex is short for Tyrannosaurus rex.  For more information on T. rex, click here . Q: what is the\rextinct cousin of the great white shark from\rmichael k, \rfrostproof, \rflorida, \ru.s.a; \rAugust 14, 2000 A: Megalodon . Q: Which came\rfirst in the evolutionary ladder - shark or cock\rroach? from Shawn L., \rKingsford, \rMI, \rUSA; \rAugust 12, 2000 A: Cockroaches similar to modern-day species are found in upper Carboniferous rock, roughly 300 million years old.  Sharks evolved earlier, during the Devoninan, over 350 million years ago. Q: What is\rThescelosaurus's nick name? from Tara Kairupan, \rShepparton, \rVictoria, \rAustralia; \rAugust 12, 2000 A: Ican't answer this question because it's current question on the CyberSafari quiz, but to get the answer, click here and read the page . Q: Iseem to\rremember, when Iwas a kid, studying learning about a\rDinosaur whose brain was in his tail?  Is that correct\ror am Igoing to lose this bet? from Kim E, \rSan Diego, \rCA, \rUSA; \rAugust 11, 2000 A: You're right; scientists used to think that some dinosaurs (like Stegosaurus and the sauropods ) had a second brain at the base of the tail.  They no longer think that this is true, however. Q: When did the\rdinosaurs live? from D.T, \rMissippi, \rMocomb, \rTexas; \rAugust 11, 2000 A: The dinosaurs lived during most of the Mesozoic Era .  They evolved about 230 million years ago and went extinct 65 million years ago. Q: What was the\rdinosaurs habitat and climate? from Lindsey R, \rFort Worth, \rTX, \rUSA; \rAugust 11, 2000 A: It varied tremendously for different dinosaurs.  Some lived in hot, desert-like areas, some lived in lush forests, others lived in relatively cold places. Q: how much does\rthe mussaurus weigh? from wendy s., \rfortworth, \rtexas, \ru.s.a.; \rAugust 11, 2000 A: As an adult, Mussaurus was perhaps up to 10 feet long (3 m), weighing roughly 260 pounds (120 kg).  For more information on Mussaurus, click here . Q: was there any\rdinosaur bones found in ohio.if so where and\rwhen from john g., \rcleveland, \rohio, \runited states; \rAugust 10, 2000 A: No dinosaur fossils have been found in Ohio.  For a list of dinosaurs fossil finds, listed state by state, click here . Q: Why are the\rolder dinosaur names usually given by one person, but\rthe new dinosaurs are named by many people? from\rBrad, \rWoodville, \rON, \rCanada; \rAugust 10, 2000 A: That's a really good question.  I've never seen heard any discussion of this, but my guess would be that long ago, there were also many people involved in finding fossils, but only the top guy got any credit.  When you read about some of the early \"dinosaur hunters\" and their famous feuds and bullying episodes, you can bet that they gave little credit to their less-famous co-workers.  It's hard to believe that these men found so many new genera single-handedly. Perhaps the world has become more egalitarian and a bit fairer. Q: How many years ago did\rthey die from ?, \r?, \r?, \r?; \rAugust 9, 2000 A: Most evidence points to the dinosaurs going extinct 65 million yeasr ago.  There is one new controvertial find that seems in indicate a few survivors into the Tertiary period . Q: Iheard that\rscientists in Japan were either in the prosses of or\rare attempting to bring back the wooly mamoth by using\ra frozen mamoths sperm or egg and combining it with a\rregular elephant....exactly what further information\rcan you give me on this and when do we'the public' we\rexpect to see this resurrected paccaderm? from\rjennifer w., \rmidwaycity, \rcalifornia, \runited states; \rAugust 7, 2000 A: Japanese and Russian scientists (K. Goto, A. Iritani, and S. Zimov) are trying to combine woolly mammoth genetic material (from the 23,000-year-old Jarkov mammoth recently found frozen in Siberian permafrost) with that of a modern-day elephant.  They will try to inject a cell nucleus of the mammoth into a living elephant cell in order to produce a viable embryo in a living female elephant, and eventually produce a new animal that is part-mammoth, part-elephant.  This could be done again and again using the new organisms, getting closer to a pure mammoth offspring.  The first problem is finding viable genetic material from the mammoth. Q: How big is\rBrachiosaurus heart ?. from Sarah M ., \rAuckland, \r?, \rNew-Zealand; \rAugust 7, 2000 A: No fossilized Brachiosaurus hearts have been found, but it must have been large and powerful in order to pump blood up the long neck to its head.  For more information on Brachiosaurus, click here . Q: How big are a\rt rex's teeth? from Naomi B, \rAuckland, \r?, \rNew Zealand; \rAugust 7, 2000 A: T. rex's teeth were up to 9 inches (23 cm) long.  For more information on T. rex, click here . Q: Hi could i please\rhave as much information as posible on the breeding of\rBrachiosaurus.  Did brachiosaurus\rstay withun a heard,did it nurtreits young,did Brachiosaurus\rhave any nests our eggs and what did Earths continents look\rlike during Brachiosauruses time. from Josan Biggins, \rAdilaide, \r?, \rSouth Australia; \rAugust 7, 2000 A: Brachiosaurus probably hatched from enormous eggs.  It is not known if it cared for its young or build nests.  That's about all that is known about its breeding. It may have lived in herds, but it is far from certain.   For information on Brachiosaurus, click here . Q: How long do you\rhave to go to school to become a paleontologist? from\rraptor h., \rchandler, \raz, \r?; \rAugust 5, 2000 A: You'll need an undergraduate degree (which usually takes four years) plus a graduate degree (usually a Ph.D., which takes 4 or more years).  For more information on becoming a paleontologist, click here . Q: What is the name of\rthe dinosaur that as the sort of hamer on the back of it's\rhead? from ?, \r?, \r?, \r?; \rAugust 3, 2000 A: It could be the meat-eating dinosaur called Cryolophosaurus , which had a horn-like, upward pointing crest above its eyes (it was named by W. Hammer and W. Hickerson). Q: are some dinoaurs\rstill alive like unknown and in rivers and things like\rthat? from megan, \roklahoma city, \roklahoma, \rusa.; \rAugust 3, 2000 A: It's unlikely. Q: What is\rbipedal? from Amel S, \rOxon Hill, \rMD, \rFenwood; \rAugust 3, 2000 A: Bipedal (which means two feet) refers to an animal that walks on two legs.  For example, people and T. rex are bipedal. Q: Is it true that\rmost of the dinosaurs were wiped out by a\rmetorite? from Dean m, \rhainult, \r?, \rEngland; \rAugust 3, 2000 A: The most accepted theory (the Alvarez Asteroid Theory ) is that an asteroid (or a series of asteroids) hit the Earth, triggering catastrophic climate changes, which caused many organisms to go extinct. Q: Iknow this is a\rlot, but any answers you can give me will be very helpful to\rmy project. :) Ineed to know when (which period) the\rfollowing first evolved and if and when it flourished:\r1)weeping willow 2)trees like oak or maple 3)common shrubs\r4)ground flowers, preferably roses, if they are even called\rground flowers :P 5)palm trees 6)fruit-bearing trees 7)kiwis,\rthe bird not the fruit :) 8)cobras or any snake really 9)Idon't know what they are called, LOL, but those large ice age\rbirds that kinda resembled an ostrich in body plan; long,\rstrong legs, little wings, and it's flightless...\rThanks so much for your help! :) from Lyssi, \rVictoria, \rTexas, \rUSA; \rAugust 2, 2000 A: 9. Dinornis was a huge, long-legged, flightless bird that lived from the Pleistocene until about 200 years ago. 8.  The earliest-known snakes date from the early Cretaceous period, about 130 million years ago (they probably evolved from lizards). 7.  The oldest-known kiwi fossil is only 1 million years old, but the kiwi is thought to be quite a bit older than this . 6. Flowering plants evolved during the early Cretaceous period .  Modern-day fruit-bearing tree evolved quite a while after this (during the Eocene, roughly 45 million years ago). 5. Palm trees are flowering plants and monocots, and evolved during the Cretaceous period. 4.  Roses are flowering plants (angiosperms) and dicots, and their ancestors evolved during the late Cretaceous period , (97.5 to 66.4 million years ago). 3. Different shrubs evolved at different times.  The flowering shrubs evolved much later (from the early Cretaceous period) than the non-flowering shrubs (like juniper). 2. Different trees evolved at different times.  Oaks and maples are flowering plants (angiosperms) whose ancestors first appeared during the middle Cretaceous period.  Some trees, like conifers, are much more ancient 1.  Ican't find when the modern-day weeping willow evolved, but it is closely related to magnolias, which evolved during the Cretaceous period. Q: Uh, Idon't know\rwhat exactly I'm looking for this time. LOL  Ijust need\rinformation on ice age tar pits.  Things like what causes\rthem, where they occur (geologically and geographically :)),\rwhat they looked like, what happened to the victims... etc.\rwould be great!  If there is anything else about tar pits\rthat is important or just fun and interesting:) please tell\rme that too. :) Thanks again! :) from Lyssi, \rVictoria, \rTexas, \rUSA; \rAugust 2, 2000 A: Atar pit is a pool of gooey asphalt.  It is created when crude oil seeps up from deep inside the Earth through a crack, called a fissure.  The less dense elements of the crude oil evaporate, leaving asphalt (a very sticky mess).   Water pooled on the tar, attracting thirsty animals.  As an animal gets stuck in the tar, it probably attract predators.   The animals' bones, teeth, and other hard parts are well-preserved in this environment (but they turn brown from the asphalt). Tar pits are located around the world.  Afamous tar pit is the Rancho La Brea Tar Pit (in southern California, USA).  The oldest organism (a wood fragment) found in the La Brea Tar Pit is from 40,000 years ago. Q: Where have the\rfossilized remains of water-dwelling 'dinosaurs' such as\rplesiosaurs and ichthyosaurs been located ? from Karen\rS., \rGowrie Junction, \rQueensland, \rAustralia; \rAugust 2, 2000 A: Plesiosaurs have been found in England, Germany, France, Japan, Kansas (USA), Queensland (Australia), parts of the former USSR, and other localities that were covered by a shallow sea during the MesozoicEra. Ichthyosaurs have been found in Nevada, Alaska, (USA), Alberta (Canada), the Canadian Arctic, China, Timor, the Alps, Spitsbergen, Greenland, Argentina, England, Germany, and other ancient sea bed areas. Q: My four year old\rdaughter wants to know what was alive before there were\rdinasaurs.  i thought maybe birds and fish, but i really\rdon't know.  she would be tickled to see her answer here.\rthanks a lot from natalie t, \rriverview, \rmi, \rusa; \rAugust 2, 2000 A: There were lots of animals that lived before the dinosaurs, including many reptiles, fish (including sharks), amphibians (like frogs), corals, sponges, insects (like cockroaches and beetles), shell fish, and many others.  Mammals evoloved about the same time as the dinosaurs. Q: Where are fossils\rfound from sheila sgp, \rSan Bernardino, \rCalifornia, \rUnited States; \rAugust 2, 2000 A: FOssils have been found all over the world (on every continent), usually in exposed sedimentary rock (especially in areas like badlands). Q: Iread in the paper\rthat a shark tooth of Cretodus crassidems\rWould you give me a info sheet if you have one\rThanks. from Samuel C., \rColumbus, \rGeorgia, \rU.S.A; \rAugust 2, 2000 A: Cretodus is an extinct genus of Mackerel sharks that lived during the late Cretaceous period.  This shark is known only from fossilized teeth and vertebrae that have been found in Africa, Europe, and North America.  The length of the teeth (from the tip of the crown to the tip of the root) is about  inches (5 cm).  Cretodus was named by Sokolov in 1965.  Classification: Order Lamniformes , Family Cretoxyrhinidae. Q: Which oceans did the\rIchthyosaurus live in? from Rebi N, \rCairns, \rQueensland, \rAustralia; \rAugust 2, 2000 A: Ichthyosaurus lived in shallow seas that covered what is now England, Germany, Greenland, and Alberta ( Canada ).  During the early Jurassic period until the early Cretaceous period , roughly 206 to 140 million years ago, when Ichthyosaurus lived, these areas of Europe and North America were covered by many shallow seas (these shallow seas existed becasue the sea level was higher during his time, since there was no polar ice. Q: how many brains do they\rhave from Tamara pritchard, \rAlexandra, \rOtago, \rNew  zealand; \rAugust 1, 2000 A: One per dinosaur.  It used to be thought that some of the larger dinosaurs (like Stegosaurus and the giant sauropods ) had a second brain at the base of the tail.  This is no longer believed to be true. Q: What type of\rprehistoric animals were found in Florida or Ohio? from\rEric V., \rKeystone Heights, \rFlorida, \rUSA; \rAugust 1, 2000 A: Florida was underwater for a lot of Earth's history (including during the Mesozoic Era, the time of the dinosaurs).  It has been home to millions of marine organisms (like teeth of Carcharodon the ancient shark, other fish, porpoises and whales, seacows, shells, other invertebrates, etc.), and later land animals like Mammuthus columbi, Cuvieronius (a gomphothere ), bears, horses, camels, protoceratids, rhinos, dogs, amphicyons, oreodonts, lizards, turtles, snakes, alligators, amphibians, birds, bats, etc. Ohio was also under the sea for a long time.  Fossils from Ohio include trilobites, nautiloid cephalopod, bryozoans, horn corals, gastropods, brachiopods, crinoids, pelecypods, Cladoselache (an early shark), Dunkleosteus, lungfish, and many other fish, mastodons, horses, and others.  For a good page on Ohio fossils, click here . For a list of dinosaurs fossils listed state by state (none from Florida or Ohio, though), click here . Q: WHAT IS THE LARGEST\rDINOSAURS EGG? from Jessie L., \rBlountville, \rTn., \rUSA; \rAugust 1, 2000 A: The first fossilized dinosaur eggs (and the biggest yet to be found) were football-shaped Hypselosaurus eggs found in France in 1869.  For more information on dinosaurs eggs, click here . Q: what are the three main\rtheories on the dinasaurs extinction from ?, \r?, \r?, \r?; \rAugust 1, 2000 A: The Alvarez asteroid theory is the most widely accepted theory.  For other dinosaur extinction theories, click here . Q: I've had that Safari\rmodel for years, and the colour scheme is really stuck in my\rhead.  But Idon't want ot use it, because Ithink it could be\rplagarism.  It is pretty unique.  I've also seen it with zebra\rstripes, which is cool, but again its already taken.  Imight\rjust make it sand-coloured.  I've subscribed to the dinosaur\rmailing list and recieve tons of e-mail, but I'm not sure how to\rpost stuff so it appears in the archives.  Can you help\rme? from Brad, \rWoodville, \rON, \rCanada; \rAugust 1, 2000 A: When you write to the list, your post will be put in the archives.  For information on writing to the list (and other things you should know about the list), click here ."
    },
    {
      "tag": "div",
      "text": "Return to the top of the page. Enchanted Learning ® Over 20,000 Web Pages. Sample Pages for Prospective Subscribers Overview of Site What's New Enchanted Learning Home Monthly Activity Calendar Site Index K-3 Beginning Books Crafts K-3 Themes Little Explorers Picture dictionary PreK/K Activities Rebus Rhymes Writing Cloze Activities Essay Topics Newspaper Writing Activities Fiction The Test of Time Biology Animal Printouts Biology Label Printouts Biomes Birds Butterflies Dinosaurs Food Chain Human Anatomy Mammals Plants Rainforests Sharks Whales Physical Sciences Astronomy The Earth Geology Hurricane Oceans Tsunami Volcano Languages Dutch French German Italian Japanese (Romaji) Portuguese Spanish Swedish Geography/History Explorers Flags Geography Inventors US History Other Topics Art and Artists Calendars Crafts Graphic Organizers Label Me! Printouts Math Music Parts of Speech Stories"
    },
    {
      "tag": "p",
      "text": "Click to read our Privacy Policy E-mail"
    },
    {
      "tag": "h2",
      "text": "Enchanted Learning Search"
    },
    {
      "tag": "p",
      "text": "First search engine with spelling correction and pictures! Search EnchantedLearning.com for all the words: Enter one or more words, or\na short phrase. You can use an asterisk * as a wild-card. Advertisement. Advertisement. Copyright ©2000-2006 EnchantedLearning.com ------ How to cite a web page"
    }
  ]
}